[
    {
        "title": "Apple banks on AI to boost sales of new iPhone 16",
        "description": "The firm says its new handset has been built for artificial intelligence as it looks to regain its edge.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Could powerful lasers unlock cheap fusion power?",
        "description": "A Denver-based start-up plans to use powerful lasers to spark a fusion reactor.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Asos shoppers hit out at new £3.95 returns charge",
        "description": "The company said it was introducing a charge for customers with a \"frequently high return rate\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Allegations mount against India market regulator",
        "description": "The head of India’s market regulator denies any conflict of interest in her activities.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Starmer faces union pressure over UK winter fuel payment cut",
        "description": "Unite's boss says the government needs to U-turn on plans to cut the payment for millions of pensioners.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Could powerful lasers unlock cheap fusion power?",
        "description": "A Denver-based start-up plans to use powerful lasers to spark a fusion reactor.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "'A lot of red flags': Fyre Festival investor fears reboot disaster",
        "description": "Fraudster Billy McFarland says Fyre II will take place next year. His former business partner says it's not looking good.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Online overtakes TV in survey of UK news habits",
        "description": "Ofcom survey suggests 71% of the population said they now use online services for news.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "EU facing existential risk without investment - report",
        "description": "The long-awaited report paints a bleak picture days ahead of the EU's new top team being confirmed.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Asos shoppers hit out at new £3.95 returns charge",
        "description": "The company said it was introducing a charge for customers with a \"frequently high return rate\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Google's lucrative ad tech business goes on trial",
        "description": "Regulators have successfully argued Google is too powerful in search - now they are coming for its ad tech.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Climate change leaves future of Pacific Islands tourism 'highly uncertain'",
        "description": "Tourist sector bosses in the region are increasingly concerned about the impact of climate change.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Corruption review finds 'red flags' in more than 130 Covid contracts in UK",
        "description": "An anti-corruption charity finds significant concerns in £15.3bn worth of contracts awarded during the pandemic.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "The luxury plane that took flight 75 years ago",
        "description": "The Bristol Brabazon laid the foundation for the development of Concorde.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Where will the UK bury nuclear waste for 100,000 years?",
        "description": "Britain's nuclear waste needs a permanent home - but finding a community willing to take it is tricky.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Chinese giant Chery could build cars in UK",
        "description": "Chery is weighing up the possibility of building cars in the UK, according to a senior executive.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "State pension set to rise by £460 next year",
        "description": "The latest figure comes as the government faces a backlash over cutting winter fuel payments for most pensioners.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "New oil and gas ban threatens jobs, unions warn",
        "description": "Unite and the GMB say fossil fuels should not be abandoned until workers know how their jobs will be protected.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "More bus services could come under control of councils",
        "description": "Transport Secretary Louise Haigh promises to deliver a \"bus revolution\" that will save vital routes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Aldi shoppers trade up to Wagyu steak and brioche buns",
        "description": "The supermarket reveals it made an extra £2.4bn in sales in 2023, despite now facing a slowdown in growth.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "How much is the winter fuel payment and how can I still claim it?",
        "description": "A row over winter fuel payments exposes issues with unclaimed benefits such as pension credit.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "'Without emergency government fund, I wouldn't be here'",
        "description": "The BBC hears from those who have used the Household Support Fund, which has been extended until April 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Body Shop's remaining stores rescued from administration",
        "description": "The deal for the cosmetics firm appears to secure the immediate future for remaining staff.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Fudge maker devastated as social media suspended",
        "description": "The family-run business claims it has lost almost 100,000 followers after Instagram's decision.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Owner of OnlyFans paid $631m as subscriptions rise",
        "description": "Leonid Radvinsky's huge earnings were revealed in the online platform's latest accounts.",
        "source": "BBC Business",
        "fetched_date": "2024-09-10T07:23:07.684681"
    },
    {
        "title": "Is climate change making hurricanes and typhoons worse?",
        "description": "These powerful tropical storms are generally becoming more intense as the world warms.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-10T07:23:07.756939"
    },
    {
        "title": "Tyrese Gibson Arrested at Court Hearing for Underpayment of Child Support",
        "description": "Tyrese Gibson is in custody in Atlanta after a contentious child support hearing where he was ordered to pay upwards of $73,000 to his former partner by a judge to avoid jail time, according to court records. The actor appeared in Fulton County Superior Court for the latest hearing in his ongoing battle with ex-wife […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Harvey Weinstein Rushed to Hospital For Heart Surgery",
        "description": "Harvey Weinstein was taken to Bellevue Hospital in New York Sunday night and underwent heart surgery Monday.  According to Weinstein’s representatives, Craig Rothfeld and Juda Engelmayer, Weinstein was “rushed” to the hospital “due to several medical conditions.” They did not comment further on the current state of his health.   “We can confirm that Mr. Weinstein […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Donald Glover Postpones Childish Gambino Shows to “Focus on My Physical Health”",
        "description": "Donald Glover postponed the remainder of his North American Childish Gambino tour on Monday, citing physical health concerns and promising that all tickets will eventually be honored. Glover, who performs under the Childish Gambino moniker, wrote on social media he needed to cancel all remaining dates of his New World tour “to focus on my […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Shailene Woodley Defends Sharing Melania Trump Statement After Donald Trump Assassination Attempt",
        "description": "Shailene Woodley has defended her decision to share Melania Trump’s statement following the assassination attempt on Donald Trump. In an interview with Bustle, the Three Women star was asked if she felt she was “misunderstood” after receiving backlash for sharing Melania’s open letter on her Instagram Story. Woodley explained that upon reading the former first […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Eric Idle on ‘Monty Python’ Money Troubles, “Poor” John Cleese Relationship",
        "description": "The move also follows fellow Cleese claiming he's quitting Twitter/X after Elon Musk post.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Eminem to Open 2024 MTV VMAs",
        "description": "Eminem is set to open the 2024 MTV VMAs with the first TV show performance from his latest album, The Death of Slim Shady. The rapper is nominated for eight VMAs this year, including video of the year, best hip-hop, song of the summer and VMAs’ most iconic performance for his 2000 medley of “Real […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "CMA Awards: Beyoncé Snubbed; Morgan Wallen, Post Malone Earn Multiple Nominations",
        "description": "The 2024 CMA Awards have showered Morgan Wallen and Post Malone with multiple nominations but heavily snubbed Beyoncé, though she had one of the year’s biggest country albums with Cowboy Carter and biggest country songs with “Texas Hold ‘Em.” Wallen leads the way at the CMAs with seven nominations. He’s followed by Chris Stapleton and […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Antonique Smith and Rev Yearwood Launch Nonprofit to Mobilize Black Communities on Climate Vote",
        "description": "Actress Antonique Smith and activist Rev Yearwood have teamed up to launch Climate Revival, a new nonprofit using the power of music and celebrity to mobilize faith communities and people of color to get out the climate vote, both in the 2024 election and beyond. The duo will host special event “Climate Revival: Live” in […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Hollywood Bowl Cancels Sunday Night’s Vance Joy Concert Due to a Power Outage",
        "description": "The Hollywood Bowl was forced to cancel its Sept. 8 show due to a power outage. The venue posted on its website that the concert, headlined by Vance Joy, had been called off. “Tonight’s Vance Joy concert is cancelled due to a power outage affecting the Hollywood Bowl and vicinity,” the website read. “We apologize […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Robert De Niro Warns Democrats Not to Become Complacent Ahead of Election: “It Ain’t Over Till It’s Over”",
        "description": "Robert De Niro and Steve Buscemi were among the Hollywood stars who took part in Sunday’s “Paisans for Kamala,” a livestream featuring prominent Italian Americans hoping to drum up support and donations for the Harris-Walz presidential campaign. De Niro kicked off the event — hosted by comedian Paul Mecurio, former New York Mayor Bill de […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Kendrick Lamar to Headline 2025 Apple Music Super Bowl LIX Halftime Show",
        "description": "Kendrick Lamar is set to headline the 2025 Apple Music Super Bowl LIX halftime show. Roc Nation, NFL and Apple Music made the announcement on Sunday, and the big game will take place on Feb. 9, 2025, at the Caesars Superdome in New Orleans. It will air on Fox. Lamar previously performed at the hip-hop […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "LL Cool J on the Challenges of Finding the “Right Balance” Between His Acting and Music Careers",
        "description": "LL Cool J is opening up about learning how to balance his acting career with his passion for music. The Grammy-winning rapper got candid in a recent interview with The Independent about feeling conflicted once his acting career took off in the 1990s. “The more successful I became in acting, the less I wanted to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-10T07:23:08.172849"
    },
    {
        "title": "Formo gets investors’ mouths watering with Koji protein-based animal-free cheese",
        "description": "A love of food — and, well, cheese — has landed German fermentation startup Formo‘s co-founder Roman Plewka and its team a hefty $61 million Series B round to keep…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Swiggy weighs increasing IPO size by $150M, aiming to raise up to $1.4B",
        "description": "Swiggy is considering boosting the fresh issue component of its IPO by $150 million, targeting a total of $1.4 billion.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Sri Mandir helps Hindus visit sacred temples and offer donations virtually, from their phones",
        "description": "AppsForBharat, the startup behind Hindu devotional app Sri Mandir, has raised $18 million to penetrate into global markets and add new features.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Seattle Cybertruck became fleeting tourist destination",
        "description": "You could argue whether Cybertruck owners crave attention, but attention they receive, often by critics poking fun at the vehicles. People seem to particularly delight at Cybertruck mishaps, as when…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Heart disease is the world’s biggest killer — this Cambridge Uni spinout is using AI to find new treatments",
        "description": "Cambridge University spinout CardiaTec is striving to tackle cardiovascular diseases, one of the world’s leading causes of death, with AI.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Online, led by social media, overtakes TV as the most popular source of news in the UK, Ofcom says",
        "description": "Online platforms have now overtaken TV for the first time as the most popular resource for news among adult consumers, at 71% versus 70%, according to new research.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Apple upgrades watchOS with AI-powered features, including translation",
        "description": "Apple has announced new features for the latest version of watchOS, watchOS 11, including translation and an upgraded Smart Stack.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "TechCrunch Space: Boeing’s Starliner returns to Earth",
        "description": "Hello and welcome back to TechCrunch Space. Let’s dive into the news! Want to reach out with a tip? Email Aria at aria.techcrunch@gmail.com or send a message on Signal at…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "iPhone 16, Apple Intelligence, AirPods 4 and more: Everything revealed at Apple Event 2024",
        "description": "Apple’s lineup of announcements echoed many of the anticipated hardware reveals, including the new iPhone 16, AirPods 4, the Apple Watch Series 10 and more.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Why Apple added yet another button to the iPhone 16",
        "description": "With another new iPhone comes another new iPhone button: Camera Control, which was announced at Apple’s “Glowtime” event on Monday.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Audible recruits voice actors to train audiobook-generating AI",
        "description": "Audible, Amazon’s audiobook business, on Monday announced that it’ll use AI trained on professional narrators’ voices to generate new audiobook recordings. A select, U.S.-based cohort of audiobook narrators will be…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Climate change was a lot less prominent in this year’s iPhone event",
        "description": "The lack of climate announcement’s at Apple’s annual event shows just how hard meaningful progress on carbon emissions can be, even for one of the world’s most valuable companies.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Confluent acquires streaming data startup WarpStream",
        "description": "Confluent plans to use WarpStream’s cloud-native solution to fill out its portfolio by offering a new service (Confluent WarpStream) that can sit in between its fully-managed Confluent Cloud and self-managed…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Apple sets lower iPhone 16 Pro prices in India",
        "description": "The iPhone 16 Pro and Pro Max models now start at 119,900 rupees ($1,428) and 144,900 rupees ($1,725) respectively, compared to their iPhone 15 Pro counterparts which were priced at…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Here are all the devices compatible with iOS 18",
        "description": "iOS 18 will be available in the fall as a free software update.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "All the iPhone 16 models compared",
        "description": "All the iPhones now have an action button and a dedicated camera button.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "What is Apple Intelligence, when is it coming and who will get it?",
        "description": "Apple Intelligence was designed to leverage things that generative AI already does well, like text and image generation, to improve upon existing features.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Here’s the full list of 35 US AI startups that have raised $100M or more in 2024",
        "description": "In the first half of 2024 alone, more than $35.5 billion was invested into AI startups globally.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Apple will make iOS 18 available to all users on September 16",
        "description": "You will get the iOS 18 update if you have an iPhone XR or later, or iPhone SE (second gen) or later.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Apple to release AI-focused macOS Sequoia on September 16",
        "description": "The swift macOS Sequoia release deviates from Apple’s usual late September or October timeline for desktop OS updates.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-10T07:23:08.486827"
    },
    {
        "title": "Giants whacked after footy boss’ Papley bump",
        "description": "Giants footy boss Jason McCartney has learned his fate from the AFL after his collision with Swan Tom Papley at the SCG.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Unacceptable’: GWS punished for player clash",
        "description": "The AFL has slapped GWS with a hefty penalty for an incident involving a Giants staff member and a Sydney star on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "NRL’s best player is back for the finals",
        "description": "There are no extended bench shenanigans this week with clubs naming their biggest stars to return from injury.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Layers’ to Smith decision, says coach",
        "description": "Australian coach Andrew McDonald has outlined where the Test batting line-up could change this summer against India.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Giants whacked after footy boss’ Papley bump",
        "description": "Giants footy boss Jason McCartney has learned his fate from the AFL after his collision with Swan Tom Papley at the SCG.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Unacceptable’: GWS punished for player clash",
        "description": "The AFL has slapped GWS with a hefty penalty for an incident involving a Giants staff member and a Sydney star on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "NRL’s best player is back for the finals",
        "description": "There are no extended bench shenanigans this week with clubs naming their biggest stars to return from injury.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Storm not fooled by Cronulla’s siege mentality",
        "description": "The Sharks claim they don’t get enough respect in Sydney, but it’s a different story down south where the Storm have nothing but respect for their long-time rivals.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Layers’ to Smith decision, says coach",
        "description": "Australian coach Andrew McDonald has outlined where the Test batting line-up could change this summer against India.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Bazball truth no one wants to admit",
        "description": "Australia has laughed along at England’s attempts to fool the world about Bazball – but in reality there is actually one good thing about it.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Awfully tough’: Aussies’ Davis Cup blow",
        "description": "The US Open doubles champions and red-hot Alexei Popyrin will lead the Australian Davis Cup charge in Spain after an injury blow.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Taylor, Travis stun with PDA at US Open",
        "description": "The A-list couple appeared more in love than ever during their very public date at the US Open.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Monster’: F1 champ spits the dummy",
        "description": "F1 golden boy Max Verstappen has made a candid admission that could produce the massive upset some fans have been waiting for.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Lambo Guy’ reveals shock new investment",
        "description": "Self-made billionaire and Aussie car nut Adrian “Lambo Guy” Portelli has revealed his next big investment.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Ex-NRL star’s horror driving record revealed",
        "description": "A court has heard details of controversial former NRL star John Hopoate’s shocking driving record as he lost an appeal to have his licence reinstated.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Transformed Hollywood star unrecognisable",
        "description": "A former WWE heavyweight champion turned Hollywood star has left jaws on the floor after showing off his body transformation.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Coach breaks down over NFL star’s arrest",
        "description": "Footage of an NFL superstar’s police confrontation has been released, with his coach getting emotional addressing the incident.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Star’s wife’s heartbreaking eulogy reveal",
        "description": "There have been distressing scenes as the wives of killed brothers revealed devastating pregnancy news as the duo were laid to rest.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Former Celtic striker joins Sydney FC",
        "description": "Having already secured the services of Brazilian star Douglas Costa, Sydney FC has added more firepower to its attacking arsenal.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Kerr smashes question everyone’s asking",
        "description": "Sam Kerr has addressed speculation about her return to football, nine months after suffering an ACL injury that put her career on hold.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Taylor Swift and the Super Bowl: Inside UFC’s $30m gamble",
        "description": "The UFC is promising to put on the biggest event ever at Las Vegas’ state of the art Sphere. Here’s how they did it and why it’s costing Dana White 10 times more than any other pay-per-view.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "LIV gun’s big Aussie commitment",
        "description": "After earning a golden ticket to the Masters via his win in Sydney last year, the Australian Open champion is coming back for more.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "New to SuperCoach NBL? Follow the winner’s five simple tips",
        "description": "A year ago, the first winner of SuperCoach NBL didn’t know much about basketball. Now he’s hooked. Here’s how he made it to the top – and how you can join the fun.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Body found in search for rugby legend’s wife",
        "description": "Police have made a tragic discovery in the search for a rugby legend’s wife after she vanished going for a group swim.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Humiliating’: Wallabies torn to shreds",
        "description": "Australia has fallen apart on the international stage with the Wallabies imploding in spectacular fashion on Sunday morning.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "Randwick-Kensington tips: Hat-trick looms for Winx’s sister",
        "description": "Winx’s little sister, Wings Of Desire, has been good in winning her first two starts and can maintain her unbeaten record when she steps out at Randwick-Kensington.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-10T07:23:10.977401"
    }
]