[
    {
        "title": "Trump says EU tariffs will happen and UK is 'out of line' but deal 'can be worked out'",
        "description": "Asked by the BBC whether he would target the UK with tariffs, Donald Trump says \"it might happen\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Asian markets tumble as Trump's tariff war escalates",
        "description": "Canada and Mexico are facing 25% tariffs on US exports, and Chinese-made goods, a 10% levy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Musk team given access to sensitive federal payment system - reports",
        "description": "The Trump administration grants Musk's team access to system that controls the flow of trillions of dollars in funds, US media report.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Canada imposes 25% tariffs in trade war with US",
        "description": "Canada announces retaliatory tariffs against the US, in a move that is likely to be costly for both nations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Asian markets tumble as Trump's tariff war escalates",
        "description": "Canada and Mexico are facing 25% tariffs on US exports, and Chinese-made goods, a 10% levy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "EU tariffs 'pretty soon' but UK can be worked out - Trump",
        "description": "Trump accuses the EU of taking advantage of the US but says UK PM Starmer has been 'very nice'.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Thames Water seeks court approval for emergency cash",
        "description": "Thames Water is hoping to secure an emergency cash injection or face runing out of money in weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Canadian fans boo US anthem as tariffs spur 'buy local' pledge",
        "description": "Canadians have begun booing the US anthem at sports games, signalling the depth of anger at steep tariffs issued by Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "How world responds to Trump's tariffs is what matters next",
        "description": "Retaliatory taxes against the US by other nations could lead global trade into uncharted territory.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Tax relief for Indian middle class - but will it boost economy?",
        "description": "The finance minister announced steps to tackle slowing growth, rising prices and low middle-class consumption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Trump using tariffs 'as geopolitical leverage' - 31 Jan 2025",
        "description": "Expert says President Trump may not impose the full 25 percent tariffs if he gets some concessions.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Will Donald Trump’s tariffs hurt US consumers?",
        "description": "Trump claims more taxes on trade wouldn't be a cost to the US - but almost all economists dispute this.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Barclays working to update account balances after tech outage",
        "description": "The bank says a technical issue, which began on Friday and impacted the its app, online banking and payments, has been resolved.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "'Is it for a day or four years?': Tariff uncertainty spooks small businesses",
        "description": "Entrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Davey urges Starmer to start EU customs union talks",
        "description": "Sir Ed Davey calls for PM to use meeting with EU leaders to \"fire the starting gun\" on new trade deal.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Why Dynasty Warriors makers scrapped sequel to reinvent series",
        "description": "Tomohiko Sho says the unreleased game was something fans were 'starting to get a bit bored of'.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Take-off or bail out? The airport even Ryanair thinks is a tough sell",
        "description": "After Rachel Reeves pledges her support, is Doncaster Sheffield Airport clear for take-off?",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Barclays customers face second day of issues after IT outage",
        "description": "Online banking, the bank's app and payments in and out of accounts are all affected.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Trump's tariffs hit China hard before - this time, it's ready",
        "description": "Trump has imposed a 10% levy - but his campaign included promises of 60% tariffs against Chinese imports.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Booze, oil and orange juice: How Canada could fight Trump tariffs",
        "description": "As Justin Trudeau warns Canadians they could face \"difficult days\" ahead, here are four options for retaliation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Canada 'will stand up to a bully', says PM contender Carney over Trump tariffs",
        "description": "The prime ministerial candidate responds to Donald Trump imposing 25% tariffs on Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "'Outlandish comments': War of words between US, Canada and Mexico",
        "description": "As Donald Trump threatened to impose border taxes, the leaders of America's neighbours said they were prepared to act.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Blow for Reeves as AstraZeneca ditches £450m investment",
        "description": "The drugs giant blames \"protracted\" talks with the government as well as differences over funding.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Ex-Trafigura boss convicted of bribery in landmark case",
        "description": "The commodities giant went on trial in Switzerland over attempts to gain access to Angola's oil market.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Five key impacts of Brexit five years on",
        "description": "The UK left the European Union on 31 January 2020.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Sri Lanka eases vehicle import ban, but can people afford a new car?",
        "description": "A scarcity of vehicles to buy, the country's weak currency and high taxes have forced up prices of cars.",
        "source": "BBC Business",
        "fetched_date": "2025-02-03T07:24:04.178048"
    },
    {
        "title": "Grammys: Reporter Apologizes for Disrespectful Babyface Interview",
        "description": "A red carpet interview between the 13-time winner and journalists from the Associated Press went viral for all of the wrong reasons on Sunday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Beyoncé Wins Album of the Year at 2025 Grammys for First Time",
        "description": "The award, presented by the Los Angeles Fire Department, ended the singer's long-running streak as the most nominated female artist without a win in the category.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Inside Beyoncé’s Record-Breaking Night at the 2025 Grammys",
        "description": "The cultural icon finally won album of the year as well as awards for best country album for 'Cowboy Carter,' and best country duo/group performance for \"II MOST WANTED\" featuring Miley Cyrus.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Grammys: Kendrick Lamar Wins Song of the Year, Marking Clean Sweep at 2025 Ceremony",
        "description": "The ‘Not Like Us’ singer took home five Grammys for his 2024 track.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Grammy Awards: Winners List",
        "description": "Beyoncé won album of the year, Kendrick Lamar took home the trophies for record and song of the year, and Chappell Roan was named best new artist during Sunday's ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Grammys: Kendrick Lamar Dedicates Record of the Year Win for “Not Like Us” to L.A.",
        "description": "The rapper's win during music's biggest night comes amid Drake's legal war over the song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Lady Gaga Says “Trans People Are Not Invisible” as Grammys Get Political",
        "description": "The awards show, in a departure from the tone of other recent ceremonies and as the first such event during Donald Trump's second term, featured a number of comments about immigration and tariffs.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Lady Gaga Returns to Pop Roots With New Song and Music Video “Abracadabra”",
        "description": "Lady Gaga appears to be going back to the not-so-basics in her new music video, which partially dropped during a commercial break at the 2025 Grammys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "How the 2025 Grammys Responded to L.A. Wildfires",
        "description": "The devastating fires that destroyed tens of thousands of structures and left at least 29 dead were central to the awards ceremony in Los Angeles on Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Grammys Tribute to Quincy Jones Features Cynthia Erivo, Will Smith and a Medley of Iconic Hits",
        "description": "Janelle Monaé, Lainey Wilson, Stevie Wonder, Herbie Hancock and Jacob Collier also helped remember the late music legend on Sunday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "“Miss Me?”: ‘M3GAN 2.0’ Teaser Debuts During Grammy Awards",
        "description": "The sequel to the 2022 box office hit 'M3GAN' hits theaters on June 27.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "The Weeknd Makes Surprise Grammys Performance After Past Boycott",
        "description": "\"I remember waking up to the headlines that the Weeknd called out the Academy for a lack of transparency in our awards. He went so far as to announce he was boycotting the Grammys. That made for some interesting reading over breakfast,\" Recording Academy CEO Harvey Mason jr. said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-03T07:24:04.984462"
    },
    {
        "title": "Defender wants Sydney to see ‘best’ of him",
        "description": "Sydney FCs defensive options have increased with the signing of an experienced centre-back and the emergence of a young talent.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "AFL makes decision after Ryan fight video",
        "description": "The AFL Integrity Unit has made a decision on Liam Ryan’s involvement in a fight outside a music festival last month.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Konstas gong confirms star status",
        "description": "After a stunning Test debut teenage tyro Sam Konstas has been given an honour named after Australia’s best ever.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "‘Every year’: Calls for annual All-Stars game",
        "description": "The AFL Indigenous All-Stars squad is sure to provide plenty of highlights when they come together for the first time in a decade and the players involved want to do it every year.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Konstas gong confirms star status",
        "description": "After a stunning Test debut teenage tyro Sam Konstas has been given an honour named after Australia’s best ever.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Cricket’s night of nights now ‘meaningless’",
        "description": "It’s cricket’s equivalent of the Dally M Awards or Brownlow Medal night but many are questioning if it is even significant anymore.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "‘Villain’: Star smacks butt in Australia’s face",
        "description": "Tennis star Danielle Collins has chosen not to forgive and forget Australia after the nation turned on her in Melbourne.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Tennis in uproar over ‘unbelievable scenes’",
        "description": "The tennis world has been left gobsmacked after a rogue shoulder charge celebration took out a player in wild scenes at the Davis Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "AFL makes decision after Ryan fight video",
        "description": "The AFL Integrity Unit has made a decision on Liam Ryan’s involvement in a fight outside a music festival last month.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "‘Every year’: Calls for annual All-Stars game",
        "description": "The AFL Indigenous All-Stars squad is sure to provide plenty of highlights when they come together for the first time in a decade and the players involved want to do it every year.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is in overdrive and showing no signs of slowing down. Keep up to date with all the latest player movement in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "McLean mystery solved ahead of Vegas test",
        "description": "Casey McLean is too young to enjoy everything Las Vegas has to offer, but the emerging Panthers star is wise enough to know what he needs to work on to build on his breakout year.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "All-Stars dealt in more NBA trade drama",
        "description": "A day after perhaps the biggest NBA trade of all time, another mega-deal has been done, seeing two All-Stars swap teams.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Text message says it all in NBA bombshell",
        "description": "The NBA is in meltdown over one of the biggest trades in basketball history — and the cloak-and-dagger deal has sparked bombshell rumours.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Defender wants Sydney to see ‘best’ of him",
        "description": "Sydney FCs defensive options have increased with the signing of an experienced centre-back and the emergence of a young talent.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Major turnaround in Socceroos’ fortunes",
        "description": "In a good sign for the Socceroos ahead of March’s FIFA World Cup qualifiers, Mat Ryan and Joe Gauci are both now getting match minutes since moving to new clubs.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "UFC boss Dana White en route to Sydney",
        "description": "UFC president Dana White is expected to touch down in Sydney this afternoon ahead of the city’s UFC 312 pay per view event.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Supercars team owner airborne in terrifying Bathurst crash",
        "description": "Supercars team owner Stephen Grove has been hospitalised after a scary airborne crash at the top of Mount Panorama in the Bathurst 12 Hour.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "All-Stars dealt in more NBA trade drama",
        "description": "A day after perhaps the biggest NBA trade of all time, another mega-deal has been done, seeing two All-Stars swap teams.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Aussie stunner not enough in $32m chase",
        "description": "Cam Davis made a spectacular finish at Pebble Beach but, after starting within touching distance of a payday close to $6m, came up short.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Best bets, inside mail for Grafton on Tuesday",
        "description": "Gooree-bred mare Got The Smarts can end a run of near misses and post another win at Grafton on Tuesday.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Tahs suffer early Suaalii blow with injury icing debut",
        "description": "Superstar Joseph-Aukuso Suaalii’s hotly anticipated debut in the NSW Waratahs jersey has been cruelled by an injury.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Wallabies grudge match secured with Jones’ Japan",
        "description": "He left the Wallabies after a horror World Cup campaign to take a job in Japan some say he’d already lined up and now Eddie Jones will have to coach against his former players.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    },
    {
        "title": "Anna Kournikova went from star to recluse",
        "description": "The Russian beauty had a cocktail and even computer virus named after her at height of fame before her horror stalking ordeal.",
        "source": "News AU",
        "fetched_date": "2025-02-03T07:24:07.049077"
    }
]