[
    {
        "title": "US Senate holds marathon vote on Trump's 'big beautiful bill'",
        "description": "Senators are debating a nearly 1,000-page bill that is pivotal to President Donald Trump's domestic agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "The bridge changing lives and boosting business",
        "description": "The Öresund bridge, which connects Denmark and Sweden, is celebrating 25 years since its opening.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "UK-US tariff deal begins but still no news on steel",
        "description": "The deal will give the UK motor industry preferential treatment and cut aerospace tariffs to zero.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "One of Nigeria’s richest men set to be buried in Saudi Arabia",
        "description": "An uncle of Africa’s richest man, Dantata left behind 21 children and 121 grand children",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "The bridge changing lives and boosting business",
        "description": "The Öresund bridge, which connects Denmark and Sweden, is celebrating 25 years since its opening.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "White House says Canada's Carney 'caved' to Trump on tech tax",
        "description": "Carney said the tax had been dropped as \"part of a bigger negotiation\" and that Canada-US trade talks had resumed.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Canada drops tech tax to restart US trade talks",
        "description": "A new tax on technology firms is being halted after Trump threatened new tariffs on Canadian goods.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Boeing's 787 Dreamliner was deemed the 'safest' of planes. The whistleblowers were always less sure",
        "description": "Long before the Air India tragedy, the cause of which is still to be determined, people who had worked on the 787 had raised concerns about the production standards",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "The global environmental award hit by accusations of greenwashing",
        "description": "US business Dr Bronner's has criticised the B Corp scheme for allowing in too many multinationals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Why your old mobile phone may be polluting Thailand",
        "description": "The Asian nation is importing thousands of tonnes of electronic waste per year, despite a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Markets rise on Canada trade deal hopes - 30 Jun 2025",
        "description": "Expert says the markets have moved on from the initial tariff turmoil.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Should we be letting flies eat our food waste?",
        "description": "In Lithuania and Australia, hungry fly larvae are used to process food waste into useful protein.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "China partially lifts ban on Japanese seafood imports",
        "description": "It imposed the ban in 2023 over Japan's release of treated waste water from the Fukushima nuclear plant.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Trump says he has 'a group of very wealthy people' to buy TikTok",
        "description": "Trump says he thinks China's president will probably approve a sale to the unidentified group.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Nearly 12 million estimated to lose health coverage under Trump budget bill",
        "description": "The spending plan could also add nearly $3.3tn (£2.4tn) in debt, according to non-partisan analysis.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which is set for a Senate vote, includes sweeping changes to taxes, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "'In business, indecision is killer': Canadian firms seek certainty in tariff war",
        "description": "Intense US-Canada negotiations for a potential new trade and security deal have hit a snag ahead of a mid-July deadline.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "'We have all the cards' - Trump says he is ending Canada trade talks",
        "description": "Canada had been hoping to secure a trade deal with the US next month to avoid steep tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "'I tell my children not to play so we save money on soap'",
        "description": "High inflation and a cost-of-living crisis means many Malawians, like Suzanna Kathumba, face tough choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Japan loves them. And now they're in the UK - strawberries and cream sandwiches",
        "description": "Serving strawberries in a sandwich might sound unusual in the UK, but it's nothing new in Japan.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "'We can't do without these people': Trump's migrant crackdown has businesses worried",
        "description": "President Donald Trump's crackdown on immigrants could have serious economic repercussions.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Lotus considering shifting UK production to US",
        "description": "The BBC understands the car maker is considering the move amid the introduction of US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "UK car production plunges to 76-year low for May",
        "description": "Exports to the US halved as President Donald Trump's tariffs caused some UK car makers to halt shipments.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Nike pledges to cut reliance on Chinese factories",
        "description": "Company executives say the sportwear giant will cut its reliance on producing goods in China to ease the impact of US trade policies.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Satirical Bezos mannequins pop up in Venice ahead of wedding",
        "description": "Unflattering installations depicting Amazon founder and his bride-to-be are attracting attention in the Italian city.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "The woman who could bust Trump's 'big beautiful bill'",
        "description": "The Senate parliamentarian, often called a referee, has thrown a spanner in Trump's tax bill.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "Canada passes law fast-tracking 'nation-building' projects to counter Trump",
        "description": "The government hopes the legislation will reduce dependence on the US, but has drawn criticism from environmental groups.",
        "source": "BBC Business",
        "fetched_date": "2025-07-01T07:30:06.366532"
    },
    {
        "title": "BBC “Regrets” Not Pulling Bob Vylan Glastonbury Set Livestream With “Antisemitic Sentiments”",
        "description": "\"The team were dealing with a live situation, but with hindsight, we should have pulled the stream during the performance,\" a statement from the U.K. public broadcaster said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Olivia Rodrigo Brings Out The Cure’s Robert Smith as She Wraps Up Politically Charged Glastonbury",
        "description": "A sweet moment also occurred during Rodrigo's headline set when she dedicated the tune \"so american\" to Brit boyfriend and actor Louis Partridge, who was watching from backstage.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Beyoncé Pauses Show After Prop Car Tilts in the Air",
        "description": "The Cowboy Carter Tour's second night in Houston is Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Charli XCX Hits Back at “Boomer” Criticism of Autotune Use During Glastonbury Set: “Yawn”",
        "description": "\"The idea that singing with deliberate autotune makes you a fraud or that not having a traditional band suddenly means you must not be a real artist is like, the most boring take ever,\" the English singer said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Charlize Theron Calls Out Immigration Policies That Have “Destroyed the Lives of Families, Not Criminals”",
        "description": "The star hosted her fifth annual Charlize Theron Africa Outreach Project Block Party on Saturday, as she told guests, \"We're moving backwards fast.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Glastonbury Organizers “Appalled” by Bob Vylan Chants: “There Is No Place for Antisemitism”",
        "description": "The rap duo has come under fire for encouraging audiences at the U.K. music festival to join in on shouting \"death to the IDF\" during their set.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Charli xcx Burns ‘Brat’ at Packed Glastonbury Set: “I Don’t Know Who I Am If It’s Over”",
        "description": "Gracie Abrams — on Worthy Farm this weekend as a performer, also — was selected as the Grammy winner's \"Apple\" girl on Saturday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Paul Simon Cancels Philadelphia Concerts Due to “Chronic and Intense Back Pain”",
        "description": "A statement posted to the singer’s official Instagram account revealed he would be undergoing a “minor surgical procedure” in the coming days.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Walter Scott Jr., Vocalist of The Whispers, Dies at 81",
        "description": "The singer was known for hit tracks like \"And the Beat Goes On\" and \"Rock Steady.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Kneecap Shocks as Expected With Raucous Glastonbury Set: “The BBC Editor Is Going to Have Some Job”",
        "description": "The Irish rap trio has drawn widespread criticism in recent months, with U.K. politicians criticizing the choice to allow them to perform at the musical festival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Dolly Parton’s Vegas Residency Sold Out in 90 Minutes: Here’s How Fans Can Still Snag Tickets",
        "description": "The six-show engagement marks the country legend's first extended run in 32 years. Here's how to secure seats with THR-exclusive promo codes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    },
    {
        "title": "Matty Healy Gives Mixed Message on Politics as The 1975 Kick Off Glastonbury Headline Sets",
        "description": "\"I know I'm meant to be a rockstar but this is really scary and I'm really nervous,\" said the band's frontman to the 100,000+ crowd Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-01T07:30:06.600596"
    }
]