[
    {
        "title": "Tesla denies launching search for Musk replacement",
        "description": "The electric car firm says a report that it is hunting for a successor is \"absolutely false\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "US and Ukraine sign long-awaited natural resources deal",
        "description": "The White House has been pushing for the agreement as a prerequisite for further military assistance.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Meta warns of 'worse' experience for European users",
        "description": "Meta said the negative impact could kick in as soon as the third quarter of this year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "US economy shrinks as firms import more ahead of tariffs",
        "description": "The world's largest economy contracted at an annual pace of 0.3% in the first three months of 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "US and Ukraine sign long-awaited natural resources deal",
        "description": "The White House has been pushing for the agreement as a prerequisite for further military assistance.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks",
        "description": "The US president blames the first quarterly GDP decline in three years on his Democratic predecessor.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "'We don't care': A defiant China looks beyond Trump's America",
        "description": "Chinese exporters tell the BBC if the US doesn't want their goods, \"other countries have money\" to buy them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Apple referred for possible criminal contempt investigation",
        "description": "The tech giant had been ordered in 2021 to allow greater competition and open the App Store up to outside payment options.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Deported gang members get second chance at call centre",
        "description": "In the Mexican city of Tijuana a number of firms are employing people who were removed from the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Fifty years after the war, Vietnam faces a new US threat - tariffs",
        "description": "The South East Asian country is on a path to prosperity. The US-China trade war could change that.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Billionaire Isaacman takes big step toward leading Nasa",
        "description": "Jared Isaacman, who has worked with Elon Musk, won approval from a key committee and is expected to clear a full Senate vote.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Xi's real test is not Trump's trade war",
        "description": "The real battleground of the current trade war might be China's domestic economy",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Starbucks to hire more baristas in bid to win back customers",
        "description": "The move to increase staff numbers comes as the coffee shop giant continues to see sales fall.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Border crossings, egg prices and jobs - Trump's 100 days speech fact-checked",
        "description": "BBC Verify has looked into some of the claims made by the US president during his speech in Michigan.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Richard Branson criticises Donald Trump's tariffs",
        "description": "Sir Richard Branson told the BBC he wanted to \"make London prosperous for everybody\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Canada will deal with Trump 'on our terms', Carney tells BBC",
        "description": "Speaking exclusively to the BBC, Canada's PM says he will only visit the US when there is a \"serious discussion to be had\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Trump calls Bezos as Amazon says no plan to show tariff price rises",
        "description": "Donald Trump called Amazon founder Jeff Bezos to complain about the plan, which the company said had been rejected.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Trump eases car tariffs after firms raised concerns",
        "description": "The president said the move would give companies relief while they adjust their supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Analysis:  Carney wants to lead a G7 fightback on Trump tariffs",
        "description": "In winning the Canadian election, Mark Carney becomes the biggest economic force against the US president.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "How Spain powered back to life from unprecedented national blackout",
        "description": "However diversified Spain's energy mix is, the blackout required an enormous effort to get back up and running.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Malta's golden passport scheme breaks EU law, top court rules",
        "description": "The scheme lets people become citizens after paying, buying or renting property of a certain value, and donating to charity.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Trainer prices will rise due to tariffs, says Adidas",
        "description": "Adidas says trade tariffs introduced by President Donald Trump will lead to price rises for US consumers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Prince Andrew's firm linked to controversial PPE millionaire",
        "description": "Documents show Doug Barrowman-linked company owned the prince's start-up competition for two years.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Australian PM dismisses warning over AAA credit rating",
        "description": "High public spending puts the country's rating at risk if savings are not found, analysts have said.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "ChatGPT AI bot adds shopping to its powers",
        "description": "The move is a challenge to tech rivals such as Google as well as other websites offering product reviews.",
        "source": "BBC Business",
        "fetched_date": "2025-05-01T07:26:30.316777"
    },
    {
        "title": "Chappell Roan Recalls ‘The Voice’ Audition Where Producer “Did Not Even Look Up From His Phone”",
        "description": "“I didn’t make it on the show, obviously,” the Grammy winner previously said of her time with the NBC reality show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Lorde Announces New Album, ‘Virgin,’ With X-Ray Cover Art",
        "description": "The Grammy winner’s fourth studio record will debut June 27th, serving as the follow-up to 2021's 'Solar Power.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Kneecap Concerts Canceled In Germany Following Anti-Israel Statements at Coachella",
        "description": "The controversial Irish rap group faces controversy over their claims at Coachella, and over resurfaced concert video of the band calling to kill members of parliament.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Jack Black Sets New Billboard Hot 100 Record With ‘Minecraft Movie’ Song ‘Steve’s Lava Chicken’",
        "description": "The track, co-written by Black and director Jared Hess, is only 34-seconds long, making it the shortest song to get on the chart.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Harvey Weinstein’s Attorneys Push for Mistrial as Accuser Testifies",
        "description": "The ex-mogul's attorneys have pushed for a mistrial three times so far, but have been denied.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Oliver Stone Looks Back at the Fall of Saigon 50 Years Later: “We’re Back to Learning Nothing” (Exclusive)",
        "description": "The ’Platoon’ director reconciles then and now on the anniversary of the Vietnam War’s end.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Barbra Streisand Announces New Duet Album ‘The Secret of Life: Partners, Volume Two’",
        "description": "The record will include features with Paul McCartney, Bob Dylan, Hozier, Mariah Carey and Ariana Grande, among others.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "With a New Label Deal, Kacey Musgraves Faces the Future While Making Peace With Her Past (Exclusive)",
        "description": "The singer-songwriter was a relative unknown when she signed her first label deal. Now, 15 years later, she returns to relaunched Lost Highway Records a country superstar who fought to make music on her terms, expanding the genre in the process. With a divorce in the rearview and blue skies ahead, she talks to THR about why she wanted to go home again.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "CEIPA Board Member Tatsuya Nomura on Matsuri’25, J-Pop’s Global Rise and Japan’s Shift to Streaming",
        "description": "Last month, thousands of attendees flooded DTLA’s Peacock Theatre for Matsuri’25, a concert celebrating Japanese artists.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Ole Obermann and Rachel Newman Named Co-Heads of Apple Music",
        "description": "Obermann joins months after leaving his post as head of music at TikTok, while Newman is a 16-year Apple veteran.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "DJ Khaled Launches Joint Ventures With Influence Media Partners",
        "description": "Khaled will work with the company to develop film and television projects, Influence said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Mike Peters, Frontman of Welsh Band The Alarm, Dies of Cancer at 66",
        "description": "He became a prominent advocate while he fought cancer for 30 years while recording albums and playing concerts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-01T07:26:30.835122"
    },
    {
        "title": "Axed coach decides who should play fullback",
        "description": "The Brisbane Broncos are facing several tough calls around Adam Reynolds and Reece Walsh, with a squeeze set to push players out the door.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘He’s a leader’: Tiger straight back in after curfew",
        "description": "There’s no doubt what Richmond coach Adem Yze thinks of star defender Noah Balta, whose standing has not been diminished despite a heavy court sentence.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "A-League club hit with FIFA ban",
        "description": "An A-League club’s hopes of bringing new players in has been dealt a severe blow by a FIFA ban.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Ugly fallout of star’s contract farce revealed",
        "description": "Revealing the full toll of the ugly fallout from a meeting with a rival coach, the West Coast co-captain says things got very dark.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Axed coach decides who should play fullback",
        "description": "The Brisbane Broncos are facing several tough calls around Adam Reynolds and Reece Walsh, with a squeeze set to push players out the door.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Major update in Lomax’s return date",
        "description": "Eels fans will have to wait a little longer to see Mitch Moses and Zac Lomax on the field together, with the club ruling out an early return for their star recruit.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘He’s a leader’: Tiger straight back in after curfew",
        "description": "There’s no doubt what Richmond coach Adem Yze thinks of star defender Noah Balta, whose standing has not been diminished despite a heavy court sentence.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Ugly fallout of star’s contract farce revealed",
        "description": "Revealing the full toll of the ugly fallout from a meeting with a rival coach, the West Coast co-captain says things got very dark.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘Benchmark’: Aussie legend’s last hurrah",
        "description": "After piling on thousands of runs for Australia and becoming the ultimate cult hero, David Boon has called time on his second career in cricket.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘Pretty bad’: Finger injury ends Maxy’s IPL",
        "description": "He was accused of having a holiday at the IPL so bad was his output and now an Australian star’s tournament is over because of a bad injury.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Axed coach decides who should play fullback",
        "description": "The Brisbane Broncos are facing several tough calls around Adam Reynolds and Reece Walsh, with a squeeze set to push players out the door.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Piastri advantage no other F1 star has",
        "description": "Oscar Piastri has a chance to land a killer blow this weekend as his secret Aussie weapon looms as a big advantage against his F1 rivals.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Schumacher’s first public act ignites hopes",
        "description": "There is fresh hope surrounding F1 legend Michael Schumacher after his first public act in 12 years was spotted by a good friend.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "150kg Aussie giant’s NFL deal",
        "description": "The pathway program that produced Super Bowl winning star Jordan Mailata has unearthed another Aussie giant who has been signed up by the Las Vegas Raiders.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘Insanity’: Grave fears as Aussie sport booms",
        "description": "Leading sports neuroscientist Dr Alan Pearce has issued a grave warning to Aussies as a new combat sport makes waves across the country.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Aussie makes history, wins major NBA award",
        "description": "He may have missed out on Defensive Player of the Year, but Dyson Daniels could not be denied for his all-round improvement in his first season at the Atlanta Hawks.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "150kg Aussie giant’s NFL deal",
        "description": "The pathway program that produced Super Bowl winning star Jordan Mailata has unearthed another Aussie giant who has been signed up by the Las Vegas Raiders.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "A-League club hit with FIFA ban",
        "description": "An A-League club’s hopes of bringing new players in has been dealt a severe blow by a FIFA ban.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘Unbelievable’ teen freak blows world away",
        "description": "The teenage heir apparent to Lionel Messi has stolen the show in a thrilling Champions League semi-final were the goals kept coming.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "‘More money’: Tszyu in massive career U-turn",
        "description": "Tim Tszyu has reached an agreement for a blockbuster world title fight re-match in a stunning development nobody saw coming.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Aussie ‘aura’ could end winning drought",
        "description": "The new Australian captain of the International Team for the Presidents Cup brings something special to the table.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Rising Aussie WNBA star suffers horror season-ending injury",
        "description": "Just two weeks being drafted into the WNBA, young Australian Georgia Amoore’s dream has turned into a nightmare with a shocking training injury.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Wagga, Muswellbrook tips: Promising Me Me to land her first win",
        "description": "Robert and Luke Price can get Wagga Cup Day favourite backers off to the right start should their lightly-raced and progressive mare Me Me the opening race. BEST BETS, INSIDE MAIL",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "All hell breaks loose after car crash interview",
        "description": "NFL icon Bill Belichick has come out in defence of his 24-year-old girlfriend after she intervened in a controversial TV interview.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    },
    {
        "title": "John Coates erupts on TV star Sandra Sully",
        "description": "John Coates has launched an extraordinary attack on Sandra Sully after the TV star reached out to the Australian Olympics great.",
        "source": "News AU",
        "fetched_date": "2025-05-01T07:26:32.456218"
    }
]