[
    {
        "title": "TikTok to begin appeal against being sold or banned in US",
        "description": "The US government wants TikTok sold or divested because it says it is a threat to national security.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Women in tech groups 'can’t run on inspiration alone'",
        "description": "Groups supporting women in science, technology, engineering and maths are struggling for funds.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "New beanless 'coffee' emerges but does it taste any good?",
        "description": "Start-ups launch drinks that look and taste like coffee but they say are better for the environment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "New US shipping rules target China's Shein and Temu",
        "description": "Shein and Temu have been able to ship packages under $800 to the US without facing tariffs.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Germany to welcome Kenyans in labour deal",
        "description": "Germany agrees to ease some of its immigration laws to enable Kenyans find employment in the European's biggest economy.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Women in tech groups 'can’t run on inspiration alone'",
        "description": "Groups supporting women in science, technology, engineering and maths are struggling for funds.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "How the world’s smelliest fruit is making coffee more expensive",
        "description": "A \"perfect storm\" of economic and environmental factors in coffee-producing regions is pushing up prices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "'I tried to say no repeatedly': More men accuse ex-Abercrombie boss over sex events",
        "description": "New witnesses tell the BBC fresh details about the sophisticated operation they say exploited them for sex.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Billionaire investor warns of threat to US democracy",
        "description": "Ray Dalio says he thinks the probability of civil war in the US is \"low but cannot be dismissed\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "New beanless 'coffee' emerges but does it taste any good?",
        "description": "Start-ups launch drinks that look and taste like coffee but they say are better for the environment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "China raises retirement age for first time since 1950s",
        "description": "The plan, which will set in from January, has been on the cards for a few years as China's population ages.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "UK accounting giant PwC faces six-month China ban",
        "description": "The firm is being penalised for its role in the failure of property giant Evergrande.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Ex-Ticketmaster boss sentenced for hacking rival company CrowdSurge",
        "description": "British national Stephen Mead stole sensitive CrowdSurge data, contributing to the firm’s collapse.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Second-hand bedding a hit at St Andrews University",
        "description": "The recycled bedding has been distributed to new owners who have signed up to the scheme.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Jared Isaacman, the high-school dropout behind historic spacewalk",
        "description": "Jared Isaacman started his first company at age 16, and has long been passionate about flying.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "UK ban on rental bidding wars is on the way - but will it work?",
        "description": "Renter groups say the plans are a positive step but warn more action will be needed to tackle unaffordable rents.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "780,000 eligible pensioners to lose out on fuel payment - DWP",
        "description": "Pensioners aged 80 and over would take the biggest financial hit, a government analysis found",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "'Our winter fuel payment goes into the holiday kitty'",
        "description": "Some pensioners say they don't need the extra cash of up to £300 - and want better means testing.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Dangers for FOMO mortgage hunters as rates fall",
        "description": "Competition between lenders is intense ahead of the next interest rates decision from the Bank of England.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Titanic shipyard may run out of cash within weeks",
        "description": "Trade unions are calling for help to save hundreds of jobs at the historic shipbuilder Harland and & Wolff.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Census may have overestimated number of trans people in England and Wales",
        "description": "Language barriers may have seen some people mistakenly say they consider themselves to be trans.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "UK national debt forecast to treble over next 50 years",
        "description": "An ageing population, climate change and geopolitical tensions all add pressure to the public finances, a report says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Why do companies fire and rehire their workers?",
        "description": "Controversy surrounds companies which dismiss their workers and rehire them on worse contracts.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Union wins Tesco 'fire and rehire' battle",
        "description": "The row erupted when Tesco proposed firing staff at some distribution centres and rehiring them on lower pay.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "How are renting and eviction rules changing?",
        "description": "A new law will ban no-fault evictions, limit rent rises and help tenants with children or pets.",
        "source": "BBC Business",
        "fetched_date": "2024-09-16T07:22:48.615644"
    },
    {
        "title": "Why humpback whales are changing course",
        "description": "The first humpback whale to return to the North Pacific's Salish Sea in decades tells a new story about the global threat to whale populations.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The fisher folk reviving Finland's 'moonscape'",
        "description": "Finland's Linnunsuo wetland used to be a barren \"moonscape\". A local fishing community has transformed it into a biodiverse haven and an important carbon sink.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The town that should have burned, but didn't",
        "description": "In 2017, one of California's largest ever wildfires was steadily approaching Montecito. But it had long been preparing for just such an event.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Mystery tremors were from massive nine-day tsunami",
        "description": "Scientists launched an investigation after being baffled by seismic signals picked up across the world",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "'I wouldn't wish it on my worst enemy': The people who work inside the eye of a hurricane",
        "description": "As climate change makes hurricane systems more dangerous, the need to understand their inner workings is greater than ever.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "UK farming's 'net zero' climate target in doubt",
        "description": "Doubts are raised over UK farming's ability to reach \"net zero\" greenhouse gas emissions by 2040.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-16T07:22:48.681589"
    },
    {
        "title": "Trump’s Campaign Says He Is Safe After Apparent Assassination Attempt at His Florida Golf Club",
        "description": "Donald Trump’s campaign said the Republican presidential candidate was safe after gunshots were first reported in his vicinity Sunday afternoon in Florida, his campaign and the Secret Service said on Sunday. The U.S. Secret Service said it was investigating and that the incident occurred shortly before 2 p.m. “The former president is safe,” according to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Harris-Walz Campaign Responds to Trump’s “I Hate Taylor Swift” Comments With Singer’s Song Lyrics",
        "description": "The Harris-Walz campaign referenced 28 different Taylor Swift songs in a statement Sunday morning responding to Donald Trump’s “I Hate Taylor Swift” comments issued that same day. The statement, titled “Trump’s Bad Week (Taylor’s Version),” came in response to the former president’s Sunday morning Truth Social post, in which he wrote without context, “I HATE […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "How an Oscar Winner Made a Top-Secret Benjamin Netanyahu Movie Without Anyone Finding Out",
        "description": "From investigations into Wikileaks and Scientology, Elizabeth Holmes and the war in Afghanistan, Alex Gibney has made some of the defining documentaries of our time. So it makes sense he’d now turn his attention as a producer to one of the defining political figures of our time: long-serving Israel prime minister Benjamin Netanyahu. In The […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "John Legend Praises Taylor Swift for Being “Willing to Take That Risk” With Kamala Harris Endorsement",
        "description": "John Legend said he’s “always respected” Taylor Swift for being “willing to take that risk” in openly sharing her political views. The EGOT winner, who has been vocal about his support for Kamala Harris in the upcoming presidential election, recently told The Independent that he understands it’s more difficult for the pop superstar to speak out […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "‘Barbie’ Producer, ‘Supacell,’ ‘Wonka’ Among Production Guild of Great Britain Awards Winners",
        "description": "The Production Guild of Great Britain (PGGB) celebrated the likes of Warner Bros. film Wonka, Netflix series Supacell, and Barbie, Paddington and Harry Potter franchise producer David Heyman at its awards ceremony on Saturday night. Hosted by comedian, presenter and actor Patrick Kielty from Northern Ireland at The Grove Hotel in Watford, near London, Heyman […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Tommy Cash, Country Singer and Johnny Cash’s Brother, Dies at 84",
        "description": "Tommy Cash, a country singer and the younger brother of Johnny Cash, has died. He was 84. The news of Cash’s passing was confirmed on Saturday in a social media post by the Johnny Cash Museum in Nashville. “We are saddened to announce that the world lost a bright light last evening with the passing […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Anderson .Paak’s New Speakeasy, Andy’s, Is “Like My Home Studio … But With Bomb-A** Food”",
        "description": "Anderson .Paak, the Grammy-winning musician who’s also half of Silk Sonic with Bruno Mars, opens Andy’s on Sept. 25. It’s an intimate throwback live-music venue with a focus on R&B and jazz. His partners are his friends: seasoned L.A. nightlife impresarios Mark and Jonnie Houston, whose other industry-favored ventures include La Descarga, Break Room 86, No […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Perry Farrell Throws Punch at Dave Navarro During Jane’s Addiction Concert, Causing Show to Abruptly End",
        "description": "Jane’s Addiction’s Boston concert on Friday came to an abrupt end after singer Perry Farrell threw a punch at guitarist Dave Navarro seemingly out of nowhere while the reunited band was playing “Ocean Size.” Several social media users shared videos of the incident during the show, in which Farrell can be seen getting angry and […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Kelly Clarkson Confused by Beyoncé’s CMA Awards Snub: “I Feel Like Those Songs Were Everywhere”",
        "description": "Kelly Clarkson doesn’t understand why Beyoncé was snubbed by the 2024 CMA Awards, however, it’s something she can relate to. In a recent interview with NBC10 Boston, the Grammy-winning singer reacted to Beyoncé’s Cowboy Carter album not receiving any nominations at the 58th Annual CMA Awards, as well as opened up about her own challenges in the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Nicole Kidman Expresses Gratitude for “Outpouring of Love and Kindness” After Mother’s Death",
        "description": "Nicole Kidman is thanking fans and friends for their support as she continues to deal with the death of her mother, Janelle Ann Kidman. “My sister and I along with our family want to thank you for the outpouring of love and kindness we have felt this week,” the actress wrote on Instagram in a […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Francis Ford Coppola Says Donald Trump’s Comments About Pet-Eating Immigrants Are “So Outrageously Insulting”",
        "description": "Francis Ford Coppola is the latest celebrity to address Donald Trump’s debate comments accusing immigrants in Springfield, Ohio, of eating pets. “I really was infuriated during the debates, when Haitian people were disparaged,” the filmmaker wrote in a post shared on Instagram. “I feel Haitian people are among the most kind, generous, talented, wonderful I […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "Justin Timberlake Admits to Drunken Driving and Avoids Jail Time as Judge Accepts Plea Deal",
        "description": "Justin Timberlake admitted to driving under the influence of alcohol in a Long Island courtroom on Friday morning while appearing before a judge, who accepted his guilty plea as part of a deal that lessened his punishment and allowed the pop star to avoid any more jail time.  Though the actor and pop sensation initially […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-16T07:22:49.059686"
    },
    {
        "title": "AWS brings OpenSearch under the Linux Foundation umbrella",
        "description": "AWS today announced that it is transitioning OpenSearch, its open source fork of the popular Elasticsearch search and analytics engine, to the Linux Foundation with the launch of the very…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Insight Partners is closing in on a whopping $10B+ new fund",
        "description": "Insight Partners is reportedly on the cusp of on more than $10 billion in capital commitments for its 13th fund, per the FT.  The FT report notes that two of…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Port of Seattle shares ransomware attack details",
        "description": "The Port of Seattle released a statement Friday confirming that it was targeted by a ransomware attack. The attack occurred on August 24, with the Port (which also operates the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Flappy Bird’s creator disavows ‘official’ new version of the game",
        "description": "A decade after the wildly popular game Flappy Bird disappeared, an organization calling itself The Flappy Bird Foundation announced plans to “re-hatch the official Flappy Bird® game.” But this morning,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "DryMerge promises to connect apps that normally don’t talk to each other — and when it works, it’s great",
        "description": "Platforms to connect apps that wouldn’t normally talk to each other have been around for a minute (see: Zapier). But they have not gotten dramatically simpler to use if you’re…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Cohere co-founder Nick Frosst’s indie band, Good Kid, is almost as successful as his AI company",
        "description": "Nick Frosst, the co-founder of $5.5 billion Canadian AI startup Cohere, has been a musician his whole life. He told TechCrunch that once he started singing, he never shut up. That’s still true today. In addition to his full-time job at Cohere, Frosst is also the front man of Good…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "A walk through the crypto jungle at Korea Blockchain Week",
        "description": "Blockchain technology is all about decentralization and virtualization. So it’s a little ironic that humans love to come together in person at big blockchain events. Such was the case last…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "The LinkedIn games are fun, actually",
        "description": "I have a guilty pleasure, and it’s not that I just rewatched “Glee” in its entirety (yes, even the awful later seasons), or that I have read an ungodly amount…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "OpenAI could shake up its nonprofit structure next year",
        "description": "It’s looking increasingly likely that OpenAI will soon alter its complex corporate structure. Reports earlier this week suggested that the AI company was in talks to raise $6.5 billion at…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Every fusion startup that has raised over $300M",
        "description": "Fusion startups have raised $7.1 billion to date, with the majority of it going to a handful of companies.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "‘Hot Ones’ could add some heat to Netflix’s live lineup",
        "description": "Netflix has never quite cracked the talk show formula, but maybe it can borrow an existing hit from YouTube. According to Bloomberg, the streamer is in talks with BuzzFeed to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Why ORNG’s founder pivoted from college food ordering to real-time money transfer",
        "description": "Alex Parmley has been thinking about building his latest company, ORNG, since he was working on his last company, Phood.  Launched in 2018, Phood was a payments app that let…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Sam Bankman-Fried appeals conviction, criticizes judge’s ‘unbalanced’ decisions",
        "description": "Lawyers representing Sam Bankman-Fried, the FTX CEO and co-founder who was convicted of fraud and money laundering late last year, are seeking a new trial. Following crypto exchange FTX’s collapse,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "OpenAI previews its new Strawberry model",
        "description": "OpenAI this week unveiled a preview of OpenAI o1, also known as Strawberry. The company claims that o1 can more effectively reason through math and science, as well as fact-check…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "DeepWell DTx receives FDA clearance for its therapeutic video game developer tools",
        "description": "There’s something oddly refreshing about starting the day by solving the Wordle. According to DeepWell DTx, there’s a scientific explanation for why our brains might feel just a bit better…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "These two friends built a simple tool to transfer playlists between Apple Music and Spotify, and it works great",
        "description": "Soundiiz is a free third-party tool that builds portability tools through existing APIs and acts as a translator between the services.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "This is how bad China’s startup scene looks now",
        "description": "In early 2018, VC Mike Moritz wrote in the FT that “Silicon Valley would be wise to follow China’s lead,” noting the pace of work at tech companies was “furious”…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Fei-Fei Li’s World Labs comes out of stealth with $230M in funding",
        "description": "Fei-Fei Li, the Stanford professor many deem the “Godmother of AI,” has raised $230 million for her new startup, World Labs, from backers including Andreessen Horowitz, NEA, and Radical Ventures.…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Fintech Bolt is buying out the investor suing over Ryan Breslow’s $30M loan",
        "description": "Bolt says it has settled its long-standing lawsuit with its investor Activant Capital. One-click payments startup Bolt is settling the suit by buying out the investor’s stake “after which Activant…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Dave and Varo Bank execs are coming to TechCrunch Disrupt 2024",
        "description": "The rise of neobanks has been fascinating to witness, as a number of companies in recent years have grown from merely challenging traditional banks to being massive players in and…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-16T07:22:49.277385"
    },
    {
        "title": "Ricciardo ‘badly affected’ by bizarre issue",
        "description": "A frustrating weekend resulted in another poor GP finish for Daniel Ricciardo, who is still looking for answers to his troubles.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Injured Wallabies skipper targeting November return",
        "description": "Having tried to rush back from a shoulder injury without success, one-time Wallabies captain Liam Wright is now taking a steady approach to his recovery.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "‘It’s an OK pass’: NRL weighs in on controversial call",
        "description": "Roosters coach Trent Robinson blew up after losing a crucial try to a forward pass call last Friday and the NRL’s football boss has had his say on the ruling.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Update on teen in coma after footy match",
        "description": "The family of a 17-year-old footballer has given an update after the teen was flown to hospital when a local footy match turned violent.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Update on teen in coma after footy match",
        "description": "The family of a 17-year-old footballer has given an update after the teen was flown to hospital when a local footy match turned violent.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Cat returns with scars of horror injury",
        "description": "The 50 staples running across the top of his head at training on Monday showed just how severe Gary Rohan’s skull injury was.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "‘It’s an OK pass’: NRL weighs in on controversial call",
        "description": "Roosters coach Trent Robinson blew up after losing a crucial try to a forward pass call last Friday and the NRL’s football boss has had his say on the ruling.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Tedesco’s warning to JWH ahead of return",
        "description": "The Roosters were well beaten in the middle by Penrith, but the return of Jared Waerea-Hargreaves should fix that as long as he doesn’t lose his cool.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Aussies add firepower after T20 washout",
        "description": "Rain prevented Australia from winning the T20 series against England and the big-name reinforcements are arriving to make up for that in the ODO series.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "England level series, Short claims five in defeat",
        "description": "Liam Livingstone has steered England towards a three-wicket victory in the second T20I against Australia at Sophia Gardens to level the series. But there was an unexpected shining star with the ball  in defeat.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "New high for Aussie rising star",
        "description": "The first Australian to make a WTA 500 singles final since Ash Barty fell just short of victory but will walk away from Mexico with a special new title.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Aussies defy ‘ridiculous’ schedule for Davis Cup dream",
        "description": "The likely return of injured star Alex de Minaur will only bolster Australia’s Davis Cup bid after captain Lleyton Hewitt’s team made the finals without him.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Ricciardo ‘badly affected’ by bizarre issue",
        "description": "A frustrating weekend resulted in another poor GP finish for Daniel Ricciardo, who is still looking for answers to his troubles.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "‘Simply phenomenal’: Piastri stuns F1 world",
        "description": "Australian Oscar Piastri has claimed his second Formula 1 Grand Prix victory after the Azerbaijan Grand Prix ended in chaotic scenes.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Actor ‘killing’ himself over transformation",
        "description": "A hulking Hollywood actor has spoken out about the lengths he’s been going to in order to keep his new toned down look going.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Actor breaks silence on body transformation",
        "description": "A WWE legend turned Hollywood star has opened up on his transformation that left fans seriously concerned for his health.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Alleged double-killer breaks down in court",
        "description": "The man charged over the deaths of ice hockey star Johnny Gaudreau and his brother has burst into tears as a judge handed down a decision.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Burrow’s Bengals aim to bounce back against Chiefs",
        "description": "Joe Burrow and the Cincinnati Bengals are aiming to avoid a second NFL defeat this weekend, but in their way are Patrick Mahomes and the Chiefs.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Key pair closing in on Socceroos recall",
        "description": "Socceroos coach Graham Arnold is likely to have more selection options for next month’s games against China and Japan.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Brazilian star ready to shine in new strip",
        "description": "Sydney FC’s star signing Douglas Costa has promised to ‘deliver’ for the Sky Blues.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Champion stunned in one-sided UFC bout",
        "description": "“Suga” Sean O’Malley has suffered a devastating loss to Georgian Merab Dvalishvili in a one-sided contest at the Sphere in Las Vegas.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Scott’s bold plan to be like Tiger",
        "description": "After becoming Australia’s highest-ranked male golfer again aged 44, Adam Scott has a bold plan for one of the sport’s biggest tournaments.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "No Go Zone: Injuries, suspensions strike top SuperCoach stars",
        "description": "Reverse trades now! A host of popular SuperCoach players are either out or have question marks hanging over them for the start of the season.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Injured Wallabies skipper targeting November return",
        "description": "Having tried to rush back from a shoulder injury without success, one-time Wallabies captain Liam Wright is now taking a steady approach to his recovery.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Shock response to record Wallabies loss",
        "description": "A shellacking in Argentina for the Wallabies hasn’t resulted in mass changes for the next even more imposing challenge.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "Epsom weight not a Bridge too far for Celestial Legend",
        "description": "In a shock spring carnival program switch, Hall of Fame trainer Les Bridge is considering aiming Celestial Legend at the Group 1 $1.5 million Epsom Handicap.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-16T07:22:50.841617"
    }
]