[
    {
        "title": "Trump tariffs a 'major blow to world economy' says EU, as China vows retaliation",
        "description": "The US president announces a 10% tariff on all imports, with further measures targeting countries the White House call the \"worst offenders\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Musk's X is suing India, as Tesla and Starlink plan entry",
        "description": "X says a new government portal gives officials wide-ranging powers to issue blocking orders.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "'Not the act of a friend': Australia angry over Trump tariffs",
        "description": "The Prime Minister has described Trump's decision as \"unwarranted\" and \"not the act of a friend\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "UK to keep pushing for deal after Trump imposes 10% tariff",
        "description": "\"No one wants a trade war\" but \"nothing is off the table\", UK business secretary says.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Musk's X is suing India, as Tesla and Starlink plan entry",
        "description": "X says a new government portal gives officials wide-ranging powers to issue blocking orders.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Trump's tariffs on China, EU and more, at a glance",
        "description": "A 10% rate of import tax will apply globally - with higher rates for a list of Trump's \"worst offenders\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Trump to charge high tariffs on 'worst offenders' globally",
        "description": "The president says the US has been \"pillaged, raped and plundered\" for years by international trade partners.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "No additional US tariffs for Canada, but no relief either",
        "description": "One business leader says the world is now \"waking up to a reality that Canada has been living with for months.\"",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "The Finnish defence firms 'on steroids'",
        "description": "Helsinki has become one of the top five cities in Europe for investment in defence and security technologies.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "The Swedish city fined for missing an environmental target",
        "description": "Gothenburg has to pay a financial penalty if it misses certain annual sustainability goals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Six things that could get more expensive for Americans under Trump tariffs",
        "description": "Economists say the president's import taxes could result in higher prices for a range of products in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Tesla sales plunge after Elon Musk backlash",
        "description": "The car maker's sales slide has been attributed to competition and controversy around its boss.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Trump announces tariffs on NI and Irish goods",
        "description": "NI goods entering the US will face a 10% tariff, while those from the Republic will be hit with 20%.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Trade war should not be UK's first response to tariffs - PM",
        "description": "Sir Keir Starmer says he will rule nothing out as the government braces itself for new US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Heathrow warned by airlines about power supply days before shutdown",
        "description": "MPs hear the airport was warned about power supply resilience days before the disruptive closure.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Tariffs will 'drastically' impact global pharmaceutical supply",
        "description": "US President Donald Trump is expected to announce a new round of tariffs later on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Ex-Shell boss tasked with cleaning up Nigeria's oil sector",
        "description": "President Tinubu restructures the NNPC, a company which has long struggled with corruption allegations.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Trump-endorsed news channel sees shares surge 2,200%",
        "description": "Conservative US cable TV channel Newsmax started trading on the New York Stock Exchange on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Massive layoffs begin at top US health agency",
        "description": "Health Secretary Robert F Kennedy Jr announced last week that the health agency would cut 20,000 employees.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Harry charity engulfed by cash fears, insiders claim",
        "description": "Financial worries and fundraising rows inflamed boardroom battle that engulfed Sentebale, insiders claim.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Analysis: Jitters, uncertainty and hope as UK awaits Trump tariff decision",
        "description": "Talks are continuing between London and Washington at quite an intensity, our political editor writes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Top Australian universities close Chinese Confucius Institutes",
        "description": "Australia has ramped up scrutiny on the centres over fears China is using them to spread propaganda.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Car firms fined in UK for withholding recycling information",
        "description": "BMW, Ford, JLR, Peugeot Citroen, Mitsubishi, Nissan, Renault, Toyota, Vauxhall and Volkswagen have all been fined.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Hooters restaurant chain files for bankruptcy",
        "description": "Like many other casual dining chains, Hooters has struggled in recent years with rising costs and wages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Investigation launched into UK's statistics agency",
        "description": "The Office for National Statistics is under review after criticism about the reliability of its data.",
        "source": "BBC Business",
        "fetched_date": "2025-04-03T07:25:39.828771"
    },
    {
        "title": "Monument Records to Fold Eight Years After Revival",
        "description": "The record label's artists include Walker Hayes and Tigirlily Gold.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Inside Val Kilmer’s Little-Known Life as a Poet",
        "description": "Hollywood's homegrown star, known for leading man roles throughout his career, published a hard-to-find collection that now goes for $3,500.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Gavin Newsom’s Right Turn: Is Ex-Wife Kimberly Guilfoyle Behind the Wheel?",
        "description": "Plus, why Graydon Carter’s ghost writer should get a raise and Marvel’s extremely weird musical chair stunt breaks livestream records.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Morgan Wallen Selling ‘Get Me to God’s Country’ Merch Following ‘SNL’ Controversy",
        "description": "Days after the viral moment, the singer has listed T-shirts and trucker hats with the phrase for $45 on his website.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "The End of the Hollywood Kingmaker",
        "description": "The decline of Jeffrey Katzenberg, long the town’s chief political power broker, has left the industry’s Democratic elite without a leader, a plan or the clout they once wielded — just as Trump retakes Washington with vengeance on his mind.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Val Kilmer Died Before Planned Beverly Hills Film Fest Red Carpet Appearance",
        "description": "“It was a shock to find this out,\" festival founder Nino Simone said on Wednesday of Kilmer, who died of pneumonia at age 65.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "25th Hour: Why Cory Booker’s Speech Was the Screen Performance of the Year",
        "description": "The New Jersey senator's epic floor session drew many cues from Hollywood, and may teach it a few things too.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Neil Young Concerned Trump Will Bar Him From Returning to U.S. After European Tour",
        "description": "\"If the fact that I think Donald Trump is the worst president in the history of our great country could stop me from coming back, what does that say for freedom,\" Young wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Oliver Stone, Testifying Before Congress, Is Confused for Roger Stone by GOP Rep. Lauren Boebert",
        "description": "The director behind the controversial 1991 political thriller 'JFK' was appearing before the House Oversight and Government Reform Committee’s Task Force on the Declassification of Federal Secrets.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Wet Leg Announce ‘Moisturizer,’ First Album in Three Years",
        "description": "The band also released the album's lead single \"Catch These Fists.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Gene and Betsy Hackman’s Estate Wins Partial Victory in Footage and Death Records Court Ruling",
        "description": "A mixed ruling handed down on Monday afternoon stipulates that images of the very private couple’s partially decomposing bodies will not be released.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "Kid Rock Says Meeting He Brokered With President Trump and Bill Maher ‘Could Not Have Been Better’",
        "description": "The rocker told 'Fox & Friends' all about the success of the White House meeting he orchestrated between the onetime foes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-03T07:25:40.702976"
    },
    {
        "title": "‘RIP champ’: Netflix star dead at 44",
        "description": "Vittorio Pirbazari, a Netflix star and bodybuilder who was recovering from surgery, collapsed and died after running on a treadmill.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Montemurro backed to coach Matildas",
        "description": "The search continues for a permanent Matildas coach as the AFC Women’s Asian Cup fast approaches.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘Ashamed’: Star breaks silence on saga",
        "description": "West Coast Eagles captain Oscar Allen has spoken out for the first time after he was caught having a meeting with a rival coach.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘Ashamed’: Allen’s big admission",
        "description": "West Coast co-captain Oscar Allen has addressed his meeting with Hawthorn coach Sam Mitchell, saying he was “embarrassed and ashamed”.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘My lifelong dream’: Atkinson opens up on Sharks exit",
        "description": "As he prepares to take on the Raiders, Sharks star Daniel Atkinson has opened up on his decision to leave the club, and the vow he made to his Cronulla teammates.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Fresh twist in Allianz Stadium tug of war",
        "description": "As the Rabbitohs fight to have home matches moved to Allianz Stadium next year, Trent Robinson reminded footy fans that the state-of-the-art venue is the true home of only one NRL club.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "AFL Now: Roos’ draft gamble set to be unleashed",
        "description": "The Kangaroos raised eyebrows late in the first round of last year’s draft, gambling with their pick this year to grab Matt Whitlock. Now, the youngster will get the chance to impress.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘It’s a business after all’: AFL great’s TDK warning for Blues",
        "description": "The battle for Tom De Koning’s signature is well and truly on, but one AFL great is urging Carlton to be wary of the ruckman’s price tag, suggesting they could use the money for other needs.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Warne medical report uncovers third drug",
        "description": "The medical report of Shane Warne’s death has come to light for the first time, revealing the truth behind claims made about his final hours.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Sam Konstas move could seal fate of veteran",
        "description": "Cricket Australia’s move could come at a cost for Marnus Labuschagne , with Sam Konstas viewed as Australia’s Test future.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Fan’s conspiracy theory divides tennis world",
        "description": "A British tennis star had to be helped from the court after collapsing midgame in scary scenes, but not everyone was convinced.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "New Aussie breaks silence on defection",
        "description": "Daria Kasatkina has opened up about the defection call she “had to make” and why it simply had to be Australia.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘On the line’: NRL pest faces ‘tricky’ dilemma",
        "description": "A former footy niggler has given the NRL’s biggest pest some advice after the Bulldogs firebrand came under scrutiny for his antics.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Piastri contract clause changes everything",
        "description": "Oscar Piastri’s battle with Lando Norris will decide the F1 championship, and a detail in the Aussie’s contract proves the shackles are off.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "What must happen for Perez to consider Formula 1 return",
        "description": "He was unceremoniously sacked by Red Bull at the end of 2024, leaving him without a seat, but Sergio Perez says he has been approached by “a few” teams about a return to Formula 1.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘He’ll be disappointed’: Praise for benched half",
        "description": "Queensland captain Tate McDermott is relishing the battle for the Reds’ starting halfback role with Kalani Thomas.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Ex-Wallaby’s massive NFL deal",
        "description": "Former Wallaby Jordan Petaia has been signed by the Los Angeles Chargers as he pursues his NFL dream.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "NBA ‘Bad Boy’ team goes rogue in wild fight",
        "description": "Seven players were ejected after a wild NBA brawl broke out featuring a team that is quickly earning a feisty reputation.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Coach axing leaves NBA world in shock",
        "description": "An NBA championship contender has left fans in disbelief after sacking their head coach only weeks out from the playoffs starting.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Montemurro backed to coach Matildas",
        "description": "The search continues for a permanent Matildas coach as the AFC Women’s Asian Cup fast approaches.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Bombshell rumour shakes up Matildas",
        "description": "A legendary Socceroos player is in the mix to take the Matildas into a new era as the search for a new team leader ramps up.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Assassination fears halt Aussie MMA event",
        "description": "A mixed martial arts event has been canned amid fears a high-profile former UFC fighter may be the target of a gangland hit.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "‘Fanboying’: Lee’s friendship with pop icon",
        "description": "Min Woo Lee isn’t short of support from big names in sport and music as he prepares for next week’s Masters at Augusta.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Odd reason star deliberately scored own goal",
        "description": "Basketball star Marie Pardon has incredibly nailed a buzzer beater … only problem was it was for the wrong team.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Sapphire Coast tips: Cholante to shine for new stable",
        "description": "Choisir daughter Cholate has trialled exceedingly well ahead of her return to racing at the Sapphire Coast which marks her first run for new trainer Scott Collings. BEST BETS, INSIDE MAIL",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    },
    {
        "title": "Spiranac lifts lid on ‘sexual favour’ rumours",
        "description": "Golfer and social media sensation Paige Spiranac has spoken out over rumours that plagued her in the early stages of her career.",
        "source": "News AU",
        "fetched_date": "2025-04-03T07:25:42.722504"
    }
]