[
    {
        "title": "China and Canada retaliate as Trump tariffs take effect",
        "description": "Fears of a trade war loom as Trump tariffs spark retaliatory action from two of the US's biggest trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Trump's tariffs risk economic turbulence - and voter backlash",
        "description": "Trump is making a high-stakes bet that could either reap major political dividends, or seriously undercut his second term.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Ban on India's stock market 'She-Wolf' puts regulators on the spot",
        "description": "India's market regulator recently banned a dozen financial influencers from giving trading advice.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Ex-Barclays boss with Epstein links seeks to clear name",
        "description": "Jes Staley wants to overturn a decision by the UK regulator banning him from holding a senior role in the City.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Trump's tariffs risk economic turbulence - and voter backlash",
        "description": "Trump is making a high-stakes bet that could either reap major political dividends, or seriously undercut his second term.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Markets sink as Trump confirms tariffs on Canada, Mexico and China",
        "description": "The US president has repeatedly threatened to tax imports from two of the country's closest neighbours.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Six things that could get more expensive for Americans under Trump tariffs",
        "description": "Economists warn that new tariffs on Canadian and Mexican goods could push up prices on a wide range of products.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Bubble tea chain bigger than Starbucks sees shares jump on debut",
        "description": "Mixue's shares rose by more than 40% in their Hong Kong Stock Exchange debut.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "What we know about US-Ukraine minerals deal",
        "description": "The White House said the deal, which would give the US access to mineral deposits, was not signed on Friday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Analysis: Any Starmer deal with Trump is all about avoiding tariffs",
        "description": "A deal to avoid further trade barriers appears very much on the cards, but challenges remain.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Diversity backlash: Is 'masculine energy' coming to the UK?",
        "description": "Donald Trump has scrapped federal diversity initiatives and many US firms have too - will UK companies follow suit?",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Switzerland targets rich tourists but at what cost?",
        "description": "Switzerland's already upmarket tourism sector is trying to attract more high rollers.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Crypto prices rally after Trump backs five coins for 'crypto reserve'",
        "description": "Trump named five cryptocurrencies he wanted in a potential national reserve so the US could become \"the Crypto Capital of the World\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "In the US, DEI is under attack. But under a different name, it might live on",
        "description": "Donald Trump has promised to \"terminate\" diversity programmes. But a rebrand might yet save them.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-04T07:24:49.423935"
    },
    {
        "title": "Tate McRae Earns First U.S. No. 1 Album With ‘So Close to What’",
        "description": "The 21-year-old pop star is also preparing to head to out on a massive 82-date world tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "3.9-Magnitude Earthquake Shakes L.A. on Hollywood’s Biggest Night",
        "description": "The 2025 Oscars wrapped just hours before the quake hit North Hollywood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Chappell Roan Duets With Elton John on ‘Pink Pony Club’ for Electric Oscar Party Performance",
        "description": "The 27-year-old breakout, aka the Midwest Princess, is expected to do a 45-minute set inside the starry fundraiser co-hosted by Jean Smart, Sheryl Lee Ralph, Neil Patrick Harris and David Burtka.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Oscars Goes Light on Politics Despite Heated Climate Amid Trump’s Second Term",
        "description": "Conan O’Brien, Adrien Brody and Daryl Hannah were among the few people to make politically centered remarks through the 2025 awards ceremony on Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Hulu’s Oscars Livestream Glitches Out as Ceremony Begins, Then Cuts Off Best Actress and Best Picture Winners",
        "description": "Complaints came in quickly as the streamer's much-touted first year sharing the broadcast went haywire for many subscribers; the company said to update its app.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "BBC Gaza Doc Fallout Continues as Former Chief Accuses Corp of Being “Manipulated by Terrorists”",
        "description": "Ex-BBC1 controller Danny Cohen called on U.K. culture secretary Lisa Nandy to ensure \"wider systemic issues of anti-Israel bias\" are explored at the BBC.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Joey Molland, Last Living Core Member of Badfinger, Dies at 77",
        "description": "Molland kept performing into his later decades after the death of several key bandmates.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Ingrid Andress Makes Surprise Return Following Controversial National Anthem Performance",
        "description": "The Grammy-nominated artist performed \"The Star-Spangled Banner\" again, this time at the Colorado Avalanche hockey game.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Inside the 2025 Brit Awards: Sabrina Carpenter Shocks, Millie Bobby Brown Gushes, Tender Liam Payne Tribute Leaves Arena Still",
        "description": "Charli XCX owned the night with five wins, but host Jack Whitehall was pulling no punches as the U.K.'s biggest music awards show kicked off Saturday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Former Gov. Andrew Cuomo Launches Political Comeback With a Run for New York City Mayor",
        "description": "Cuomo previously faced a barrage of sexual harassment accusations, which he has denied.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Angie Stone, Grammy-Nominated R&B Singer, Dies in Car Crash at 63",
        "description": "Stone was a member of the all-female hip-hop trio The Sequence.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "Brat Brit Awards 2025: Charli XCX Wins Four, Chappell Roan Gets Two Honors",
        "description": "The ceremony at London's O2 Arena, hosted by Jack Whitehall, also featured a special tribute video to Liam Payne.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-04T07:24:49.708728"
    },
    {
        "title": "NRL relocates game in more cyclone drama",
        "description": "After the AFL cancelled Friday’s game in Brisbane, the NRL has followed suit and relocated the round 1 match at Suncorp Stadium.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Connolly set as Smith declares Australia ready for Indian spinners",
        "description": "Australia has rushed breakout BBL star Cooper Connolly into the XI for the Champions Trophy semi final against India in Dubai, where skipper Steve Smith expects spin to be crucial.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "NBA star in tears, stuns with courageous act",
        "description": "The Dallas Mavericks’ nightmare season has gone from bad to worse after Kyrie Irving went down with what could be a serious injury.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "NRL club rocked by star’s round 1 omission",
        "description": "The NRL Round 1 teams have been named and some big guns are set to play their first games of the year, but one club is in early strife.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "NRL relocates game in more cyclone drama",
        "description": "After the AFL cancelled Friday’s game in Brisbane, the NRL has followed suit and relocated the round 1 match at Suncorp Stadium.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "NRL club rocked by star’s round 1 omission",
        "description": "The NRL Round 1 teams have been named and some big guns are set to play their first games of the year, but one club is in early strife.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Door accident adds to opening round injury list",
        "description": "An accident with a door has cost a goalkicking star his spot in the AFL’s opening round which is down on matches and starpower.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Cyclone forces AFL to abandon matches",
        "description": "The AFL’s Opening Round in Queensland is in disarray with the league being forced to postpone two games as a Tropical Cyclone looms.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Connolly set as Smith declares Australia ready for Indian spinners",
        "description": "Australia has rushed breakout BBL star Cooper Connolly into the XI for the Champions Trophy semi final against India in Dubai, where skipper Steve Smith expects spin to be crucial.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Cricket great slams Albo’s beer tax freeze",
        "description": "Australian cricket legend David Warner has laid into Anthony Albanese after the PM promised to put a stop to soaring beer prices.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Aussie surge nets five-year first",
        "description": "A rankings breakthrough by a teenage tennis star has set a five-year benchmark for Australia ahead of a big teams event.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Cruz Hewitt claims first professional trophy",
        "description": "Cruz Hewitt has taken a massive step in replicating his famous father Lleyton with a rare feat as a 16-year-old on the professional tennis circuit.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Joey’s Broncos prediction should frighten NRL",
        "description": "NRL legends have made a bold prediction about the Broncos’ chances this season that should send a shiver through their rivals.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Russell edges Verstappen to post fastest testing time",
        "description": "George Russell struck late on the third and final day of Formula One pre-season testing as he edged four-time reigning world champion Max Verstappen to post Friday’s fastest time.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "‘Unique and cherished’: Aus GP lifts ban on post-race tradition",
        "description": "Fans at the Australian Grand Prix will be allowed to storm the track after this year’s race following the lifting of a ban thanks to unruly behaviour in 2023.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Revenge is sweet for the Queensland Reds",
        "description": "Almost 12 months after losing to the Western Force in Perth, the Queensland Reds have returned fire, claiming a hard-fought win in the dying moments in Super Rugby.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Reds recruit to add ‘different dimension’",
        "description": "An injury to Jock Campbell has given a New Zealand recruit the chance to shine at fullback for the Queensland Reds.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "NBA star in tears, stuns with courageous act",
        "description": "The Dallas Mavericks’ nightmare season has gone from bad to worse after Kyrie Irving went down with what could be a serious injury.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Socceroo makes timely return",
        "description": "While it’s good news for one Socceroo, another has been sidelined for the rest of the season with an ankle injury.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Blueprint for Aussie success in Asia",
        "description": "The Young Socceroos’ AFC Under-20 Asian Cup success came on the back of meticulous planning from coach Trevor Morgan and his staff.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "‘Worst call I’ve seen’: Boxing in disbelief",
        "description": "Boxing controversy has erupted after superstar Gervonta ‘Tank’ Davis was seemingly granted preferential treatment in his world title fight.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "‘Unprecedented’: Golf makes call AFL won’t",
        "description": "As football codes stall on calling off games with a cyclone approaching the Queensland coast, golf officials have made a decision on a major event.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "NBA star in tears, stuns with courageous act",
        "description": "The Dallas Mavericks’ nightmare season has gone from bad to worse after Kyrie Irving went down with what could be a serious injury.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Warwick Farm preview: Ford Threatening to claim a double",
        "description": "The formidable pairing of Jay Ford and Joe Pride can claim a winning double at Warwick Farm as they edge closer to a record achievement.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Legend’s daughter’s big news after break-up",
        "description": "The daughter of a football icon has announced big personal news after her split from disgraced NRL player Brett Finch.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    },
    {
        "title": "Teen crushed to death in horror gym accident",
        "description": "Graphic Warning: Gym goers have been left shaken after a teenager was crushed to death in a shocking weightlifting accident.",
        "source": "News AU",
        "fetched_date": "2025-03-04T07:24:51.138695"
    }
]