[
    {
        "title": "US government struggles to rehire nuclear safety staff it laid off days ago",
        "description": "It is having problems contacting people who were fired in Trump's blitz to shrink the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Mapping China's influence around the Panama Canal",
        "description": "A close-up look at Chinese projects that worry the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "What it means when Elon Musk brings his children to work",
        "description": "You'll sometimes see one of his children on his shoulders as billionaire Elon Musk makes public appearances.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Why don't Europeans buy more American cars?",
        "description": "Trump wants US vehicles to be more popular in Europe, but it's a difficult market for them to crack.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Mapping China's influence around the Panama Canal",
        "description": "A close-up look at Chinese projects that worry the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Scattered anti-Musk protests target Tesla dealerships",
        "description": "Protesters organized small #TeslaTakeover demonstrations on BlueSky, the rival to Musk's platform X.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Plans to protect UK steel industry amid threat of tariffs",
        "description": "US President Donald Trump is set to impose 25% taxes on steel entering America \"without exceptions\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "'This battle is my 9 to 5 - I won't stop until I have my £620m of Bitcoin back'",
        "description": "James Howells claimed his ex-girlfriend threw out the hard drive, today worth £620m, in 2013.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "What we've learned about Rachel Reeves's expenses - and the Labour response",
        "description": "Senior figures defended the chancellor after we revealed her expenses were investigated before she was an MP.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Is Trump right when he says the US faces unfair trade?",
        "description": "He wants to hit back at countries that place import taxes on American goods that he thinks are too high.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Too quiet on set? Hollywood pushes for more LA productions post wildfires",
        "description": "January's wildfires have exacerbated the decline of Hollywood's once booming film and television industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Five key takeaways from Modi-Trump talks",
        "description": "Modi and Trump rekindle ties amid a global trade war, balancing tariffs, trade deals and strategic interests.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Why Muslims in India are opposing changes to a property law",
        "description": "Muslim groups say the changes are politically motivated but the government says it is responding to demands for reform.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Uber and Bolt drivers strike on Valentine's Day",
        "description": "Thousands of drivers are taking part in the strike action over pay and working conditions, a union says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "US politicians furious at UK demand for encrypted Apple data",
        "description": "They say the US should re-evaluate its cyber-security partnership with the UK unless the \"dangerous\" request is withdrawn.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Trump tariff VAT threat raises fears of hit to UK",
        "description": "The surprise inclusion of VAT to calculate tariffs prompts questions over the possible impact on British businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "TikTok returns to Apple and Google app stores in the US",
        "description": "TikTok is again available on app stores in the US after President Donald Trump delayed a ban on the app.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "More migrant workers claim UK farm exploitation",
        "description": "The UK government says it always takes \"decisive action\" where abusive practices are found on farms.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Beyoncé ticket sale runs smoothly, to fans' surprise",
        "description": "Tickets for Beyoncé's latest UK dates go on general sale on Friday, with prices reaching up to £950.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Trump launches plan to target countries with new tariffs",
        "description": "The US president ordered his staff to develop a response to countries with trade policies he says are unfair.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "UK signals it will seek US steel tariff exemption",
        "description": "Business secretary Jonathan Reynolds says the government has a strong case to avoid tariffs on UK-made steel entering the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Jeff Bezos space firm Blue Origin to cut a tenth of jobs",
        "description": "The company is looking to trim manager ranks and focus on ramping up rocket launches.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Honda-Nissan multi-billion dollar merger collapses",
        "description": "The Japanese car making giants aimed to combine their businesses to compete against Chinese rivals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Trump moves to close entries to government worker buyout programme",
        "description": "About 75,000 government employees have reportedly opted into the programme, which is designed to shrink the workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Igloo recalls coolers over finger amputations and injuries",
        "description": "People have reported other injuries including finger lacerations and bone fractures from using the product.",
        "source": "BBC Business",
        "fetched_date": "2025-02-16T07:22:50.138826"
    },
    {
        "title": "Sheryl Crow Says “So Long Tesla,” Donates Money to NPR: “Under Threat By President Musk”",
        "description": "The Grammy-winning singer sold her Elon Musk-manufactured Tesla because she's no longer \"willing to align\" herself with the billionaire following his move into the Trump administration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Murdoch Family Drama Details Emerge After Nevada Trial Ruling Over Fate of Empire",
        "description": "The Roy clan of HBO's 'Succession' has nothin' on the bitter and deep divides in the Murdoch family, as is revealed this week in an Atlantic Magazine feature.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Blink-182 Reunite With Former Guitarist Matt Skiba at L.A. Fire Relief Concert",
        "description": "The band performed a sold-out show at the Hollywood Palladium, with proceeds benefiting those impacted by the recent Los Angeles wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Jay-Z and Sean “Diddy” Combs Rape Lawsuit Dropped",
        "description": "Tony Buzbee, a lawyer for the Jane Doe accuser who's filed several lawsuits on behalf of accusers advancing sexual assault allegations against Combs, moved to voluntarily dismiss the lawsuit.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Selena Gomez Says She Couldn’t “Have Accepted” Her Relationship With Benny Blanco 10 Years Ago",
        "description": "The couple's joint album 'Said I Love You First' will drop on March 21.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Ari Emanuel Explains Why He Believes Blake Lively Instead of Justin Baldoni",
        "description": "The Endeavor CEO on why he's \"ride or die\" for Lively and Ryan Reynolds in their legal battle with the 'It Ends With Us' director.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "JonasCon: Jonas Brothers Celebrate 20 Years With One-Day Fan Event",
        "description": "The trio of brothers are heading to their home state of New Jersey for a free fan experience with live performances, Q&A panels, DJ sets and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Will Smith to Perform New Single “First Love” on Univision Awards Show ‘Premio Lo Nuestro’ (Exclusive)",
        "description": "This will mark the Grammy winner's first performance in the history of the show and the TV debut of the new track.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Selena Gomez Announces New Album With Fiancé Benny Blanco",
        "description": "'I Said I Love You First' is out next month. The couple released a single, \"Scared of Loving You,\" as part of the announcement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Couture-Clad Lady Gaga Fights Back Tears Eating Spicy Wings on ‘Hot Ones’ With Sean Evans",
        "description": "The superstar singer tried her best to keep a poker face, but when the heat level progressed to Da Bomb hot sauce, she fought back tears and quipped, \"Is this safe?\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Mandy Moore Looks Back on L.A. Fires Evacuations, Amazon Apologizes for Delivering a Package to Her In-Laws’ Lost Home",
        "description": "\"Do better, Amazon,\" the actress shared to her Instagram Story.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Kanye West Video Creator Defends Showing AI Celebrities Without Permission",
        "description": "In a new interview, Guy Bar attempted to justify his celebrity-filled stunt, and noted, \"I wish they would share it and say, 'We agree'.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-16T07:22:50.831965"
    },
    {
        "title": "Eels star apologises for inappropriate act",
        "description": "A Parramatta Eels star has issued a personal apology to a reporter after a crude sideline act sparked fierce backlash.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘Crazy’: Five-year LIV deal shocks Smith",
        "description": "After taking big bucks to move to LIV and copping criticism for it Cam Smith says the new Adelaide deal means a lot.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘What an idiot’: Star pours fuel on F1 feud",
        "description": "McLaren’s Lando Norris has poured fuel all over his feud with Max Verstappen as he prepares to dethrone the F1 champ in 2025.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Phoenix keep NBL title dream alive with stunning comeback",
        "description": "South East Melbourne Phoenix has surged into the NBL’s final four after a stunning second half comeback powered by import Matt Hurt. Here’s how they set up a date with the Illawarra Hawks.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Cricket Australia has failed Aussie star",
        "description": "A former Test bowler has put the onus on Cricket Australia after Matt Kuhnemann was cited for a suspect action in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘Will pass’: More support for reported Aussie spinner",
        "description": "Days of testing will determine if breakout spin star Matt Kuhnemann’s action is suspect and his captain says it won’t be an issue.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘Corrupt’: World loses it over Sinner detail",
        "description": "Two words have left the tennis world staggered as Jannik Sinner’s doping saga turns into “one of the biggest scandals in the history of sport”.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Kyrgios erupts over world No. 1’s doping ban",
        "description": "Australian tennis star Nick Kyrgios has unleashed on social media after learning of Jannik Sinner’s bombshell three-month doping ban.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘F***wit: Channel 7 rolls dice with TV rivals",
        "description": "Channel 7 is weeks away from pressing the button on its AFL transformation — and extraordinary details are leaking out.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Coach’s ‘vanilla’ admission rocks AFL",
        "description": "Fremantle coach Justin Longmuir has casually dropped an eyebrow-raising admission about his team’s fake performance in Saturday’s All Star game.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Eels star apologises for inappropriate act",
        "description": "A Parramatta Eels star has issued a personal apology to a reporter after a crude sideline act sparked fierce backlash.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Souths investigated after medical emergency",
        "description": "The South Sydney Rabbitohs are reportedly facing sanctions as the NRL scrutinises a 100-minute pre-season game delay.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘Getting fired anyway’: Shaq goes rogue",
        "description": "The basketball legend yelled “we’re getting fired anyway” as he stunned onlookers with a wild rant on a live NBA broadcast.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "$178m NFL trainwreck ends, reason revealed",
        "description": "Aaron Rodgers’ divorce from the New York Jets has gotten messier with the team explaining why the quarterback was cut.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Newcastle cause massive upset in City of Churches",
        "description": "Newcastle Jets stunned A-League Premier’s Plate hopefuls Adelaide United at Coopers Stadium on Saturday night.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Arsenal close gap as City find ominous touch before Reds clash",
        "description": "PL WRAP: Arsenal has cut the gap on Liverpool to four points after a dramatic win over Leicester City, while Manchester City made light work of Newcastle.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Racist scandal overshadows title fight",
        "description": "An American boxer has become a champion of the world in the wake of an ugly racist scandal that overshadowed the title fight.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Schumacher wife upset over prison sentence",
        "description": "Sentences have been handed down and new details have emerged about the plot to blackmail the family of Formula 1 legend Michael Schumacher.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Phoenix keep NBL title dream alive with stunning comeback",
        "description": "South East Melbourne Phoenix has surged into the NBL’s final four after a stunning second half comeback powered by import Matt Hurt. Here’s how they set up a date with the Illawarra Hawks.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘Crazy’: Five-year LIV deal shocks Smith",
        "description": "After taking big bucks to move to LIV and copping criticism for it Cam Smith says the new Adelaide deal means a lot.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Fangirl shows she’s still got it with second Apollo win",
        "description": "It was billed as a clash between Via Sistina and Ceolwulf but Fangirl had other ideas as she stormed home to make it back-to-back wins in the Group 2 Apollo Stakes at Randwick.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Reds star staying patient in comeback bid",
        "description": "With a ‘weird’ 2024 behind him, Queensland Reds co-captain Liam Wright is eager to return from a shoulder injury that has sidelined him since July.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Suaalii turns heads in crazy debut",
        "description": "Joseph Suaalii stole the show in his Super Rugby debut with an instant impact on the Waratahs, as they clinched a last-gasp win over the Highlanders.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "‘Tacky’: Reality Taylor Swift can’t escape",
        "description": "Taylor Swift might be one of the most famous and liked women in the world but there’s a wild reality even she can’t escape.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-16T07:22:52.187484"
    }
]