[
    {
        "title": "7-Eleven owner rejects $38bn buyout offer",
        "description": "Japanese owner of convenience store giant says offer from Canadian rival ‘grossly undervalues’ firm.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Telegram CEO Durov says his arrest 'misguided'",
        "description": "Pavel Durov has hit back at French authorities following his arrest in Paris last week.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Why this US jobs report matters and what to watch",
        "description": "The report is a key gauge of the US economy - a top issue in the presidential election.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Trump says Musk could head 'government efficiency' force",
        "description": "In a speech at an economic club Thursday, the former president endorsed the Tesla boss's idea for a task force on government spending",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "'I worked two jobs at university to survive'",
        "description": "BBC Scotland speaks to two care-experienced students about their time at university.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Telegram CEO Durov says his arrest 'misguided'",
        "description": "Pavel Durov has hit back at French authorities following his arrest in Paris last week.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "A mega merger aims to reshape India's entertainment landscape",
        "description": "The deal aims to create India's largest entertainment company which will dominate the advertising market.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Crash dummies and robot arms: How airline seats are tested",
        "description": "Building hi-tech airline seats has become a huge business in Northern Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Why protecting Australia's surf beaches is good for the economy",
        "description": "Surfing is estimated to be worth billions of dollars to the country's economy.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Why this US jobs report matters and what to watch",
        "description": "The report is a key gauge of the US economy - a top issue in the presidential election.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "YouTube restricts teenager access to fitness videos",
        "description": "The platform says it is acting on concerns about teens being over-exposed to \"idealised\" body types.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Volvo gives up plan to sell only EVs by 2030",
        "description": "The car maker's decision comes as industry faces slowing demand in some major markets for electric vehicles.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Hunter Biden makes last-minute guilty plea in tax case",
        "description": "The plea spares the US president's son a trial and keeps his friends and family from having to testify.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "UK competition watchdog launches Oasis tickets probe",
        "description": "The Competition and Markets Authority is investigating if Ticketmaster breached consumer protection law.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Fast fashion drove Bangladesh - now its troubled economy needs more",
        "description": "The once booming garment industry faces an uncertain future amid political unrest and slowing demand.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Sell-off erases Trump Media shares' 2024 gains",
        "description": "Shares in Trump Media are now worth less than they were at the start of the year.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "UK house prices hit two-year high",
        "description": "The recent rate cut has boosted confidence among homebuyers, the UK's largest mortgage lender says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Towie star says sorting pension is a top priority",
        "description": "Gemma Collins says saving for retirement is important as she does not want to be \"hustling forever\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Second class letter deliveries on Saturdays could be cut",
        "description": "Changes to second class deliveries could be allowed to keep the first class service unchanged.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "John Lewis brings back 'never knowingly undersold'",
        "description": "The U-turn comes as the High Street retailer tries to revive its fortunes and win back customers.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Rise in fines for term-time holidays won't stop us, say parents",
        "description": "Some say the threat of prosecution is not enough to stop them going on holiday for cheaper prices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Alert over potentially deadly counterfeit vodka in UK",
        "description": "The Food Standards Agency warns counterfeit bottles have been found to contain a dangerous substance.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Mablethorpe permanent banking hub confirmed",
        "description": "Customers of all major banks will be able to carry out regular cash transactions on weekdays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Nvidia plunges almost 10% as global markets fall",
        "description": "The artificial intelligence chip giant saw $279bn wiped off its stock market value in New York.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "Biggest UK housing firm to build fewer homes",
        "description": "The house building giant built 18% fewer homes last year as profits tumbled.",
        "source": "BBC Business",
        "fetched_date": "2024-09-06T07:21:42.425373"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "'Why I cycled 1,500km to avoid a flight'",
        "description": "Looking for alternatives to flying, Matilda Welin decided to embark on a long-distance cycle from London to Sweden. Here's what she learned.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "The flawed way we rank hurricanes",
        "description": "Scientists are racing to update the imperfect system we rely on to warn just how deadly a storm will be.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-06T07:21:42.502108"
    },
    {
        "title": "Michael Keaton Hints He’s Ready to Change His Name Professionally",
        "description": "Michael Keaton may be changing his name, professionally. The actor, who was born as Michael Douglas, wasn’t able to use his birth name when he began his career as the Screen Actors Guild disallows its members from using the same name professionally as other actors. Since both Michael Douglas and Mike Douglas were taken, he […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Obama Praises Charli XCX’s ‘brat’: “She Knows What She’s Doing”",
        "description": "Former President Obama praised Charli XCX’s brat this week, the newest in a long line of politicians becoming part of the pop album’s legacy this summer. Obama included “365,” the final track of brat, on his annual summer playlist earlier this month. “It is a great album,” the former president said on the I’ve Had […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Rich Homie Quan, “Type of Way” Rapper, Dies at 34: Report",
        "description": "Rich Homie Quan — born Dequantes Lamar — reportedly died Thursday (Sept. 5) at 34 years old. The cause of the Atlanta rapper’s death remains unknown. TMZ first confirmed the news, citing family and the Fulton County Morgue, and Rolling Stone confirmed with a family member. Billboard has reached out to Quan’s manager and the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Melissa McCarthy, Clive Owen to Star in ‘JonBenet Ramsey’ Limited Series at Paramount+",
        "description": "A pair of Oscar nominees will lead a limited series about the murder of JonBenét Ramsey. Melissa McCarthy and Clive Owen will star in the drama, currently titled JonBenét Ramsey, which has scored a series order at Paramount+. The series comes from Yellowstone producers MTV Entertainment Studios and 101 Studios and showrunner Richard LaGravenese (Behind […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Harvey Weinstein Indecent Assault Charges in U.K. Dropped: “Unrealistic Prospect of Conviction”",
        "description": "Disgraced Hollywood mogul Harvey Weinstein has had two charges of indecent assault against him dropped by the U.K.‘s Crown Prosecution Service (CPS). In June 2022, the CPS authorized the charges against Weinstein for alleged offenses against a woman (now in her mid-50s) in 1996, according to the Metropolitan Police. On Thursday, it was confirmed that […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "DOJ Investigation Alleges Russia Sent $10M to U.S. Media Company",
        "description": "The Department of Justice announced charges Wednesday against two Russian state media employees for funneling $10 million to an unidentified media company in the United States. The criminal case names two defendants, Kostiantyn Kalashnikov and Elena Afanasyeva, both charged with conspiracy to commit money laundering and violating the Foreign Agents Registration Act. Their scheme was […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Travis Kelce Says Taylor Swift Is Drafting Up Plays for Him: “She’s a Little Biased”",
        "description": "Travis Kelce and Taylor Swift are always looking to support each other in their careers and that includes the pop star drawing up football plays for her boyfriend. During a recent appearance on The Rich Eisen Show, the Kansas City Chiefs tight end shared how Swift has been especially interested in learning more about the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Documentary Crew Uses Venice Red Carpet to Spotlight Ukrainian Prisoners of War",
        "description": "A film crew took advantage of the Venice Film Festival spotlight Wednesday and wore clothing on its prestigious red carpet embroidered with the distances from the Lido to various locations where Russians are holding Ukrainian prisoners. Their documentary Songs of Slow Burning Earth, directed by Olha Zhurba, celebrated its world premiere in the Out of […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "‘Masters of the Universe’: Alison Brie Nabs Key Villain Role of Evil-Lyn in Amazon’s He-Man Movie (Exclusive)",
        "description": "Alison Brie has nabbed the key villain role of Evil-Lyn in Amazon MGM Studios and Mattel Films’ live-action take on Masters of the Universe. The actress, currently seen on Peacock’s thriller limited series Apples Never Fall, joins Nicholas Galitzine (The Idea of You) and Camila Mendes in the adaptation of the popular toy brand first introduced […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Queen Guitarist Brian May Reveals He Suffered a Minor Stroke, Temporarily Lost Mobility in Left Arm",
        "description": "Queen guitarist Brian May is on the road to recovery after suffering a minor stroke, which temporarily left him unable to move his left arm. The musician took to Instagram and YouTube to share the update, detailing his breakthrough following his health struggles. “I’m here to bring you—first of all—some good news, I think,” he […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "‘Megalopolis’ Finds a Fall Guy for AI Trailer Snafu and Hollywood Cries Foul",
        "description": "Megalopolis Finds a Fall Guy for AI Trailer Snafu We’ll find out whether Francis Ford Coppola’s Megalopolis is a masterpiece or a stinker when it arrives in theaters on Sept. 27, but the behind-the-scenes dramas have already been riveting. The latest twist was the snafu over the sci-fi drama’s trailer, which was pulled by distributor Lionsgate […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "‘Twilight’ Animated Series a Go at Netflix",
        "description": "Twilight is getting a second (after)life in the form of an animated series at Netflix. The streamer has given a straight-to-series order and begun development on a show based on Midnight Sun, author Stephenie Meyer’s companion novel to her mega-selling Twilight series. The book is a retelling of the events of Twilight from vampire Edward […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-06T07:21:42.875967"
    },
    {
        "title": "Telegram quietly enables users to report private chats to moderators after founder’s arrest",
        "description": "Telegram has quietly updated its policy to allow users to report private chats to its moderators following the arrest of founder Pavel Durov in France last month over “crimes committed…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "‘Stop harassing Starlink,’ SpaceX president tells Brazilian judge",
        "description": "SpaceX President Gwynne Shotwell made a public plea to one of Brazil’s top judicial figures on Thursday, asking him to “please stop harassing Starlink” amid the ongoing battle in the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Osom is shutting down on Friday, as it had ‘no customers for a mobile phone’",
        "description": "OSOM always had a difficult road, with plans to launch a privacy-focused handset.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Salesforce acquires data management firm Own for $1.9B in cash",
        "description": "Salesforce has acquired Own Company, a New Jersey-based provider of data management and protection solutions, for $1.9 billion in cash. Own is Salesforce’s biggest deal since buying Slack for $27.7…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "US charges five Russian military hackers with targeting Ukraine’s government with destructive malware",
        "description": "The U.S. government indictment demonstrated deep knowledge of the Russian spies’ activities, including their real-world meetings at a cafe in Moscow.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Lyft restructures its micromobility business and Volkswagen brings ChatGPT to US vehicles",
        "description": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! Short week,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Microsoft gives deepfake porn victims a tool to scrub images from Bing search",
        "description": "The advancement of generative AI tools has created a new problem for the internet: the proliferation of synthetic nude images resembling real people. On Thursday, Microsoft took a major step…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Driverless car-sharing startup Vay steers toward B2B services",
        "description": "The new business-to-business division is a bet on what co-founder and CEO Thomas von der Ohe thinks is the future of mobility.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Drip Capital, a fintech that provides working capital to SMBs, picks up $113M",
        "description": "Drip Capital has raised $113 million in a combination of $23 million in equity and $90 million in debt to provide credit to more small businesses in India and the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Google’s AI-powered Ask Photos feature begins US rollout",
        "description": "Google said the feature could be used for more than just photo retrieval alone; users would also be able to ask questions to get helpful answers.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Endolith is using ‘Olympic-caliber’ copper microbes to address the copper shortage",
        "description": "The stealthily operating startup thinks it can narrow the gap by helping miners extract more copper from their mines.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "A comprehensive list of 2024 tech layoffs",
        "description": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "All Hands AI raises $5M to build open source agents for developers",
        "description": "As with many open source startups, All Hands AI expects to monetize its service by offering paid, closed-source enterprise features.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "TechCrunch Minute: This robotic wheelchair can climb stairs",
        "description": "Korea’s Institute of Machinery and Materials unveiled a pretty cool robotic wheelchair this week. By creating a compliant wheel that conforms to the terrain around…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Mintlify is building a next-gen platform for writing software docs",
        "description": "Mintlify offers a collection of documentation-authoring tools, including tools that can auto-generate docs from codebases.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "German LLM maker Aleph Alpha pivots to AI support",
        "description": "Europe doesn’t have many large language model (LLM) makers but one of these rare AI beasts — Germany’s Aleph Alpha — appears to be preparing to rule itself out of…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Rivian’s chief software designer is coming to TechCrunch Disrupt 2024",
        "description": "Every automaker is aiming to build and sell the so-called software-defined vehicle. Rivian may have actually done it, but getting there wasn’t easy. Just ask Rivian’s chief of software Wassym…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "The AI industry is obsessed with Chatbot Arena, but it might not be the best benchmark",
        "description": "LMSYS’ Chatbot Arena is perhaps the most popular AI benchmark today — and an industry obsession. But it’s far from a perfect measure.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Google expands AI-powered virtual try-on tool to include dresses",
        "description": "Google announced Thursday that it expanded its generative AI-powered virtual try-on tool to support dresses, allowing users to virtually wear thousands of dresses from hundreds of brands, including Boden, Maje,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Announcing the Startup Battlefield 200 at TechCrunch Disrupt 2024",
        "description": "TechCrunch Disrupt 2024, which takes place from October 28-30 at Moscone West in San Francisco, is rapidly approaching. Today we’re thrilled to announce the 200 startups selected to participate in…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-06T07:21:43.039496"
    },
    {
        "title": "Unthinkable final scenes stun NFL world",
        "description": "Truly unthinkable scenes have unfolded during the opening game of the NFL’s season with viewers watching on left in disbelief.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘Got a few weapons’: Blues ready for mission impossible",
        "description": "Carlton may be taking a risk bringing back six injured players for a sudden death final but the riskiest one actually gives coach Michael Voss the most confidence.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Unbelievable Raygun photo emerges",
        "description": "After Raygun’s interview on The Project, a private photo of the Olympian has emerged that could “break the internet”.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Swift’s partner horrifies with rogue new look",
        "description": "Travis Kelce, the boyfriend of superstar Taylor Swift, has been savaged on social media after displaying a new look for the NFL opener.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Gloomy Melbourne skies threaten to hand Hawks key advantage",
        "description": "The build-up has been about Western Bulldogs’ talls against Hawthorn’s smalls — and the weather gods look set to hand the Hawks a huge advantage as clouds circle the MCG.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘Got a few weapons’: Blues ready for mission impossible",
        "description": "Carlton may be taking a risk bringing back six injured players for a sudden death final but the riskiest one actually gives coach Michael Voss the most confidence.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "NRL Live: All eyes on Tigers and Eels in Spoon Bowl showdown",
        "description": "The rugby league world tonight turns to Campbelltown to watch the Tigers and Eels battle it out in the highly anticipated Spoon Bowl. Follow along for live coverage and SuperCoach analysis from the thrilling showdown.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘Not even close’: Dragons coach debunks spray claims",
        "description": "There are two things Dragons fans would want to hear from coach Shane Flanagan and he delivered them both on Friday.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Aussies shatter records in cricket demolition",
        "description": "Australian skipper Mitch Marsh and Travis Head have set fire to cricket’s record books in a blistering display against Scotland.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Marsh whacks 30 in an over as records tumble",
        "description": "The boundaries at The Grange in Edinburgh were no match for Travis Head and Mitchell Marsh who put Scotland back in their T20 place with an unforgettable effort.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Never before seen angle of ball girl drama",
        "description": "A tennis star who became public enemy number one at the US Open has taken to social media to try and dispel the outrage.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "World No. 1’s US Open act ‘leaves a bad taste’",
        "description": "World No. 1 Jannik Sinner is the only top 10 player left in the men’s semis at the US Open, but his charge has left a “bad taste”.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Schumacher wife’s rare public outburst",
        "description": "Corinna Schumacher has caused a scene in front of the Formula 1 world in a confrontation with a long-time friend surrounding her family.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘Was I a prick?’: Ricciardo apologises for race incident",
        "description": "Australian F1 star Daniel Ricciardo has reached out to Nico Hulkenberg to apologise for an opening lap incident that did damage to both their races.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Gold medallist as you’ve never seen her",
        "description": "Surviving a horrific cycling accident was a feat in itself for Alexa Leary. After stealing the spotlight in Paris, read about her incredible story.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Aussies in near ‘catastrophic’ lightning strike",
        "description": "Aussie sailor Jimmy Spithill was caught up in a terrifying lightning episode that struck in the middle of a competition.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "NFL about to see something ‘never done before’",
        "description": "A historic, freakish feat seems destined to happen in the NFL this year — and it’s something even Tom Brady could only dream of.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Travis Kelce hits back over ‘break-up contract’",
        "description": "Travis Kelce has hit back after a break-up “contract” that surfaced online apppeared to show he and Taylor Swift are set to call it quits.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Socceroos star owns up after shocker",
        "description": "One of the Socceroos’ main attacking weapons has put his hand up for failing to deliver in Australia’s shoddy display against Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "World’s worst team wins after 20-year wait",
        "description": "There have been scenes of total insanity as the world’s worst football team snapped a 20 year, 140-game winless run.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Whittaker eyes blockbuster Sydney world title fight",
        "description": "Rob Whittaker has his eyes on a middleweight title fight in Sydney next year, and got in some high-level sparring against Jai Opetaia on Friday.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘Definitely pushing’: Major move for LIV players",
        "description": "There’s one significant thing LIV Golf has done that an Australian gun thinks could have big ramifications for local events in the future.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "How players score points in SuperCoach NBL",
        "description": "The SuperCoach NBL scoring formula is simple enough to follow on TV or courtside. Check out this quick explainer – and who to consider for your team.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Rugby great’s wife disappears, declared dead",
        "description": "The “shattered” family of a former rugby star has released a heartbreaking message after the search for his wife was called off.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Epic feat for ‘ultimate team man’",
        "description": "An all-time Wallabies playing record will be broken during the Bledisloe Cup after James Slipper was recalled to play Argentina.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "‘They’ve elevated her’: Willo, Bella to relish Giga clash",
        "description": "Bella Nipotina continues to leave jockey Craig Williams in awe and he’s expecting the brilliant sprinter to pick up where she left off in the Group 3 Concorde Stakes at Randwick.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-09-06T07:21:44.462403"
    }
]