[
    {
        "title": "China's BYD closes in on Tesla as sales jump",
        "description": "Chinese firm got a boost from subsidies encouraging consumers to replace old cars with greener ones.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Cybertruck filled with fuel and fireworks explodes at Trump's Las Vegas hotel",
        "description": "President Biden said law enforcement is investigating \"any possible connection with the attack in New Orleans\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Pre-flight checks found 'no issues' before S Korea air crash",
        "description": "Jeju Air says the plane that crashed in South Korea killing 179 people had passed a pre-flight inspection.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Do not wipe toilet seat with toilet paper: Japanese maker",
        "description": "Social media users have complained that their seats were scratched after being wiped with toilet paper.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Cybertruck filled with fuel and fireworks explodes at Trump's Las Vegas hotel",
        "description": "President Biden said law enforcement is investigating \"any possible connection with the attack in New Orleans\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Era of cheap Russian gas to EU ends as transit across Ukraine stops",
        "description": "The EU says most states will not be affected but other European countries, including Moldova, are facing shortages.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Moldova faces energy crisis as flow of Russian gas ends",
        "description": "Russian gas has stopped passing through Ukraine after a five-year deal expired, leaving Moldova at risk of a crisis.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Elon Musk changes his name to Kekius Maximus on X",
        "description": "The world's richest man sparks speculation after changing his name and using a picture of Pepe the Frog.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "What to know about string of US hacks blamed on China",
        "description": "Presidential campaigns and the US telecommunications network have also been targeted by hackers in recent months.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "What we know about US visas Trump supporters are clashing over",
        "description": "A row has erupted over a long-standing US visa programme, We looked into the figures behind the scheme.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Robinhood CEO: Crypto under relentless assault - 19 Dec 2024",
        "description": "The CEO of online investing platform Robinhood says the Trump administration will be very good for business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Crypto fugitive Do Kwon extradited to US over $40bn crash",
        "description": "US authorities allege he was responsible for the collapse of two coins, prompting a massive crypto sell-off.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Madoff fraud victims get $4.3bn as fund completes payouts",
        "description": "Victims of one of the biggest frauds in US history set to recover more than 90% of proven losses.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "US Treasury says it was hacked by China in 'major incident'",
        "description": "A Chinese state-sponsored hacker broke into the US Treasury Department's systems and accessed some unclassified documents.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "'There aren't enough jobs to go round for everyone'",
        "description": "James Harrison's online videos talking about graduate job rejection have been seen by millions.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "South Korea orders air safety probe after deadly plane crash",
        "description": "The order came after the nation's deadliest aviation disaster in decades in which 179 people were killed.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "'I have 22 million followers but kept my day job'",
        "description": "Miles Laflin encourages others to create online content and says there is an audience for every job.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Barbados fishing industry still reeling from hurricane aftermath",
        "description": "Hurricane Beryl lashed the island in July, devastating much of its fishing fleet.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Kenya's celebrated coffee under threat as farmers hit by climate change",
        "description": "Growers find that the changing climate is having a big impact on the size of their harvests.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "UK and EU look to 2025 for reset, but with little room for trade-offs",
        "description": "Sir Keir Starmer is invited to an EU summit in February - the first of its type since the Brexit negotiations.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Billionaire HBO creator Charles Dolan dies aged 98",
        "description": "The mogul who created Cablevision also owned Madison Square Garden, and the Knicks and Rangers sports teams.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "'It's still in shambles': Can Boeing come back from crisis?",
        "description": "Safety issues with the Boeing 737 Max and mass employee strikes made for a challenging 2024.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Starmer asks UK regulators for ideas to boost growth",
        "description": "The prime minister writes to regulators including Ofgem and Ofwat for ideas to boost economic growth.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "US homelessness hit record high in 2024",
        "description": "High housing costs, natural disasters and a spike in migration helped fuel the rise, officials said.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Fog causes disruptions to UK flights for second day",
        "description": "The UK's main air traffic control provider says \"temporary\" air restrictions remain in place until Sunday for areas with low visibility.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Trump urges US Supreme Court to delay TikTok ban",
        "description": "Trump says that he could negotiate a 'political resolution' for TikTok if the high court intervenes.",
        "source": "BBC Business",
        "fetched_date": "2025-01-02T07:23:42.008829"
    },
    {
        "title": "Hollywood’s Most Notable Deaths of 2024",
        "description": "Carl Weathers, Shannen Doherty, Bob Newhart, Donald Sutherland, Liam Payne, Maggie Smith, James Earl Jones, Gena Rowlands and Jon Landau are among several entertainment legends the industry lost this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "King Charles III Knights Stephen Fry, Carey Mulligan Also Stars on U.K. New Year’s Honors List",
        "description": "'Happy Valley' star Sarah Lancashire, 'Bad Sisters' star Anne-Marie Duff and veteran actor Eddie Marsan are among the other big entertainment industry names receiving honors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Boy George Opens up Ahead of New Year’s Concert in Rome: “All Human Beings Are Multi-Universes”",
        "description": "The 1980s pop icon, who will ring in 2025 with a free concert in the Eternal City, talked to THR Roma in an exclusive interview.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Lily-Rose Depp on Why She’s Doing Everything She Can to “Protect a Sense of Anonymity”",
        "description": "The actress has found her way into the spotlight with her roles in 'The Idol' and 'Nosferatu.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Did Beyoncé Clinch an Album of the Year Win With Her Netflix Xmas Halftime Show?",
        "description": "With the Grammy Awards voting deadline still days away, an NFL halftime show may be the key to locking in a seemingly overdue honor.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Kate Beckinsale Details Years of On-Set Harassment: “Complaining About Abuse Should Not Beget More Abuse”",
        "description": "In an Instagram video, the actress recalled being physically harmed by a male co-star while filming a fight scene, a publicist forcing her to do a photo shoot “the day after I had a miscarriage\" and being \"felt up\" by a crewmember at age 18.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Ex-‘American Idol’ Contestant Disses Katy Perry’s Song “OK”: “This Can’t Be the Same Person Who Eliminated Me”",
        "description": "The singer's latest album, '143,' also received harsh criticism.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Liam Payne Death Probe Leads to Charges Against Five People, Including Alleged Friend",
        "description": "The One Direction singer died after falling from the balcony of his Buenos Aires hotel room in October.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Sabrina Carpenter “Had Literally No Idea” Anyone Would Like “Espresso” Before It Came Out",
        "description": "The Grammy-nominated singer also opens up about her Christmas special, potential plans for new music and keeping it “playful” for her new Dunkin’ partnership.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "German Politicians Condemn Elon Musk’s Support of Far-Right, Compare Him to Vladimir Putin",
        "description": "Government and opposition leaders call the tech billionaire's op-ed backing the anti-immigrant AfD party election interference: \"Elon Musk is attempting nothing different than Vladimir Putin.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "A Predator Presenter and Ballroom Bullying: The U.K.’s Top Entertainment Scandals of 2024",
        "description": "It was a bad year for the BBC with Huw Edwards, Gregg Wallace and Jermaine Jenas in the spotlight. Here, The Hollywood Reporter looks at Britain's biggest ents controversies of 2024.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "Gal Gadot Reveals She Underwent Emergency Surgery for “Massive” Blood Clot In Her Brain During Pregnancy: “All I Wanted Was to Hold On and Live”",
        "description": "The actress shared her harrowing personal story on social media to raise awareness.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-02T07:23:42.463722"
    },
    {
        "title": "One image hints at bombshell Indian axing",
        "description": "The rumour mill surrounding India’s captain was thrust into overdrive on Thursday with one moment raising eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Aussie cult hero causes stir in Albo photo",
        "description": "The 19-year-old’s actions have been called out as the Test side posed for a happy snap with the Australian Prime Minister.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Star jockey’s sad news after horrific fall",
        "description": "Leah Kilner was forced to retire after suffering a traumatic brain injury in a shocking race fall and now she is facing a new battle.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Raiders snubbed as $3.5m star leaves Knights",
        "description": "One of the biggest dominoes in the NRL player market has fallen with a star forward deciding on a move to a Sydney-based club.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "One image hints at bombshell Indian axing",
        "description": "The rumour mill surrounding India’s captain was thrust into overdrive on Thursday with one moment raising eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Aussie cult hero causes stir in Albo photo",
        "description": "The 19-year-old’s actions have been called out as the Test side posed for a happy snap with the Australian Prime Minister.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "New Aussie No.1 crowned, Thompson books quarter-final rematch",
        "description": "Australia has a new top-ranked woman after Kimberly Birrell pulled off another stunning upset, while Jordan Thompson has booked a spot in the quarter-finals against a familiar foe. See the latest news.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Hewitt call Australia has waited 20 years for",
        "description": "Lleyton Hewitt believes Alex de Minaur can do something not even he could manage in his own illustrious career.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "‘Can’t wait’: Ch7 star shares huge news",
        "description": "AFLW great turned TV commentator Abbey Holmes has dropped a bombshell from out of nowhere, much to the delight of fans.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "AFL star arrested and charged",
        "description": "A Richmond Tigers premiership star has been charged with assault following an alleged late-night incident in New South Wales.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Raiders snubbed as $3.5m star leaves Knights",
        "description": "One of the biggest dominoes in the NRL player market has fallen with a star forward deciding on a move to a Sydney-based club.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "‘Tragedy’: Tigers rocked by 15-year ban",
        "description": "The Wests Tigers’ civil war has taken an explosive turn with senior powerbrokers banished by a so-called “Gang of Four”.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "First ever Aussie women’s sports bar closes",
        "description": "A women’s sports bar opened with much fanfare and enthusiasm but just a few months later, it’s had no choice but to call last drinks.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Swift’s BF’s insane $190k Christmas haul",
        "description": "After reeling from a “frustrating” personal nightmare at home, Travis Kelce has been showered with an almighty Christmas bonanza that left him speechless.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Trade means more headaches for Simmons",
        "description": "Ben Simmons’ career has again been plunged into uncertainty after his NBA team pressed the trigger on a surprise trade.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Has a massive injury opened the door for a new Super Bowl favourite?",
        "description": "With three weeks left in the NFL season, there’s a new Super Bowl favourite: with a longtime nemesis injured, can it turn around years and years of losing?",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Juan Mata scores as A-League’s Wild West shootout erupts",
        "description": "Juan Mata finally found the back of the net as the Wanderers-Bulls clash turned into a Wild West Shootout, while Victory’s winless run under interim coach Arthur Diles continues. A-LEAGUE LATEST",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "NYE blaze sends revellers fleeing",
        "description": "A roaring fire broke out on NYE, sparking chaos in a crowded celebration spot, as thousands more were leaving the area following an A-League game.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Utter chaos in boxing ‘freak show’ brawl",
        "description": "There have been insane scenes at a traditional New Year’s Eve boxing event with an all-in brawl erupting after illegal acts.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Schumacher reveals massive family news",
        "description": "Formula One legend Michael Schumacher’s daughter has shared some beautiful news about their family, months after her wedding.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 15",
        "description": "After a slow start to the season, a Phoenix star is back – in a big way. Here’s how to get your team set up for round 15 before Thursday lockout.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Australia bans professional trans golfer",
        "description": "Transgender golfer Breanna Gill, who won last year’s Australian Women’s Classic, is about to be kicked off the WPGA Tour.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Port Macquarie, Wagga previews: Schmidt to roll out the winners",
        "description": "Trainer Cassandra Schmidt and jockey Luke Rolls could claim half the card when Port Macquarie hosts its first meeting in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "David Pocock reveals major life update",
        "description": "It’s the first glimpse fans have been given of the Pocock family’s newest member since their pregnancy announcement earlier this year.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Rookie Reds prop in Wallabies training squad",
        "description": "An emerging Queensland Reds prop has been included in a 40-man Wallabies training squad.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-02T07:23:43.921811"
    }
]