[
    {
        "title": "Car giant Ford and Barbie maker Mattel warn over tariffs costs",
        "description": "The firms join a growing list of big businesses cautioning about the impact of Trump's import taxes.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "India worried about Chinese 'dumping' as trade tensions with Trump escalate",
        "description": "Experts warn that a flood of cheap Chinese goods could hurt the competitiveness of Indian exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "What impact might Trump's Hollywood tariffs plan have?",
        "description": "As Trump turns his attention to what he calls the \"dying\" US film industry, his solution has provoked strong reactions.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Elon Musk's Starbase in Texas will officially become a city",
        "description": "Residents approved incorporating a patch of land as the new municipality in an election on Saturday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "India worried about Chinese 'dumping' as trade tensions with Trump escalate",
        "description": "Experts warn that a flood of cheap Chinese goods could hurt the competitiveness of Indian exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Trump considering 100% tariffs on movies not made in the US",
        "description": "The president blamed foreign-made movies for the American film industry's \"very fast death\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Trump film tariffs to be part of UK-US trade talks",
        "description": "It comes as moviemakers worry the UK's thriving film industry could be hit by the new tariff threat.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "OpenAI says non-profit will remain in control after backlash",
        "description": "The move follows a bitter power struggle over the business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Colombia's wind farms bring promise and pain for indigenous group",
        "description": "The South American country is turning to wind power, but some local people are unhappy.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Deported gang members get second chance at call centre",
        "description": "In the Mexican city of Tijuana a number of firms are employing people who were removed from the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "How Carney's election win will change direction of trade war",
        "description": "In his exclusive BBC interview, the Canadian Prime Minister indicates how he plans to tackle Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "London's 'spiralling' housing crisis in numbers",
        "description": "Research sets out the challenges and solutions to tackle the growing housing need in the capital.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Warren Buffett, 94, stepping down as Berkshire Hathaway CEO",
        "description": "The veteran investor told his company's annual meeting that he would hand over the reins to Vice-Chairman Greg Abel.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Uber starts allowing customers to pay in cash",
        "description": "Taxi app giant Uber said trials showed some people preferred paying in cash or did not have a bank card.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Wall Street stocks bounce back from Trump tariff losses",
        "description": "Investors were buoyed by a better-than-expected jobs report and rising hope of US-China trade talks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Tariffs on car parts entering the US come into force",
        "description": "Import taxes were eased after carmaker outcry,  but it's \"still a big tariff\", analysts say.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "US court rules ex-Abercrombie CEO unfit for trial",
        "description": "Mike Jeffries is \"mentally incompetent\" and will spend time in hospital to see if his condition improves, a judge rules.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "US jobs grow by more than expected despite tariff turmoil",
        "description": "Employers added 177,000 roles in April as the jobs market continues to prove resilient.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Temu to stop selling goods from China directly to US customers",
        "description": "The online marketplace says it will move to a \"local fulfillment model\" in the US, with sales handled by locally based sellers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "M&S supplier resorts to pen and paper after cyber attack",
        "description": "What's going on behind the scenes in the aftermath of the cyber attack on M&S.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Co-op cyber attack affects customer data, firm admits, after hackers contact BBC",
        "description": "The firm previously said there was \"no evidence that customer data was compromised\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Trump signs order to block funding to public radio",
        "description": "Trump alleged that both organisations have produced \"biased and partisan news coverage\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Meta threatens to cut off Facebook in Nigeria over huge fines",
        "description": "The social media giant has challenged demands to pay $290m over regulatory violations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Talks or no talks: Who blinks first in US-China trade war?",
        "description": "Donald Trump and Xi Jinping are locked in a game of chicken - despite wanting the same outcome.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Apple says most US-bound iPhones no longer made in China",
        "description": "The technology giant says US tariffs will add around $900m to its costs this quarter.",
        "source": "BBC Business",
        "fetched_date": "2025-05-06T07:26:52.381273"
    },
    {
        "title": "Zach Bryan Signs New Deal With Warner Records",
        "description": "The country star extends his relationship with the company for at least two albums, while he's also selling his publishing catalog.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Beyoncé Replaces Sphere Visual in Cowboy Carter Tour After Cease-and-Desist",
        "description": "During Sunday's show at SoFi Stadium, Bey replaced the venue with Allegiant Stadium, where she's slated to perform in July.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Zayn VIP Key, Anyone? How the Music Star’s First Solo Tour Engaged Superfans via Fan3",
        "description": "The former One Direction member's manager and UTA Music used innovative ticketing technology and fan-centric experiences, while beating online scalpers, in the promotion of his Stairway to the Sky tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Lady Gaga Draws Record-Breaking 2.5M People to Brazil Beach for Mayhem Concert",
        "description": "The 14-time Grammy Award winner brought an estimated 2.5 million fans to Rio de Janeiro's Copacabana Beach Saturday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Lady Gaga Responds to Thwarted Bomb Plot Allegedly Targeting Her Brazil Concert",
        "description": "\"Prior to and during the show, there were no known safety concerns, nor any communication from the police or authorities to Lady Gaga regarding any potential risks,\" a spokesperson for the singer said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Brazilian Police Arrest 2 People Over Plot to Bomb Lady Gaga’s Concert in Rio",
        "description": "It was the biggest show of the pop star's career that drew some 2 million fans to Copacabana Beach.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Yesterday, All His Photos Seemed So Far Away",
        "description": "Now Paul McCartney's Beatles-era snapshots are finally viewable (and buyable!) at Los Angeles' Gagosian Gallery.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Samuel L. Jackson and Judge Judy Honor Sisters Toni Howard and Wendy Howard Goldberg at Women’s Guild Cedars-Sinai Luncheon",
        "description": "”I can’t imagine my life without her,” Jackson said of his CAA rep Howard during the luncheon, which was hosted by Entertainment Tonight’s Nischelle Turner. “She’s been my hero for at least 30 years.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Singer-Songwriter Jill Sobule “Filled The Room With This Whirlwind of Whimsy”",
        "description": "Michelle Lewis, CEO of the Songwriters of North America and a close friend of Sobule’s, remembers the groundbreaking artist after she tragically died in a house fire.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Howard Ruby, ‘Father of Corporate Housing’ and Husband of Yvette Mimieux, Dies at 90",
        "description": "The founder of the Oakwood furnished-apartment company also was an award-winning nature photographer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Dual Lawsuits Accuse and Deny José Menendez’s Alleged Sexual Assaults of Menudo Members",
        "description": "Roy Rosselló has filed a sweeping complaint against his former manager, and the man holding some rights to the Latin group's songs is suing NBC over a 2023 docuseries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "The Stars of ‘White Lotus,’ ‘Yellowjackets’ and ‘Star Trek: Discovery’ Just Barnstormed Congress in the Name of Arts Funding",
        "description": "Trump wants the NEA gone. So some of your favorite Hollywood actors were let loose on the Capitol to stop him (think karaoke, gauntlets to Republican staffers and Jason Isaacs getting teary).",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-06T07:26:53.103313"
    },
    {
        "title": "Brownlow winner’s year-long absence to end",
        "description": "The return of a Brownlow medallist after a year on the sidelines is the good news as injuries continue to mount for AFL teams.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "AFLW fixture still weeks away as season nears",
        "description": "The AFLW season will start in 100 days but the full fixture is weeks away from being finalised although one key change has been confirmed.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Broncos make bold Mam call as ban ends",
        "description": "With his nine-week NRL ban now served, Ezra Mam is available to play for the Brisbane Broncos who have decided where the star playmaker will return.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Broncos make bold Mam call as ban ends",
        "description": "With Ezra Mam’s nine-week NRL ban now served, the Brisbane Broncos have made a call on his return to the footy field.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "NRL teams: Fresh twist as Fifita out indefinitely",
        "description": "Axed Titans star David Fifita has been ruled out indefinitely and will seek urgent medical advice following ongoing complications from a pre-season operation.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Broncos make bold Mam call as ban ends",
        "description": "With his nine-week NRL ban now served, Ezra Mam is available to play for the Brisbane Broncos who have decided where the star playmaker will return.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Brownlow winner’s year-long absence to end",
        "description": "The return of a Brownlow medallist after a year on the sidelines is the good news as injuries continue to mount for AFL teams.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "AFLW fixture still weeks away as season nears",
        "description": "The AFLW season will start in 100 days but the full fixture is weeks away from being finalised although one key change has been confirmed.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Inspiration behind rising Aussie star",
        "description": "Fergus O’Neill is tearing through top orders at home and overseas – but the seam sensation is happy to bide his time for a Test call-up.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Cricket erupts as item appears out of thin air",
        "description": "A professional player has some questions to answer after a rogue act during a game left cricket commentators and fans gobsmacked.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Legend’s verdict on brutal Billy Slater call",
        "description": "A Queensland legend has given his verdict on a big headache facing Maroons coach Billy Slater ahead of the State of Origin opener.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Motorsports world rocked, two dead in crash",
        "description": "The motorsport’s world has been rocked by a “catastrophic” event which has led to the deaths of two much-loved Superbike riders.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Aussie F1 star brutally sacked on the spot",
        "description": "Aussie driver Jack Doohan has reportedly been sacked with his Formula 1 team facing a backlash over the brutal move.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Reds remain winless in Fijian capital due to last-minute try",
        "description": "A final minute try has denied Queensland Reds a drought-breaking win in Fiji and puts their chances of hosting a Super Rugby finals match in doubt.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Olympian returns to rugby as a man",
        "description": "Ellia Green, an Olympic gold medallist and former NRLW competitor, has made a comeback in a men’s rugby competition.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Photo gallery: Sir Lewis headlines the Met Gala Sport Edition",
        "description": "Co-chaired by Sir Lewis Hamilton, there was no shortage of the world’s best sports talent headlining the iconic Met Gala carpet. Click for a full photo gallery.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "$257m star sparks chaos in suburban comp",
        "description": "An NBA star has gobsmacked onlookers at a local Australian suburban league when he suited up before it all went wrong.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Socceroos great handed mighty new task",
        "description": "The coaching merry-go-round in the A-League has continued with a famous Australian football name given a big job.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "‘New course’: Roar confirms coach’s sacking",
        "description": "Brisbane Roar officials have finally acted on the club’s poor form by parting ways with coach Ruben Zadkovich and naming his replacement.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Boxing world erupts over epic title fight",
        "description": "Boxing superstar Naoya Inoue has defended his belts to remain undisputed world champion, but not before suffering a huge early scare.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "‘Can’t wait’: Aussie young gun’s major call-up",
        "description": "He went head-to-head with Cam Smith in Brisbane last summer and now Elvis Smylie will lock horns with the world’s best at the second major of 2025.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "The guy who dropped 50 on Josh Giddey on a Monday night",
        "description": "Josh Giddey surprised everyone when he turned up at Frankston Stadium for a game. One local decided to take it to the NBA star.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Warwick Farm preview: Handy mare Hellbent on maintaining hot form",
        "description": "Having been pipped by the progressive Candlewick last start, Hellbent On You returns to Warwick Farm looking to go one better.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "Photo gallery: Sir Lewis headlines the Met Gala Sport Edition",
        "description": "Co-chaired by Sir Lewis Hamilton, there was no shortage of the world’s best sports talent headlining the iconic Met Gala carpet. Click for a full photo gallery.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    },
    {
        "title": "‘Insane’: Dress steals show at Grand Prix",
        "description": "The model wife of a $300m star has stolen the spot light away from the celebrities that have flocked to the Miami Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-05-06T07:26:54.149050"
    }
]