[
    {
        "title": "Why is China spending billions to get people to open their wallets?",
        "description": "Beijing hopes better wages and discounts can enocurage spending and stave off greater economic trouble.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Trade turmoil forecast to slash growth in Canada and Mexico",
        "description": "Trump's tariffs will hit its biggest steel trading partners' economies the most, the OECD predicts.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Jonathan Anderson steps down as creative director of Loewe",
        "description": "Jonathan Anderson thanks Loewe as he departs the Spanish luxury fashion house after 11 years.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Small electric cars were said to be the future – but SUVs now rule the road",
        "description": "Despite dire predictions of climate breakdown, more Sports Utility Vehicles are being spotted on, and off, the roads.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Trade turmoil forecast to slash growth in Canada and Mexico",
        "description": "Trump's tariffs will hit its biggest steel trading partners' economies the most, the OECD predicts.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "King meets Carney in symbolic support for Canada",
        "description": "The King, who is also head of state of Canada, meets the country's new prime minister Mark Carney amid a trade war with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Trump moves to close down Voice of America",
        "description": "More than 1,300 staff placed on administrative leave as White House accuses VOA of being anti-Trump, \"radical\" and \"leftist\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Forever 21 operator files for bankruptcy in the US",
        "description": "US stores will remain open as Forever 21's operating company \"begins its process of \"winding down\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "'I'm a little angry': Canadian firms boycott US products",
        "description": "Canadian firms say there is a need for more homegrown production after tariffs imposed by the US sparked a trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Week in Markets - 14 March 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "US government shutdown averted as Senate passes spending bill",
        "description": "The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Clothes brand gets 100 complaints a day that models are 'too fat'",
        "description": "Snag clothing is cited in an online debate over whether adverts showing models who appear \"unhealthily fat\" should be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Musk says first mission to Mars will launch next year",
        "description": "The billionaire says an unmanned mission by his SpaceX \"Starship\" vehicle will be followed by human landings as early as 2029.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "It's not a competition! The collaborative video game loved by players",
        "description": "Josef Fares has found big success with co-operative two player games. Why aren't others doing the same?",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Germany is back, says Merz after historic spending deal",
        "description": "Germany's conservative leader clinches an major financial agreement ahead of a crunch vote in parliament.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Does cutting UK benefits work?",
        "description": "The government is to set out details of how it will save billions of pounds from the working welfare bill.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "How Britain's former top banker became Canada's prime minister",
        "description": "The former banker may not have been elected to office before, but his experience managing global economic crises will help.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Musk's Tesla raises concern over Trump tariffs",
        "description": "The electric carmaker’s warning about tariffs comes despite its boss's key position in the Trump administration.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Apple encrypted data row hearing begins in secret",
        "description": "The BBC - along with civil liberties groups and some US politicians - argue the case should be heard in public.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Gold price hits $3,000 as trade tensions mount",
        "description": "Demand for the precious metal has surged amid economic uncertainty over the impact of the global trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "The unexpected knock-on effect of Trump's minerals 'deal of the century'",
        "description": "The president once derided attempts to develop new green technology as a \"green new scam\" - but his deal could help boost the US's potential in the sector",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "UK economy shrank unexpectedly in January",
        "description": "A slowdown in manufacturing was one of the main reasons for the dip, the Office for National Statistics says.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Every McDonald's in UK warned over staff sexual abuse",
        "description": "The warning from the UK's equality watchdog comes after the \"extremely serious\" allegations uncovered by the BBC.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "The blunt-speaking Canadian taking his fight with Trump to Washington",
        "description": "Doug Ford meets Trump's top trade adviser as relations between the two countries hits a new low.",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "Car sharing switches to electric to boost appeal",
        "description": "Car sharing has not taken off, but will electric cars boost its appeal?",
        "source": "BBC Business",
        "fetched_date": "2025-03-18T07:25:32.354926"
    },
    {
        "title": "iHeartRadio Music Awards Winners: Billie Eilish and Finneas Take Album of the Year",
        "description": "Taylor Swift, Benson Boone, SZA, GloRilla, Sabrina Carpenter and Green Day also were among the winners during Monday night's show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Ex-CNN Anchor Don Lemon Reveals He Was Sexually Harassed by Women While at Network",
        "description": "While appearing on Bill Maher’s podcast this weekend, the veteran broadcaster shared a dark piece of his past as he explained his thoughts on gender and power dynamics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Lady Gaga Unleashes ‘Mayhem’ On Albums Chart With No. 1 Debut",
        "description": "The seventh such feat for Gaga comes as Kendrick Lamar and SZA's \"Luther\" spent a fourth week atop the Hot 100.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "SXSW Clarifies Changes to 2026 Music Conference",
        "description": "Next year’s edition of the festival will be two days shorter as SXSW's music programming will take place throughout the week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Neil Young Will Stop Selling Platinum Tickets for Concerts, Says The Cure’s Robert Smith Inspired Him",
        "description": "\"I have a choice to make and can make a difference for my music loving friends,\" Young wrote on his website.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Civil Liberties Report Calls Out Italy, Hungary for Media Freedom Violations",
        "description": "Giorgia Meloni’s government has shown \"heavy intolerance to media criticism,\" the report finds, calling out \"unprecedented levels of interference in public service media.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Will Smith Announces Imminent Release Date for His First Album in 20 Years",
        "description": "The Oscar-winning actor, who is still notorious for \"The Slap,\" is moving back to his roots in radio-friendly hip-hop with a record on March 28.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "How Gene and Betsy Hackman’s Dog Died Revealed In New Report",
        "description": "There was no evidence of infectious disease, trauma or poisoning that could have resulted in death, according to a New Mexico Department of Agriculture report.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Kanye West Drops New Song Seemingly Featuring Diddy and Daughter North",
        "description": "In a since-deleted text conversation posted on West's X account, Kim Kardashian allegedly attempted to stop the release of the song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Playboi Carti’s New Album ‘Music’ Breaks Spotify Record",
        "description": "\"Carti’s MUSIC is already making history,\" the audio streaming giant wrote on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "President Trump Signs Order to Cut Staff at Voice of America",
        "description": "Other U.S. funded media organizations will be cut as well.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "PVRIS Releases 10-Year Anniversary Edition of Debut Album ‘White Noise’ Featuring Spiritbox’s Courtney LaPlante",
        "description": "Lynn Gunn, the band's frontwoman, is now touring the anniversary album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-18T07:25:33.297643"
    },
    {
        "title": "Disgruntled NRL star has to pay to leave club",
        "description": "The Dragons have agreed to release a disgruntled player immediately following a club dispute with a staff member, but there’s a catch.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "‘Horrendous’: Melb suburb’s huge gripe",
        "description": "The median house price here is $2.6m and the beach is a short walk away. It’s paradise for 11 months of the year.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "NRL club swings axe as stars mount comeback",
        "description": "One NRL club is breathing a sigh of relief, while one coach has dropped the axe and others have rung the changes for round 2.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Sea Eagles duo cleared, Bulldogs’s replacement revealed",
        "description": "It’s good news for a couple of Sea Eagles stars, but team list Tuesday has thrown up some major shocks in the halves at a couple of desperate clubs.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Disgruntled NRL star has to pay to leave club",
        "description": "The Dragons have agreed to release a disgruntled player immediately following a club dispute with a staff member, but there’s a catch.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "NRL club swings axe as stars mount comeback",
        "description": "One NRL club is breathing a sigh of relief, while one coach has dropped the axe and others have rung the changes for round 2.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "AFL Now: Archer’s tribunal fate revealed, Tiger and Hawk to come",
        "description": "North Melbourne youngster Jackson Archer attempted to overturn his three-game ban at the tribunal tonight. See how he fared and follow more footy news live here.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Newman, underworld figure drop bombshell",
        "description": "Sam Newman has aired an extraordinary “conspiracy theory” and hit out over a video showing him with an infamous Melbourne figure.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Prodigy ‘still learning’ in breakout summer",
        "description": "A Victorian prodigy has announced himself as a future star with a breakout state season, but he insists he has plenty more to learn.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "‘It’s crazy’: Batting miracle keeps final hopes alive",
        "description": "Bonus points could be the deciding factor in who faces South Australia in the Sheffield Shield final and a trio of Queenslanders helped their state rack up crucial ones.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Tennis loses it over teen’s savage ‘death note’",
        "description": "TV cameras have captured the brutal homework notes written by tennis’ newest teen phenom as she make made history against the world No. 1.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Tennis rocked by world No. 1’s putrid act",
        "description": "Tennis star Iga Swiatek has been booed by spectators after smashing a ball at a ball boy in an ugly act of sportsmanship.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Disgusting accusations after Gout Gout feat",
        "description": "Australian athletics great John Steffensen has spoken out about the disgusting accusations made towards teen sensation Gout Gout.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "‘Horrendous’: Melb suburb’s huge gripe",
        "description": "The median house price here is $2.6m and the beach is a short walk away. It’s paradise for 11 months of the year.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Star’s dad puts heartless F1 boss to shame",
        "description": "A Red Bull rookie was in tears when his Australian GP ended in heartbreaking fashion, but his team boss had zero sympathy for the youngster.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "International manhunt for ex-Wallabies star",
        "description": "An international manhunt is underway after a former Wallabies captain was given a prison sentence while his location is unknown.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Wallabies star remains loyal to Reds",
        "description": "One of the world’s best flankers is staying with the Queensland Reds for another three years.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Pro wrestler dead after collapsing in the ring",
        "description": "The beloved pro wrestler has passed away aged 39 after suffering a medical emergency during a match on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "The ‘mindset’ helping Lions deal with adversity",
        "description": "Having overcome a host of problems to win last year’s AFL premiership, the Brisbane Lions continue to show a steely mentality in their bid for another flag.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Recalled ‘Roo itching for an opportunity",
        "description": "Socceroos appearances for left-back Jason Davidson have been few and far in between since the 2015 AFC Asian Cup.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "UFC star’s embarrassing wardrobe blunder",
        "description": "UFC fighter Marvin Vettori infamously attended a photoshoot with his pants on backwards but Sunday’s wardrobe topped that.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "‘I was stunned’: Underdog’s nightmare as Rory wins Players decider",
        "description": "Rory McIlroy has cruised to a St Patrick’s Day victory at the Players Championship, defeating J.J. Spaun in a nervy three-hole playoff at TPC Sawgrass after the American imploded.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Tatum fumes as United pounce on Hawk’s injury to take game 3",
        "description": "It will go down as one of the great wins in Melbourne United history, but Illawarra coach Justin Tatum was left fuming after what he thought was the visitors preying on a Hawk’s injury.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Wyong tips Wednesday: Imperial Force to strike again",
        "description": "Bjorn Baker colt Imperial Force was a dominant winner first-up and will prove tough to beat again when he heads to Wyong on Wednesday. BEST BETS, INSIDE MAIL",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Newman, underworld figure drop bombshell",
        "description": "Sam Newman has aired an extraordinary “conspiracy theory” and hit out over a video showing him with an infamous Melbourne figure.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    },
    {
        "title": "Bodybuilding star drops scary truth bomb",
        "description": "A champion natural bodybuilder has revealed the secret tricks behind his insane physique and issued a warning about the sport.",
        "source": "News AU",
        "fetched_date": "2025-03-18T07:25:35.393254"
    }
]