[
    {
        "title": "'Trump study sessions': How Japan PM's homework paid off",
        "description": "PM Shigeru Ishiba's playbook gets him much-needed reassurances that his country is still America's top ally.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Power station's further reporting failure exposed by BBC",
        "description": "Drax, which burns wood pellets, is required to report where it sources its wood from.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Judge blocks Musk team access to Treasury Department records",
        "description": "Nineteen state attorneys general sued the Trump administration after the Department of Government Efficiency (Doge) was given access.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Musk's Doge takes aim at US consumer protection agency",
        "description": "The billionaire aide to Donald Trump indicates he wants to see the end of an agency founded after the financial crash of 2007-8.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Power station's further reporting failure exposed by BBC",
        "description": "Drax, which burns wood pellets, is required to report where it sources its wood from.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Trump administration to cut billions from overheads in biomedical research",
        "description": "President Trump's administration has announced it will slash billions of dollars in overheads for grants in biomedical research as a part of broader cost-saving measures.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "'It helps me switch off': Adults spend thousands on toys for themselves",
        "description": "A rising number of adults are buying toys - we hear from so-called \"kidults\" who are splashing out thousands.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Oasis fans see tickets cancelled over 'bots' claim",
        "description": "Fans say they have been wrongly accused of using bots to buy their tickets for the comeback shows.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "How big tech ad money helped fund child abuse",
        "description": "Some of the biggest tech companies in the world served ads on a website featuring images of child abuse, helping to fund its operations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Baltic states begin historic switch away from Russian power grid",
        "description": "More than 30 years after leaving the Soviet Union, Estonia, Latvia, and Lithuania will join the EU's grid.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "'You're fired': The people Trump has sacked since taking office",
        "description": "FBI agents, former allies, and the nation's top record keeper are among those President Trump has fired.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Kobe sneakers from torn Achilles game sell for $660,000",
        "description": "The basketball legend stayed in the game to score two free throws despite tearing his tendon.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "How Japan sparked Trump's 40-year love affair with tariffs",
        "description": "As a young real estate developer in New York, Trump said a rising Japan was ripping off the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Judge blocks Trump plan to put thousands of USAID staff on leave",
        "description": "A last-minute lawsuit means Trump's efforts to dismantle the overseas aid agency have been put on hold.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "'We're pawns in a game': US aid workers left in limbo overseas as agency slashed",
        "description": "USAID foreign staff say in addition to feeling stranded, they also worry how their absences will harm the countries and people they leave behind.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Trump says Nippon Steel will 'invest heavily' in US Steel, drop takeover bid",
        "description": "The Japanese firm's $14.9bn (£12bn) takeover was blocked by President Joe Biden on national security grounds.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Musk to rehire Doge aide who resigned over racist posts",
        "description": "Vice-President JD Vance had said the young employee should be given a second chance.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Cheaper China e-bikes 'kick in teeth' for UK firms",
        "description": "British makers of e-bikes are worried after the government scraps tariffs on Chinese e-bikes .",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Trump suspends tariffs on small packages from China",
        "description": "The order ending duty-free shipment of packages from China worth less than $800 had caused chaos.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "US job growth slows but unemployment stays low",
        "description": "Firms created 143,000 jobs last month, below analysts' forecasts, but December's figure was upgraded.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "USAID could slash staff to hundreds after placing most on leave",
        "description": "But US President Donald Trump's plan to dramatically cut back US foreign aid faces a legal challenge.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Panama says US 'spreading lies' over free canal passage",
        "description": "The US State Department had claimed that they were no longer required to pay a fee for transit.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "India cuts interest rates for the first time in five years",
        "description": "The latest cut happens when India's GDP growth is seen slowing to a four-year-low of 6.7%.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "TikTok sued by parents of UK teens after alleged challenge deaths",
        "description": "The US-based Social Media Victims Law Center filed the wrongful death lawsuit  on Thursday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "Senate confirms Project 2025 co-author as Trump budget chief",
        "description": "Democrats call Russell Vought the president's \"most dangerous nominee\", but Republicans say he will \"stop the waste of US taxpayers' dollars\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-09T07:21:36.180433"
    },
    {
        "title": "José Menendez’s Music Industry Past Revealed: “You Did Not Want to Incur His Wrath,” Says Former Colleague",
        "description": "Deals for the Elvis catalog, hits by Mr. Mister and an Annie Lennox charm offensive, with the brothers back in the news, THR takes a closer look at the patriarch’s roots as an executive at RCA Records.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Kathy Bates Dedicates Critics Choice Trophy to ‘Matlock’ Producer Who Lost His Home in L.A. Fires",
        "description": "\"I just want to tell Eric Olsen, who hasn't quite found a home yet, this is coming to you first thing for decor,\" the veteran actress said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Where the Menendez Brothers’ Legal Paths to Freedom Stand",
        "description": "The brothers who gunned down their parents in 1989 have a few glimmers of hope in what has become a protracted process to see them freed — and none come from L.A.'s new D.A.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Chelsea Handler Addresses Blake Lively and Justin Baldoni Feud in Critics Choice Monologue: “There’s Probably Not Going to Be a Sequel”",
        "description": "The comedian, hosting the awards show for the third time, said she was \"grateful\" for the 'It Ends With Us' stars for being a \"distraction\" from troubling news.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Hannah Einbinder Calls Out Chevron, Fossil Fuel Industry for Climate Damage During Critics Choice Awards Acceptance Speech",
        "description": "\"They need to pay to clean up the mess that they made,\" the 'Hacks' star said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Trump Says He Will Make Himself Chair of the Kennedy Center After Firing Board Members",
        "description": "The president said he had removed the chairman David Rubenstein, saying he did not “share our vision for a Golden Age in Arts and Culture.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Chappell Roan Fires Back at Grammys Speech Critic  With $25K Throw-Down",
        "description": "The pop star replied to a critique of her Grammys speech, where she blasted the music industry.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Why the Chappell Roan Speech Critic “Couldn’t Be More Wrong” (Guest Column)",
        "description": "Musician Kay Hanley has some words for the mansplainer-in-chief: “Good luck, babe!”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "50 Cent Trolls Irv Gotti Following Rap Mogul’s Death",
        "description": "The \"In Da Club\" rapper took to Instagram to pay his own kind of tribute to the late Murder Inc. founder, who was a close associate of his longtime rival, Ja Rule.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Fake Online Video Claiming USAID Paid Hollywood Stars to Visit Ukraine Debunked",
        "description": "Stars mentioned in the video to have received payments included Angelina Jolie, Sean Pean, Jean Claude Van Dam, Orlando Bloom and Ben Stiller.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Inside the AFI Awards With Ariana Grande, Colin Farrell, Kristen Bell and a Pacific Palisades Fireman",
        "description": "The awards luncheon, held at the Four Seasons on Thursday, toasted AFI's top 10 films and top 10 TV shows of the year and hosted a hotbed of A-list mingling.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "Netflix Will Not Release Controversial Prince Doc Following New Deal With Singer’s Estate",
        "description": "A New York Times report last year alleged that the unreleased documentary accused the late musician of physical and emotional abuse.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-09T07:21:36.422801"
    },
    {
        "title": "‘Absolute genius’: Cricket erupts at Smith act",
        "description": "Steve Smith is having a blinder in Sri Lanka and cricket fans were in awe after he masterminded Australia’s stunning surge to victory.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Australia seal whitewash as Smith pulls off historic first",
        "description": "Australia has crushed Sri Lanka for the second time in two Tests to secure its first whitewash win in Asia in nearly two decades.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "‘OH MY GOD’: UFC star utterly dominated in insane Sydney bloodbath",
        "description": "Sean Strickland has been utterly dominated in his UFC blockbuster, with his trainer and commentators unleashing on the US star.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Lakers disaster as NBA trade cancelled",
        "description": "Just when the NBA trade deadline couldn’t get any crazier, the LA Lakers have backflipped on a mega trade, rescinding the move.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "‘Absolute genius’: Cricket erupts at Smith act",
        "description": "Steve Smith is having a blinder in Sri Lanka and cricket fans were in awe after he masterminded Australia’s stunning surge to victory.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Australia seal whitewash as Smith pulls off historic first",
        "description": "Australia has crushed Sri Lanka for the second time in two Tests to secure its first whitewash win in Asia in nearly two decades.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "World-famous singer makes pro tennis debut",
        "description": "He once vowed to never stop party rocking but it appears he hasn’t listened to his own advice, as the iconic singer made his professional tennis debut, aged 49.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Shock, tears as ex-world No. 1 retires on spot",
        "description": "A much-loved tennis champ’s career has ended in sad scenes when she grabbed a microphone on court and left spectators in tears.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Ben Cousins news says it all about AFL great",
        "description": "West Coast Eagles great Ben Cousins has a new job — and it shows just how far he has come after his life fell apart.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "AFL star’s tragic five words after bro’s death",
        "description": "AFL champ Joel Selwood has gone public with a devastating message about his brother, who died in tragic circumstances this week.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Broncos bombshell as Walters secret drops",
        "description": "Kevin Walters has corrected a rumour that was spread during his tumultuous departure from the Broncos after a year of misery.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "‘Bit of feeling’ in heated NRL preseason upset",
        "description": "Raiders fans would have loved what they saw from Ethan Sanders as the youngster steered his side to an encouraging win over Penrith.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Aussie icon drops news, shatters UFC fans",
        "description": "Beloved Aussie UFC star Alex Volkanovski has opened up about his future in the sport, revealing details fans won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Lakers disaster as NBA trade cancelled",
        "description": "Just when the NBA trade deadline couldn’t get any crazier, the LA Lakers have backflipped on a mega trade, rescinding the move.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "NFL Down Under 2026: Everything you need to know",
        "description": "The NFL is officially coming to Australia, and to get you ready for a piece of sporting history, we’ve got every question covered ahead of the Rams’ venture to Melbourne.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "A-League: Sydney stuns with 97th minute equaliser in derby",
        "description": "Sydney FC has produced a stunning comeback sealed in the 97th minute in a dramatic derby against its western rivals. Read the biggest news from Round 18 here.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "‘OH MY GOD’: UFC star utterly dominated in insane Sydney bloodbath",
        "description": "Sean Strickland has been utterly dominated in his UFC blockbuster, with his trainer and commentators unleashing on the US star.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Lakers disaster as NBA trade cancelled",
        "description": "Just when the NBA trade deadline couldn’t get any crazier, the LA Lakers have backflipped on a mega trade, rescinding the move.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Near-faultless Geary closes on Vic Open title",
        "description": "Josh Geary is in the box seat to clinch the Vic Open title after mastering windy conditions at 13th Beach with a round that left his rivals wondering if he would make another error.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Growing confidence in colt’s Lightning strike",
        "description": "Star colt Growing Empire will resume in the Group 1 Black Caviar Lightning Stakes (1000m) on Saturday at Flemington.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Reds primed for Super season",
        "description": "The Reds don’t want to waste their good work on a successful pre-season tour of the United Kingdom when they kick-off their Super Rugby Pacific season later this month.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Wallabies in turmoil as coach calls it quits",
        "description": "Rugby Australia is back on the hunt for yet another new coach after Joe Schmidt confirmed he will step down ahead of the World Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    },
    {
        "title": "‘Absolutely ridiculous’: Olympics bomb drops",
        "description": "Donald Trump is pushing International Olympic Committee to change its rules on transgender athletes after he signed a ban of his own.",
        "source": "News AU",
        "fetched_date": "2025-02-09T07:21:37.717149"
    }
]