[
    {
        "title": "Worst week for US stocks since Covid crash as China hits back on tariffs",
        "description": "The US president, who has vowed to remake the global trade order, dismissed concerns, noting the US jobs market is strong.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Tariffs have shaken the markets - how worried should we be?",
        "description": "Workers are right to fear for their pensions, but the greater worry is the here and now - the economy they live in.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Who‘s trying to buy TikTok?",
        "description": "Oracle, Microsoft and the founder of OnlyFans are also among names that have cropped up as the president seeks to broker a deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Sam Altman's AI-generated cricket jersey image gets Indians talking",
        "description": "Some found the image delightful, but others wondered about OpenAI founder's motives for wooing India.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Tariffs have shaken the markets - how worried should we be?",
        "description": "Workers are right to fear for their pensions, but the greater worry is the here and now - the economy they live in.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "'Sometimes you have to walk through fire': Tariffs get backing in Trump heartland",
        "description": "As economic uncertainty swirls and the markets take a hit, many in this deeply Republican area back the president's plan.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "How might tariffs change the price of Nike's iconic trainers?",
        "description": "What impact will the introduction of hefty tariffs on countries in Asia have on Nike's iconic US shoe?",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Trump extends deadline to keep TikTok running in US",
        "description": "The president has granted the app a second 75-day extension to comply with a law that requires it to either sell its US assets or face a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Spain tackles housing 'social emergency' as rents double in a decade",
        "description": "The Spanish government is moving to make renting more affordable and boost the supply of homes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Week in Markets - 4 Apr 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Will £75 be the new normal for video games after Switch 2's Mario Kart?",
        "description": "There's a lot of excitement about the new console - but also concern about the high price of its games.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Trump's tariffs could be death knell for  US-Africa trade pact",
        "description": "Some African countries got privileged access to US markets, but the future of that deal is uncertain.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Americans could pay more for these everyday basics under Trump's new tariffs",
        "description": "The next cup of coffee, Shein shopping haul and more may soon cost more as tariffs take effect",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "China and US are at each other's throats on tariffs, and neither is backing down",
        "description": "China's new 34% tax on US imports shows it is ready to tussle with Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Nintendo pulls Switch 2 pre-orders in US over Trump tariffs",
        "description": "It unveiled the console on Wednesday just hours before the president announced a wave of global tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "US envoy says he's working on DR Congo minerals deal",
        "description": "DR Congo hopes that US involvement in its minerals sector would help deter Rwandan-backed rebels.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Analysis: EU talks tough on Trump tariffs in hope of U-turn",
        "description": "The EU has enormous economic clout as the biggest single market in the world, but does not want to risk a backlash.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "How will India navigate a world on the brink of a trade war?",
        "description": "India is the world's fastest-growing major economy. How it deals with Trump will define its economic trajectory.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "'Nowhere's safe': How an island of penguins ended up on Trump tariff list",
        "description": "The remote Heard and McDonald Islands haven't been visited by humans in almost a decade.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Trump tariffs trigger steepest US stocks drop since 2020 as China, EU vow to hit back",
        "description": "Nike and Apple were among brands worst hit, but Trump maintained the US economy would ultimately \"boom\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "What is live shopping and will it take off?",
        "description": "Big in Asia, live shopping involves brands putting on live shows to sell direct to shoppers.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "US pharma boss: 'Tariffs are pivotal moment and hard to come back from'",
        "description": "Eli Lilly's boss tells the BBC he is doubtful tariffs will bring jobs to the US or raise billions in taxes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "UK draws up list of US products it could hit with tariffs",
        "description": "The business secretary says he wants to reach an economic deal but would take \"necessary steps' if talks failed.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "How jeans and diamonds pushed Lesotho to the top of Trump's tariffs list",
        "description": "Only Chinese goods are facing higher US tariffs than exports from Lesotho, which will be charged at 50%.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "Analysis: Trump's tariffs are the biggest change to global trade in 100 years",
        "description": "The impact of the tariffs will be huge, with significant changes to long-standing global avenues of trade.",
        "source": "BBC Business",
        "fetched_date": "2025-04-05T07:22:57.294668"
    },
    {
        "title": "How the Coastal Record Labels Crashed Nashville: “Artists Don’t Have to Follow Those Old Rules”",
        "description": "Country is one of the hottest genres in music, and now labels outside of the old Nashville system have come to town to cash in.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Coldplay Featured on New Version of League of Legends ‘Arcane’ Song “Ma Meilleure Ennemie” (Exclusive)",
        "description": "Coldplay's feature comes as Riot Games and Virgin Music released an extended version of 'Arcane's season two soundtrack.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Elton John and Brandi Carlile Release Collaborative Album ’Who Believes in Angels?’",
        "description": "The duo recently played a one-night only engagement in London that will air as a concert special on CBS this Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Mel Gibson’s Gun Rights Restored by Justice Department (Report)",
        "description": "The decision comes after former U.S. Pardon Attorney Elizabeth G. Oyer claimed she was fired from the DOJ for refusing to recommend the actor be allowed to carry a handgun again.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Ed Sheeran Drops First Single “Azizam” From Eighth Studio Album",
        "description": "The new song is the first from Sheeran’s forthcoming album ‘Play.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Miley Cyrus Drops Single “End of the World” From Upcoming ‘Something Beautiful’ Album",
        "description": "The new song comes days after the singer dropped the first two tracks, \"Prelude\" and \"Something Beautiful.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Conan O’Brien Says It Was “Important” to Attend Kennedy Center Mark Twain Event Despite Trump Overhaul",
        "description": "“There was the question of, ‘Should I go, should I not go?’ And I felt like it was important to show up,” the comedian said during an episode of his podcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "MTV Video Music Awards to Air on CBS for First Time Via Simulcast",
        "description": "The 2025 VMAs will air live on Sept. 7 on MTV and CBS and stream on Paramount+.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Kanye West Raps About Split With Wife Bianca Censori on His New Album, ‘WW3’",
        "description": "The troubled rapper-mogul suggests trouble in his marriage on \"BIANCA,\" from his new solo album, which dropped on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Bruce Springsteen to Release Seven ‘Lost’ Albums in June",
        "description": "The albums, recorded from 1983 to 2018, will release as part of an extensive box set called ‘Tracks II: The Lost Albums.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "FIFA President Gianni Infantino Praises Los Angeles First Responders Ahead of Club World Cup",
        "description": "Games for both the 2025 FIFA Club World Cup and the 2026 FIFA World Cup will take place in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Johnny Tillotson, ‘Poetry in Motion’ Singer, Dies at 86",
        "description": "A two-time Grammy nominee, he had another popular track, \"It Keeps Right on A-Hurtin',\" that was covered by Elvis Presley.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-05T07:22:58.141986"
    },
    {
        "title": "Lawson faster than Tsunoda after Red Bull swap, Norris quickest",
        "description": "Liam Lawson failed to make the top 10 in his return to the Racing Bulls, but he out-qualified the man who replaced him, Yuki Tsunoda, as Max Verstappen’s Red Bull Racing teammate.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "NRL defector gets last laugh as tempers flare",
        "description": "Parramatta Eels coach Jason Ryles had to wait for his first win but it came against his former team in dramatic fashion.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Aussie tennis star fumes at influencer reality",
        "description": "Aussie star Daria Saville has called out ‘marketing teams’ behind the rise of tennis influencers, something she said is costing players dearly.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Panthers’ inexcusable error called out",
        "description": "The Panthers had a night to forget on Friday as they were stunned by the Cowboys, but eagle eyed fans pointed out the club already made a howler pre-game.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "NRL Live: Dolphins extend lead after early Titans drama",
        "description": "There has been some early drama in the Queensland derby, with the Dolphins on top early after both teams had a player sin-binned under the NRL’s high shot crackdown. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "NRL defector gets last laugh as tempers flare",
        "description": "Parramatta Eels coach Jason Ryles had to wait for his first win but it came against his former team in dramatic fashion.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Big-name Lions, Lalor make their mark at the ‘G",
        "description": "Brisbane’s class – and SuperCoach stars – are shining through at the MCG. But, again, there’s been enough to like for Richmond fans. Follow Super Saturday live.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "‘Can’t stay quiet’: Two footy widows bonded by tragedy",
        "description": "Cherie Dear and Karen Turner have been bonded by the tragedy of losing their husbands to pancreatic cancer. But now, they’re driven to do something about it.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Never-seen-before act stuns cricket world",
        "description": "Cricket fans couldn’t believe their eyes when a Sri Lankan star did something rarely seen before during his debut IPL match.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Warne medical report uncovers third drug",
        "description": "The medical report of Shane Warne’s death has come to light for the first time, revealing the truth behind claims made about his final hours.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Aussie tennis star fumes at influencer reality",
        "description": "Aussie star Daria Saville has called out ‘marketing teams’ behind the rise of tennis influencers, something she said is costing players dearly.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Sinner’s ex-trainer drops doping bombshell",
        "description": "Jannik Sinner’s former trainer has reignited the doping case that rocked tennis by dropping a bombshell that’s bad news for one person.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "‘Scary’ star set to tear Australia apart",
        "description": "One player is tipped to make such a difference to Super Netball that “something will have to go horribly wrong” for her team not to win the premiership.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Lawson faster than Tsunoda after Red Bull swap, Norris quickest",
        "description": "Liam Lawson failed to make the top 10 in his return to the Racing Bulls, but he out-qualified the man who replaced him, Yuki Tsunoda, as Max Verstappen’s Red Bull Racing teammate.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "‘Oh my god’: Aussie rookie in huge F1 crash",
        "description": "Under-pressure Aussie F1 rookie Jack Doohan has been involved in a heavy collision early in practice for the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Poll: 1st Colts comp offering rising rugby talent a second chance",
        "description": "It’s a comp helping launch young talent and identifying others who may have slipped under the radar and Waratah selectors will be monitoring every game of Colts in 2025 for future stars",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "New AI move in Aus sport infuriates",
        "description": "Aussie sporting teams are in hot water after using a new AI feature that can generate artwork in seconds, in a move on the nose to fan bases and artists alike.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "NBA ‘Bad Boy’ team goes rogue in wild fight",
        "description": "Seven players were ejected after a wild NBA brawl broke out featuring a team that is quickly earning a feisty reputation.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Coach axing leaves NBA world in shock",
        "description": "An NBA championship contender has left fans in disbelief after sacking their head coach only weeks out from the playoffs starting.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Matildas seeking momentum",
        "description": "With next year’s AFC Women’s Asian Cup fast approaching, the Matildas want to turn winning into a habit.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "How a forced restart brought winning feeling back to Matildas",
        "description": "The Matildas were without a number of their Olympic stars and yet, the forced restart caused by line-up and combination changes did the trick for a much needed confidence boost.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "‘Been lied to’: Tszyu tensions explode",
        "description": "Tensions have spilled over between Tim Tszyu and his American opponent as controversy threatened to derail the Aussie’s comeback fight.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "‘Fanboying’: Lee’s friendship with pop icon",
        "description": "Min Woo Lee isn’t short of support from big names in sport and music as he prepares for next week’s Masters at Augusta.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Odd reason star deliberately scored own goal",
        "description": "Basketball star Marie Pardon has incredibly nailed a buzzer beater … only problem was it was for the wrong team.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Baker’s dream realised as Stefi Magnetica wins Doncaster",
        "description": "Trainer Bjorn Baker craved a win in ‘iconic Sydney race’ and he finally got it when Stefi Magnetica won the $4 million Group 1 Doncaster Mile at Randwick.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    },
    {
        "title": "Spiranac lifts lid on ‘sexual favour’ rumours",
        "description": "Golfer and social media sensation Paige Spiranac has spoken out over rumours that plagued her in the early stages of her career.",
        "source": "News AU",
        "fetched_date": "2025-04-05T07:23:00.940455"
    }
]