[
    {
        "title": "S Korea orders air safety probe after deadly plane crash",
        "description": "The order came after the nation's deadliest aviation disaster in which 179 people were killed.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Barbados fishing industry still reeling from hurricane aftermath",
        "description": "Hurricane Beryl lashed the island in July, devastating much of its fishing fleet.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "'It's still in shambles': Can Boeing come back from crisis?",
        "description": "Safety issues with the Boeing 737 Max and mass employee strikes made for a challenging 2024.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Starmer asks UK regulators for ideas to boost growth",
        "description": "The prime minister writes to regulators including Ofgem and Ofwat for ideas to boost economic growth.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Barbados fishing industry still reeling from hurricane aftermath",
        "description": "Hurricane Beryl lashed the island in July, devastating much of its fishing fleet.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Kenya's celebrated coffee under threat as farmers hit by climate change",
        "description": "Growers find that the changing climate is having a big impact on the size of their harvests.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "UK and EU look to 2025 for reset, but with little room for trade-offs",
        "description": "Sir Keir Starmer is invited to an EU summit in February - the first of its type since the Brexit negotiations.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Billionaire HBO creator Charles Dolan dies aged 98",
        "description": "The mogul who created Cablevision also owned Madison Square Garden, and the Knicks and Rangers sports teams.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Elon Musk's 'social experiment on humanity': How X evolved in 2024",
        "description": "New users? New algorithms? Or something else going on behind the scenes? The story behind the new changes on the social media site",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Greenland and the Panama Canal aren't for sale. Why is Trump threatening to take them?",
        "description": "Trump's promises to use America's strength to its advantage helped propel him twice to the White House.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Robinhood CEO: Crypto under relentless assault - 19 Dec 2024",
        "description": "The CEO of online investing platform Robinhood says the Trump administration will be very good for business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "US homelessness hit record high in 2024",
        "description": "High housing costs, natural disasters and a spike in migration helped fuel the rise, officials said.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Fog causes disruptions to UK flights for second day",
        "description": "The UK's main air traffic control provider says \"temporary\" air restrictions remain in place until Sunday for areas with low visibility.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Trump urges US Supreme Court to delay TikTok ban",
        "description": "Trump says that he could negotiate a 'political resolution' for TikTok if the high court intervenes.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Trump sides with tech bosses in Maga fight over immigrant visas",
        "description": "Cracks have appeared among Trump supporters over the stand taken by Elon Musk and Vivek Ramaswamy.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "S Korean crypto-boss Do Kwon to be extradited to US",
        "description": "The man behind the collapse of terraUSD and Luna tokens faces fraud charges in the United States.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "US sanctions billionaire founder of Georgia Dream party",
        "description": "State secretary Antony Blinken accuses Bidzina Ivanishvili of undermining democracy to Russia's benefit.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "China to build world's largest hydropower dam in Tibet",
        "description": "The project has stoked concerns about displacement and environmental impact downstream in India and Bangladesh.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Panama's president calls Trump's Chinese canal claim 'nonsense'",
        "description": "The president-elect has threatened to take back control of the Panama Canal, alleging Chinese interference.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Manmohan Singh, Indian ex-PM and architect of economic reform, dies at 92",
        "description": "Manmohan Singh was instrumental in bringing India out of economic and nuclear isolation.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "London's disappeared department stores of days gone by",
        "description": "Here are some of the capital's retail behemoths of the time, now gone from the streets.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "The Nigerian watch-lover lost in time",
        "description": "For years repairing watches was a booming business, but a Kaduna horologist  now has time on his hands.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "'I work alone in my pub because of staff shortages'",
        "description": "Hotel and restaurants say they are struggling to attract enough staff.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "'Home swap holidays with strangers have shown us a different world'",
        "description": "Home exchanges give travellers the chance to experience someone else's way of life abroad.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Finland investigates Russia 'shadow fleet' ship after cable damage",
        "description": "Finland is investigating a tanker following the rupture of a transmission cable in the Baltic Sea.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "UK High Street suffers Boxing Day hit as shoppers stay home",
        "description": "Boxing Day shoppers stay away from the High Street and shopping malls compared with 2023, data shows.",
        "source": "BBC Business",
        "fetched_date": "2024-12-30T07:24:59.424989"
    },
    {
        "title": "Hannah Berner Clarifies Her Blake Lively Joke Was Filmed Before Legal Action Against Justin Baldoni",
        "description": "The comedian took part in Netflix's new comedy special, 'Torching 2024: A Roast of the Year,' which included a joke about the actress.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Historic Morrison Hotel Made Famous by The Doors Destroyed in Fire",
        "description": "The four-story Los Angeles landmark with a troubled history went up in flames Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Music Company SALXCO Elevates Lindsay Unwin to CEO, Appoints Co-Presidents (Exclusive)",
        "description": "With the internal promotions, founder Wassim “Sal” Slaiby will shift his focus to “high-level projects and new business growth.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Judge Denies Jay-Z’s Efforts to Dismiss Rape Accuser’s Lawsuit",
        "description": "Judge Analisa Torres also ruled Thursday that the Alabama woman accusing the rapper of raping her in 2000 could proceed anonymously at this early stage of the litigation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Bad Bunny Announces New Album, ‘Debí Tirar Más Fotos,‘ Set for Early January Release",
        "description": "According to the Puerto Rican singing sensation's Christmas Day post on X, fans can expect 17 bomba tracks — or “explosive hit songs.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Justin Baldoni Podcast Episode Deleted After Blake Lively Allegations, Elizabeth Day Says",
        "description": "The 'It Ends With Us' director and actor at the center of a legal complaint from co-star Blake Lively appeared on the 'How to Fail' podcast earlier this month.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Hallmark Actor John Reardon Reveals He’s Recovering From Tonsil Cancer, Thanks Wife for “Taking on Our Whole World”",
        "description": "The 'Believe in Christmas' star enjoyed his first night out for the holidays since his recovery.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Critic’s Notebook: Mariah Carey’s Christmas Tune Could Become the Greatest Song of All Time",
        "description": "Here's why \"All I Want for Christmas Is You,\" which reemerges on the charts each holiday season, is on track to become the most successful song ever released.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Child Actor Hudson Meek, Known for ‘Baby Driver’ Role, Dies at 16",
        "description": "The Alabama native died in a hospital over the weekend after falling from a moving vehicle last week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Beyoncé Sleighs at Netflix Christmas Day Halftime Show with Post Malone, Shaboozey and Blue Ivy",
        "description": "The pop superstar gave a top-notch performance of songs from her country album 'Cowboy Carter.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "The Perfect K-Pop Songs for Your Christmas Day Playlist",
        "description": "From the Red Velvet and aespa collaboration “Beautiful Christmas” to Stray Kids’ instant classic “Christmas EveL,” these are the best songs K-Pop songs to add to your holiday playlist.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "Richard Perry, Record Producer Behind ‘You’re So Vain’ and Other Hits, Dies at 82",
        "description": "The hitmaking record producer behind many successes — including a Ringo Starr album featuring all four Beatles — died on Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-30T07:25:00.601022"
    },
    {
        "title": "UMPIRES SPRAYED: Sparks fly as young gun loses his cool",
        "description": "A hugely controversial DRS review sparked a dramatic collapse as Australia sealed a famous victory late on day five at the MCG.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Aussie record shattered as fans flock to MCG",
        "description": "A record that has stood since Don Bradman graced the crease has finally been broken during the gripping Boxing Day Test at the MCG.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "‘Never thought I’d be back’: Australia’s greatest showman returns",
        "description": "Nick Kyrgios thinks it’s a miracle he’s, again, playing tennis at a professional level. And Australians fans can count themselves lucky that the game’s great entertainer made it back to the top.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "City’s injury list grows",
        "description": "Melbourne City has been hit with more injuries heading into Tuesday’s battle with Central Coast Mariners in Gosford.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "UMPIRES SPRAYED: Sparks fly as young gun loses his cool",
        "description": "A hugely controversial DRS review sparked a dramatic collapse as Australia sealed a famous victory late on day five at the MCG.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Australia win epic MCG Test in thrilling, controversial fashion",
        "description": "Australia have claimed a thrilling victory in Melbourne, thanks to an Indian collapse in the final session. They now lead the series 2-1 heading to Sydney after a day not without controversy.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "‘Never thought I’d be back’: Australia’s greatest showman returns",
        "description": "Nick Kyrgios thinks it’s a miracle he’s, again, playing tennis at a professional level. And Australians fans can count themselves lucky that the game’s great entertainer made it back to the top.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Lleyton Hewitt’s son Cruz stuns tennis world",
        "description": "Everyone is saying the same thing about Cruz Hewitt after the 16-year-old took on a much older foe at the Canberra International.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "WAG’s Christmas post sets internet alight",
        "description": "An influencer labelled “Australia’s hottest WAG” has set the internet alight as she stripped down to enjoy Christmas Day.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "$145m star causes uproar with Christmas pic",
        "description": "A sweet family photo has sparked widespread outrage with a $145 million star facing an ugly backlash from his biggest fans.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Mam’s Broncos penalties finally revealed",
        "description": "The Broncos have revealed the club’s own actions after the five-eighth was alleged to have breached the NRL Code of Conduct.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Footy star marries teammate’s sister",
        "description": "Manly Sea Eagles star Jake Trbojevic has tied the knot with a teammate’s sister in a wedding attended by NRL stars.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Swift’s BF’s insane $190k Christmas haul",
        "description": "After reeling from a “frustrating” personal nightmare at home, Travis Kelce has been showered with an almighty Christmas bonanza that left him speechless.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Matildas star melts internet with big news",
        "description": "Matildas gun Charli Grant has sent her teammates into meltdown after dropping news of her engagement on Boxing Day,",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Trade means more headaches for Simmons",
        "description": "Ben Simmons’ career has again been plunged into uncertainty after his NBA team pressed the trigger on a surprise trade.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Has a massive injury opened the door for a new Super Bowl favourite?",
        "description": "With three weeks left in the NFL season, there’s a new Super Bowl favourite: with a longtime nemesis injured, can it turn around years and years of losing?",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "City’s injury list grows",
        "description": "Melbourne City has been hit with more injuries heading into Tuesday’s battle with Central Coast Mariners in Gosford.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Matildas star married in spectacular scenes",
        "description": "Glamorous photos of Matildas players celebrating their star teammate’s wedding day have leaked out as Sam Kerr let her hair down.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Boxing world stunned as champ dies at 35",
        "description": "There has been a stunned reaction as boxer Paul Bamba has died just days after he won his first world championship belt.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Schumacher reveals massive family news",
        "description": "Formula One legend Michael Schumacher’s daughter has shared some beautiful news about their family, months after her wedding.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Hallway scuffle erupts in NBL Christmas night thriller",
        "description": "The Sydney Kings’ Christmas night clash with Illawarra Hawks got off to a hot start — and it kept heating up with reports referees had to separate players during a hallway scuffle.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Australia bans professional trans golfer",
        "description": "Transgender golfer Breanna Gill, who won last year’s Australian Women’s Classic, is about to be kicked off the WPGA Tour.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "A rejuvenated High Blue Sea storms home to victory",
        "description": "Having a successful association for over 30 years, trainer Gerald Ryan knows when Nash Rawiller is confident, you chances increase and that was the case with High Blue Sea at Randwick.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Rookie Reds prop in Wallabies training squad",
        "description": "An emerging Queensland Reds prop has been included in a 40-man Wallabies training squad.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "NRL star’s heartwarming baby joy",
        "description": "An NRL star has stunned with a huge announcement – revealing a new addition to his family in a heartwarming Instagram post.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-30T07:25:03.857156"
    }
]