[
    {
        "title": "Iconic firm Campbell Soup set to drop soup from name",
        "description": "Executives at the 155-year old firm plan to change its name to reflect its growing line of products.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "UK sells peaches from Fukushima nuclear disaster region",
        "description": "Harrods' sale of the fruit is part of efforts to restore trust after the 2011 radiation leak.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "GB News owner buys Spectator magazine for £100m",
        "description": "The right-leaning political magazine has been sold to the hedge fund tycoon Sir Paul Marshall.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Billionaire takes off for first ever private spacewalk",
        "description": "The mission is the first of three funded by payments processing business founder Jared Isaacman.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Grand Theft Audio? The tricky business of music and gaming",
        "description": "How much is a song worth? That's the question after Rockstar Games butts heads with an 80s pop star.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "UK sells peaches from Fukushima nuclear disaster region",
        "description": "Harrods' sale of the fruit is part of efforts to restore trust after the 2011 radiation leak.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Apple told to pay Ireland €13bn in tax by EU",
        "description": "The European Court of Justice upheld a 2016 decision that said Apple received unlawful aid from Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Sony reveals much more expensive and powerful PlayStation 5 Pro",
        "description": "UK gamers will have to shell out £699.99 when the upgraded console launches on 7 November.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "EU court rules Google must pay €2.4bn fine",
        "description": "Google loses its appeal against the fine, handed down for its shopping comparison service.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "GB News owner buys Spectator magazine for £100m",
        "description": "The right-leaning political magazine has been sold to the hedge fund tycoon Sir Paul Marshall.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "UK state pension set to rise by £460 next year",
        "description": "The latest figure comes as the government faces a backlash over cutting winter fuel payments for most pensioners.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Apple banks on AI to boost sales of new iPhone 16",
        "description": "The firm says its new handset has been built for artificial intelligence as it looks to regain its edge.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "'A lot of red flags': Fyre Festival investor fears reboot disaster",
        "description": "Fraudster Billy McFarland says Fyre II will take place next year. His former business partner says it's not looking good.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "'Grim' September ahead with 6,000 steel and oil jobs to go in UK",
        "description": "The BBC understands the government is bracing itself for a tough month as workers face losing their jobs",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Online overtakes TV in survey of UK news habits",
        "description": "Ofcom survey suggests 71% of the population said they now use online services for news.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "EU facing existential risk without investment - report",
        "description": "The long-awaited report paints a bleak picture days ahead of the EU's new top team being confirmed.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "UK economy fails to grow for second month in a row",
        "description": "It comes after no growth in June and despite forecasts of slight growth of 0.2%.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "How much is the winter fuel payment and how can I still claim it?",
        "description": "Plans to change winter fuel payments have highlighted the problem of unclaimed pensioner benefits.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "New oil and gas ban threatens jobs, unions warn",
        "description": "Unite and the GMB say fossil fuels should not be abandoned until workers know how their jobs will be protected.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "More bus services could come under control of councils",
        "description": "Transport Secretary Louise Haigh promises to deliver a \"bus revolution\" that will save vital routes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Asos shoppers hit out at new £3.95 returns charge",
        "description": "The company said it was introducing a charge for customers with a \"frequently high return rate\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Aldi shoppers trade up to Wagyu steak and brioche buns",
        "description": "The supermarket reveals it made an extra £2.4bn in sales in 2023, despite now facing a slowdown in growth.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Boeing offers staff 25% pay hike in bid to avoid strike",
        "description": "The tentative deal comes just days ahead of a possible strike at the plane maker's main factories.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "'Without emergency government fund, I wouldn't be here'",
        "description": "The BBC hears from those who have used the Household Support Fund, which has been extended until April 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Chinese giant Chery could build cars in UK",
        "description": "Chery is weighing up the possibility of building cars in the UK, according to a senior executive.",
        "source": "BBC Business",
        "fetched_date": "2024-09-11T07:21:50.940172"
    },
    {
        "title": "Louisiana braces as Hurricane Francine barrels in",
        "description": "State orders evacuations and closes schools as it prepares for hurricane's landfall on Wednesday as a Category 2 storm.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-11T07:21:51.008674"
    },
    {
        "title": "Casey Wasserman Reveals Tom Cruise’s Payday for Death-Defying Olympics Stunt: Nothing",
        "description": "It’s been a month since Tom Cruise stole the show during the Paris Olympics closing ceremony, and people are still talking about it. By people, at least one person (today) and it’s precisely the guy you still want to hear from right about now: Casey Wasserman. The mogul, who serves as LA28 president and chairperson, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Dave Grohl Reveals Birth of Daughter Born Outside Marriage, Says He’s Working to Regain Family’s Trust",
        "description": "Foo Fighters musician Dave Grohl announced Tuesday he recently welcomed a new daughter born outside of his marriage. “I plan to be a loving and supportive parent to her,” Grohl wrote in a statement on social media. Grohl married his second wife, Jordyn Blum, in 2003. They share three daughters. “I love my wife and […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Halsey Wrote Britney Spears a Letter Before Using “Lucky” in New Album (Exclusive)",
        "description": "Halsey asked for permission the old-fashioned way when sampling Britney Spears’ “Lucky” for her new album: She wrote the ’90s pop star a letter. “She was so supportive out the gate,” Halsey says in The Hollywood Reporter‘s exclusive preview of the newest episode of the Sauce on the Side with Gandhi podcast, out Wednesday. Halsey adds […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Beyoncé Confirms ‘Cowboy Carter’ and ‘Renaissance’ Will Not Get Visual Albums",
        "description": "Beyoncé fans won’t get to see Cowboy Carter and Renaissance music videos anytime soon. In a rare interview with GQ, Beyoncé explained that following her various visual albums, including for her self-titled LP and Lemonade, she decided to not accompany her latest releases with visual components. “I thought it was important that during a time […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "‘Eyes of Tammy Faye’ Actor Gabriel Olds Charged With Five Additional Counts of Sexual Assault",
        "description": "Five additional sexual assault charges were filed against actor Gabriel Olds in Los Angeles this week related to claims brought by three new victims.  Olds, whose credits include Six Feet Under, NCIS and The Eyes of Tammy Faye, was charged one count of forcible rape, two counts of forcible oral copulation, one count of sexual […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Chappell Roan Explains Experiences With Stalker, Aggressive Fans After Calling Out “Predatory Behavior”",
        "description": "Chappell Roan is opening up about her experiences with a stalker and other aggressive fans following her strong message asking people to respect her boundaries. In a Rolling Stone profile, the pop star shared she has a stalker, who she had met in her home state of Missouri. The situation had grown severe, as the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Harvey Weinstein Resting and “Weak” After Being Rushed to Hospital for Heart Surgery",
        "description": "Harvey Weinstein was taken to Bellevue Hospital in New York on Sunday night and underwent heart surgery Monday.  According to Weinstein’s representatives, Craig Rothfeld and Juda Engelmayer, Weinstein was “rushed” to the hospital “due to several medical conditions.” On Tuesday, Engelmayer said Weinstein was resting after surgery and “weak.” “We can confirm that Mr. Weinstein […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Civil Rights Group Color of Change Calls Out CMA Awards for Beyoncé Snub (Exclusive)",
        "description": "Racial justice nonprofit Color of Change is calling out the Country Music Association for snubbing Beyoncé at its 2024 awards show. Despite having an uber-successful No. 1 album and single on both the country and pop charts — with Cowboy Carter and “Texas Hold ‘Em” — the Grammy-winning star was completely shut out of the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Another UFO Boss to Break Silence in Major Book Deal: “The Process of Disclosure Has Begun”",
        "description": "Another high-ranking government official who investigated UFOs/UAPs is ready to tell their story. Jay Stratton, the former director of the U.S. government’s secretive Unidentified Aerial Phenomena Task Force, has struck a memoir deal with HarperCollins. Stratton represents the most senior former U.S government official yet to go public about their direct involvement in the investigation […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "Hitmaker for Ariana Grande, The Weeknd Launches Company to Support Songwriters in India (Exclusive)",
        "description": "Grammy- and Oscar-nominated songwriter Savan Kotecha, who has crafted hits for Ariana Grande, The Weeknd and Britney Spears, is launching a platform to help songwriters in India reach global audiences. Kotecha, who is Indian, is partnering with A&R executive and songwriter Murtuza Gadiwala and talent management company REPRESENT to launch Outwrite. Kotecha’s mission with the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "DNC Unveils Youth Voter Push on Debate Day: “Google Project 2025”",
        "description": "The Democratic National Committee, on Tuesday, messaged to over 100,000 Philadelphia-area students to “Google Project 2025.” Ahead of the night’s Kamala Harris-Donald Trump debate in Philadelphia, Pennsylvania, students at Drexel University, Lafayette College, Temple University, University of Pennsylvania and Widener University were greeted with new campus kiosks, billboards, flyers and a mobile billboard video in […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "TIFF: Anti-Netanyahu Film Premiere Goes Forward in Toronto After Court Motion Fails",
        "description": "After facing a failed attempt by the government of Benjamin Netanyahu to block their world-premiere screening, the filmmakers behind the anti-Netanyahu documentary The Bibi Files carried on Monday night debuting their work at the Toronto International Film Festival with a mix of grim resolve and giddy triumph. Alexis Bloom’s film, which builds its case against […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-11T07:21:51.211099"
    },
    {
        "title": "InMobi secures $100 million for AI acquisitions ahead of IPO",
        "description": "Adtech startup InMobi has raised $100 million in debt financing as the profitable Indian firm looks to “significantly deepen” its artificial intelligence initiatives and fund potential AI acquisitions ahead of…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Sergey Brin says he’s working on AI at Google ‘pretty much every day’",
        "description": "Google co-founder and ex-Alphabet president Sergey Brin said he’s back working at Google “pretty much every day” because he hasn’t seen anything as exciting as the recent progress in AI…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Beats makes iPhone 16 cases now",
        "description": "The $49 cases work with MagSafe and the iPhone’s new Camera Control button.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Senate leaders ask FTC to investigate AI content summaries as anti-competitive",
        "description": "A group of Democratic senators is urging the FTC and Justice Department to investigate whether AI tools that summarize and regurgitate online content like news and recipes may amount to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Neurode wants to treat and track ADHD symptoms through a wearable headband",
        "description": "Sydney-based Neurode has come up with a novel way to offer some relief to people with ADHD: a wearable headband that can track and treat ADHD symptoms. And you only…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Bumble to leverage AI to help users with profile creation and conversations",
        "description": "Bumble is increasing its investments in AI and branching out with new features to stay relevant amid a generational shift in dating behavior among younger users. During Goldman Sachs’ annual technology…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "The real power of Apple Intelligence will show up in third-party apps",
        "description": "Apple Intelligence, the iPhone maker’s new set of AI capabilities arriving in iOS 18, is laying the groundwork for a new way to use apps. Today, the dated App Store…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "SpaceX calls out ‘superfluous’ regulatory delays holding up Starship flights",
        "description": "SpaceX has launched its most public and aggressive offensive against regulators to date, with a blog post published Tuesday urging more expeditious launch licensing — lest the country lose its…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "What is Bluesky? Everything to know about the app trying to replace Twitter",
        "description": "Is the grass greener on the other side? We’re not sure, but the sky is most certainly bluer. It’s been almost two years since Elon Musk purchased Twitter, now X,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Apple Watch blood oxygen detection won’t be available on the Series 10 in the US",
        "description": "Apple has not discussed whether the feature’s removal was a hardware change on the Series 10 or if it was simply disabled via the software, like with the Series 9.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Drybaby is a dating app for the ‘sober curious’ movement",
        "description": "Drybaby is the newest dating app designed for singles who are sober or interested in reducing their alcohol consumption.  The app arrives as 41% of Americans are cutting back on…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Google Gemini: Everything you need to know about the generative AI models",
        "description": "Gemini is Google’s long-promised, next-gen generative AI model family.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "London’s transit agency drops claim it has ‘no evidence’ of customer data theft after hack",
        "description": "The London transport authority removes a claim that said there was no evidence that customer data was compromised during a recent hack.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Here’s how the new AirPods Pro hearing test works",
        "description": "Hearing Test will be built into iOS 18, though Apple is currently awaiting FDA approval for both it and the newly announced hearing aid feature before launch.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "iPhone 16, Apple Intelligence, AirPods 4 and more: Everything revealed at Apple Event 2024",
        "description": "Apple’s lineup of announcements echoed many of the anticipated hardware reveals, including the new iPhone 16, AirPods 4, the Apple Watch Series 10 and more.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Apple punts on AI",
        "description": "One would have expected that “Apple’s first phone made from the ground up for Apple Intelligence” would justify being so.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Finally, a bunch of SMB-focused fintechs get investor love while M&A activity heats up",
        "description": "Welcome to TechCrunch Fintech! It’s finally cooling down here in my home base of Austin, Texas, and that makes me happy. In this week’s newsletter, we’re looking at a big…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Huawei’s $2,800 triple-screen phone laughs at your puny foldable",
        "description": "The Mate XT Ultimate Design costs roughly $2,800 and is only available in China for now.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "French embedded insurance startup Neat secures $55 million",
        "description": "Neat helps other companies sell insurance products to their own customers. In insurance lingo, it focuses on affinity insurance contracts linked to another service or product.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "EV warranty startup Amber launches a remote diagnostic service for Teslas",
        "description": "EV warranty startup Amber is expanding nationwide, bringing on new vehicles and offering a new remote diagnostic scan — all signs that the one-year-old company is putting its recent $3.18…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-11T07:21:51.476822"
    },
    {
        "title": "Gus comes clean on Addo-Carr stand down",
        "description": "Phil Gould has left the door open for Josh Addo-Carr to play in the 2024 finals series after standing himself down amid his drug drama.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Played his last game’: AFL bombshell stuns",
        "description": "Bombers star Jake Stringer’s time at Essendon appears to already be over after an ugly contract standoff took a huge twist.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "UFC 308: Title contender confirms billionaire buddy’s VIP appearance",
        "description": "He’s on a 10-fight winning streak, is fighting for the bantamweight title, and Merab Dvalishvili has confirmed a big name presence will be cageside this weekend.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Vital leader’: Dogs re-sign smalls",
        "description": "As they brace for the departures of more senior players, the Western Bulldogs have locked away an important defender.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Played his last game’: AFL bombshell stuns",
        "description": "Bombers star Jake Stringer’s time at Essendon appears to already be over after an ugly contract standoff took a huge twist.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Vital leader’: Dogs re-sign smalls",
        "description": "As they brace for the departures of more senior players, the Western Bulldogs have locked away an important defender.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Gus comes clean on Addo-Carr stand down",
        "description": "Phil Gould has left the door open for Josh Addo-Carr to play in the 2024 finals series after standing himself down amid his drug drama.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Cleary set to face the ultimate test",
        "description": "Nathan Cleary has spent the past two weeks testing out his injured shoulder, but nothing can properly prepare him for an Angus Crichton barrage.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Aussie in strife over ugly scene",
        "description": "Aussie cricket star Marnus Labuschagne was charged with dissent after raging over an umpires decision in a Brisbane grade cricket match.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘No pressure’ on dynamo after Scottish flop",
        "description": "Two ducks in three innings against Scotland wasn’t a great start amid lots of hype and expectation for Jake Fraser McGurk.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Did it again’: Hewitt’s bold plan pays off",
        "description": "With no Alex de Minaur at the Davis Cup, Australia needed others to step up, and three of them did.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Awfully tough’: Aussies’ Davis Cup blow",
        "description": "The US Open doubles champions and red-hot Alexei Popyrin will lead the Australian Davis Cup charge in Spain after an injury blow.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Monster’: F1 champ spits the dummy",
        "description": "F1 golden boy Max Verstappen has made a candid admission that could produce the massive upset some fans have been waiting for.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Lambo Guy’ reveals shock new investment",
        "description": "Self-made billionaire and Aussie car nut Adrian “Lambo Guy” Portelli has revealed his next big investment.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Ex-NRL star’s horror driving record revealed",
        "description": "A court has heard details of controversial former NRL star John Hopoate’s shocking driving record as he lost an appeal to have his licence reinstated.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Transformed Hollywood star unrecognisable",
        "description": "A former WWE heavyweight champion turned Hollywood star has left jaws on the floor after showing off his body transformation.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Coach breaks down over NFL star’s arrest",
        "description": "Footage of an NFL superstar’s police confrontation has been released, with his coach getting emotional addressing the incident.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Star’s wife’s heartbreaking eulogy reveal",
        "description": "There have been distressing scenes as the wives of killed brothers revealed devastating pregnancy news as the duo were laid to rest.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Dominating’: Socceroos whiz-kid’s ultimate aim",
        "description": "It was only the woodwork that denied teenage sensation Nestory Irankunda a memorable goal for the Socceroos against Indonesia.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Common theme’ haunting Socceroos",
        "description": "Matches next month against China and Japan have taken on extra importance for the Socceroos after their disappointing start to the latest round of World Cup qualifiers.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "UFC 308: Title contender confirms billionaire buddy’s VIP appearance",
        "description": "He’s on a 10-fight winning streak, is fighting for the bantamweight title, and Merab Dvalishvili has confirmed a big name presence will be cageside this weekend.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "LIV gun’s big Aussie commitment",
        "description": "After earning a golden ticket to the Masters via his win in Sydney last year, the Australian Open champion is coming back for more.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "No Go Zone: Players to avoid in SuperCoach NBL",
        "description": "He’s a four-time NBL MVP and the top points scorer in SuperCoach last season. But is Wildcats superstar Bryce Cotton really worth the big bucks?",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "Body found in search for rugby legend’s wife",
        "description": "Police have made a tragic discovery in the search for a rugby legend’s wife after she vanished going for a group swim.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Humiliating’: Wallabies torn to shreds",
        "description": "Australia has fallen apart on the international stage with the Wallabies imploding in spectacular fashion on Sunday morning.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "FIELDS: Group 1 winners galore in Makybe Diva Stakes",
        "description": "Some of Australia’s best weight-for-age gallopers will clash in a star studded Makybe Diva Stakes at Flemington on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-11T07:21:53.352975"
    }
]