[
    {
        "title": "US House narrowly passes Trump-backed spending bill",
        "description": "It is still several steps from becoming law, but marks a major victory for Republican House Speaker Mike Johnson.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Billion Indians have no spending money - report",
        "description": "India's population is 1.4 billion but its consuming class is only 140 million, or about as big as Mexico.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Apple boss says its DEI programmes may change",
        "description": "His comments came as shareholders rejected a call for the firm to consider ending its diversity practices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Trump orders copper probe in first step to tariffs",
        "description": "The White House said the metal was vital to national security.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Billion Indians have no spending money - report",
        "description": "India's population is 1.4 billion but its consuming class is only 140 million, or about as big as Mexico.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Ukraine official says minerals deal  agreed with US",
        "description": "Donald Trump says the deal would give Ukraine \"the right to fight on\" in its war with Russia.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "BP to slash green investment and ramp up gas and oil",
        "description": "The energy giant will announce its strategy later after rivals also rowed back on green energy plans.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Who is Doge's official leader? White House says it's not Musk",
        "description": "The agency known as \"Doge\" is Musk's brainchild, but the White House insists that he is not its leader - or even employed by it.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Countries compete to keep skilled young workers",
        "description": "EU nations hope that tax benefits might encourage young, skilled workers to stay, but will they work?",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Why is Ukraine negotiating a minerals deal with the US?",
        "description": "A minister says nearly all key details have been finalised for a deal giving the US access to the country's minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Tesla shares slump after European sales fall",
        "description": "Shares in the US electric carmaker dropped after European sales halved in January.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Myanmar villagers reveal 'desperate' illegal kidney sales",
        "description": "Two Burmese men tell the BBC they used forged documents and middlemen to undergo surgery in India.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Major Asia bank to cut 4,000 roles as AI replaces humans",
        "description": "It makes DBS one of the first major banks to offer details on how AI will affect its operations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Theranos founder Elizabeth Holmes loses fraud appeal",
        "description": "Holmes was sentenced to more than 11 years in prison for defrauding investors in her blood-testing company.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Putin offers Russian and Ukrainian rare minerals to US",
        "description": "The proposal to give the US access to minerals would also include those from territories taken from Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Apple commits to $500bn US investment",
        "description": "The iPhone giant's $500bn investment plan includes a new factory in Texas, as well as money spent on suppliers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Federal workers left confused as Musk doubles down on threat",
        "description": "Employees get conflicting advice over compliance with a Musk-backed order to list their last week's work or face termination.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Starbucks cuts English breakfast latte in menu shake-up",
        "description": "It is also simplifying the menu, including dropping the Royal English Breakfast Latte in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "'Thank God for Elon Musk' - Maga Republicans praise Doge cuts",
        "description": "The BBC asked Trump supporters what they make of the controversial advisory body.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Greenpeace risks bankruptcy at US pipeline trial",
        "description": "The lawsuit stems from the Standing Rock protests against the Dakota Access Pipeline eight years ago.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Historic visual effects studio Technicolor collapses in UK",
        "description": "The company's UK entity has filed for administration, with 'the majority' of its UK staff made redundant.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "UK and India relaunch trade talks in Delhi",
        "description": "British trade secretary Jonathan Reynolds met his Indian counterpart Piyush Goyal in Delhi on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Key US agencies tell staff not to answer Musk email on what they did last week",
        "description": "Some departments encouraged staff to respond, while others requested employees wait for further guidance.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "List weekly accomplishments or resign, Musk tells US federal workers",
        "description": "The weekend email comes as Elon Musk leads an effort to aggressively curtail the government workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "Can Canadians get the world drinking tree sap?",
        "description": "The largest producer of maple syrup now wants you to drink the sap, which it calls maple water.",
        "source": "BBC Business",
        "fetched_date": "2025-02-26T07:23:25.027444"
    },
    {
        "title": "SAG Awards: “Very Worried” Michael Urie, Hopeful Lily Gladstone Respond to Trump Attacks on DEI Initiatives",
        "description": "\"America is a big DEI experiment,\" the 'Killers of the Flower Moon' star said, as she remained optimistic that Hollywood will continue to tell diverse stories. \"When there's something to resist, a lot of times it turns up the creativity.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "AP Will Remain Banned From White House Press Pool Following “Gulf of Mexico” Dispute",
        "description": "The judge, a Trump appointee, noted that he will consider a request for a preliminary injunction and advised the Trump administration to reconsider their position.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Jewish Hollywood Protests Artists4Ceasefire Pins After Bibas Bodies Release: “Have You No Shame?”",
        "description": "The Brigade, representing some 700 producers, filmmakers, agents, managers, publicists, executives, actors and actresses, is taking issue with a letter encouraging attendees of the 2025 Academy Awards to wear a controversial emblem.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "American Music Awards Set Memorial Day Return on CBS",
        "description": "The ceremony last aired on ABC in 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Roberta Flack, Soulful “Killing Me Softly With His Song” Performer, Dies at 88",
        "description": "The singer, pianist and four-time Grammy winner had two other No. 1 hits with \"The First Time Ever I Saw Your Face\" and \"Feel Like Makin' Love.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "German Conservatives Win Historic Election, Far-Right Vote Doubles",
        "description": "Germany now faces weeks to months of negotiations as the conservatives, under presumptive Chancellor-to-be Friedrich Merz, try to form a government collation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "‘Wicked,’ ‘A Complete Unknown’ Among 2025 Guild of Music Supervisors Awards Winners",
        "description": "‘Sing Sing,’ ‘Baby Reindeer’ and ‘Agatha All Along’ also picked up honors, and ‘Wicked’ creator Stephen Schwartz accepted the Icon Award.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Jane Fonda Calls for Actors to “Resist” and “Project an Inspiring View of the Future” Amid Current Political Climate",
        "description": "The two-time Oscar winner, receiving the SAG Awards Life Achievement Award, spoke about the need for empathy and community, earning loud applause and cheers when she said, \"Woke just means you give a damn about other people.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "2025 NAACP Image Awards: Keke Palmer Named Entertainer of the Year as ‘The Six Triple Eight’ Nabs Two Wins",
        "description": "The Deon Cole-hosted ceremony honored former Vice President Kamala Harris, Dave Chappelle and the Wayans family.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Kamala Harris Urges Collective Action in Troubled Time at NAACP Image Awards: “We Have No Illusions About What We Are Up Against”",
        "description": "The former vice president, who received an enthusiastic show of support as she accepted the Chairman's Award, said, \"This chapter will not be written simply by whoever occupies the Oval Office nor by the wealthiest among us. The American story will be written by you, written by us, by we the people.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Spirit Awards: Justin Simien Shares Plan for “Stopping the White Nationalist Coup Taking Over This Country”",
        "description": "The writer-director, who won best new nonscripted or documentary series for 'Hollywood Black,' delivered one of a handful of political comments during Saturday's awards show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Do Couples That Sing Together Stay Together? Tate McRae and The Kid Laroi, Sonny & Cher and More Star-Studded Duets",
        "description": "From Beyoncé and Jay-Z to Camila Cabello and Shawn Mendes, take a look at the celebrity couples who have recorded songs together.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-26T07:23:25.276313"
    },
    {
        "title": "Sheargold’s entire show pulled after backlash",
        "description": "Marty Sheargold and his embattled team have not gone to air as the fallout continues from his “disgusting” comments about the Matildas.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Daughter of top NRL official missing",
        "description": "Police are calling for public assistance to locate ex-NRL referee Gavin Badger’s daughter Shante, who vanished last week.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Cop admits to lying in NRL star’s case",
        "description": "A former police officer has pleaded guilty to giving false evidence during an NRL star’s sexual assault criminal proceedings, a court has been told.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Boost for Reds as Wallabies star returns",
        "description": "It has been a long wait for Reds star Liam Wright, but the Queensland flanker is finally ready to return from a shoulder injury.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Young gun to trust short-ball approach",
        "description": "Victoria opener Harry Dixon knows the short ball is a double-edged sword – his strength and, at times, his downfall.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "‘Simple’ equation for wary Aussies",
        "description": "A semi-final berth at the ICC Champions Trophy awaits Australia if Steve Smith’s team can beat Afghanistan.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Raducanu’s security move amid frightening incident",
        "description": "Emma Raducanu’s security has been revamped after the English tennis star was allegedly followed across four countries by her stalker",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "De Minaur’s $10m gamble horribly backfires",
        "description": "Aussie tennis star Alex de Minaur has been left to ponder what could have been after a risky call proved incredibly costly.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "How Power will cover injured superstar",
        "description": "Port Adelaide faces a major challenge with the loss of Zak Butters but is confident in its depth to cover the superstar’s absence.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Eagles skipper’s sacrifice to lure star Swan",
        "description": "West Coast Eagles co-captain Liam Duggan says he’d gladly make way in the club’s midfield if it meant securing one of the competition’s brightest young players.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Daughter of top NRL official missing",
        "description": "Police are calling for public assistance to locate ex-NRL referee Gavin Badger’s daughter Shante, who vanished last week.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Cop admits to lying in NRL star’s case",
        "description": "A former police officer has pleaded guilty to giving false evidence during an NRL star’s sexual assault criminal proceedings, a court has been told.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "‘It’s greed’: Footy divided over $1.2m trend",
        "description": "“Exciting” AFL and NRL off-seasons with more player movement than ever has exposed a modern new reality about the footy codes.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "NFL team torched as Trump rumours swirl",
        "description": "There has been an angry backlash against the Super Bowl champions with the team told to “go f*** yourselves” over Donald Trump rumours.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Sheargold’s entire show pulled after backlash",
        "description": "Marty Sheargold and his embattled team have not gone to air as the fallout continues from his “disgusting” comments about the Matildas.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "‘Unnecessary’ comments won’t faze Matildas",
        "description": "The Matildas aren’t being distracted from their task of beating Colombia despite “over the edge” comments made by a leading radio presenter.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Aussie’s career derailed by latest defeat",
        "description": "Aussie Jason Moloney faces a long climb back into world title contention after suffering his second straight loss on Japanese soil.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Clean sweep: Waters the driver to beat after wet and wild win",
        "description": "Cam Waters has produced a stellar opening round clean sweep on a wet and wild Sydney track, claiming all three race wins to stamp himself as the driver to watch this season.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Driver fined, relegated to last after embarrassing teammate crash",
        "description": "Teammates Aaron Love and James Courtney were involved in a bizarre collision at the start of Supercars qualifying which left their team principal fuming.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "‘Crazy’ moment lifts Voke to Webex Players Series Sydney",
        "description": "Nick Voke continued New Zealand’s recent golden run on the PGA Tour of Australasia, taking out the Webex Players Series Sydney title. And there’s a moment the part-time content creator is keen to watch back.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Wyong, Armidale previews: Remlaps commands attention",
        "description": "With a solid first-up run from a long injury lay-off under his belt, trainer Scott Singleton expects Remlaps Commander to prove very competitive when he heads at Wyong.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Boost for Reds as Wallabies star returns",
        "description": "It has been a long wait for Reds star Liam Wright, but the Queensland flanker is finally ready to return from a shoulder injury.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Suaalii sidelined for Tahs in fresh $5m blow",
        "description": "Superstar NRL convert Joseph-Aukuso Suaalii has been sidelined for the NSW Waratahs after being injured in the opening round of the Super Rugby season.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Legend’s daughter’s big news after break-up",
        "description": "The daughter of a football icon has announced big personal news after her split from disgraced NRL player Brett Finch.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    },
    {
        "title": "Teen crushed to death in horror gym accident",
        "description": "Graphic Warning: Gym goers have been left shaken after a teenager was crushed to death in a shocking weightlifting accident.",
        "source": "News AU",
        "fetched_date": "2025-02-26T07:23:26.563559"
    }
]