[
    {
        "title": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu",
        "description": "Chinese online retailers had previously relied on the \"de minimis\" loophole to ship low-value items to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Markets rise as US and China agree to slash tariffs",
        "description": "Shares jump as markets welcome news of a major de-escalation of the trade conflict between the two nations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Analysis: US and China step back from beyond brink",
        "description": "It is not an end to the trade war, but it is a significant truce, writes the BBC's economics editor.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "China has come to the table - but this fight is far from over",
        "description": "Beijing can claim its defiance has delivered a battle victory in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Markets rise as US and China agree to slash tariffs",
        "description": "Shares jump as markets welcome news of a major de-escalation of the trade conflict between the two nations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "What does the US-China tariff deal mean?",
        "description": "The agreement marks a major de-escalation of the trade war between the world's two biggest economies.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Gold is booming – but how safe is it for investors, really?",
        "description": "Trade wars and volatile markets have contributed to a gold rush, but investors shouldn't put all their eggs in this one basket, warn experts",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Trump's order on US drug prices: What's in it, and will it work?",
        "description": "The president promises sweeping price cuts \"almost immediately\", but experts say these are unlikely.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Trump heads to Saudi Arabia eyeing more investment in US",
        "description": "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "US and China are ready to talk tariffs - who will blink first?",
        "description": "The BBC's journalists in Washington DC and Singapore analyse US and China's moves ahead of the negotiation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Trump defends plan to use Qatari luxury jet for Air Force One",
        "description": "Trump says he'd be \"stupid\" to not accept the aircraft \"free of charge\", after Qatar denied it amounted to a gift.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Along the Canada border, small-town America feels sting of Trump's trade war",
        "description": "Since the trade war began, crossings between the US and Canada are down some 17%. What has that cost towns such as Port Huron and Michigan?",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "The US and China are finally talking. Why now?",
        "description": "Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Kwik Fit founder Sir Tom Farmer dies aged 84",
        "description": "The Edinburgh-born businessman built the firm into a £1bn business and also owned Hibernian FC.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "'I freaked out and spent $400 online': US consumers on cheap shipping changes",
        "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Mexico sues Google over 'Gulf of America' name change",
        "description": "President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Hormone-treated beef will not enter UK after US deal, says government",
        "description": "Farmers are raising questions over how checks will ensure US beef produced using hormones doesn't enter the UK market.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Trump proposes 80% China tariff ahead of trade talks",
        "description": "The meeting is the strongest sign yet that the world's two biggest economies are ready to de-escalate their trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Trump misspeaks and calls toy firm Mattel a country",
        "description": "The US president says tariffs are \"the most misunderstood thing\" in business and threatens more action.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "UK to announce fresh sanctions on Putin's 'shadow fleet'",
        "description": "Officials say action will be taken against up to 100 oil tankers that have been carrying cargo.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "What is in the UK-US tariff deal?",
        "description": "The two nations have announced a deal to reduce tariffs - here's what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "US and UK agree to deal slashing Trump tariffs on cars and metals",
        "description": "It will leave a 10% import tax on most goods shipped from the UK to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "How good is the UK trade pact for America?",
        "description": "In Trump's new trade pact with the UK, we got a glimpse of the types of agreements he may seek across the globe.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "Inside the secretive world of Zara",
        "description": "The BBC's Emma Simpson gets a rare glimpse behind the scenes of how the fashion brand operates.",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "UK must 'do everything' to rebuild trade with EU, says Bank boss",
        "description": "Andrew Bailey says he does not take a view on Brexit, but reversing the post-Brexit hit to UK-EU trade would be \"beneficial\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-13T07:27:36.290928"
    },
    {
        "title": "From Outlaws to Breakouts: Oldenburg Success Stories",
        "description": "With no red carpet attitude and no corporate agenda, Germany’s premium indie film festival is a platform and springboard for outsider art: “It’s the purest filmmaker’s festival in the world, no ego, just cinema.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Tory Lanez Hospitalized After Getting Stabbed In Prison",
        "description": "Reps for the rapper, who's serving a 10-year sentence for shooting Megan Thee Stallion, posted on his Instagram that he was \"stabbed 14 times — including 7 wounds to the back.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Morgan Wallen Speaks Out About Abrupt ‘SNL’ Exit: “I Was Just Ready to Go Home”",
        "description": "The country star says he wasn't mad when he left the stage and posted a cryptic message on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Cher Calls for Relocation of L.A. Zoo Elephants to Sanctuary: “They Have Been Through Hell”",
        "description": "\"Billy and Tina have served their time in confinement. They deserve the chance to live out their lives in peace and dignity,\" the singer added in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Beyoncé, Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Bad Bunny, Benson Boone, Blackpink, Katy Perry, Shakira, Lil Baby, Ed Sheeran and Morgan Wallen are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "John Legend on Kanye West’s “Descent”: It’s “Sad, Sometimes Shocking to See Where He Is Now”",
        "description": "“I didn’t see a hint of what we’re seeing now, his obsessions with antisemitism, anti-Blackness,” the Grammy winner said of his former relationship with the rapper.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Johnny Rodriguez, Hispanic Country Music Star and “That’s the Way Love Goes” Singer, Dies at 73",
        "description": "“Dad was not only a legendary musician whose artistry touched millions around the world, but also a deeply loved husband, father, uncle and brother,” Rodriguez’s daughter, Aubry, shared on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Michael Feinstein Calls Kennedy Center Show Cancellations “Government-Sanctioned Censorship”",
        "description": "The singer and pianist said “any government-supported access to the arts is no longer safe” in his penned “Fear of Queer?” essay.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Shakira Insisted Label Add “Hips Don’t Lie” to Album: “I Knew I Had a Hit”",
        "description": "The Grammy winner \"had to repackage the albums\" to include the song because they were initially distributed without the track.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Is Europe the Last Bastion of DEI in Film and TV?",
        "description": "European producers are pushing back on Trump's crackdown on diversity initiatives: \"We have no lessons to learn from the boss of America.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "Dump Truck Crashes Into Whisky a Go Go Music Venue on Sunset Strip",
        "description": "Mötley Crüe, the Doors, Janis Joplin and Guns N' Roses have all performed at the beloved Los Angeles site.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "The Hollywood Reporter Takes Home 2025 American Society of Magazine Editors Best Cover Award",
        "description": "The news organization won best local magazine cover for THR’s 2024 “The Work Issue,” photographed by Fredrik Broden.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-13T07:27:36.769688"
    },
    {
        "title": "NRLW star rocked by disturbing image",
        "description": "A popular NSW State of Origin player has gone public after seeing “scary” images of herself swirling around cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Big calls made on return of NRL stars",
        "description": "The Broncos and Titans have made some big calls on the status of their sidelined NRL stars after the teams dropped for round 11.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "CA makes call on Aussies for IPL restart",
        "description": "With confirmation the Indian Premier League will resume, Cricket Australia has confirmed what it means for Aussies involved.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Adorable new pics of Kerr and baby",
        "description": "Matildas captain Sam Kerr and her partner have melted hearts after uploading several images to social media of their new family.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "NRLW star rocked by disturbing image",
        "description": "A popular NSW State of Origin player has gone public after seeing “scary” images of herself swirling around cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Big calls made on return of NRL stars",
        "description": "The Broncos and Titans have made some big calls on the status of their sidelined NRL stars after the teams dropped for round 11.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Roos skipper picks side in OT debate",
        "description": "North Melbourne captain Jy Simpkin has had his say on extra time following the Kangaroos’ thrilling draw with Brisbane on Sunday night.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Cats won’t engage with Rioli: Stengle",
        "description": "Geelong star Tyson Stengle has weighed in on Willie Rioli’s ban and how Geelong will approach the Power forward this Saturday.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "CA makes call on Aussies for IPL restart",
        "description": "With confirmation the Indian Premier League will resume, Cricket Australia has confirmed what it means for Aussies involved.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Konstas in, Green back for WTC final",
        "description": "Test selectors have given themselves a wealth of choices to open the batting in the World Test Championship final at Lord’s, including a teen star.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Jelena Dokic’s heartbreaking confession",
        "description": "Australian tennis great turned commentator Jelena Dokic has lifted the lid on her feelings towards her estranged father in a raw interview.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Andy Murray in shock career change",
        "description": "Tennis legend Andy Murray has made a shock career switch on the back of a largely unsuccessful partnership with Novak Djokovic.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "‘Hoodwinked’: Wayne Bennett sold a lemon",
        "description": "The South Sydney Rabbitohs were meant to turn things around in 2025, instead Wayne Bennett has been sold a lemon in his return to the club.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Oscar Piastri bullying drama erupts",
        "description": "Oscar Piastri’s F1 team have sensationally claimed the young Aussie was ‘bullied’ when he was signed to rival team Alpine.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Piastri topples Ricciardo in the one area we never thought possible",
        "description": "For the first time ever, Oscar Piastri is officially Australia’s most popular F1 driver. But there’s one area he still trails Daniel Ricciardo – even after torching the F1 circuit this year.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Aussie star KOd in frightening scenes",
        "description": "Joseph Suaalii left Allianz Stadium on a stretcher after an ugly incident involving teammate Andrew Kellaway.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Reds conquer Tahs after Suaalii’s sickening head clash",
        "description": "With the British and Irish Lions heading to Australia soon, the only concern among New South Wales and Queensland was the health of Joseph-Aukuso Suaalii rather than the scoreboard.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "America loses it over huge name in stands",
        "description": "Footage of a global leader making an under-the-radar public appearance is spreading across the internet with eagle-eyed fans spotting the figure.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "MJ’s shock new job leaves NBA in disbelief",
        "description": "Michael Jordan achieved it all on the basketball court but his latest career move has left NBA fans’ jaws on the floor.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Adorable new pics of Kerr and baby",
        "description": "Matildas captain Sam Kerr and her partner have melted hearts after uploading several images to social media of their new family.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Ryan Reynolds drops shock Australia news",
        "description": "Hollywood star Ryan Reynolds has taken a cheeky shot at Hugh Jackman as he announced big news about his $400m fairy tale story.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Aussie becomes champ, stuns UFC world",
        "description": "Australian fighter Jack Della Maddalena has produced a masterclass display to become the UFC’s new welterweight champion.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "‘Another one in him’: Day reunion boost",
        "description": "The mentor who helped steer Jason Day to his only major and world No.1 is back in his inner circle and confident major success is coming.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Opals lose star as Australia seals Trans-Tasman Challenge titles",
        "description": "Kings star Xavier Cooks has led the Boomers to the Trans-Tasman Challenge title as the Opals ensured Australia claimed both best of three series against New Zealand.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Champion driver to ponder future after idol’s passing",
        "description": "Australia’s premier driver James Herbertson will give himself time to reset and consider where his future may be following the death of Greg Sugars.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Road attack has to be seen to be believed",
        "description": "Cycling fans couldn’t quite believe their eyes when a rogue intruder ran onto the road, sparking chaos in the Giro d’Italia.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "‘Heart broken’: WWE legend dead at age 60",
        "description": "An icon of the wrestling world has died just weeks after his final match with stars of the industry left “heartbroken”.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    },
    {
        "title": "Brutal truth about Candice, David’s marriage",
        "description": "Candice Warner has opened up about her decade-long marriage to cricketer David Warner, saying the couple have faced their challenges.",
        "source": "News AU",
        "fetched_date": "2025-05-13T07:27:39.218996"
    }
]