[
    {
        "title": "Killing of insurance CEO reveals simmering anger at US health system",
        "description": "Long-standing frustrations were revealed online after a health insurance executive was shot and killed in New York City.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "'I don't know how we'll survive': War-damaged Lebanese businesses face the unknown",
        "description": "Traders and shop-owners lost their livelihoods as a result of destruction from Israeli attacks.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Online star Hawk Tuah girl faces crypto coin criticism",
        "description": "Haliey Welch's \"Hawk\" digital coin shot up in price then lost 95% of its value just hours after it launched.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "EU tries to get closer to South America with trade deal",
        "description": "The pact promises lower tariffs but may still meet resistance from European countries.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "'I don't know how we'll survive': War-damaged Lebanese businesses face the unknown",
        "description": "Traders and shop-owners lost their livelihoods as a result of destruction from Israeli attacks.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "What happened when India banned TikTok",
        "description": "TikTok was one of India's most popular apps – until it was banned in 2020. It's a lesson for what might unfold if a US ban goes ahead.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "TikTok set to be banned in the US after losing appeal",
        "description": "The app - which faces being banned in a matter of weeks - says it will now take its case to the Supreme Court.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "US jobs bounce back after hurricanes and strikes",
        "description": "Employers added 227,000 jobs in November as markets look ahead to what it means for interest rates.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Why are doctors wary of wearables?",
        "description": "Wearable tech claims to help monitor our health, but many doctors remain sceptical.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Why is vintage audio equipment booming?",
        "description": "Music lovers are buying up old cassette, CD and record players and getting them fixed.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "US Fed uncertain over interest rate cuts - 6 Dec 2024",
        "description": "Could the November rebound in the US jobs figures deter the Federal Reserve from cutting interest rates?",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Boeing plea deal over fatal Max crashes rejected",
        "description": "The deal undermines the court and involves \"contradictory\" diversity requirements, a judge ruled.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Trump tariff threat puts a strain on Canada-Mexico ties",
        "description": "Canadian officials have suggested striking their own trade agreements with the US - and Mexico has taken notice.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Observer newspaper sale to Tortoise Media approved",
        "description": "The Scott Trust and Guardian Media Group agreed the sale on Friday, despite pushback from staff.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "What an accountant-turned-mechanic says about Ghana's election",
        "description": "To curb unemployment, Mahamudu Bawumia has promised a \"digital economy\" and John Mahama a \"24-hour economy\".",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "What we know about NYC killing of healthcare executive",
        "description": "Police are still working to determine a motive in the killing as the hunt for the gunman expands beyond New York City.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Who was Brian Thompson, healthcare CEO gunned down in New York?",
        "description": "Police are still searching for the suspect who shot dead the UnitedHealthcare CEO in Manhattan on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "What next for Bitcoin after bursting $100k barrier?",
        "description": "The rapid increase in price has been attributed to Donald Trump's election victory - can it continue?",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "What we know about Musk's cost-cutting mission",
        "description": "Elon Musk and Vivek Ramaswamy are on Capitol Hill to discuss their new advisory body. So what will it do?",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Illegal Ghana gold mining causing widespread disruption",
        "description": "Illegal gold mining in Ghana picked up this year following an almost 30% rise in global gold prices, despite military operations to shut them down.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Mattel sued over porn site misprint on Wicked dolls",
        "description": "A South Carolina mother claims her daughter visited the adult website on the doll's packaging.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Shell and Equinor to combine forces in North Sea",
        "description": "The energy firms say the deal will see the creation of the North Sea's biggest oil and gas producer.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Selling sex for gold in the Amazon's illegal mines",
        "description": "Life for women among the Amazon’s illegal gold miners is harsh, violent, and can be deadly.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "NYPD hunts gun-wielding assailant who killed UnitedHealthcare CEO outside hotel",
        "description": "Brian Thompson was \"targeted\" by a masked suspect who fled first on foot before grabbing an e-bike and heading towards Central Park.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Airbus cuts nearly 500 UK jobs to reduce costs",
        "description": "It has made the cuts mostly to its space division and says there are no \"compulsory\" losses planned.",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Guinness supplies in UK being limited after demand soars",
        "description": "Guinness-maker Diageo has placed limits on wholesale distribution of the stout to pubs in Great Britain after \"exceptional demand\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-07T07:24:48.050209"
    },
    {
        "title": "Mariah Carey Responds to Claims Her Spotify Wrapped Video Was Made With AI",
        "description": "The \"All I Want for Christmas Is You\" singer thanked her fans in a video message released as part of the music streaming service's year-end celebration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Spider-Man Watches, Dungeons & Dragons Stamps and an ‘Alien: Romulus’ VHS: The Heat Vision Holiday Gift Guide",
        "description": "From stocking stuffers to massive Lego sets, we've got you covered if you're buying for loved ones, co-workers, or yourself (yeah, you are).",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Harvey Weinstein’s Lawyer Fears He Will Die in Rikers Island Due to Mistreatment by “Vindictive” Prison Officials",
        "description": "“He had blood spattered on him,\" his attorney Imran H. Ansari says. \"I was shocked to see that any prisoner would be treated that way.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Taylen Biggs, 11-Year-Old Media Personality, Signs With Wasserman Creators for Representation",
        "description": "News of the partnership comes after Biggs made her acting debut in Hallmark’s 'Holiday Touchdown: A Chiefs Love Story,' which premiered just days ago on Nov. 30.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Lance Bass Says CW Pilot Was Halted After He Came Out",
        "description": "While appearing on the 'Politickin' podcast, Bass recalled being told, \"We can’t do the show anymore. Like, they have to believe that you’re straight to play a straight character.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Taylor Swift ‘Eras Tour Book’ Sells Nearly 1M Copies in First Week",
        "description": "The book, which is being exclusively sold in Target stores nationwide, is the highest-selling week one new release print book of 2024 to date and the fastest-selling new release book of the last four years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "‘Baby Reindeer’ Star Jessica Gunning, ‘One Day’ Breakout Ambika Mod Among Women in Film & TV Award Winners",
        "description": "The guests at London's Park Lane Hilton event also included 'Emilia Pérez' leads Zoe Saldaña and Karla Sofía Gascón, 'Rivals' actor Katherine Parkinson, and 'Doctor Who' boss Russell T. Davies",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Dick Van Dyke Says He’s “Not Afraid” of Dying Ahead of 99th Birthday, Reflects on Life and Career in Coldplay’s New Music Video",
        "description": "The legendary icon features in the \"All My Love\" video, where he gives access to his Malibu home and talks about his Hollywood legacy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "For K-Pop Superstars Twice, Sky’s the Limit: “We Want to Be a Part of History”",
        "description": "The Hollywood Reporter's newest \"Person of Interest,\" the K-pop girl group who has topped music charts around the world, dish about their new album 'Strategy,' collaborating with Megan Thee Stallion and what they hope to be remembered for.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Women in Film and TV “Galvanized” by Comments Like Gregg Wallace’s, Says WFTV CEO",
        "description": "Katie Bailiff caught up with The Hollywood Reporter ahead of the Women in Film and TV Awards in London on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Billie Eilish on Why She Says Her Social Media Usage Is Like “My Cigarettes”: “It’s Really a Problem”",
        "description": "The singer-songwriter says it's difficult to be off social media while also on tour: \"I really love to interact with the fans.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "CJ ENM Unveils 150+ Must-Watch K-Content Titles via Add-On Subscription on Prime Video in the U.S.",
        "description": "CJ ENM expands its global access with the launch of CJ ENM selects, offering a well-curated collection of Korean dramas, films, and variety shows.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-07T07:24:48.463719"
    },
    {
        "title": "Gout Gout shatters 56-year Australian record",
        "description": "Gout Gout has once again proven he’s the real deal, shattering an Australian record which has stood since the 1968 Olympics.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Fastest KO in history blows world away",
        "description": "History has been made at the Bare Knuckled Fighting Championship after with the fastest knockout you’ll ever see.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "‘Who else?’: Gout Gout stuns once again",
        "description": "Gout Gout continues to show his extraordinary talent, coasting to victory in his first 200m run at the All Schools Championships.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Cricket world says one thing about Smith",
        "description": "Veteran Steve Smith’s wretched run has continued, with whispers over his future in this Australian side only getting louder.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "WATCH: Swans academy stars going viral on TikTok",
        "description": "The Swans Academy has already helped uncover future AFL and AFLW stars — and thanks to a new Tiktok series, the next generation of young talent could become household names even earlier.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "BT’s shock Channel 7 move revealed",
        "description": "He may be one of the most recognisable voices in AFL media but Brian Taylor is set for a massive move ahead of the 2025 season.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Reece Robson quits, signs with NRL powerhouse",
        "description": "The Cowboys have lost a key player to a rival club, with the representative star joining the Roosters in 2026.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Munster’s warning to NSW over Bellamy move",
        "description": "Craig Bellamy has often said how much he hated coaching against his Storm players when he was at the Blues, but it’s something he’ll have to get used to.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Cricket world says one thing about Smith",
        "description": "Veteran Steve Smith’s wretched run has continued, with whispers over his future in this Australian side only getting louder.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Local hero goes bananas after Marnus saves career",
        "description": "David Warner knows a thing or two about taking the game away from the opposition – and he believes that’s what Travis Head is doing right now. Follow all the action here.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Kyrgios Aus Open mystery finally answered",
        "description": "A key question has been answered over Nick Kyrgios’ Australian Open comeback plans as the tournament released the full list of entrants.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Brisbane options limited for Tomic",
        "description": "If Bernard Tomic wants to try to qualify for the Brisbane International, he will need some help from tournament organisers.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Aussie trio about to shock the fight world",
        "description": "In just a month, three Aussie boxers can call themselves world champion and bring Australia to the top of the sport after Tim Tszyu’s loss.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "‘Not good’: Fiery F1 feud twist as Piastri tears up Abu Dhabi track",
        "description": "Oscar Piastri is setting himself for a big finish to the F1 season, clocking the second-fastest time in practice ahead of the Abu Dhabi Grand Prix – but all eyes were on the sport’s feuding stars.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "‘Little miracle’: F1 champ Verstappen announces new addition",
        "description": "Formula 1 world champion Max Verstappen has announced he is expecting his first child with girlfriend Kelly Piquet.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "‘Totally wild’: Raygun item says it all",
        "description": "Aussie cult figure Rachael “Raygun” Gunn has done it again with a crazy trend emerging about the much-maligned Olympian.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Jess Fox quietly splits from longtime partner",
        "description": "Australia’s Olympic golden girl Jessica Fox has reportedly split from her longtime partner at the end of a career best year.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "‘Dude is ridiculous’: Aussie wins NBA gong",
        "description": "Aussie guard Dyson Daniels has claimed a huge NBA award and earned massive plaudits from his Atlanta Hawks teammates.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Who’s the new NFL MVP frontrunner with the superstar fiancée?",
        "description": "It was a Thanksgiving Week for the ages for the new MVP frontrunner, and can anyone outside the top 4 contend for the Super Bowl?",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Football icon snaps over four-word sledge",
        "description": "This is the shocking moment Pep Guardiola had to be held back from angrily confronting a fan after an ugly sledge.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "City pair star in easy win over Roar",
        "description": "Brisbane Roar’s poor A-League campaign suffered another blow, this time from Melbourne City, on Friday night.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Fastest KO in history blows world away",
        "description": "History has been made at the Bare Knuckled Fighting Championship after with the fastest knockout you’ll ever see.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Quayle on the cusp of greatest comeback in Aussie golf history",
        "description": "Despite a ‘rookie mistake’ that cost him a staggering seven shots in the opening round, Anthony Quayle is closing in on one of greatest comebacks in Australian golf history at the Victorian PGA.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "All-star cast of basketball legends watch Bullets bounce back",
        "description": "NBA Hall of Famer George Gervin headlined an all-star cast of basketball legends on deck to witness the Brisbane Bullets take care of business against Adelaide. EVERY GAME FROM ROUND 11 OF THE NBL",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Rugby moves to secure Wallabies stars as NRL poachers circle",
        "description": "Rugby Australia has moved to secure the futures of several off-contract Wallabies as the NRL considers salary cap concessions to raid the 15-man code’s biggest stars. Find out more inside.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Wallaby gut punch as star makes NFL move",
        "description": "One of the Wallabies’ most exciting players has announced he is gambling everything to chase his dream in the United States.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Heady Schiller ride lands big plunge on Be Real",
        "description": "Tyler Schiller could have come right down the outside but backed his Judgement that the middle of the Rosehill track was the place to be as the heavily backed Be Real scores at Rosehill.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    },
    {
        "title": "Olympian ‘deathly pale’ after ugly crash",
        "description": "A double Olympic road cycling champ suffered horror injuries after a postal van worker opened their car door in front of him on a ride.",
        "source": "News AU",
        "fetched_date": "2024-12-07T07:24:49.823988"
    }
]