[
    {
        "title": "Bourbon is out, patriotism is in: How Canadians are facing Trump threats head on",
        "description": "Across the country, Canadians are defiant in boycotting American goods and travel even as Trump promises another temporary reprieve.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Is Trump reining in Musk after a cabinet showdown with secretaries?",
        "description": "The president intervenes in a cost-cutting row after a reported clash at the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Trump pulls $400m from Columbia University, saying it failed to protect Jewish students",
        "description": "The Trump administration accuses the college of \"appalling inaction\" in the wake of student rallies.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Deep-sea mining tech advances but doubts remain",
        "description": "Despite opposition investors are still looking at deep-sea mining technology.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Is Trump reining in Musk after a cabinet showdown with secretaries?",
        "description": "The president intervenes in a cost-cutting row after a reported clash at the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Data, waves and wind to be counted in the economy",
        "description": "Wind and wave power is set to be included in calculations of the size of countries' economies for the first time, as part of changes approved at the United Nations.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Trump team hits pause on tariffs - but still sees them as vital tool",
        "description": "The White House sees levies as a means to reshape America's relationship with its global partners.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "US job growth stable as government cuts start",
        "description": "Employers added 151,000 jobs in February but there was a drop in federal employment.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "As US and Canada trade barbs, it's so far so good for Mexico's Sheinbaum",
        "description": "Donald Trump and Justin Trudeau's clear tensions are a stark contrast to the Mexican leader's approach to the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Can Trump's tariffs break China's grip on manufacturing?",
        "description": "The \"Made in China\" juggernaut was built over decades. Can Trump's moves set it back?",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "'A pig in lipstick': Trump's strategic Bitcoin reserve criticised",
        "description": "The reserve will hold cryptocurrency forfeited to the government in criminal or civil proceedings, said the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "SpaceX rocket explodes, raining debris from sky for second time in a row",
        "description": "It grounded flights in Orlando, Miami and Palm Beach after debris concerns from Starship's failed launch.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Trump expands exemptions from Canada and Mexico tariffs",
        "description": "Trump said he was granting the two US neighbours a temporary exemption on tariffs that he imposed two days ago.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Boots gets new US owner in multi-billion dollar deal",
        "description": "There have been reports the Boots chain could be sold off separately by its new owner.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Jack Daniel's hits out at Canada pulling US alcohol",
        "description": "Some Canadian provinces have removed US-made alcohol from shelves in response to US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "European Central Bank cuts interest rates again",
        "description": "The bank cuts rates to 2.5% but faces pressures from threatened US tariffs and plans to boost military funding.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Carmakers win break from Trump's tariffs on Canada and Mexico",
        "description": "Trump says he will exempt cars from the new import taxes, while continuing his criticism of Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Sweden is 'no longer a country that cannot be trusted'",
        "description": "Sweden and Finland's defence sectors are benefiting from their countries joining Nato.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Denmark postal service to stop delivering letters",
        "description": "The decision will end 400 years of the company's letter service, and postboxes will disappear from June.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Irish economy grew at 'a solid pace' in 2024",
        "description": "The finance minister says the figures are \"consistent with the strength of our labour market\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "US charges Chinese hackers who targeted dissidents",
        "description": "The Justice Department said Chinese agencies paid as much as $75,000  (£58,200) for each hacked email inbox.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Boom to gloom: India middle-class jitters amid trillion-dollar market rout",
        "description": "One in five Indian households invest in the stock market, but the recent crash has left investors anxious.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "Warning people in UK could have less money due to US tariffs",
        "description": "Trump tariffs could affect UK economic growth, hitting UK consumers in the pocket, Bank experts warn",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "UK competition watchdog drops Microsoft-OpenAI probe",
        "description": "Digital rights campaigners say it shows the regulator has given into Big Tech and been \"defanged.\"",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "China targets 5% growth as it reels from Trump tariffs",
        "description": "A key meeting has begun to revive China's lagging economy, which is now facing a trade war with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-08T07:20:04.981207"
    },
    {
        "title": "The Ruby Experience Gives L.A. Crowd a Chance to Rock With Jennie",
        "description": "The 29-year-old K-Pop star brought her debut solo album, ‘Ruby,’ to L.A.’s Peacock Theater for a night full of experimental and cinematic production, a range of genres and immense gratitude to her fans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Why So Many Recording Artists Struggle to Get Health Insurance",
        "description": "In most label deals, artists sign as independent contractors. And while SAG-AFTRA counts around 3,500 recording musicians among its ranks, a $27,540 annual earnings threshold is one hurdle.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Trump’s Kennedy Center Pushes Back On Idea of Politically Motivated Show Cancellations",
        "description": "The organization, which has seen a shift in leadership, said recent show cancellations have either been due to “lack of sales or artist availability.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Justice on Computer Malfunctions, Stage Fright and Owing a Debt to Daft Punk",
        "description": "Currently on an epic world tour, the Grammy-winning techno duo snuck into L.A. for a revealing chat about secret inspirations and terrifying moments of man vs. machine.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "California’s Gavin Newsom Opposes Trans Athletes in Women’s Sports, Splitting With Progressives",
        "description": "Newsom made his declaration in an extended conversation with conservative activist Charlie Kirk.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Lady Gaga Says Alter Ego Jo Calderone Was a Way to Explore What She “Was Looking for in Men”",
        "description": "\"[Jo was] also what I was maybe lacking in myself,\" Gaga said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Jack Schlossberg Calls Out Cousin RFK Jr.’s Wife Cheryl Hines Over Child’s Death From Measles",
        "description": "“Almost every single case of measles is in someone who’s not vaccinated. I think you’re the perfect person to say sorry,\" the outspoken Democratic advocate said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Sean “Diddy” Combs Accused of Forced Labor in Superseding Indictment",
        "description": "Prosecutors also say that he forced an employee to have sex with him. Combs has denied the allegations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "King Charles Partners With Apple Music to Release His Playlist, Featuring Kylie Minogue, Raye and More",
        "description": "In an extraordinarily personal insight into Charles III's music taste, 'The King's Music Room' was recorded at Buckingham Palace in his private office.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Pamela Bach, ‘Baywatch’ Actress and David Hasselhoff’s Ex-Wife, Dies at 62",
        "description": "They were married for 17 years and share two daughters.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "The Future of Reggae and Dancehall Discussed at Island Music Conference in Jamaica",
        "description": "“I would really like for the artists to come in and make connections and understand the game and not get fucked like the old ones did,” said Shaggy of the third annual confab.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Olivia Rodrigo and The 1975 to Headline Glastonbury 2025",
        "description": "Neil Young, Charli XCX, Noah Kahan, The Prodigy, Raye, Loyle Carner, Gracie Abrams and more have also been confirmed to perform at the U.K.'s biggest music festival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-08T07:20:05.712630"
    },
    {
        "title": "Aussie boxing star reveals baby joy",
        "description": "Controversial boxing star Ebanie Bridges has dropped a series of photos of her new baby boy with fellow world champ Kell Brook.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "NBA stunned by never before seen history",
        "description": "Basketball fans couldn’t quite believe what they were watching as a three-time MVP produced something the NBA has never seen.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "’Heartbreaking’: AFL star cruelly cut down",
        "description": "A Sydney Swans veteran cut a dejected figure after limping from the field in the dying stages of the club’s opening round defeat.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "‘Vulnerable’ Ricciardo reveals sad F1 truth",
        "description": "As Daniel Ricciardo said farewell to Formula One for the final time, he made a confession that suggested he was ready to retire.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Defensive woes a concern for Storm",
        "description": "Storm coach Craig Bellamy will demand a better ‘attitude’ in defence from a Melbourne side hoping to extend its run of success in NRL round-one games.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Tragic phone call rocked NRL icon to his core",
        "description": "Melbourne Storm coach Craig Bellamy has opened up about the heartbreaking phone call that changed his life forever.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "’Heartbreaking’: AFL star cruelly cut down",
        "description": "A Sydney Swans veteran cut a dejected figure after limping from the field in the dying stages of the club’s opening round defeat.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "AFL greats sledge star over bizarre act",
        "description": "Hawthorn livewire Jack Ginnivan has been sledged by AFL greats for a unique pre-game ritual at the SCG that raised some eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Bulls blitz: Test quick runs through Tassie in Shield demolition",
        "description": "Former Test quick Michael Neser went close to producing a cricket miracle in Hobart and only one of the contenders to partner Usman Khawaja at the top of Australia’s order fired.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "England apologises for Pope Francis tweet",
        "description": "The England Cricket Board have been left with some egg on their face after an off colour social media post about Pope Francis.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Tears flow from injured Kyrgios as ‘reality’ sets in",
        "description": "The playing future of Nick Kyrgios looks grim after a sad end to his return to the court in California.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Kyrgios in tears, tennis career in jeopardy",
        "description": "Nick Kyrgios was inconsolable on Friday after another brutal setback as his tennis career stutters towards a sad conclusion.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Tragic phone call rocked NRL icon to his core",
        "description": "Melbourne Storm coach Craig Bellamy has opened up about the heartbreaking phone call that changed his life forever.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "‘Vulnerable’ Ricciardo reveals sad F1 truth",
        "description": "As Daniel Ricciardo said farewell to Formula One for the final time, he made a confession that suggested he was ready to retire.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "‘Feel sick’: World erupts at shock F1 footage",
        "description": "Cameras have captured a star F1 driver in a seriously vulnerable state that’s left fans questioning whether he should have been filmed.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Pressure on England’s attack ahead of final two Six Nations matches",
        "description": "After a slow start to its Six Nations campaign, England faces two major tests to its attack as it looks to win its first title since 2020. Can the Red Rose do it?",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Why Wallabies will celebrate Brumbies’ end to 12-year drought",
        "description": "The ACT Brumbies have given themselves – and by extension the Wallabies – a massive confidence boost ahead of the upcoming British and Irish Lions series after pulling off one of the biggest upsets in Super Rugby for years.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "LeBron in heated confrontation about his son",
        "description": "US sports personality Stephen A. Smith has lifted the lid on what made LeBron James confront him on the sidelines during a Lakers game.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Australia’s highest paid athletes revealed",
        "description": "Some of Australia’s brighest young stars are set for some truly eyewatering paydays as the sporting rich list gets a whole new look.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Guardiola feels pressure as Man City fights for top four",
        "description": "Normally guaranteed given six of the past seven Premier League titles, Manchester City are being forced to fight for a Champions League spot, and their manager is feeling it.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Caputo brace sparks convincing City win over slumping Bulls",
        "description": "Melbourne City youngster Max Caputo produced one of the best performances of his career to power his side to a convincing 2-0 win over Macarthur on Friday.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Aussie boxing star reveals baby joy",
        "description": "Controversial boxing star Ebanie Bridges has dropped a series of photos of her new baby boy with fellow world champ Kell Brook.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Day sizzles with putter",
        "description": "Former world No.1 golfer Jason Day has rediscovered his form with the putter after seeking the help of the coach who guided him for 20 years.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "LeBron in heated confrontation about his son",
        "description": "US sports personality Stephen A. Smith has lifted the lid on what made LeBron James confront him on the sidelines during a Lakers game.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Force is strong as unlikely sprinter Jedibeel wows trainer",
        "description": "When purchased as yearling, trainer Brad Widdup expected Jedibeel to want at least 1600m to show his best but the gelding has proven himself a high-class sprinter.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "Aussie boxing star reveals baby joy",
        "description": "Controversial boxing star Ebanie Bridges has dropped a series of photos of her new baby boy with fellow world champ Kell Brook.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    },
    {
        "title": "‘Lost a legend’: Tributes flow for Aussie champion",
        "description": "Tributes are flowing for a beloved champion Australian triathlete and coach after she passed away following a battle with cancer.",
        "source": "News AU",
        "fetched_date": "2025-03-08T07:20:08.144040"
    }
]