[
    {
        "title": "US passes first major national crypto legislation",
        "description": "It marks a milestone for the once fringe industry, as it expands its power in Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Meta investors settle $8bn lawsuit with Zuckerberg over Facebook privacy",
        "description": "Shareholders accused Meta leaders of damaging the company by allowing repeat violations of Facebook users' privacy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Former HSBC trader has fraud conviction overturned",
        "description": "Mark Johnson, 59, has fought to establish his innocence ever since he was convicted of fraud in 2017.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Plans for direct train to Berlin in new UK-Germany treaty",
        "description": "It comes as Friedrich Merz makes his first official visit to the UK as German chancellor.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Meta investors settle $8bn lawsuit with Zuckerberg over Facebook privacy",
        "description": "Shareholders accused Meta leaders of damaging the company by allowing repeat violations of Facebook users' privacy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Netflix show uses AI effects for first time to cut costs",
        "description": "The streaming firm says AI allowed The Eternauts to complete a sequence faster and cheaper.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Why is Donald Trump asking Coca-Cola to change its recipe?",
        "description": "The US president says it's better to make the fizzy drink with cane sugar, but why might that be?",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Spud-tacular: How India became a french fry superpower",
        "description": "India's position as a leading exporter of french fries has spurred innovation on potato farms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "The deepening water shortage row between the US and Mexico",
        "description": "The US is accusing its southern neighbour of breaking a long-held water sharing agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Markets 'betting' tariffs resolve by fall - 11 Jul 2025",
        "description": "Expert says markets are betting that Trump will not want to cause a recession before the US midterms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Heat pump makers are ready for a rush: Will customers come?",
        "description": "Heat pump makers are ready to raise output, but demand is still sluggish.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Samsung boss cleared of fraud by South Korea's top court",
        "description": "The ruling comes after Lee Jae-yong was acquitted of all charges in two earlier trials.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Jaguar Land Rover to cut up to 500 UK jobs",
        "description": "The carmaker says the cuts are part of \"normal business practice\", but one expert blames US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Why film-makers can't get enough of Ireland",
        "description": "Helped by generous tax breaks, Ireland's film and TV production sector has never been stronger.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Busiest UK airports raise kiss-and-fly fees, says RAC",
        "description": "Britain's airports are charging up to £7 to briefly drop off passengers close to terminals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Is buying with friends the answer to a tough UK housing market?",
        "description": "Two couples unable to afford London prices bought a home together. Add two babies, and how is it going?",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Why Jane Street, a US trading giant, is in trouble in India",
        "description": "The firm has been banned from India's securities market for alleged manipulation\nthat led to small investors trading at unfavourable prices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Trump discussed firing Fed boss but 'highly unlikely' he will",
        "description": "The US president admitted he broached sacking Jerome Powell, in what would be an unprecedented move.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Canada curbs steel imports to shield domestic industry from Trump tariffs",
        "description": "PM Mark Carney has pledged to diversify the country's trading partners away from the US and prioritise the use of Canadian steel.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "'It's just better!': Trump says Coca-Cola to change key US ingredient",
        "description": "Coca-Cola said they \"appreciate President Trump's enthusiasm\", without confirming they plan to make the tweak.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Largest Mars rock ever found on Earth sells at auction after $4.3m bid",
        "description": "The meteorite was discovered in Niger in November 2023 and is 70% larger than the next biggest piece of Mars recovered on Earth.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "German defence tech firm to make drones in UK",
        "description": "Stark, which makes weapon systems for Nato, says its new facility in Swindon will support 100 jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Could axing two national holidays save France from its mountain of debt?",
        "description": "Prime Minister François Bayrou has angered MPs with a bid to cut two public holidays to rescue the country's finances.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Does the UK video games industry have a class problem?",
        "description": "A non-profit organisation is trying to create more pathways into the sector for working-class people.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Canada's PM wants to fast-track 'nation building' - but can he?",
        "description": "Indigenous communities have launched a legal challenge against a federal law that would fast-track resource development projects.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "US and Indonesia reach tariff deal",
        "description": "The US will lower its tariffs threatened on goods from Indonesia to 19% from a planned 32%.",
        "source": "BBC Business",
        "fetched_date": "2025-07-18T07:31:02.339260"
    },
    {
        "title": "Annet McCroskey, CEO of Artistic Endeavors, Dies at 51",
        "description": "She started out with young actors as a talent manager and produced the 2018 film ‘Locating Silver Lake.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "K-pop Group Riize Announces Venues and Ticketing Details for North American Tour Leg (Exclusive)",
        "description": "The K-pop boy group is heading to eight cities across North America this fall for the Riizing Loud tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Three Six Zero Names Aimee Jessiman U.K. Head of Management",
        "description": "She is working with the likes of Calvin Harris and Swedish House Mafia.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Connie Francis, ‘Where the Boys Are’ Singer and Actress, Dies at 87",
        "description": "One of the most commercially successful female singers in history, she also had hits with \"Who's Sorry Now?,\" \"Mama,\" \"Everybody's Somebody's Fool\" and \"Stupid Cupid.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Justice Department Fires Maurene Comey, Prosecutor on Epstein Case and Daughter of Ex-FBI Director",
        "description": "The veteran federal prosecutor also worked on the case against Sean “Diddy” Combs.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "How to Watch the 2025 ESPY Awards Online",
        "description": "Simone Biles, Caitlin Clark, Shohei Ohtani, Kevin Durant, Max Verstappen and A'ja Wilson are just a handful of nominees — here's where to stream the sports awards ceremony live.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Perry Farrell Sues Jane’s Addiction Members Over 2024 Altercation Hours After They Sued Him",
        "description": "Farrell alleged the band attempted to to \"undermine him by playing their instruments at a high volume so that he could not hear himself sing without blasting his own in-ear monitors at an unsafe level.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Ariana Grande Promises She Won’t Abandon Music",
        "description": "The ‘Wicked: For Good’ star took to Instagram to reassure fans she wasn’t planning to leave music behind anytime soon.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Tomorrowland Main Stage “Severely Damaged” After Catching Fire, Festival Set to Continue",
        "description": "The Belgium-based electronic music event is slated to kick off its first weekend on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Jane’s Addiction Members File $10 Million Lawsuit Against Perry Farrell Over 2024 Stage Altercation",
        "description": "\"History will remember the band as suffering a swift and painful death at the hands of Farrell’s unprovoked anger and complete lack of self-control,\" the suit said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "Official Tina Turner Wig Recalled Amid Fan Backlash: “Is That Little Orphan Annie?”",
        "description": "Made of human hair and priced at $1,000, it features blond, curly locks that fans say are way off the mark.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    },
    {
        "title": "DC’s Next Big Publishing Event Revealed as Superhero Slugfest ‘DC K.O’ (Exclusive)",
        "description": "Scott Snyder and Joshua Williamson are co-architecting the publishing initiative that will launch this fall.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-18T07:31:02.562984"
    }
]