[
    {
        "title": "Daily Telegraph tipped to go to US bidder at auction",
        "description": "British-born Dovid Efune who owns the New York Sun is considered by several parties as the frontrunner.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "How pen and paper comes to the rescue in an IT crisis",
        "description": "Firms are advised to practise operating with pens and paper in case of a computer meltdown.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "IMF approves $7bn loan to cash-strapped Pakistan",
        "description": "Pakistan has taken more than 20 loans from the IMF since 1958 and is currently its fifth-largest debtor.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "UK supermarket demands rivals stop selling prawn rings",
        "description": "The frozen food chain has warned other shops against selling prawn rings this Christmas.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Australia's lithium mining boom hit by sagging prices",
        "description": "Some producers have halted operations, while others are increasing production, hopeful of an upturn.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "How pen and paper comes to the rescue in an IT crisis",
        "description": "Firms are advised to practise operating with pens and paper in case of a computer meltdown.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Musk hits back after being shunned from UK summit",
        "description": "There is concern about his social media posts about the UK during last month’s riots, the BBC understands.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "'I'm a capitalist', says Harris in economic pitch to US voters",
        "description": "Harris is seeking to chip away at Donald Trump's advantage with voters on the economy, a key election issue.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Dame Judi Dench and John Cena to voice Meta AI chatbot",
        "description": "The firm also unveiled the first working prototype of Meta's augmented-reality glasses, called Orion.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "IMF approves $7bn loan to cash-strapped Pakistan",
        "description": "Pakistan has taken more than 20 loans from the IMF since 1958 and is currently its fifth-largest debtor.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "China is part of the US election - but only from one candidate",
        "description": "There is a stark difference in how - and how often - each candidate addresses the US-China relationship.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Trump vows to 'take other countries' jobs' in economic speech",
        "description": "Trump pledged that companies who manufactured in the US would receive benefits, while those who did business elsewhere would face steep costs",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Boeing staff report pressure to lower standards",
        "description": "US lawmakers say regulators need to be tougher on Boeing to force change at the troubled company.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "James McAvoy and Tom Brady fall for 'Goodbye Meta AI' hoax",
        "description": "More than 600,000 people have shared a message falsely denying Meta the right to use their images to train AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Is Elon Musk’s Starlink a game changer for Africa?",
        "description": "The satellite internet company is expanding across Africa, but not without some controversy.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "China probes Calvin Klein over Xinjiang cotton",
        "description": "Beijing says it suspects US brands are discriminating against Chinese cotton after allegations of forced labour.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Death of Indian employee sparks debate on 'toxic work culture'",
        "description": "Anna Perayil's parents allege she died four months after starting a job because of \"overwhelming work stress\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Nike and Sky ads banned over online tactics",
        "description": "Advertising standards found the ads were misleading in the way information was presented.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Treasury reconsidering Labour plan for non-dom tax status",
        "description": "The change follows concerns over how much money will be raised, should wealthy foreigners leave the UK.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Yorkshire worst region for bank access - report",
        "description": "Yorkshire and the Humber has just 4.4 bank branches left per 100,000 people, a Which? report says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Legal challenge to Rosebank oil field given go-ahead",
        "description": "Greenpeace and Uplift have brought judicial reviews to stop the development of Rosebank oil field and Jackdaw gas field.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "ScotRail drivers accept deal to end long-running pay dispute",
        "description": "ScotRail has been running a reduced timetable since July due to staff shortages during the dispute.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Banks must refund fraud up to £85,000 in five days",
        "description": "Victims tricked into sending money to scammers must be refunded within five days under new rules.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Petrol prices fall to lowest for three years",
        "description": "Lower global oil prices and a stronger pound were the main reasons prices had fallen, the RAC says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "How much is the winter fuel payment and who can still get it?",
        "description": "The government's plans to limit the payment have been criticised by some MPs, unions and charities.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "UK economic growth 'robust' in 2024, think tank says",
        "description": "A think tank says it expects UK economic growth grow by 1.1%, the same rate as Canada and France.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "UK shouldn't shun Shein, says ex-B&Q boss",
        "description": "Chinese firm Shein should list in London despite controversy over green credentials, Sir Ian Cheshire says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-27T07:23:14.313528"
    },
    {
        "title": "Hurricanes: Inside the deadly storms",
        "description": "Take a detailed look at the anatomy of the world’s most powerful storms from their birth to their final moments.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The world's greatest unpaid debt?",
        "description": "Should rich countries and fossil fuel companies pay for the climate losses and damages they have caused?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The former trash islands teeming with life",
        "description": "Sri Lanka's capital city has transformed its polluted aquatic ecosystems into biodiverse havens for wildlife.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The science behind the 'mini moon' entering Earth's orbit",
        "description": "An asteroid is going to circle our planet for two months this autumn before going on its way.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Iceland's high-tech farm turning algae into food",
        "description": "A facility near the Icelandic capital, Reykjavik, is using innovative farming technology to grow algae.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "How climate change is super-charging storms",
        "description": "The behaviour of the world's most powerful storms is evolving. To adapt to more destructive hurricanes, typhoons and tropical cyclones, we need to know how they're changing.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "The feud that brought electricity to New York",
        "description": "When electricity was first rolled out in New York in the late 19th Century, sparks flew between competitors. Today, the city is attempting to complete its electric evolution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "How Vienna prepared itself for a 5,000-year flood",
        "description": "The steps Vienna took to prepare for extreme rainfall may hold lessons for how other cities can face deluges to come.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Why rivers need their curves back",
        "description": "For centuries meandering rivers have been straightened – but experts say restoring their natural bends and curves can prevent flooding and create healthy habitats for wildlife.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "'It smells like an overflowing food bin': The weird biology of the enormous 'corpse plant'",
        "description": "It stands metres high, takes a decade to flower, smells like death and draws huge crowds when it blooms. But scientists are still unravelling the baffling lifecycle of the titan arum.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Climate a more fundamental threat than terror - Lammy",
        "description": "Foreign Secretary David Lammy vows to put climate change at the heart of the UK's foreign policy.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Which is the 'dirty side' of a hurricane?",
        "description": "In tropical storms, location matters when it comes to what damage to expect – especially if you're on the \"dirty\" side of a hurricane, where winds can be up to 50% stronger.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Why humpback whales are changing course",
        "description": "The first humpback whale to return to the North Pacific's Salish Sea in decades tells a new story about the global threat to whale populations.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Mystery tremors were from massive nine-day tsunami",
        "description": "Scientists launched an investigation after being baffled by seismic signals picked up across the world",
        "source": "BBC Earth",
        "fetched_date": "2024-09-27T07:23:14.388023"
    },
    {
        "title": "Willow Smith Says “Musicianship Is Going to Become the Next Clout” Ahead of ‘Empathogen’ Deluxe Release",
        "description": "Willow Smith is releasing a deluxe version of her latest album Empathogen, but she’s surprisingly casual about the three new songs and accompanying visuals that will be available Friday. “I’m just excited for the homies to watch me be crazy, because I love doing that,” Smith tells The Hollywood Reporter. “I love being crazy for […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Alec Baldwin’s ‘Rust’ Case Was Dismissed. What Happens to the Armorer?",
        "description": "Alec Baldwin’s involuntary manslaughter trial abruptly ended in July with the dismissal of the case after a last-minute hearing over how police and prosecutors treated a handful of bullets. It related to a retired law enforcement officer turning over a collection of live ammunition to the Santa Fe Sheriff’s Office, some of which matched the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "NYC Mayor Eric Adams Charged With Taking Bribes and Illegal Campaign Funds From Foreign Sources",
        "description": "New York City Mayor Eric Adams was indicted Thursday on federal charges alleging that he took illegal campaign contributions and bribes from foreign nationals in exchange for favors that included helping Turkish officials get fire safety approvals for a new diplomatic building in the city. Adams, a former captain in the New York City police […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Usher’s Wonder-ful Concert: Superstar Brings Out Icon at Sold-Out L.A. Tour Date",
        "description": "Usher closed out his sold-out four-night stint at Los Angeles’ new Intuit Dome by serenading the crowd with his greatest hits and bringing out music legend Stevie Wonder. While the audience spent most of the night on its feet as Usher dazzled with his catalog of hits and guest stars that included comedian Kevin Hart, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "New York City Mayor Eric Adams Has Been Indicted, Sources Say",
        "description": "New York City Mayor Eric Adams has been indicted by a federal grand jury on criminal charges that are still sealed, according to two people familiar with the matter. The charges against Adams, a Democrat, were still sealed late Wednesday, according to the people, who spoke with the Associated Press on condition of anonymity because […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Chappell Roan Says She’s Voting for Kamala Harris, but “Endorsing and Voting Are Completely Different”",
        "description": "Chappell Roan clarified her comments about not endorsing Kamala Harris in a social media post on Wednesday, telling followers: “Voting is all we have right now.” Roan said recently she doesn’t “feel pressured to endorse someone,” adding, “I have so many issues with our government in every way. There are so many things that I […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Cat Glover, Singer and Dancer Who Worked With Prince, Dies at 60",
        "description": "Cat Glover, the singer, dancer and choreographer who worked with Prince during his late 1980s pomp, has died. She was 60. Glover’s death was announced on her official Facebook page. “It’s with great sadness that we formally announce the passing of Catherine Vernice Glover- AKA ‘Cat.’ Please allow her children, family and friends privacy at […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Diddy and Kim Porter’s Children Call Claims of a Memoir and Conspiracy Surrounding Her Death “Simply Untrue”",
        "description": "Kim Porter’s four children are speaking out, calling claims that their late mother wrote a memoir “simply untrue.” Christian (King) Combs and twins, D’Lila and Jessie Combs — whom Porter shares with Sean “Diddy” Combs — as well as Quincy Brown — whom she shares with Albert Joseph Brown (the R&B singer known as Al […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "APOS: Warner Bros. Discovery Sets Max Rollout Dates in Australia, Several Asian Markets",
        "description": "Warner Bros. Discovery has set target launch dates for its Max streaming service in Australia and several key Asian markets. On the day that Max launched in Japan via local partner U-Next, James Gibbons, president of APAC for Warner Bros. Discovery, revealed that the company is looking to roll out Max direct-to-consumers in Australia in […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Kamala Harris and Donald Trump Agree to Participate in Dueling TelevisaUnivision Town Halls",
        "description": "There may or may not be another debate between Vice President Kamala Harris and former President Donald Trump, but both candidates have agreed to appear in another high-profile TV setting: Town halls to be hosted by the Spanish-language media giant TelevisaUnivision. The media company says that both the Trump and Harris campaigns have agreed to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Jennifer Lawrence Reveals Why She’s Endorsing Kamala Harris: “Abortion Is Literally on the Ballot”",
        "description": "Jennifer Lawerence got candid about why she’s endorsing Kamala Harris in this year’s presidential election against Donald Trump. “Abortion is literally on the ballot,” the Oscar-winning actress told People. “I’m voting for Kamala Harris because I think she’s an amazing candidate, and I know that she will do whatever she can to protect reproductive rights. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "Lawsuit Claims Sean “Diddy” Combs Drugged and Raped Woman With Bodyguard at Bad Boy Studio",
        "description": "Sean Combs, the embattled music mogul who remains in jail while he awaits trial on federal sex trafficking and racketeering charges, has been sued for allegedly drugging and raping a woman in 2001. Thalia Graves, in a lawsuit filed on Tuesday in New York federal court, says she was sexually assaulted by Combs and his […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-27T07:23:14.602784"
    },
    {
        "title": "9 startups that stood out on YC Demo Day 2",
        "description": "Here are the startups from YC Demo Day 2 that we thought stood out from the flock.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Indian game streaming startup Loco sells majority stake to Redwood",
        "description": "UAE-based Redwood has acquired a majority stake in the game streaming platform Loco as the Indian firm looks to expand focus to international markets, TechCrunch has learned and confirmed. Redwood,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Starlink hits 4 million subscribers",
        "description": "SpaceX’s Starlink satellite internet network is expected to hit a new customer milestone this week, company President Gwynne Shotwell told Texas legislators on Tuesday.  “This week, by the way, we…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Runway earmarks $5M to fund up to 100 films using AI-generated video",
        "description": "AI video generators need to believe that filmmakers will use their models in the production process. Otherwise why exist? To jump-start the new AI film ecosystem, Runway has set aside…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "OpenAI’s VP of global affairs claims o1 is ‘virtually perfect’ at correcting bias, but the data doesn’t quite back that up",
        "description": "Departures might be dominating the week’s OpenAI-related headlines. But comments on AI bias from Anna Makanju, the company’s VP of global affairs, also grabbed our attention. Makanju, speaking on a…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Former Brex COO who now heads unicorn fintech Figure says GPT is already upending the mortgage industry",
        "description": "Lending startup Figure will be launching an AI tool powered by GPT-4 to help catch errors in lending documents.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Security compliance unicorn Drata lays off 9% of its workforce",
        "description": "Drata, a security compliance automation platform that helps companies adhere to frameworks such as SOC 2 and GDPR, has laid off 9% of its workforce, amounting to 40 people. Founded in 2020, Drata integrates…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Nomi’s companion chatbots will now remember things like the colleague you don’t get along with",
        "description": "As OpenAI boasts about its o1 model’s increased thoughtfulness, small, self-funded startup Nomi AI is building the same kind of technology. Unlike the broad generalist ChatGPT, which slows down to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Zap Energy investors in recent $130M round included Soros Fund and Laurene Powell Jobs’ Emerson Collective",
        "description": "The company recently closed a $130 million round, according to an SEC filing, bringing the total to $327 million.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Uber snags another robotaxi deal, aviation startups land VC bucks, and where Rivian Foundation money is going",
        "description": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! I’ve been…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Kaspersky defends force-replacing its security software without users’ explicit consent",
        "description": "That lack of user interaction — or request for consent — is what confused and concerned some former Kaspersky customers.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "The WordPress vs. WP Engine drama, explained",
        "description": "The world of WordPress, one of the most popular technologies for creating and hosting websites, is going through a very heated controversy. The core issue is the fight between WordPress…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Tesla Superchargers: GM, Ford, Rivian, and other EV brands with access",
        "description": "EV owners of GM vehicles like the Chevrolet Silverado EV and Cadillac Lyriq will now officially have access to Tesla’s Superchargers.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "BMW says we need both battery and hydrogen EVs for a zero-emissions future",
        "description": "Despite hydrogen’s challenges, BMW thinks the only way to actually achieve a shift to zero-emissions transportation is through a mix of BEVs and hydrogen vehicles.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "EVA, an entertainment booking platform for events, raises $2M as it expands to more cities",
        "description": "EVA, the platform that connects event bookers with local performers, has secured $2 million in funding as the popularity of in-person events comes back in full force. The round, which…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Google’s NotebookLM enhances AI note-taking with YouTube, audio file sources, sharable audio discussions",
        "description": "Google’s NotebookLM has been updated with YouTube and audio files as new source types and sharable links for Audio Overviews.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Subscription management platform RevenueCat acquires a ‘spicy’ audiobooks app (??!!)",
        "description": "The idea here is to bring a subscription-based app in-house to serve as a testing ground for RevenueCat’s new features.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Announcing the final agenda for the AI Stage at TechCrunch Disrupt 2024",
        "description": "We’re thrilled to announce that the agenda for our dedicated AI Stage presented by Google Cloud to TechCrunch Disrupt 2024 is complete and ready to go! It joins fintech, SaaS,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Meta Connect 2024: Orion glasses, Quest 3S headset, Meta AI upgrades, Ray-Ban Meta real-time video, and more",
        "description": "Meta Connect 2024 is a developer-centric event featuring a keynote from CEO Mark Zuckerberg. He showcased new hardware and software to support two of Meta’s big ambitions: AI and the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "India’s Star Health says it’s investigating after hacker posts stolen medical data",
        "description": "The health insurance giant is investigating an incident that allegedly leaked sensitive customer medical data.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-27T07:23:14.854569"
    },
    {
        "title": "Broncos 2024: Where it all went wrong",
        "description": "Grand final heartache may linger with the Broncos but the NRL powerhouse had bigger designs on 2024. ULTIMATE GUIDE",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Contract reveal sparks furious backlash",
        "description": "Daniel Ricciardo’s Formula 1 replacement found himself on the receiving end of furious fans as details surrounding the move were revealed.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Bulls question Australia Cup change",
        "description": "A monster truck show has forced the date of the Australia Cup final to be moved, and it’s a decision that hasn’t pleased Macarthur FC coach Mile Sterjovski.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Swan’s tears for heartbroken teammate",
        "description": "Dane Rampe has detailed how distraught he was after Swans skipper Callum Mills’ Grand Final dream was officially crushed.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Thousands line streets for AFL parade",
        "description": "Thousands of fans have crowded Melbourne streets to catch a glimpse of the players involved in this year’s AFL grand final.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Katy Perry spotted in top secret rehearsal",
        "description": "The US pop star has been spotted undergoing an elaborate rehearsal at the MCG ahead of her blockbuster show at the AFL grand final.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Broncos 2024: Where it all went wrong",
        "description": "Grand final heartache may linger with the Broncos but the NRL powerhouse had bigger designs on 2024. ULTIMATE GUIDE",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Matty Johns: How the Roosters can upset Storm tonight",
        "description": "The Melbourne Storm will have a ‘14th man’ on the field tonight against the Roosters, but Matty Johns can see a path to victory – and the grand final – for the visitors form Sydney.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "‘Moved on’: No Aussie angst for Lord’s return",
        "description": "Australian players love Lord’s so much they went in to lunch on their day off ahead of a return for the first time since last year’s fiery Ashes Test.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Aussie cricket legend’s devastating loss",
        "description": "Australian cricket legend Greg Chappell has revealed one of the prized possessions from his career has devastatingly gone missing.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Australia rocked by Davis Cup blow",
        "description": "A significant name was missing when Australia’s squad for the Davis Cup finals in Spain was named.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Cruz Hewitt development stuns tennis fans",
        "description": "The son of Australian tennis legend Lleyton Hewitt has stunned fans with an Instagram post of himself and global star Carlos Alcaraz.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Ricciardo officially sacked, goes viral",
        "description": "Daniel Ricciardo’s Formula 1 farewell message is going viral after Red Bull officially sacked the Australian on Friday morning.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Kylie drops awful news on Ricciardo",
        "description": "Kylie Minogue says her love for Daniel Ricciardo is “pure” after the pop queen signalled the end of the line for her fellow Aussie.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Vince McMahon’s sick plot for daughter exposed",
        "description": "Disgraced former WWE boss Vince McMahon has come under fire over a disgusting storyline he attempted to put his daughter in.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Nathan Cleary lifts lid on wild car chase",
        "description": "Nathan Cleary has detailed an eye-opening moment that unfolded with the paparazzi before his relationship with Mary Fowler went public.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Why underdogs are causing havoc: NFL Week 4 trends",
        "description": "There are some stand out reasons for why the NFL season has been so chaotic in the first three weeks of the season: what are the biggest reasons for underdogs dominating?",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Mum oblivious as 4yo girl chugs a beer",
        "description": "A little girl has gone viral after a video appearing to show the toddler throwing down an unusual beverage was published online.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Bulls question Australia Cup change",
        "description": "A monster truck show has forced the date of the Australia Cup final to be moved, and it’s a decision that hasn’t pleased Macarthur FC coach Mile Sterjovski.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Star striker keen for Matildas recall",
        "description": "A Matildas great believes the A-League women’s competition’s leading coach has what it takes to guide the national team.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Mike Tyson comment spells disaster for fight",
        "description": "Boxing icon Mike Tyson has made a worrying admission that could spell complete disaster for his upcoming fight with Jake Paul.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "‘It’s not over’: Scott’s vow after Cup shocker",
        "description": "They were buzzing with excitement and confidence but it meant little in the Presidents Cup cauldron as the International Team was schooled by the mighty USA.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "NBL Late Mail: SuperCoach setback as top buy in doubt",
        "description": "All the info you need to set up your SuperCoach NBL team for round 2 is right here, including a popular purchase being floored by illness.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Bledisloe Cup 2024: Wallabies set for crucial All Blacks clash",
        "description": "New Zealand has retained the Bledisloe Cup, but Wallabies coach Joe Schmidt has left no stone unturned in the hunt for an elusive – and perhaps Australia’s most crucial – win in enemy territory.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Key takeaways Wallabies must learn from",
        "description": "The Wallabies will need a better start as well as a more clinical performance if they are to beat New Zealand on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Rosehill Inside Mail: Wet dampens Baker’s confidence",
        "description": "Ray Thomas reveals his best bets and quaddie selections for Saturday’s 10-race card at Rosehill Gardens, where Bjorn Baker’s confidence has been dampened by the wet conditions.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    },
    {
        "title": "Stunning win won’t change Aussie star’s mind",
        "description": "A gold medallist in Paris and now a dual world champion still has heads shaking about why she’s headed to retirement.",
        "source": "News AU",
        "fetched_date": "2024-09-27T07:23:17.498203"
    }
]