[
    {
        "title": "Vance says good chance of UK-US trade deal, as Trump moves closer to pharma and chip tariffs",
        "description": "The US vice president suggests a US-UK trade deal may be easier than an US-EU deal, due to \"a much more reciprocal relationship\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Good cops, bad cops - how Trump's shifting tariff team kept world guessing",
        "description": "Competing voices from the White House fuelled uncertainty before the president announced a sweeping pause, experts say.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "US stock markets rise on Trump tariff rollback",
        "description": "The US president exempts some Chinese goods such as smartphones from levies but says it is temporary.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "The curious case of why a billionaire wants to buy Royal Mail",
        "description": "From the end of April, the 500-year-old Royal Mail will be controlled by Czech billionaire Daniel Kretinsky who co-owns a football club - but why does he want it?",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Good cops, bad cops - how Trump's shifting tariff team kept world guessing",
        "description": "Competing voices from the White House fuelled uncertainty before the president announced a sweeping pause, experts say.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "'Good chance' of US-UK trade deal, says Vance",
        "description": "The Trump administration's trade policy shakeup has caused global economic turmoil.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Mark Zuckerberg defends Meta in social media monopoly trial",
        "description": "The US government is seeking to break up Meta by forcing a spinoff of Instagram or WhatsApp.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Trump threatens new tariffs on smartphones days after exempting them",
        "description": "President Trump says Chinese-made electronics are simply moving to a different levy \"bucket\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Finland's bid to win Europe's start-up crown",
        "description": "Helsinki wants to become a top European start-up hub, but can it challenge London and Stockholm?",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Week in Markets - 11 Apr 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "'A stab in the back' - car workers in Canada hit out at US over tariffs",
        "description": "The car industry in Windsor, Ontario, has employed generations of Canadians but now the future is uncertain.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Was China the reason Guyana faced higher Trump tariff?",
        "description": "A Guyanese political commentator says Washington objects to Beijing's \"very strong foothold\" in the country.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "No 10 'confident' British Steel furnaces will stay on",
        "description": "Vital materials stored nearby to the Scunthorpe plant will arrive in the \"coming days\", Downing Street says.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Analysis: Trump's iPhone olive branch is a significant trade war retreat",
        "description": "Exempting electronics from US tariffs is a stunning about-turn by the Trump administration after 10 days of chaos.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "'I can't keep up': Trump's changing tariffs leave shoppers feeling paralysed",
        "description": "The rapid change of Trump's tariff policy has shoppers wondering if they should stock up or just wait this out.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "UK takes control of British Steel under emergency powers",
        "description": "Business Secretary Jonathan Reynolds says nationalisation is \"likely\" next step as Parliament rushes law through.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Chris Mason: British Steel law rushed through Parliament but it is just a stop gap",
        "description": "For all of Saturday's drama, the government's intervention so far is just a stop gap, writes our political editor.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Universal theme park is coming to the UK - so what could it look like?",
        "description": "Imagination should have no limit when drawing up new resorts, rollercoaster and theme park experts say.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Trump exempts smartphones and computers from new tariffs",
        "description": "It follows concerns that tech prices could skyrocket, as many gadgets are made in China, with the US president saying he will give more detail on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "US coffee shops worried about bitter price hike after tariffs",
        "description": "Higher prices are worrying independent US coffee shops, which import almost all their beans.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Why Beijing is not backing down on tariffs",
        "description": "Amid a trade war with the US, our China correspondent explains why Beijing doesn't need to change tactics.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "OpenAI sues Elon Musk, claiming 'bad-faith tactics'",
        "description": "Claim follows Mr Musk's own lawsuit earlier this year against OpenAI's Sam Altman.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Australia's looming election brings housing crisis into focus",
        "description": "Australia's housing crisis has hit its worst point in decades, becoming a key issue in the upcoming election.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "UK economy grew more than expected in February",
        "description": "Analysts warn the unexpected growth could prove short-lived due to the threat of US tariffs and business tax rises.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "Trump had five tariff goals - has he achieved any of them?",
        "description": "The president made a partial reversal this week - here's a look at where it leaves five of his key ambitions.",
        "source": "BBC Business",
        "fetched_date": "2025-04-15T07:27:48.096863"
    },
    {
        "title": "The Hollywood Reporter Elevates Liz Culley, Names Debra Fink VP, Entertainment and Special Projects",
        "description": "Their key roles focus on digital growth, brand strategy and entertainment initiatives.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Katy Perry, Lauren Sánchez, Gayle King Blast Into Space and Back on Blue Origin Flight",
        "description": "Jeff Bezo’s spacecraft also carried film producer Kerianne Flynn and scientists Aisha Bowe and Amanda Nguyen for a 10-minute, all-female flight before returning to Earth in Texas.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Mario Vargas Llosa, Peruvian Author and Nobel Literature Laureate, Dies at 89",
        "description": "He was author of such celebrated novels as 'The Time of the Hero' (La Ciudad y los Perros) and 'Feast of the Goat.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "K-Pop Group Treasure on Latest Album ‘Pleasure,’  First U.S. Tour and Hopes for the Future",
        "description": "The 10-member boy group are about to close out their first U.S. tour with a stop in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Green Day Blaze Through Headline Set, Charli XCX Brings Star Power at Coachella Day 2",
        "description": "Day two was also marked by unconventional sets as Yo Gabba Gabba and the LA Philharmonic played star-studded performances Saturday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Bernie Sanders Blasts Trump and Musk During Surprise Coachella Appearance",
        "description": "In an unannounced cameo before a massive crowd, the Vermont senator urged young people to take action against the administration: “The future of what happens in America is dependent on your generation.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Neil Young, Joan Baez, Maggie Rogers Headline Bernie Sanders Los Angeles Rally",
        "description": "\"Take America back,\" Young chanted in his performance before eventually introducing Alexandria Ocasio-Cortez to the stage.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Keith Olbermann Condemns Bill Maher’s Positive Visit With Trump, Says It’s “So He Can Keep His HBO Show”",
        "description": "The American journalist further called Maher a “shameless opportunist with no real principles,” having known him “since 1978.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Lady Gaga Is Queen of the Desert, Benson Boone Channels Freddie Mercury, Lisa Slays at Coachella 2025",
        "description": "Day one brought the heat, as temps soared and so did music’s top hitmakers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Coachella 2025: All The Special Guest Performances We Know About",
        "description": "Billie Joe Armstrong already came out for The Go-Go's, while Troye Sivan is slated to join Charli xcx on stage later this weekend, sources say.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Erik and Lyle Menendez Granted Resentencing Hearing as Judge Rejects New D.A.’s Motion",
        "description": "L.A. District Attorney Nathan Hochman was dealt a blow after his motion that his predecessor's request for the brothers' resentencing after 35 years was roundly rejected by a Superior Court judge.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Bowen Yang Opens Up About “Painful and Detrimental” Experience With Conversion Therapy",
        "description": "The ‘Saturday Night Live’ star shared the ultimatum his parents gave him as a teenager in a preview for NBC’s ’Sunday Sitdown with Willie Geist.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-15T07:27:48.593912"
    },
    {
        "title": "Blues confirm worst for leading goalkicker, hope remains for Harry",
        "description": "The Blues have officially been hit with another blow up forward, but there’s better news for their clash next Sunday against the Cats. Get all the daily news here.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Club officially axe prodigy after bombshell",
        "description": "The Wests Tigers have swung the axe on Lachlan Galvin’s place in the side after several star players took issue with his decision.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Star Pie returns but concerns for winless Demons",
        "description": "Two of Melbourne’s biggest stars will need to prove their fitness later in the week while Collingwood is set to welcome back a premiership midfielder.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Star’s support amid shock coach claim",
        "description": "As the fallout from Lachlan Galvin’s exit hits fever-pitch, one of the NRL’s biggest names has thrown his support behind Benji Marshall.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Club officially axe prodigy after bombshell",
        "description": "The Wests Tigers have swung the axe on Lachlan Galvin’s place in the side after several star players took issue with his decision.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Star’s support amid shock coach claim",
        "description": "As the fallout from Lachlan Galvin’s exit hits fever-pitch, one of the NRL’s biggest names has thrown his support behind Benji Marshall.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Blues confirm worst for leading goalkicker, hope remains for Harry",
        "description": "The Blues have officially been hit with another blow up forward, but there’s better news for their clash next Sunday against the Cats. Get all the daily news here.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Star Pie returns but concerns for winless Demons",
        "description": "Two of Melbourne’s biggest stars will need to prove their fitness later in the week while Collingwood is set to welcome back a premiership midfielder.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Aussie star’s comeback just days away as six-month injury hiatus finally ends",
        "description": "Cameron Green hasn’t played cricket for more than six months after career-saving back surgery but his return is happening.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Star’s comeback just days away",
        "description": "Cameron Green hasn’t played cricket for more than six months after career-saving back surgery but his return is happening.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Consolation win for Australia",
        "description": "Playing for pride, Australia bounced back from its loss to Kazakhstan with a win over Colombia in the Billie Jean King Cup Group D qualifier in Brisbane.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "‘Insane’ : De Minaur blows tennis world away",
        "description": "Aussie Alex de Minaur is the talk of the tennis world right now after an act of total insanity that has shattered records.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "AFL club ‘in a hell of a lot of trouble’ right now",
        "description": "An often forgotten AFL team is preparing to unleash a massive war chest, while other clubs are “in a hell of a lot of trouble”.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "‘Not happy’: Verstappen rumours grow louder",
        "description": "Max Verstappen had a race to forget at the Bahrain Grand Prix and his camp have blown up at Red Bull in a heated confrontation.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "F1 drama as McLaren dudded by illegal act",
        "description": "Lando Norris is licking his wounds after the Bahrain Grand Prix as a rival driver somehow escaped any santion for an illegal move.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "‘True team man’: Aussie NRL recruit’s surprise visit",
        "description": "A favourite son was a surprise visitor at Queensland training on Friday to further boost spirits ahead of a massive milestone match.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Broken arm sidelines Wallabies captain",
        "description": "Wallabies captain Harry Wilson has suffered an unfortunate injury blow ahead of Queensland’s battle with the ACT Brumbies.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "‘No way I’m playing’: Luka’s emotional return",
        "description": "Luka Doncic was in tears in his emotionally charged, highly-anticipated return to Dallas before producing a vintage display.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Josh Giddey stuns America with ‘monster’ game",
        "description": "Josh Giddey’s NBA hot streak has continued with the Aussie young gun notching up a milestone that puts him in an exclusive club.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Internet melts over Matildas star’s big news",
        "description": "Matildas star Emily van Egmond and her partner have taken to social media to share some life-changing news.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Fans condemn star over sickening tackle",
        "description": "One of the worlds best football players has been torn to shreds after delivering one of the worst tackle attempts you’ll ever see.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Aussie breaks UFC curse, makes shock reveal",
        "description": "Aussie Alex Volkanovski has rewritten the UFC record books, winning an epic title fight to reclaim his belt and become champ again.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "‘Just wrong’ Rory McIlroy image floors fans",
        "description": "An image taken moments after Rory McIlroy won the Masters has stunned fans, with many pointing out how “awkward” it must have been.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "‘No way I’m playing’: Luka’s emotional return",
        "description": "Luka Doncic was in tears in his emotionally charged, highly-anticipated return to Dallas before producing a vintage display.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Warwick Farm, Coffs Harbour previews: Media World to scoop his rivals",
        "description": "Trainer Peter Snowden has planned a campaign targeted at the Brisbane Winter Carnival with Media World and the colt takes his first step on the path when he resumes at Warwick Farm.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "Manhunt begins after ‘manslaughter’ attempt",
        "description": "The cycling world has erupted over a “scumbag” fan’s act of “attempted manslaughter” which rocked a prestigious event.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "12yo quits rugby league over ugly incident",
        "description": "The father of a schoolboy whose shoulder was shattered after a dangerous tackle during a division three rugby league match is calling for change.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    },
    {
        "title": "League hits back after brutal tackle on 12yo",
        "description": "Footage of the tackle shows Oliver being lifted by the other boy and landing on his shoulder.",
        "source": "News AU",
        "fetched_date": "2025-04-15T07:27:51.782300"
    }
]