[
    {
        "title": "Brazil sues China carmaker BYD over 'slave-like' conditions",
        "description": "The Public Labour Prosecutor's Office in the state of Bahia says 220 Chinese workers were rescued.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Temu's Chinese owner sees profits plunge as trade war bites",
        "description": "US-listed shares of PDD Holdings fell over 13% on Tuesday as the firm said its profit had almost halved.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Second suspect arrested in alleged crypto torture scheme",
        "description": "Police say the two men kidnapped an Italian businessman and tortured him with a gun, chainsaw and electrical wires for nearly three weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Chinese-owned Volvo Cars to cut 3,000 jobs",
        "description": "The firm's boss pointed to the \"challenging period\" faced by the industry as a reason for the layoffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Temu's Chinese owner sees profits plunge as trade war bites",
        "description": "US-listed shares of PDD Holdings fell over 13% on Tuesday as the firm said its profit had almost halved.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Trump administration seeks to pull estimated $100m in Harvard funding",
        "description": "Federal agencies will review their grants to the top university to decide whether they should be terminated.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Texas governor signs online safety law in blow to Apple and Google",
        "description": "Under the new law, minors will need parental approval before they can download apps or make in-app purchases.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Tesco shoppers mock 'VAR'-style cameras at self-checkout",
        "description": "The supermarket's latest use of technology to crack down on shoplifting has led to both jokes and complaints.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Winemakers finding Trump's tariffs hard to swallow",
        "description": "Wine producers in both France and the US are unhappy at the US president's trade actions.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Cyber criminals contact BBC to claim hack on Co-op, M&S",
        "description": "Hackers reached out to the BBC's Joe Tidy on Telegram, frustrated that their ransom demands weren't being met.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Frugal tech: The start-ups working on cheap innovation",
        "description": "Indian start-ups are using local materials and innovative ideas to make useful and affordable products.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Adidas says customer data stolen in cyber attack",
        "description": "The sportswear giant says criminals accessed its systems through a \"third-party customer service provider.\"",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Arrests over French cryptocurrency kidnapping plots",
        "description": "The arrests follow several kidnapping plots targeting cryptocurrency executives and their families.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "IMF raises UK growth forecast as it warns on tax and spending",
        "description": "In its annual health-check for the UK economy, the IMF predicted growth of 1.2%, a marginal upgrade to its previous forecast.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "KFC to create 7,000 jobs in UK and Irish growth push",
        "description": "The fried chicken firm will invest nearly £1.5bn over five years as rivals step up expansion.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Beef drives UK food inflation to highest in a year",
        "description": "The British Retail Consortium says the annual rate of food price rises hit 2.8% in May.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Fake discounts on Shein 'breach law', EU says",
        "description": "Shein has one month to respond to the EU's findings or face fines based on its sales, the bloc has said.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Trump agrees to extend EU trade talks after 50% tariff threat",
        "description": "Trump extended the deadline after EU chief Ursula von der Leyen said the bloc needed more time to \"reach a good deal\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "The people who think AI might become conscious",
        "description": "With a leap in the evolution of large language models, some leading thinkers are questioning whether AI might become sentient",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Rate 'rigging' traders say they were scapegoated - now the Supreme Court will decide",
        "description": "Tom Hayes and Carlo Palombo were among 37 City traders prosecuted for \"manipulating\" interest rate benchmarks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Analysis: Trump's tariff plans could spark global economic shock",
        "description": "The move threatens significant volatility in the coming weeks, ahead of a crucial G7 summit in Canada next month.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "EU calls for 'respect' after Trump threatens 50% tariffs",
        "description": "Trade chief Maros Sefcovic said the EU is \"ready to defend\" its interests after Trump threatened 50% tariffs on the bloc.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Boeing to avoid prosecution in US Justice Department deal over crashes",
        "description": "The two crashes happened in 2018 and 2019 and left 346 people dead.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "The Bitcoin hum that is unsettling Trump's Maga heartlands",
        "description": "Trump has said he wants to turn the US into the crypto-mining capital of the world - but that has real-world implications for many of his core voters",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Harvard foreign students face uncertainty as Trump plan to block enrolment is halted - for now",
        "description": "It comes a day after the administration said it had revoked Harvard's access to student visa programmes.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Protestors accuse Trump of corruption as he hosts crypto gala dinner",
        "description": "Trump hosted the biggest investors in his own cryptocurrency, but insisted he put the country ahead of his  businesses interests.",
        "source": "BBC Business",
        "fetched_date": "2025-05-28T07:27:37.043306"
    },
    {
        "title": "Trump Plans to Pardon Reality TV Stars Todd and Julie Chrisley",
        "description": "Lifetime recently announced the Chrisleys, who were convicted of federal bank fraud and tax evasion charges, will be returning to the network with an upcoming reality series from the team behind 'Surviving R. Kelly.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Rick Derringer, Singer-Songwriter Known for ‘Hang on Sloopy’ and ‘Rock and Roll, Hoochie Coo,’ Dies at 77",
        "description": "He worked with a wide range of acts including Steely Dan and Ringo Starr, and he produced \"Weird Al\" Yankovic's first six albums.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Shaboozey Responds to Viral AMAs Side Eye Moment With Megan Maroney",
        "description": "“When you uncover the true history of country music, you find a story so powerful that it cannot be erased,\" the \"A Bar Song (Tipsy)\" singer wrote on X on Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Morgan Wallen Dominates Hot 100 With Six of Top 10 Spots, Tops Chart With Tate McRae on ‘What I Want’",
        "description": "Wallen's 'I'm The Problem' secured the biggest album opening of 2025 so far.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "American Music Awards: 7 Things You Didn’t See on TV",
        "description": "Behind the scenes of Monday's show, where Jennifer Lopez announced a new Las Vegas residency, MGK left early and Becky G leapt into Manuel Turizo's arms.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Ex-Aide to Sean “Diddy” Combs Testifies He Kidnapped Her in Plot to Kill Kid Cudi",
        "description": "Capricorn Clark, the former global brand director for Bad Boy Entertainment, launched the third week of testimony in the trial on a violent note as prosecutors try to prove Combs led a racketeering conspiracy spanning two decades that relied on beefy security employees and others to ensure he got what he wanted.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Shaboozey’s Reaction to Megan Moroney Saying the Carter Family Invented Country Music at AMAs Goes Viral",
        "description": "The two artists were presenting the award for favorite country duo or group at the 2025 American Music Awards.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Rod Stewart Is “Forever Young” While Accepting Lifetime Achievement Award at 2025 AMAs",
        "description": "\"When I started singing the early '60s, the reason I got into it is because I had this burning ambition to sing,\" Stewart said while accepting the honor Monday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "American Music Awards: Full List of Winners",
        "description": "Billie Eilish, SZA, Beyoncé, Eminem, Post Malone, Becky G and Gracie Abrams were among the night's winners at the Las Vegas ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Janet Jackson Performs “Someone to Call My Lover” and “All for You” During First Televised Performance in 7 Years at 2025 AMAs",
        "description": "The five-time Grammy winner hit the stage before she was honored with the Icon Award.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "Jennifer Lopez Kicks Off 2025 AMAs Dancing to Kendrick Lamar, Billie Eilish, Chappell Roan Hits",
        "description": "The \"On The Floor\" singer served as the night's host while also delivering a fierce performance set to the tune of Shaboozey, Bruno Mars, Rosé and Post Malone, among others.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "American Music Awards: Benson Boone, Reneé Rapp, Shaboozey, Tiffany Haddish and More Stars Walk the Carpet",
        "description": "Machine Gun Kelly, Becky G, Lainey Wilson and Nikki Glaser are also in attendance at the 2025 ceremony in Las Vegas on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-28T07:27:37.988536"
    },
    {
        "title": "‘Won’t play’: Rumours swirl over NSW star",
        "description": "NSW have been called out for a “suspicious” move around one player amid rumours the Blues could be set to make a late change.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "AFL star’s ‘extraordinary’ teammate clip",
        "description": "Brisbane Lions captain Lachie Neale has caused a stir with “extraordinary comments” about one of the club’s biggest stars.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "‘Storm in a teacup’: Mitchell slams Sicily concern",
        "description": "Hawthorn coach Sam Mitchell has jumped to the defence of captain James Sicily amid reports he’s led the Hawks injured.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Defender close to Socceroos return",
        "description": "A key defender is set to return to the Socceroos squad for next month’s FIFA World Cup qualifiers against Japan and Saudi Arabia.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Maroon hacked? Origin star’s unusual game-day Bitcoin posts",
        "description": "You would think Lindsay Collins’ attention would be fixed on beating the Blues, but the Maroons enforcer has been handed an unwanted distraction ahead of Origin I.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "‘Won’t play’: Rumours swirl over NSW star",
        "description": "NSW have been called out for a “suspicious” move around one player amid rumours the Blues could be set to make a late change.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Timeline set for top draft pick’s debut",
        "description": "Richmond has unleashed a large number of their bumper haul of top drafts picks from last year, but one of the most exciting is yet to be seen.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "AFL star’s ‘extraordinary’ teammate clip",
        "description": "Brisbane Lions captain Lachie Neale has caused a stir with “extraordinary comments” about one of the club’s biggest stars.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "‘Muddled mess’: Key factor in Marnus’ fate",
        "description": "Cameron Green looks a certainty to return to the Australian team, but a decision on who opens with Usman Khawaja could be determined by one thing.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Green’s third ton ups Marnus pressure",
        "description": "Who opens the batting for Australia in the World Test Championship final remains unclear, but there’s one red-hot batter selectors have to get back into the team.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Aussie launches into rant over tennis reality players ‘can’t stand’",
        "description": "Jordan Thompson has fired a broadside at tour scheduling, describing the demands placed on players as “s**t” while critical of changes to several Masters tier tournaments.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Tennis world in disbelief over Dokic act",
        "description": "Fans have all been left saying the same thing over Jelena Dokic’s French Open act just days after the death of her father.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Ricciardo move sends F1 world into frenzy",
        "description": "F1 fans are convinced Daniel Ricciardo is set to make a shock return to the grid – and it’s all to do with a single image.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "‘Cold blood’: What Norris’ Monaco win means for Oscar Piastri",
        "description": "McLaren team principal Andrea Stella predicted the “cold blood” victory from Lando Norris in Monaco could mark the start of a charge from the Brit in an ominous warning to his title leading teammate Oscar Piastri.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Reds their own worst enemy after falling short in nailbiter",
        "description": "Queensland Reds were shooting for a guaranteed spot in the Super Rugby playoffs and its first win over the Hurricanes since 2013, but were their own worst enemy in a nailbiting loss.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Sliding Reds ‘need to be better’",
        "description": "The Queensland Reds are searching for some answers to their dip in form ahead of the Super Rugby Pacific finals series.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Football star’s girlfriend killed by deer",
        "description": "A former college wide receiver’s girlfriend has been killed in a horrific freak crash that left the ex-football star with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Defender close to Socceroos return",
        "description": "A key defender is set to return to the Socceroos squad for next month’s FIFA World Cup qualifiers against Japan and Saudi Arabia.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Staggering update after car rams into crowd",
        "description": "There has been a remarkable turn of events after a man drove his car into a crowd of football fans, injuring more than 50 people.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "25yo star dies weeks after getting married",
        "description": "Tributes are flowing around the boxing world after a talented fighter died at the age of 25 in a heartbreaking tragedy.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "YouTube guide to conquer US Open beast",
        "description": "A baptism of fire awaits a rookie Australian pro at the US Open on a course that few of the field have ever laid eyes on other than through videos.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Unthinkable ‘choke’ turns NBA on its head",
        "description": "Tyrese Haliburton knocked down a ridiculous game-tying shot, sparking a truly extraordinary Indiana Pacers comeback win.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Gosford, Inverell previews: Duggan hoping for a Divine result",
        "description": "Wet track specialist Divine Bene has conditions to suit on his home track of Gosford as he looks to secure his second win for the preparation.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-28T07:27:39.013510"
    }
]