[
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "HSBC profits jump as bank set for major shakeup",
        "description": "Pre-tax profits rose to $8.5bn in the three months to the end of September, beating analysts' expectations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "McDonald's apologises for E. coli as sales slide",
        "description": "Boss Chris Kempczinski says sorry for the outbreak as the burger giant faces flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Jeff Bezos defends Washington Post's end to election endorsements",
        "description": "The newspaper owner's comments follow the reported loss of subscribers and editorial staff resignations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "TikTok founder becomes China's richest man",
        "description": "Zhang Yiming's fortune has leapt to almost $50bn, according to a newly published rich list.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "UK chancellor's big Budget will set agenda for years to come",
        "description": "Rachel Reeves' historic first Budget will set the agenda for the Labour government for years to come.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Adidas ends 'fight' with Kanye West over antisemitism",
        "description": "The two collaborated on the Yeezy collection but cut ties due to the rapper's controversial comments.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "HSBC profits jump as bank set for major shakeup",
        "description": "Pre-tax profits rose to $8.5bn in the three months to the end of September, beating analysts' expectations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Robust earnings expected for Google's Alphabet - 29 Oct 2024",
        "description": "Expert says Q3 earnings for Google parent company Alphabet promise to be robust, especially in Cloud and AI.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Philadelphia prosecutor sues Musk over $1m swing-states voter lottery",
        "description": "The billionaire has been aggressively campaigning to help Republican candidate Donald Trump win back the White House.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "'It's rough out here': Why Trump and Harris should listen to this mum of seven",
        "description": "Inflation and high prices are primary concerns for Sin City's voters ahead of the 5 November vote.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Australian PM accused of seeking upgrades from Qantas boss",
        "description": "Albanese has said he followed the rules and was \"completely transparent\" with all disclosures.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "JP Morgan sues customers over viral TikTok cheque fraud",
        "description": "“Infinite money glitch” allowed the withdrawal of funds from cheques before they were cleared by the bank.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Can AI make life easier for people with dementia?",
        "description": "AI projects are underway to help ease the challenges of dementia.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Apple's AI features roll out on iPhones - but not for all",
        "description": "The new features include notification summaries and tools to assist users in writing messages.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Why female entrepreneurs are key to getting more women to work",
        "description": "A study highlights how promoting female entrepreneurship can greatly enhance women's workforce participation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Stolen cheese might be sold abroad - supplier",
        "description": "A supplier of cheese stolen in a £300,000 scam said the business was based on trust.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Bus fares to rise to £3 in England under new cap",
        "description": "The new limit replaces the existing £2 cap but some have criticised the decision.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Tariffs hurt his business. He's voting for Trump anyway",
        "description": "Donald Trump's call for sweeping tariffs is resonating, as protectionism gains steam in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "McDonald's Quarter Pounder back  after E. coli outbreak",
        "description": "The fast food giant said beef patty samples had tested negative for the bacteria.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "World's most indebted oil firm is headache for new Mexico leader",
        "description": "Claudia Sheinbaum inherits a buoyant manufacturing sector, but also a troubled state-owned oil firm.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "How my investigation led to sex trafficking charges against ex-Abercrombie boss",
        "description": "Rianna Croxford digs into a cryptic Instagram comment, unravelling allegations of abuse - and now the multi-millionaire is in court.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "'My £250 Child Trust Fund is now worth only £12'",
        "description": "Max Prince was shocked to discover that surprise fees had left him with just £12.39 in his trust fund.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "The couple who took on Google and cost the tech giant £2bn",
        "description": "Shivaun Raff and her husband, Adam, describe their long court battle with technology giant Google.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "The hybrid workers seeking fulfilment in French fields",
        "description": "These part-time farmers say they want the best of both worlds, splitting life between Paris and the country.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "'I can't run a business like this': Why the WordPress row matters",
        "description": "WordPress's tools are used by 40% of the world's websites, making this a spat with big consequences.",
        "source": "BBC Business",
        "fetched_date": "2024-10-30T07:22:50.047943"
    },
    {
        "title": "Emma Bunton, Spice Girl and Media Personality, Signs With WME",
        "description": "Also known as Baby Spice, the performer and host has signed with the agency for representation in all areas.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Joe Rogan Gives Two Reasons Why Kamala Harris Hasn’t Come on Podcast",
        "description": "The podcaster still wants the vice president to appear on his show but says they disagree on a couple of terms; J.D. Vance will appear on his podcast for an interview dropping this week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Actor Jay Johnston of ‘Bob’s Burgers,’ ‘Arrested Development’ Gets Year in Prison for Role in Jan. 6 Riot",
        "description": "Prosecutors sought a heftier sentence than the year Johnston was handed, telling the judge that despite his guilty plea, he showed no remorse for his actions.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Robert Downey Jr.’s Podcast ‘The Sunshine Place’ Will Examine Controversial Rehab Program (Exclusive)",
        "description": "The Audacy-hosted podcast, which topped the Apple Podcasts charts during its first season, will debut its second season on Oct. 30.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "50 Cent Declined $3M Donald Trump Offer to Perform at MSG Rally",
        "description": "The rapper and TV mogul told ‘The Breakfast Club’ he decided against any endorsement as he steers clear of discussing politics and religion.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Olivia Rodrigo on Netflix Concert Film and Voting In Her First Presidential Election: “It Couldn’t Be More Important”",
        "description": "The singer on the part of her new film that makes her mom cry, her advice for pal Chappell Roan and the acting role she would like to play next: \"Nothing to do with music.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Kamala Harris Calls Newspaper Decisions Not to Endorse “Disappointing”",
        "description": "In an interview with Charlamagne tha God, the Democratic nominee said the Washington Post and Los Angeles Times' moves also speak to Donald Trump's ties to billionaires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "CNN Panel Guest Directs Racist Attack on Mehdi Hasan: “I Hope Your Beeper Doesn’t Go Off”",
        "description": "Trump supporter Ryan Gidursky was promptly booted off the show, and CNN later said he would not be welcomed back on the network.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Sean “Diddy” Combs Accused In New Lawsuits of Sexually Assaulting 10- and 17-Year-Old Boys",
        "description": "The lawsuits filed in state Supreme Court in New York are the latest in a wave of lawsuits in which accusers allege they were sexually assaulted by Combs at parties and meetings over the last two decades.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Despite Police Interference, Timothée Chalamet Look-Alike Contest Creates a MrBeast-Style Hit Event",
        "description": "The Oscar-nominated heartthrob was Sunday's look du jour as the viral spectacle of a YouTube creator's surreal Hollywood star fantasia crashed Manhattan's Washington Square Park.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "A Timothée Chalamet Look-Alike Contest Turns Chaotic, As Organizer Plots Next Move",
        "description": "YouTuber Anthony Po's look-alike contest in New York Sunday also drew the real Timothée Chalamet, a police response and $50 prizes for all entrants — and he's got a few more ideas.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Quinta Brunson Honored at EMA Awards: “We All Have to Do What We Can to Hand Over This Planet and Make it Sustainable”",
        "description": "The Environmental Media Association's annual awards also recognized 'Twisters,' 'True Detective: Night Country,' 'Hacks' and more shows and films for their green commitments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-30T07:22:50.552768"
    },
    {
        "title": "Smith calls for big LIV shift",
        "description": "Cam Smith’s tilt at winning another British Open this year wasn’t helped by playing in polar opposite conditions the week before compared to his PGA Tour rivals.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘True pioneer’: AFLW star calls time",
        "description": "A Carlton veteran and GWS foundation player will hang up the boots, but remains hopeful of a farewell game on Saturday night.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "F1 stars caught in bizarre threesome ordeal",
        "description": "F1 driver Pierre Gasly has revealed a truly bizarre proposition he and Charles Leclerc received from a fan that took things too far.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘Fully invested’: New contract for Aussie coach",
        "description": "Another Ashes tour in England and a World Cup title defence are now in the sights of Australia’s all-format cricket coach.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘True pioneer’: AFLW star calls time",
        "description": "A Carlton veteran and GWS foundation player will hang up the boots, but remains hopeful of a farewell game on Saturday night.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘Fall asleep’: Big claim about AFL players",
        "description": "The boss of the AFL Players’ Association has doubled down on controversial comments made following the GWS player sanctions.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "NRL bombshell as star’s contract terminated",
        "description": "The saga over the future of St George-Illawarra captain Ben Hunt has taken the most dramatic twist, with his contract being torn up.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Test team called out over ‘disrespectful’ act",
        "description": "Typically a colourful start to Samoan rugby league games, their pre-match war cry has been accused of crossing a line.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘Fully invested’: New contract for Aussie coach",
        "description": "Another Ashes tour in England and a World Cup title defence are now in the sights of Australia’s all-format cricket coach.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Test contender declares himself ‘ready’",
        "description": "One of the four batters vying for a Test opening spot has made a bold statement on the eve of his selection audition for Australia A.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Demon’s big move towards career first",
        "description": "A superb win by a fellow Aussie could help Alex de Minaur’s rollercoaster 2024 campaign end on a high note.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Kyrgios’ insane Egyptian pyramid conspiracy",
        "description": "Nick Kyrgios, who hasn’t been seen on a tennis court for some time, has voiced his feelings on some of the world’s great conspiracy theories.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "F1 stars caught in bizarre threesome ordeal",
        "description": "F1 driver Pierre Gasly has revealed a truly bizarre proposition he and Charles Leclerc received from a fan that took things too far.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "F1 star’s horror decline laid bare as axe sharpens",
        "description": "Sergio Pérez’s Formula 1 future is in jeopardy after another scoreless race at his home Mexico City Grand Prix, with Kiwi Liam Lawson waiting in the wings for promotion.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘Hurt to watch’: Raygun’s latest move torched",
        "description": "Polarising Aussie breakdancer Raygun is back in the spotlight and she’s divided opinion once again, calling out the public in her latest move.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Brutal sledge as Raygun shows off new look",
        "description": "Raygun has opened up about the emotional toll the Olympic breakdancing saga took on here, and one thing her critics need to get over.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘Ban him for life’: Wild fan act goes viral",
        "description": "Game 4 of the World Series has left America stunned after a pair of fans manhandled a $560m star in bizarre scenes.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "NBA erupts over shocking Ben Simmons act",
        "description": "Battling Aussie Ben Simmons is under a blowtorch once more, accused of playing scared in his latest NBA act against Milwaukee.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘Special’: Matilda reflects on wonder goal",
        "description": "“Proud” midfielder Kyra Cooney-Cross can’t wait to play in front of Australian fans after scoring her first Matildas goal in grand style.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Matildas gun snares top new award",
        "description": "A Matildas star has been recognised for her brilliant year for club and country with a major new international award.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "‘OMG’: Aussie UFC star has jaw shattered",
        "description": "GRAPHIC WARNING: A gruesome photo has emerged showing just how badly Australia’s Rob Whittaker was mutilated in his UFC loss.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Smith calls for big LIV shift",
        "description": "Cam Smith’s tilt at winning another British Open this year wasn’t helped by playing in polar opposite conditions the week before compared to his PGA Tour rivals.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Aussie NBA scout: Issue ‘scared’ Ben may never fix",
        "description": "One week into the new NBA season, we’ve had our first look at the Aussies across the league, many of which are in new spots.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Code war erupts over Aussie golden girls",
        "description": "Rugby Australia are standing in the way of a plan for two of Australia’s biggest Rugby Sevens stars to maximise their earning potential.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Suaalii leaning on sacked Wallaby’s advice",
        "description": "Rugby convert Joseph Suaalii has revealed one of his biggest mentors and it might ring some alarm bells for the sport.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "UK raider emerges as unlikely Cup hope in Bendigo romp",
        "description": "Sea King, who travelled to Australia primarily as a galloping partner, is now a genuine Melbourne Cup chance after his runaway win in the Bendigo Cup.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-10-30T07:22:52.069912"
    }
]