[
    {
        "title": "Senate Republicans advance Trump's 'Big Beautiful Bill' but final vote hangs in balance",
        "description": "Senate leadership twisted arms for an initial vote on the spending plan, which still needs final approval.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which is set for a Senate vote, includes sweeping changes to taxes, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Japan loves them. And now they're in the UK - strawberries and cream sandwiches",
        "description": "Serving strawberries in a sandwich might sound unusual in the UK, but it's nothing new in Japan.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "'We can't do without these people': Trump's migrant crackdown has businesses worried",
        "description": "President Donald Trump's crackdown on immigrants could have serious economic repercussions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which is set for a Senate vote, includes sweeping changes to taxes, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "'In business, indecision is killer': Canadian firms seek certainty in tariff war",
        "description": "Intense US-Canada negotiations for a potential new trade and security deal have hit a snag ahead of a mid-July deadline.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "'We have all the cards' - Trump says he is ending Canada trade talks",
        "description": "Canada had been hoping to secure a trade deal with the US next month to avoid steep tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "'I tell my children not to play so we save money on soap'",
        "description": "High inflation and a cost-of-living crisis means many Malawians, like Suzanna Kathumba, face tough choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Why your old mobile phone may be polluting Thailand",
        "description": "The Asian nation is importing thousands of tonnes of electronic waste per year, despite a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Russia's economy is down but not out",
        "description": "The country's economy has been surprisingly resilient but there are underlying problems.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Markets near record highs despite headwinds - 26 Jun 2025",
        "description": "Expert says investors are buying into reduced uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Should we be letting flies eat our food waste?",
        "description": "In Lithuania and Australia, hungry fly larvae are used to process food waste into useful protein.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Lotus considering shifting UK production to US",
        "description": "The BBC understands the car maker is considering the move amid the introduction of US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "UK car production plunges to 76-year low for May",
        "description": "Exports to the US halved as President Donald Trump's tariffs caused some UK car makers to halt shipments.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Nike pledges to cut reliance on Chinese factories",
        "description": "Company executives say the sportwear giant will cut its reliance on producing goods in China to ease the impact of US trade policies.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Satirical Bezos mannequins pop up in Venice ahead of wedding",
        "description": "Unflattering installations depicting Amazon founder and his bride-to-be are attracting attention in the Italian city.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "The woman who could bust Trump's 'big beautiful bill'",
        "description": "The Senate parliamentarian, often called a referee, has thrown a spanner in Trump's tax bill.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Canada passes law fast-tracking 'nation-building' projects to counter Trump",
        "description": "The government hopes the legislation will reduce dependence on the US, but has drawn criticism from environmental groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Rising school fees push Indian families to the brink",
        "description": "Parents accuse private schools of steep fee raises which are stretching budgets to breaking point.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Pound hits near 4-year high as Trump rattles dollar",
        "description": "A report that the US President could name the new head of the central bank early raises concerns over its independence.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Anna Wintour stepping back as US Vogue's editor-in-chief",
        "description": "Dame Anna, who has been editor-in-chief for 37 years, will continue to hold a senior role at the company.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "'Made in the USA' reference disappears from Trump phone listing",
        "description": "Trump Mobile maintains the gold smartphone will be made in the US, despite the  changed wording on its website.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "BBC website in US launches paid subscription service",
        "description": "US-based users will have to pay $49.99 (£36) a year for access to most BBC News content.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "North Korea to open beach resort as Kim bets on tourism",
        "description": "Wonsan Kalma opens to domestic tourists on 1 July, six years after it was due to be completed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Thailand's 'weed wild west' faces new rules as smuggling to UK rises",
        "description": "A number of British travellers have been arrested and prices have collapsed due to overproduction.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "'Our food doesn't even last the month': Americans brace for Trump's welfare cuts",
        "description": "About 16% of West Virginians rely on a federal food subsidy programme that is facing big cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "The virtually abandoned Florida airport being turned into 'Alligator Alcatraz'",
        "description": "Surrounded by alligator infested swamps, BBC Mundo visited the site forming part of the Trump administration's mass deportation agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-06-29T07:26:27.217530"
    },
    {
        "title": "Dolly Parton’s Vegas Residency Sold Out in 90 Minutes: Here’s How Fans Can Still Snag Tickets",
        "description": "The six-show engagement marks the country legend's first extended run in 32 years. Here's how to secure seats with THR-exclusive promo codes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Matty Healy Gives Mixed Message on Politics as The 1975 Kick Off Glastonbury Headline Sets",
        "description": "\"I know I'm meant to be a rockstar but this is really scary and I'm really nervous,\" said the band's frontman to the 100,000+ crowd Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Rebekah Del Rio, Singer in ‘Mulholland Drive’s’ Club Silencio Scene, Dies at 57",
        "description": "The musician first crossed paths with the legendary late director David Lynch thanks to agent Brian Loucks.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Sean Combs’ Son Releases New Song ‘Diddy Free’ With Kanye West",
        "description": "Before Diddy's team gave closing arguments in his criminal trial on Friday, West and Christian Combs released the song through the EP 'Never Stop.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Germany Arrests Syrian National Over 2024 Terrorist Plot At Taylor Swift Show",
        "description": "The arrest comes nearly a year after the thwarted plot forced Swift to cancel three Eras Tour concerts in Vienna.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Diddy’s Top Attorney Admonished by Judge After Sarcasm-Heavy Closing Argument",
        "description": "Following Thursday's four-and-a-half-hour salvo from prosecutors, Sean Combs' top defense lawyer struck a mocking tone on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Penny Noble, Veteran Talent Agent, Dies",
        "description": "She founded Noble Talent Management in Toronto, the forerunner of major Canadian banner Noble Caplan Abrams.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "The ‘Barbie,’ ‘Twisters’ Soundtrack Producer Hopes to Strike Gold Again With ‘F1’",
        "description": "Atlantic Records' president of west coast Kevin Weaver has produced some of the biggest soundtracks of the past several years and tapped Ed Sheeran, Rosé and Burna Boy for his latest on 'F1.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Gavin Newsom Sues Fox News for $787 Million Over Claims He Lied About a Trump Call",
        "description": "The California governor says that the news outlet had used deceptive edits to claim that the governor had lied in saying that Trump had not called him about deploying National Guard troops during the L.A. protests.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "K-Pop Girl Group Aespa Is Exactly Where They Want to Be",
        "description": "The four-member group, who spent the last year dominating Korean music charts, is back with a new sound and a new single.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Lorde Performs Surprise Glastonbury Set on Day of Album Release: “I’m Back and Completely Free”",
        "description": "The singer told Glastonbury-goers: \"This record took me a lot, I didn't know if I would make another record to be honest.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    },
    {
        "title": "Lorde Summer Officially Arrives With New Album ‘Virgin’",
        "description": "'Virgin' marks the New Zealand superstar's first new album since 2021's 'Solar Power.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-29T07:26:27.612544"
    }
]