[
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Why Wikipedia has landed in legal trouble in India",
        "description": "India’s largest newswire service ANI has filed a $237,874 defamation lawsuit against Wikimedia Foundation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "The country has launched a campaign to encourage more international visitors.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "UK Budget 2024: Key points at a glance",
        "description": "Chancellor Rachel Reeves has delivered Labour’s first Budget since 2010 – here’s what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "UK growth set to peak next year before slowing again",
        "description": "The government's official forecaster raises its prediction for UK growth in 2024 and 2025 but reduces it for later years.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Robust earnings expected for Google's Alphabet - 29 Oct 2024",
        "description": "Expert says Q3 earnings for Google parent company Alphabet promise to be robust, especially in Cloud and AI.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Jeff Bezos defends Washington Post's end to election endorsements",
        "description": "The newspaper owner's comments follow the reported loss of subscribers and editorial staff resignations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Philadelphia prosecutor sues Musk over $1m swing-states voter lottery",
        "description": "The billionaire has been aggressively campaigning to help Republican candidate Donald Trump win back the White House.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "UK-based stars support US video game strikes as row continues",
        "description": "Famous voices from releases such as The Witcher and Cyberpunk 2077 say they support the SAG-Aftra strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "TikTok founder becomes China's richest man",
        "description": "Zhang Yiming's fortune has leapt to almost $50bn, according to a newly published rich list.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Adidas ends 'fight' with Kanye West over antisemitism",
        "description": "The two collaborated on the Yeezy collection but cut ties due to the rapper's controversial comments.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "McDonald's apologises for E. coli as sales slide",
        "description": "Boss Chris Kempczinski says sorry for the outbreak as the burger giant faces flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "HSBC profits jump as bank set for major shakeup",
        "description": "Pre-tax profits rose to $8.5bn in the three months to the end of September, beating analysts' expectations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Australian PM accused of seeking upgrades from Qantas boss",
        "description": "Albanese has said he followed the rules and was \"completely transparent\" with all disclosures.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "JP Morgan sues customers over viral TikTok cheque fraud",
        "description": "“Infinite money glitch” allowed the withdrawal of funds from cheques before they were cleared by the bank.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Can AI make life easier for people with dementia?",
        "description": "AI projects are underway to help ease the challenges of dementia.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Apple's AI features roll out on iPhones - but not for all",
        "description": "The new features include notification summaries and tools to assist users in writing messages.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Why female entrepreneurs are key to getting more women to work",
        "description": "A study highlights how promoting female entrepreneurship can greatly enhance women's workforce participation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Stolen cheese might be sold abroad - supplier",
        "description": "A supplier of cheese stolen in a £300,000 scam said the business was based on trust.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Bus fares to rise to £3 in England under new cap",
        "description": "The new limit replaces the existing £2 cap but some have criticised the decision.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "Tariffs hurt his business. He's voting for Trump anyway",
        "description": "Donald Trump's call for sweeping tariffs is resonating, as protectionism gains steam in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "McDonald's Quarter Pounder back  after E. coli outbreak",
        "description": "The fast food giant said beef patty samples had tested negative for the bacteria.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "World's most indebted oil firm is headache for new Mexico leader",
        "description": "Claudia Sheinbaum inherits a buoyant manufacturing sector, but also a troubled state-owned oil firm.",
        "source": "BBC Business",
        "fetched_date": "2024-10-31T07:22:57.792872"
    },
    {
        "title": "CNN Panel Guest Directs Racist Attack on Mehdi Hasan: “I Hope Your Beeper Doesn’t Go Off”",
        "description": "Trump supporter Ryan Gidursky was promptly booted off the show, and CNN later said he would not be welcomed back on the network.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Jennifer Aniston Says She’s Voting for “Sanity and Human Decency” After Casting Ballot for Kamala Harris",
        "description": "\"Let’s please end this era of fear, chaos and the attacks on our democracy — and vote for someone who will unite us and not continue to threaten to divide us,\" the actress wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Nicky Jam Retracts Trump Endorsement Following Puerto Rico Controversy",
        "description": "Jam had previously appeared at a Trump rally but told followers on Wednesday he never expected \"a comedian would appear to criticize and talk badly about my [Puerto Rico].\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Metro Boomin Sued Over Alleged 2016 Rape",
        "description": "The lawsuit points to lyrics from one of the producer's songs allegedly referencing the assault. He denied the allegations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Why Historians Will Be Agog Over ‘Gladiator II’",
        "description": "Plus, AI explores the South Pole and 'Star Trek' actress Jess Bush has a bee in her bonnet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Selena Gomez to Receive Equity in Entertainment Award at The Hollywood Reporter’s 2024 Women in Entertainment Gala",
        "description": "The multihyphenate joins Nicole Kidman, who as previously announced will receive the Sherry Lansing Leadership Award, as an honoree at this year’s event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "George Gascón’s Re-election Hail Mary: Freeing the Menendez Brothers",
        "description": "The Los Angeles DA’s soft-on-crime rep is a big reason he’s expected to lose his bid. So why is he showing last-minute leniency to the convicted killers?",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Saoirse Ronan Did Not Expect “Wild” Reaction to Viral Talk Show Clip on Women’s Safety",
        "description": "The 'Blitz' star addressed the online response to 'The Graham Norton Show' clip where she pointed out to Paul Mescal, Denzel Washington and Eddie Redmayne how often women think about their safety.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Aubrey Plaza Tells Trump Rally Comedian Tony Hinchcliffe to “Go F*** Yourself” in Response to His “Disgusting” Puerto Rico Joke",
        "description": "The remark that likened the U.S. territory to a \"floating island of garbage\" was swiftly condemned by Puerto Rican stars including Jennifer Lopez and Bad Bunny.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "How the National Film Institute of Hungary Is Bridging the Gap Between Hollywood and Budapest",
        "description": "With four new sound stages and a robust tax rebate — which has just been extended for another six years —  it's no wonder the country has recently played host to filmmakers like Francis Ford Coppola and Brady Corbet and A-listers like Angelina Jolie and Kate Winslet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Arnold Schwarzenegger Endorses Kamala Harris and Tim Walz: “I Will Always Be an American Before I Am a Republican”",
        "description": "\"I want to move forward as a country, and even though I have plenty of disagreements with their platform, I think the only way to do that is with Harris and Walz,\" he wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "Jimmy Kimmel Makes Plea to Republicans Ahead of Election: “This Is About Sanity and Security and Democracy”",
        "description": "The host asked people to \"ask a Republican you love\" to watch 'Jimmy Kimmel Live!' Wednesday night, as his monologue was specifically for them.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-31T07:22:57.983964"
    },
    {
        "title": "‘Proud’: Aussie stars reveal new role",
        "description": "Music star Baker Boy and AFL prodigy Daniel Rioli have both taken on an important new role they hope will help make a major difference.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘Horrible’: Wild Verstappen conspiracy theory",
        "description": "The man who penalised Max Verstappen for his tactics against Lando Norris as blasted the F1 champion’s “horrible mindset”.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Duck adds to teen’s ‘incredible challenge’",
        "description": "A duck for Australia A may have complicated Sam Konstas’ path to the Test side, with the national coach outlining another issue.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘No endpoint’: Coach walks transition tightrope",
        "description": "Australia’s ageing core of players can’t be rushed out the door too quickly, according to the coach who will oversee the next three years.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘Proud’: Aussie stars reveal new role",
        "description": "Music star Baker Boy and AFL prodigy Daniel Rioli have both taken on an important new role they hope will help make a major difference.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Hawks move exposes AFL ‘farce’",
        "description": "A rule established to help AFL teams develop young talent is being exposed by clubs exploiting it for their own list management games.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Reece Walsh finally decides his NRL future",
        "description": "The Broncos have avoided a November 1 feeding frenzy with superstar fullback Reece Walsh officially taken off the market.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘Bring premierships’: Walsh vow after inking mega deal",
        "description": "The Broncos have avoided a November 1 feeding frenzy with superstar fullback Reece Walsh officially off the market.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Duck adds to teen’s ‘incredible challenge’",
        "description": "A duck for Australia A may have complicated Sam Konstas’ path to the Test side, with the national coach outlining another issue.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘No endpoint’: Coach walks transition tightrope",
        "description": "Australia’s ageing core of players can’t be rushed out the door too quickly, according to the coach who will oversee the next three years.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Aussie star goes berserk, takes big scalp",
        "description": "Australia’s Alexei Popyrin has blown up in an X-rated rant on his way to another big win over a top 10 opponent at the Paris Masters.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Huge Aussie double helps rankings surge",
        "description": "Two more big wins in Paris for Aussie men continued a resurgence that has created a stunning rankings feat.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘Horrible’: Wild Verstappen conspiracy theory",
        "description": "The man who penalised Max Verstappen for his tactics against Lando Norris as blasted the F1 champion’s “horrible mindset”.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "F1 stars caught in bizarre threesome ordeal",
        "description": "F1 driver Pierre Gasly has revealed a truly bizarre proposition he and Charles Leclerc received from a fan that took things too far.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Raygun’s attempt to ‘cash in’ gets rejected",
        "description": "Raygun’s bid to cash in on her fame in the wake of the Olympics has hit a major roadblock as she looks to capitalise on the saga.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘Hurt to watch’: Raygun’s latest move torched",
        "description": "Polarising Aussie breakdancer Raygun is back in the spotlight and she’s divided opinion once again, calling out the public in her latest move.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘Ban him for life’: Wild fan act goes viral",
        "description": "Game 4 of the World Series has left America stunned after a pair of fans manhandled a $560m star in bizarre scenes.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "NBA erupts over shocking Ben Simmons act",
        "description": "Battling Aussie Ben Simmons is under a blowtorch once more, accused of playing scared in his latest NBA act against Milwaukee.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Blow for Sydney as stars to miss Roar battle",
        "description": "There has been mixed news on the injury front for Sydney FC ahead of the Sky Blues’ A-League clash with Brisbane Roar.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Postecoglou stuns football with mega upset",
        "description": "Ange Postecoglou is having a tough start to the Premier League season but Tottenham have stunned England’s best team in a huge upset.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "‘OMG’: Aussie UFC star has jaw shattered",
        "description": "GRAPHIC WARNING: A gruesome photo has emerged showing just how badly Australia’s Rob Whittaker was mutilated in his UFC loss.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Smith upstaged by protege in Aussie return",
        "description": "Cam Smith lived up to his star billing at the Queensland PGA Championship but was trumped by one of his former scholarship holders.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Aussie Boomers get a new coach, for now",
        "description": "Without a locked-in replacement for legendary Boomers coach Brian Goorjian, one of his former staff members will take charge for two upcoming games.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "NRL great ‘disappointed’ by anthem stance",
        "description": "Players make their own decisions about singing the national anthem before matches and it doesn’t sit well with one NRL great.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Aussie Olympians’ $100k pay day blocked",
        "description": "Rugby Australia are standing in the way of a plan for two of Australia’s biggest Rugby Sevens stars to maximise their earning potential.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Melbourne Cup jockey cap to honour late McKenna",
        "description": "A Melbourne Cup jockey will wear a special cap to honour the late, great racehorse owner and breeder Col McKenna.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-10-31T07:23:00.929816"
    }
]