[
    {
        "title": "World's police in technological arms race with Nigerian mafia",
        "description": "A series of covert operations target a feared Nigerian cyber-crime network with a global reach.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Man posing as YouTube star jailed for global sextortion",
        "description": "Muhammad Zain Ul Abideen Rasheed blackmailed 286 people - majority of them children - from 20 countries.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "UK water firms to say bill cap plan is 'material risk'",
        "description": "Industry lobby group Water UK will say on Wednesday plans \"hamper\" firms' ability to improve services.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Zuckerberg regrets bowing to Biden 'pressure' over Covid",
        "description": "The billionaire says White House officials pressured Meta to remove content 'for months' in 2021.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Two Delta workers killed while servicing plane at airport",
        "description": "Few details are available on the incident, which took place in a Delta Air Lines maintenance facility.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Man posing as YouTube star jailed for global sextortion",
        "description": "Muhammad Zain Ul Abideen Rasheed blackmailed 286 people - majority of them children - from 20 countries.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Tanker attacked by Houthis could be leaking oil - US",
        "description": "The Greek-flagged MV Sounion is on fire after being attacked several times last week, the Pentagon says.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Can Barbie help beat teen smartphone addiction?",
        "description": "Manufacturer HMD says it is trying to help people who want less 'digital impact' in their lives.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Starmer in Berlin to 'turn corner on Brexit'",
        "description": "The UK is set to start talks on a treaty with Germany, as the government looks to reset relations with Europe.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "UK water firms to say bill cap plan is 'material risk'",
        "description": "Industry lobby group Water UK will say on Wednesday plans \"hamper\" firms' ability to improve services.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Olympic legend Lindsey Vonn explains the mindset of a winner",
        "description": "The decorated US downhill skier opens up to Katty Kay about the mental state that led her to gold medal victory and the \"hole\" that's left when her mind isn't on winning anymore.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "UK to spend £10.5m on new EU border checks",
        "description": "Travellers from the UK and other non-EU countries will soon have to go through a new digital border system.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Scotland's fiscal outlook messy and 'painful'",
        "description": "Douglas Fraser looks at why budgets are so tight - and what the future holds.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Have Swiss scientists made a chocolate breakthrough?",
        "description": "The whole of the cocoa fruit is used in production, rather than just the beans.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Autumn Budget will be painful, warns Starmer",
        "description": "The PM said he would have to make \"big asks\" from the public for the \"long-term good\".",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "'We did it!' Next shop workers win equal pay claim",
        "description": "In-store staff, who are mostly women, should be paid the same as warehouse workers, a tribunal rules.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Starmer cancels Sunak's £40m helicopter contract",
        "description": "Labour scraps the ex-PM's 'VIP helicopter service', saying it was a waste of public money.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Gruffalo's Child to go on limited edition 50p coin",
        "description": "The main character of the sequel sharing her name will appear on several versions of the coin.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Homes seized from landlord after complaints ignored",
        "description": "Merton council uses the Housing Act 2004 to divert rents and fund the repairs over the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "What taxes might UK chancellor Rachel Reeves raise?",
        "description": "The government says taxes will have to rise to fix the public finances - but which ones could go up?",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Shop prices fall for first time in nearly three years",
        "description": "Prices in August were down 0.3% from a year ago, the first fall since October 2021, a retail group says.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Ikea trials resale website to rival eBay and Gumtree",
        "description": "Ikea Preowned launches in Oslo and Madrid, with a global rollout expected by the end of the year.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "ScotRail driver strikes on hold but reduced timetable continues",
        "description": "Train drivers' union Aslef withdraws its ballot for industrial action with members to vote on the offer.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Qantas sells cut-price first-class fares by mistake",
        "description": "The airline said it will refund or rebook passengers who bought wrongly-priced tickets due to a coding error.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Defence firms 'need reassuring' that big orders will be long-term",
        "description": "Western military production has ramped up due to Ukraine, but will it continue after the war ends?",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Australians get 'right to disconnect' after hours",
        "description": "A new law has come into effect that allows employees to ignore communications from employers after hours.",
        "source": "BBC Business",
        "fetched_date": "2024-08-28T07:21:02.169781"
    },
    {
        "title": "Lake Tahoe sees first August snow in 20 years",
        "description": "The unseasonable weather comes months before the local ski season in the Sierra Nevada is due to start.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "The deceptive power of a category 1 hurricane",
        "description": "Don't be lured into a false sense of security by a category one hurricane – storm surge and flooding mean they can be as dangerous as a category five.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Fisherman finds 'vampire fish' in local river",
        "description": "Jason Moore says lampreys look \"a little bit frightening\" like \"something out of a sci-fi movie\".",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Dumping of Bible verse bottles in river seemingly stops",
        "description": "An environmental group called for an end to plastic bottles with bible verses being thrown into the River Bann.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Safari park welcomes flamingo chicks",
        "description": "An animal park is experiencing a \"baby boom\", including new flamingo chicks that recently hatched.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Seagull species in serious decline, say experts",
        "description": "The decrease is because of the loss of nesting habitat and lack of food availability, the RSPB says.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Berkshire's Big Picture: Tuesday's image of the county",
        "description": "Showcasing the best images sent to us from around Berkshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Dorset's Big Picture: Tuesday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Oxfordshire's Big Picture: Tuesday's image of the county",
        "description": "Showcasing the best images sent to us from around Oxfordshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Hampshire & Isle of Wight: Tuesday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "Golf clubs fight biodiversity loss",
        "description": "A total of 14 golf clubs took part in the seminar to help green-keepers create havens for wildlife.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-28T07:21:02.256712"
    },
    {
        "title": "CNN Lands Kamala Harris and Tim Walz Joint Interview",
        "description": "Vice President Kamala Harris and Minnesota Gov. Tim Walz will have their first joint interview on CNN since becoming the Democratic presidential and vice presidential nominees last week. The pair will sit down exclusively with CNN anchor and chief political correspondent Dana Bash in Georgia, a crucial battleground state in the November election. The interview also marks Harris’ first […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Disgraced Attorney Thomas Girardi Found Guilty of Stealing $15M From Clients",
        "description": "Disgraced plaintiffs’ personal injury attorney Thomas Girardi has been found guilty of stealing at least $15 million from former clients he claimed to champion. A federal court jury in Los Angeles found the former husband of Erika “Jayne” Girardi, of Bravo’s The Real Housewives of Beverly Hills, guilty on four counts of wire fraud. Girardi, 85, of […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Brittany Cartwright Files for Divorce From Jax Taylor",
        "description": "Nearly six months after announcing their split, The Valley star Brittany Cartwright has filed for divorce from Jax Taylor.  TMZ was the first to break the news, reporting that Cartwright cited irreconcilable differences as the reason for her divorce from the Vanderpump Rules alum. The date of their separation is listed as Jan. 24. Cartwright […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "VMAs: Anitta, Karol G, LL Cool J and Shawn Mendes Join Performers Lineup",
        "description": "Anitta, Karol G, LL Cool J and Shawn Mendes have been tapped to perform at the 2024 MTV Video Music Awards. They’ll take the stage at the awards show, airing live at 8 p.m. ET/PT on Sept. 11 from New York’s UBS Arena. These artists join previously announced performers Lenny Kravitz, Halsey, Blackpink‘s Lisa, Benson Boone, Sabrina Carpenter, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "‘Rings of Power’ Star Morfydd Clark Was “Totally Unprepared” for Fan Hate Toward Galadriel",
        "description": "The Rings of Power star Morfydd Clark has addressed the backlash she received for her portrayal of young Galadriel. “I was just totally unprepared when season 1 came out,” admitted Clark in a profile for Elle. “I’ve seen a really dark side of what it means to be someone who [anyone] can write a message […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Oasis Confirm Reunion, Plan Series of U.K., Ireland Gigs in 2025",
        "description": "It’s official: Noel and Liam Gallagher have decided to reform Oasis, with the band set to perform a series of massive, money-spinning reunion concerts in 2025. The band’s official social media accounts teased a big announcement set for 8 a.m. U.K. time on Tuesday. And the reveal will excite fans, as it confirmed feverish speculation […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "DNC Executive Producer: Even My Staff Believed Beyoncé Was Coming",
        "description": "Live-show veterans Ricky Kirshner and Glenn Weiss just came off a very strongly rated Democratic National Convention — more than 26 million people tuned in Thursday night to watch Vice President Kamala Harris accept the presidential nomination. The Emmy-decorated pair (Kirshner executive produced; Weiss directed) fashioned a four-day event marked by both flash and substance. Though the DNC veterans […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Diddy Files Motion to Dismiss Lil Rod Lawsuit, Lawyer Calls Grooming, Assault Claims “Pure Fiction”",
        "description": "Rap and fashion mogul Sean “Diddy” Combs filed a motion on Monday to dismiss the explosive civil case filed by Lil Rod, which accused Combs of grooming him and exposing him to several crimes, including drug trafficking, sexual assault and serving drug-laced cocktails at his infamous parties. The motion in the Rodney Jones v. Sean […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Mariah Carey Says Her Mother and Sister Died on the Same Day: “My Heart Is Broken”",
        "description": "Mariah Carey shared on Monday that her mother and sister died on the same day last weekend. “My heart is broken that I’ve lost my mother this past weekend. Sadly, in a tragic turn of events, my sister lost her life on the same day,” the Grammy-winner told The Hollywood Reporter. “I feel blessed that […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Trump and Associates Set to Face Isaac Hayes’ Estate in Court Over Use of Songwriter’s Music",
        "description": "Team Trump and multiple associations and organizations affiliated with the former president will finally have to appear before a judge to explain its unauthorized use of popular music at the GOP candidate’s rallies and events, which has gone on for years but is being threatened by the estate of recording legend Isaac Hayes, which was […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Matthew Perry’s “Street Dealer” Managed High-End Rehab Where Client Died",
        "description": "Two entertainment industry figures connected to Matthew Perry’s death, one of whom pled guilty in the federal investigation, were involved in another fatal L.A. area overdose nearly three years earlier, family members of the deceased tell The Hollywood Reporter. Erik Fleming, a former film director and TV producer with a colorful résumé, was recently described […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Angie Martinez to Make Directorial Debut With Doc on Seminal Hip-Hop Figure DJ Clark Kent (Exclusive)",
        "description": "Veteran radio personality Angie Martinez is set to make her directorial debut with a feature-length documentary on seminal hip-hop figure DJ Clark Kent. God’s Favorite DJ: The Story of DJ Clark Kent will be produced in partnership with Green Leaf Productions and Mark Sparks Productions, and it will include appearances by popular acts like Jay-Z, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-28T07:21:02.612246"
    },
    {
        "title": "Zepto, snagging $1 billion in 90 days, projects 150% annual growth",
        "description": "Zepto co-founder Aadit Palicha told a group of analysts and investors on Tuesday that the three-year-old Indian delivery startup anticipates growth of 150% in the next 12 months, a remarkable…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "India’s VerSe buys Valueleaf to boost digital marketing",
        "description": "VerSe Innovation, India’s content tech startup, has acquired digital marketing firm Valueleaf Group to bolster its presence in the Indian digital ad space.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "One busted valve led to the failure of Astrobotic’s $108M Peregrine lunar lander mission",
        "description": "Astrobotic’s Peregrine lunar lander failed to reach the moon because of a problem with a single valve in the propulsion system, according to a report on the mission released Tuesday.…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Meta and Instagram spotted developing a new social music-sharing feature",
        "description": "Meta and Spotify are exploring deeper music integration in Meta’s Instagram app. New findings indicate the companies are testing a feature that would allow users to continuously share what music…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "How Techstars, Meta helped profitable LatAm startup Mercately raise a $2.6M seed",
        "description": "In Latin American countries like Brazil and Chile, messaging platform WhatsApp has become one of the most popular apps to use to buy things online. It was even the e-commerce…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Will HP still demand $4B from Mike Lynch’s estate?",
        "description": "Before entrepreneur and investor Mike Lynch died along with six others after the yacht they were on capsized in a storm last week, the party was celebrating Lynch’s victory in…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Why AI can’t spell ‘strawberry’",
        "description": "How many times does the letter “r” appear in the word “strawberry”? According to formidable AI products like GPT-4o and Claude, the answer is twice. Large language models (LLMs) can…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "The SEC just made life a little easier for smaller VCs",
        "description": "The SEC has updated its limits to the amount of money a “qualified venture fund” can raise to $12 million from $10 million.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "The US military’s latest psyop? Advertising on Tinder",
        "description": "Tinder removed the U.S. military ads, saying the campaign violated the company’s policies.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Just how much cash does Stripe have?",
        "description": "Welcome to TechCrunch Fintech! This week, we’re looking at the craziness that is Bolt’s proposed fundraise, how much money Synapse’s founder has raised for his new venture, just how much…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Eric Ly from KarmaCheck shares his entrepreneurial lessons after decades in the industry",
        "description": "Eric Ly has a storied career: He started as an engineering intern at IBM, and 20 years later found himself co-starting and serving as the…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Lyft follows in Uber’s footsteps with a rider verification program",
        "description": "In an effort to improve its security measures, Lyft announced Tuesday a new rider verification pilot program to help drivers verify riders’ identities and ensure that they are indeed who they say…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "TechCrunch Minute: Boeing’s Starliner spacecraft is returning home empty",
        "description": "Astronauts Butch Wilmore and Suni Williams are stuck aboard the International Space Station (ISS) after their test flight on Boeing’s Starliner went awry. This weekend,…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Polaris Dawn will push the limits of SpaceX’s human spaceflight program — here’s how to watch it launch live",
        "description": "Update: The Polaris Dawn launch has been pushed back a day and is now planned for Wednesday, August 28 after a helium leak was detected ahead of its takeoff. After…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Creators are angered by Meta’s Spark AR shutdown, saying they’ll be out of work with little notice",
        "description": "Meta will be shutting down Spark AR, its platform of third-party AR tools and content, effective January 14, 2025.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Waymo expands its curbside robotaxi service to Phoenix airport",
        "description": "Waymo said Tuesday it will start offering riders 24/7 access to curbside pickups and drop-offs at Phoenix Sky Harbor International Airport terminals 3 and 4 — yet another example of…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Is open source AI possible, let alone the future? Find out at TechCrunch Disrupt 2024",
        "description": "Some believe open source AI is a way to break out of the familiar proprietary software quagmire that the technology has predictably fallen into. Hugging Face’s Irene Solaiman and AI2’s…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Students and recent grads: Save on TechCrunch Disrupt 2024 tickets",
        "description": "It’s back-to-school season, and that often means a surge in expenses. Or perhaps you’ve recently graduated and are navigating the job hunt. Either way, your wallet might be feeling the…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "13 years later, Snapchat finally rolls out native support for iPads",
        "description": "Snapchat is officially rolling out native support for iPad, the company announced in the app’s latest release notes. Since Snapchat’s launch in 2011, the social networking app has only been…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Chinese government hackers targeted US internet providers with zero-day exploit, researchers say",
        "description": "A group of hackers linked to the Chinese government used a previously unknown vulnerability in software to target U.S. internet service providers, security researchers have found.  The group known as…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-28T07:21:02.908823"
    },
    {
        "title": "Footballer dead after collapsing on pitch",
        "description": "Tributes have poured in after a 27-year-old footballer collapsed on the pitch during a match in Brazil and later passed away.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Former AFL rookie wins NFL spot",
        "description": "There was a guarantee an Australian would be punting for the New Orleans Saints this NFL season and it was a former AFL draftee who took the spot.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Latrell drama ‘completely unprofessional’",
        "description": "The Rabbitohs have been called out for their handling of the latest Latrell Mitchell drama after his makeshift press conference.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Not my job’: Bellamy blasts rest critics",
        "description": "The Melbourne Storm coach left no doubt what he thought of those attacking his decision to rest 11 of his best players.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Demons star set to walk out on club",
        "description": "Melbourne are set for a blockbuster offseason with another player set to depart the club as he seeks a fresh start with more opportunity.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Hawks excited but cautious over star’s request",
        "description": "Hawthorn captain James Sicily has answered questions about the prospect of being joined by two rival defenders next season.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Latrell drama ‘completely unprofessional’",
        "description": "The Rabbitohs have been called out for their handling of the latest Latrell Mitchell drama after his makeshift press conference.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Not my job’: Bellamy blasts rest critics",
        "description": "The Melbourne Storm coach left no doubt what he thought of those attacking his decision to rest 11 of his best players.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Controversial spinner tries to make BBL return",
        "description": "A leg-spinner who had his visa denied to play in the T20 World Cup is trying to make a return to Australian domestic cricket.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Emerging Aussie ‘hungry’ for Test chance",
        "description": "One of Australia’s top batting prospects won’t let his exploding T20 schedule get in the way of his main goal as he also becomes a father.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Horror’: Naomi Osaka photos you need to see",
        "description": "The tennis world is usually known for pretty plain outfits but some new Naomi Osaka photos are going viral.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Best ever’ win as Aussie stuns tennis world",
        "description": "He felt a little silly dropping to the ground after an opening round stunner at the US Open, but it was a win that meant a lot for an Aussie gun among 10 into the second round.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Star’s message pours fuel all over F1 feud",
        "description": "A Formula 1 star has poured fuel all over his ongoing feud with a rival as their championship battle looks set to go down to the wire.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Damning admission as F1 blown wide open",
        "description": "Red Bull’s run of dominance in F1 is crumbling around them as the team boss made a startling admission over one of their rivals.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Influencers go to war in heated feud",
        "description": "Two sporting social media influencers are engaged in an ugly online spat after one called out the other for stealing her content.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Should be cancelled’: Star’s shock admission",
        "description": "Former UFC and WWE star Ronda Rousey has delivered a stunning admission after sharing a conspiracy theory video online.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Former AFL rookie wins NFL spot",
        "description": "There was a guarantee an Australian would be punting for the New Orleans Saints this NFL season and it was a former AFL draftee who took the spot.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "NBA legend fires up over star’s remarks",
        "description": "Magic Johnson had the perfect response to silence Anthony Edwards after the young star’s shot at 90s NBA players.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Footballer dead after collapsing on pitch",
        "description": "Tributes have poured in after a 27-year-old footballer collapsed on the pitch during a match in Brazil and later passed away.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Pivotal moment’: Matildas headline $200m deal",
        "description": "Despite bowing out of the Olympics without a medal, the Matildas’ pulling power has resulted in a nine-figure TV deal.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Tim Tszyu gives prediction for brother’s blockbuster fight",
        "description": "Catch all the action in our live blog staring at 5pm (AEST) as Nikita Tszyu takes on Koen Mazoudier, while Michael Zerafa and Tommy Browne settle their differences. PLUS all the details you need to know including start time for main card.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Scott racks up unbelievable $100m milestone",
        "description": "Only five players in PGA Tour history have won more money than Adam Scott, who has pushed his career earnings into nine figures ahead of another monster payday.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "NBA legend fires up over star’s remarks",
        "description": "Magic Johnson had the perfect response to silence Anthony Edwards after the young star’s shot at 90s NBA players.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Hurting us’: Wallabies’ ‘narrow’ focus",
        "description": "The Wallabies are still adjusting to the style of rugby coach Joe Schmidt wants them to play.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "‘Keeping it simple’ working for Wallaby",
        "description": "A Wallabies playmaker says sometimes ‘getting away from footy’ has helped him regain his spot in the Australian team.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "V’landys keen for end to racing ‘civil war’",
        "description": "Racing leaders were urged to collaborate more during an Asian Racing Conference panel which included NSW boss Peter V’landys and Victorian counterpart Aaron Morrison.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-08-28T07:21:05.067196"
    }
]