[
    {
        "title": "Uniqlo does not use Xinjiang cotton, boss says",
        "description": "It is the first time the CEO of the chain's owner, Fast Retailing, has directly addressed the issue.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Uber probed by US regulator over subscription plan",
        "description": "The ride-hailing giant says it received inquiries from the FTC about Uber One cancellation procedures.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Europe's flying taxi dreams falter as cash runs short",
        "description": "Makers of a new generation of European electric aircraft are struggling to raise money.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "'It's going to be hard': US firms race to get ahead of Trump tariffs",
        "description": "The US president-elect's import taxes may be just talk until he takes office - but they are having an impact anyway.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Uber probed by US regulator over subscription plan",
        "description": "The ride-hailing giant says it received inquiries from the FTC about Uber One cancellation procedures.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Chinese companies apologise for 'shrunken' sanitary pads",
        "description": "Chinese women have taken it upon themselves to prove that the length of sanitary pads often fall short of what is advertised.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "How vital is a company's CEO?",
        "description": "Boeing, Nike and Starbucks have changed their bosses, but how much difference can one person make?",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Ford calls for incentives to buy electric cars as backlash grows",
        "description": "The government faces pressure from the industry to make changes to electric vehicle sales quotas.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Inside South Africa's 'ruthless' gang-controlled gold mines",
        "description": "Illegal miners live dangerously, but make roaring profits selling gold on the black market.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Is nuclear power gaining new energy?",
        "description": "Countries around the world are building new nuclear power stations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "'Trump tariffs may backfire on US auto firms' - Nov 27, 2024",
        "description": "Expert says Trump's tariffs could hurt US firms as much as their Canadian counterparts in the auto industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Aston Martin issues second profit warning in two months",
        "description": "The iconic firm blames \"minor delay\" in deliveries of its ultra-exclusive Valiant cars for the shortfall.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "'No-one will win' - Canada, Mexico and China respond to Trump tariff threats",
        "description": "Mexico said it would slap tit-for-tat tariffs on the US, while China said Trump's finger-pointing \"runs completely counter to facts\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Black Friday shoppers warned to be wary of deals",
        "description": "Nine out of 10 Black Friday offers are cheaper or the same price at other times of the year, Which? finds.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Trump proves he is serious on tariffs - but it's not about trade",
        "description": "The US president-elect is using tariffs as a weapon of diplomacy, even coercion, says BBC economics editor Faisal Islam.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "LinkedIn: We're too boring for kids for social media ban",
        "description": "It is one of a number of tech firms pushing back against Australia's plan to ban social media for under-16s.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "General Motors agrees deal to enter F1 in 2026",
        "description": "US car giant General Motors reaches an agreement in principle to enter Formula 1 in 2026 with its Cadillac brand.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "From eyesore to asset: How a smelly seaweed could fuel cars",
        "description": "Scientists in the Caribbean are turning algae that have been choking beaches into biofuel.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Macy's employee hid more than $130m in delivery expenses",
        "description": "An employee \"intentionally\" concealed expenses related to package deliveries, the retailer says.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Wicked proves popular as opening set to be biggest for Broadway film",
        "description": "Wicked is also expected to have the top-grossing opening weekend in UK and Ireland of 2024.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Nominee for agriculture secretary completes Trump cabinet",
        "description": "Brooke Rollins - head of a pro-Trump right-wing think tank - is his pick for agriculture secretary.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Can RFK Jr make America's diet healthy again?",
        "description": "Kennedy's plans to ban dyes in cereals and fluoride in water could get major pushback from the food industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "UK perfume boss admitted he ignored Russia sanctions",
        "description": "David Crisp told undercover agent he had ignored \"government edicts\" to sell £1.7m of his luxury Boadicea the Victorious product.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "'We had to break rules', says Jaguar as radical rebrand stirs debate",
        "description": "The iconic carmaker's rebrand has certainly caught people's attention, but will it pay off?",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "'I was scammed out of £75k by Martin Lewis deepfake advert'",
        "description": "Des Healey lost £76,000 in a scam using a deepfake of Martin Lewis and Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "UK wants to hire EU negotiator to 'reset' relations",
        "description": "The role will “prepare and lead negotiations with the EU on key UK interests”, the job posting said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-28T07:27:17.075954"
    },
    {
        "title": "Marilyn Manson Drops Defamation Lawsuit Against Evan Rachel Wood",
        "description": "The two sides reached the settlement for Manson to pay Wood's legal fees after the court last year dismissed defamation claims.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Jason Kelce Says It’s an “Immediate No” When People Ask for Taylor Swift Tickets",
        "description": "Kelce says the superstar singer has told him \"she will take care of anybody\" he asks for but that he \"doesn't want it to be that kind of dynamic.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Zach Bryan Scolds Concertgoer From Stage: “Don’t Throw Sh**”",
        "description": "The tense moment during the country singer's Washington gig over the weekend comes after ex-girlfriend Brianna \"Chickenfry\" LaPaglia claimed he was emotionally abusive.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Drake Claims UMG, Spotify “Artificially Inflated” Kendrick Lamar’s Diss Track “Not Like Us”",
        "description": "UMG says the allegations about \"Not Like Us\" — one of the biggest hits of the year — are “offensive and untrue.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Rod Stewart Will Play Coveted Legends Slot at Glastonbury Festival 2025",
        "description": "\"After all these years, I’m proud and ready and more than able to take the stage again to pleasure and titillate my friends at Glastonbury in June,\" the rock star said Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Gavin Creel Memorial to Include U.S. and U.K. Livestream",
        "description": "The memorial will be held in New York City on Dec. 2, with Broadway set to dim lights in honor of the late star on Dec. 3.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Menendez Resentencing Hearing Delayed Until January",
        "description": "During Monday's court proceeding, the brothers' attorneys asked a judge to reconsider their convictions.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Shaboozey’s “A Bar Song” Ties “Old Town Road” for Most Weeks at No.1 on Billboard Hot 100 Chart",
        "description": "The country-rap smash is spending its 19th week on top of the chart, matching a record set by Lil Nas X and Billy Ray Cyrus in 2019.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Queen Latifah to Host 47th Annual Kennedy Center Honors",
        "description": "The ceremony, which will air Dec. 22 on CBS, will honor Francis Ford Coppola, the Grateful Dead, Bonnie Raitt, Arturo Sandoval and The Apollo.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "2024 Billboard Awards: Zach Bryan Leads With 21 Nominations, Taylor Swift Follows With 17",
        "description": "See the full list of nominations as Morgan Wallen and Sabrina Carpenter also scored multiple nods ahead of the Dec. 12 event, airing live on FOX, Paramount+ and Amazon’s Fire TV Channels.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Alec Baldwin Says Americans “Know Little or Nothing About the World” at Turin Film Festival",
        "description": "The actor was the festival's guest of honor and appeared at a press conference on the condition that the 'Rust' shooting, where cinematographer Halyna Hutchins was killed with a prop gun, was not to be brought up at any point.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Barbara Taylor Bradford, Author of Best-Selling Novel ‘A Woman of Substance’, Dies at 91",
        "description": "The book sold more than 30 million copies worldwide and was adapted into an Emmy-nominated Channel 4 miniseries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-28T07:27:17.300034"
    },
    {
        "title": "Coach apologises for inappropriate comment",
        "description": "Manchester City manager Pep Guardiola has apologised after making a problematic remark during a post-game press conference.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Shock Open lead after $7k year",
        "description": "It wasn’t the bunkers filled with water that held back a major champion as a coaching change prompted a surge from a Victorian gun at the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Smith, Herbert sizzle after course blow-up",
        "description": "Cam Smith was furious with how soft the courses were at the Australian Open, but it paved the way for an opening day birdie blitz in Melbourne.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "‘Proud’ Test call-up feels prepared by Shield",
        "description": "A potential Australian Test debutant has gone into bat for the nation’s top domestic cricket competition as batters struggle to convince.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Roos quartet desperate to relive ‘magical’ day",
        "description": "The Kangaroos know taking down an AFLW powerhouse on the last day of the season is not an impossible task – four of them have done it before.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "AFL great savages star over secret meeting",
        "description": "An AFL great has torn Sydney Swans star Chad Warner to shreds over a secret meeting he had with a rival club during the week.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Benji unsure if Bateman will stay at Tigers",
        "description": "John Bateman still has two years left on his deal with the Wests Tigers, but it remains up in the air whether the Englishman will be back in 2025.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Blues great puts his hand up to coach NSW",
        "description": "A former halfback has put his hand up to coach the NSW women’s State of Origin side next year as they search for Kylie Hilder’s replacement.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "‘Proud’ Test call-up feels prepared by Shield",
        "description": "A potential Australian Test debutant has gone into bat for the nation’s top domestic cricket competition as batters struggle to convince.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "WBBL team of the decade revealed",
        "description": "The WBBL team of the decade has been announced, with the squad featuring a combined 21 title winners and five players of the tournament.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Aussies fuelled by United Cup heartbreak",
        "description": "They were a point away from reaching the United Cup final and fell just short at the Davis Cup. It’s why there’s still belief in the Aussie camp.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Tennis world broken hearted by reveal",
        "description": "A former grand slam champion has broken hearts after detailing the nightmare toll injuries continue to have on his day-to-day life.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Truth about Schumacher wedding rumour",
        "description": "A former F1 driver and one of Michael Schumacher’s friends has debunked a rumour that surfaced about the seven-time world champion.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Chaos erupts as F1 announces new team",
        "description": "Formula One has finally announced an 11th team will join the grid, sparking speculation over which drivers will suit up for the new outfit.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Ring girl’s fame reaches absurd heights",
        "description": "Boxing’s latest viral sensation continues to take the internet by storm with Sydney Thomas left overwhelmed by her new-found fame.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Olympic champ hid secret as tears fell",
        "description": "Australia’s most decorated Olympian has spoken about the moment she was overcome with emotion during the Paris Games.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "What’s the secret Super Bowl preview hiding on Thanksgiving Weekend?",
        "description": "It’s Thanksgiving weekend and there’s one matchup on the Week 13 slate that could be a secret Super Bowl preview: which one is it?",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "166kg Aussie ragdolled in viral NFL scenes",
        "description": "Aussie Jordan Mailata has come a long way in his NFL development but the hulking star has gone viral after he was monstered.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Coach apologises for inappropriate comment",
        "description": "Manchester City manager Pep Guardiola has apologised after making a problematic remark during a post-game press conference.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Matildas star’s surprise take in ‘mental fatigue’ debate",
        "description": "The Matildas will go into their internationals against Brazil understrength, with multiple stars dealing with mental fatigue. But a packed schedule is all the Matildas have ever wanted.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Conor McGregor’s fiancee breaks her silence",
        "description": "Dee Devlin, who has been engaged to Conor McGregor since 2020, has broken her silence over his civil rape trial in Dublin.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Shock Open lead after $7k year",
        "description": "It wasn’t the bunkers filled with water that held back a major champion as a coaching change prompted a surge from a Victorian gun at the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "The NBL star leading a curious off-court double life",
        "description": "On the court New Zealand Breakers’ star import Parker Jackson Cartwright looks to be a potential NBL25 MVP, but off-court he leads a whole other life: one in the world of creative expression.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Wallabies coach having ‘huge’ impact",
        "description": "As the Wallabies prepare for their final Test of the year, coach Joe Schmidt’s impact on the team has been praised.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Coach won’t let Wallabies ’off the hook’",
        "description": "The Wallabies want to finish their spring tour on the high of a win over Ireland following a disappointing loss to Scotland.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Outgoing integrity boss calls for action on abuse report",
        "description": "The outgoing Racing Integrity Commissioner has challenged Victorian racing regulators to “action” his recommendations to ensure a safe working environment for everyone.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    },
    {
        "title": "Australia bans Olympic medallist for life",
        "description": "Australian cycling has thrown the book at Olympic medallist Matthew Richardson, slamming the door shut after his shock defection.",
        "source": "News AU",
        "fetched_date": "2024-11-28T07:27:19.072459"
    }
]