[
    {
        "title": "Elon Musk's curious fixation with Britain",
        "description": "The tycoon has changed his tune when it comes to the UK - and there are clues which help to explain why.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Somali piracy 2.0 - the BBC meets the new robbers of the high seas",
        "description": "Two fishermen tell the BBC why they have decided to become pirates in search of big ransoms.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Google suggests fixes to its search monopoly",
        "description": "Google proposed new limits after a judge ruled Google illegally crushed competition in search.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "The Indian family that built a business empire in Hawaii from scratch",
        "description": "From businesses to philanthropy, the Watumull family is inextricably linked with Hawaiian history.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Somali piracy 2.0 - the BBC meets the new robbers of the high seas",
        "description": "Two fishermen tell the BBC why they have decided to become pirates in search of big ransoms.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "The rise of Spotify Wrapped and its copycats",
        "description": "From Duolingo to Sainsbury's, companies have hopped onto the year in review bandwagon following the success of Spotify Wrapped.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Pressure on parents for Instagram-worthy Christmas",
        "description": "Social media trends, as well as pressure to attend events, are driving up costs, parents say.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "US avoids government shutdown after days of political turmoil",
        "description": "President Biden signs a budget to avert what would be the first US federal shutdown since 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "What now for the £4.5bn drug empire that bankrolled Assad's regime",
        "description": "As those in the lucrative Captagon network move aside, how will the new leaders stop any criminals waiting in the wings to replace them?",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Trump's shutdown gamble exposes limits of his power",
        "description": "Trump showed he can kill legislation, but he failed to rally Republicans behind his alternative plan.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Robinhood CEO: Crypto under relentless assault - 19 Dec 2024",
        "description": "The CEO of online investing platform Robinhood says the Trump administration will be very good for business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Sega considering Netflix-like game subscription service",
        "description": "It's another sign the industry is moving away from owning games - some fear that means gamers having to \"shell out more.\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Netflix wins US rights for Women's World Cups",
        "description": "Netflix secures the rights to show live coverage of the 2027 and 2031 Women's World Cups in the United States.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Starbucks baristas launch strike in US, union says",
        "description": "It follows calls from the Workers United union for higher pay and better conditions for Starbucks baristas.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Volkswagen agrees deal to avoid German plant closures",
        "description": "VW and a union have, however, agreed to cut more than 35,000 jobs across the country by 2030.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Musk flexes influence over Congress in shutdown drama",
        "description": "Musk and Trump quickly derailed a stopgap spending bill, showing their power before the president-elect even takes office.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "The student who blew whistle on Kenya airport controversy",
        "description": "Nelson Amenya is hailed as a hero in Kenya after sharing details of a plan to lease the main airport.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "N Korea hackers stole $1.3bn of crypto this year - report",
        "description": "Some incidents may be linked to North Korean IT workers infiltrating tech firms, according to research firm Chainalysis.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "UK government borrowing lower than expected in November",
        "description": "Public sector borrowing was £11.2bn last month, the lowest November figure since 2021.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Amazon hit by 'strike' during holiday season scramble",
        "description": "One of America's most powerful labour unions is staging a protest against the e-commerce giant.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Man convicted for repeatedly lying about inventing Bitcoin",
        "description": "Computer scientist Craig Wright was given a suspended prison sentence for what was described as \"legal nonsense.\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "AI is trained to spot warning signs in blood tests",
        "description": "AI can spot patterns in the data from blood tests that can give an early warning of disease.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Musk joins Bezos and Trump dinner at Mar-a-Lago",
        "description": "The Amazon and Blue Origin founder is one of several tech leaders who has made the trip to Mar-a-Lago.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Stocks slide as US central bank signals slower pace of rate cuts",
        "description": "The Federal Reserve warned it would be cautious about more interest cuts in the face of inflation concerns.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "UK minister named in Bangladesh corruption probe",
        "description": "Tulip Siddiq is alleged to have helped her aunt, the former prime minister of Bangladesh, embezzle up to £4bn.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Apple urged to axe AI feature after false headline",
        "description": "Reporters Without Borders has called for Apple to remove Apple Intelligence.",
        "source": "BBC Business",
        "fetched_date": "2024-12-22T07:22:00.742489"
    },
    {
        "title": "Robbie Williams’ “Forbidden Road” Deemed Ineligible at Academy Awards",
        "description": "A letter to the Academy’s music branch explains that the song from the biopic 'Better Man' has been removed from its shortlist since it “incorporates material from an existing song that was not written for this film.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Lizzo on Facing Sexual Harassment Lawsuit: “The Wind Was Knocked Out of Me by People I Cared About”",
        "description": "During an interview with Keke Palmer on her podcast, the singer opened up about facing allegations from three of her former dancers: \"I was very deeply hurt.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "CEO Shooting Suspect Luigi Mangione Moved to Notorious Facility Housing ‘Diddy’ as Both Await Trial",
        "description": "The troubled Metropolitan Detention Center in Sunset Park, Brooklyn at one point also held Sam Bankman-Fried, Ghislaine Maxwell and R. Kelly.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Spotify Fires Back at Drake’s Claim That It Illegally Boosted Streams of “Not Like Us”",
        "description": "In a new filing, Spotify says it \"found no evidence to substantiate\" Drake's claim that the streamer and UMG inflated the streams of Lamar’s diss song aimed at him.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "The Hollywood Reporter’s 50 Best Photos of 2024",
        "description": "From Pedro Pascal to Glen Powell, Angelina Jolie to Selena Gomez, here are the best photos by THR photographers this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "The Hollywood Reporter’s Top 24 Stories of 2024",
        "description": "There were many, many good options to choose from, but here are our choices for THR’s stand-out stories from the past year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Beatles Reunite as Paul McCartney Brings Out Ringo Starr for Final Show on “Got Back” Tour",
        "description": "McCartney brought his Beatles bandmate on to raucous applause before the pair played hits such as \"Helter Skelter\" and \"Sgt. Pepper's Lonely Hearts Club Band.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Sing-Along Version of ‘Wicked’ Soundtrack Released",
        "description": "The sing-along album features the 11 tracks without the lead vocals, though the orchestra and background vocals are the same as the soundtrack.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Danny Masterson Files Legal Brief Seeking to Overturn His Rape Conviction",
        "description": "The imprisoned former star of 'That '70s Show' and \"untouchable\" Scientologist was found guilty of two counts of rape in 2023.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "‘Punisher’ Writer, Artist Reteam for Indie Revenge Comic Book ‘We’re Taking Everyone Down With Us’ (Exclusive)",
        "description": "The six-issue series follows an orphaned girl and her dad's bodyguard robot.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Justine Bateman Says Cancel Culture Has Become “F***ing Unbearable”",
        "description": "“I don't remember a time in my career where there was an absence of criticism of me,” Bateman told Megyn Kelly during a prerecorded interview that will appear on SiriusXM on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "The Weeknd to Superfans: I See You",
        "description": "“I f***ing love you!” the singer told fans at Spotify’s first-ever Billions Club Live, where the streaming platform awarded a number of top devotees access to an exclusive live concert.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-22T07:22:01.025140"
    },
    {
        "title": "Host broadcaster savaged by irate fans",
        "description": "Boxing fans were left seeing red and venting their frustration online as continual issues plagued the biggest fight of the year.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Legend’s apology backfires as feud escalates",
        "description": "Five-time NBA champion Dennis Rodman’s bitter feud with his soccer star daughter has exploded in ugly scenes on social media.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘Nuts’: Tyson Fury stunned, career in doubt",
        "description": "Tyson Fury has been outclassed by Oleksandr Usyk for a second time, but his furious camp believes the heavyweight star was robbed.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Fake judge’s Tyson Fury scorecard says it all",
        "description": "The boxing world has reacted in disbelief to the first use of ultra modern technology in Oleksandr Usyk’s fight against Tyson Fury.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Wild 24 hours after Konstas gets dream phone call",
        "description": "He may have missed out with the bat in the Sydney Smash, but young gun Sam Konstas has plenty to smile about as he prepares to make his Test debut.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Drama as India star ignores Aussie reporters",
        "description": "Tensions between Australia and India have flared again after an Indian player was caught in ugly scenes at a press conference.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "From Home Hill to Wimbledon: Walton’s incredible rise",
        "description": "Adam Walton grew up playing tennis on courts in the tiny rural town of Home Hill in North Queensland – he now has giant-killing hopes after earning a Brisbane International wildcard.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Hewitt, Tomic get Australian Open lifelines",
        "description": "Two big tennis names at different stages of their careers will get the chance to fight for an Australian Open berth.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Nasty injury sidelines Dees skipper",
        "description": "A painful injury in pre-season training has derailed the summer plans of Melbourne’s star captain.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘Nothing like it’: Coach’s message to Lions",
        "description": "The “business” of winning back-to-back AFL premierships awaits the Brisbane Lions next month when they return to training after Christmas.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Storm hold off rivals for key signature",
        "description": "He knows he’s behind two superstars in the playmaking pecking order at Storm but an emerging talent has opted to stay in Melbourne.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Sports stars and fans connecting like never before",
        "description": "Nothing beats receiving a personalised message from one of your sporting heroes, and with no life event off-limits, stars and their fans are making the most of the chance to connect via Swysh.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Raygun comes clean, poster detail says it all",
        "description": "Rachael “Raygun” Gunn has hit back at claims she was demanding $10,000 from a comedian as she tried to put the saga to bed.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Mia Hewitt snags ‘nepo baby’ job",
        "description": "The daughter of a famous A-list Aussie couple has been seen working a very normal job – but there’s a famous twist.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Has a massive injury opened the door for a new Super Bowl favourite?",
        "description": "With three weeks left in the NFL season, there’s a new Super Bowl favourite: with a longtime nemesis injured, can it turn around years and years of losing?",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Superstar goes scorched earth on new format",
        "description": "NBA superstar Kevin Durant did not hold back when asked about the planned changes for this year’s All-Star Game festivities.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘They’re very together’: Victory boss hails Derby performance",
        "description": "Interim Melbourne Victory boss Arthur Diles has praised his players for avoiding a “complete disaster” in a week where Patrick Kisnorbo suddenly departed. Get the latest from every A-League game here.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘We have to find a way’: Pep backs Man City to bounce back",
        "description": "EPL WRAP: Manchester City boss Pep Guardiola says he trusts his players to turn things around despite their shocking run of just one win from their past 12 games.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Host broadcaster savaged by irate fans",
        "description": "Boxing fans were left seeing red and venting their frustration online as continual issues plagued the biggest fight of the year.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘Absolute joke’: Fans react to Red Bull move",
        "description": "Red Bull Racing has finally made a call over who will replace Sergio Perez and partner Max Verstappen in the 2025 F1 season.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘Shameless’: Outrage as Red Bull drops axe",
        "description": "Red Bull has finally put a star driver out of his misery, but the decision on his replacement has caused a stir across the Formula 1 grid.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Hot Hawks cool Cotton in Wildcats drubbing",
        "description": "The Illawarra Hawks proved why they sit on top of the NBL ladder with a dominant win over the Perth Wildcats on a day where Bryce Cotton was held as Tyler Harvey made history. SEE THE HIGHLIGHTS.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Peake’s stunning start makes history at Sandbelt Invitational",
        "description": "West Australian Ryan Peake has made Sandbelt Invitational history after a stunning start to the final round – despite having to ask members of the crowd for shot advice.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "‘Chautauqua of Hong Kong’ refuses to jump at Pakenham",
        "description": "Stewards will consider the racing future of Global Harmony after the former Hong Kong galloper refused to take part in the last race at Pakenham.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Rookie Reds prop in Wallabies training squad",
        "description": "An emerging Queensland Reds prop has been included in a 40-man Wallabies training squad.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "NRL star’s heartwarming baby joy",
        "description": "An NRL star has stunned with a huge announcement – revealing a new addition to his family in a heartwarming Instagram post.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-22T07:22:02.636947"
    }
]