[
    {
        "title": "Melania Trump launches her own cryptocurrency",
        "description": "$Melania is announced a day after President-elect Donald Trump launched his own cryptocurrency, $Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Working from home 'not proper work' - ex-Asda boss",
        "description": "Lord Rose says it harms productivity but expert says hybrid work can be as good as full-time in the office.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Toyota unit to settle emissions scandal for $1.6bn",
        "description": "The truck company will also be banned from importing its diesel engines into the US for five years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Has Trump promised too much on US economy?",
        "description": "He won the election partly to fix inflation but Trump may find his pledges on prices and tariffs conflict, say experts.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Working from home 'not proper work' - ex-Asda boss",
        "description": "Lord Rose says it harms productivity but expert says hybrid work can be as good as full-time in the office.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "TikTok restores service in US after Trump pledge",
        "description": "TikTok is resuming services to its 170 million users in US after President-elect Donald Trump said he would give the app a reprieve.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Shein backlash fails to deter shoppers: 'I spend £20 a month'",
        "description": "Some young shoppers will continue to buy from the fast fashion giant despite concerns over how workers are treated.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Trump launches cryptocurrency with price rocketing",
        "description": "Hours after its launch, the market capitalisation for $Trump reached nearly $5.5bn (£4.5bn).",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "'Irreplaceable': The real cost of losing TikTok",
        "description": "With an American TikTok ban threatening the app, users and creators reflect on what it did for internet culture – and what their online worlds might look like without it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Three reasons Trump tariffs aren't China's only problem",
        "description": "China's economy has hit the government's 5% growth target for 2024 in the face of multiple challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Bank performance signals boost to US economy - 16 Jan 2025",
        "description": "Jason Betz from Ameriprise Financial says that there is untapped resilience in the American economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Mark Carney, the 'unreliable boyfriend' who ran UK's central bank",
        "description": "Carney is now running for the Liberal Party leadership in Canada. What does his time in London tell us?",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "US Supreme Court upholds TikTok ban law",
        "description": "A law passed last year requires TikTok's Chinese parent company to sell the video platform or face a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "TikTok says it will 'go dark' on Sunday without US government action",
        "description": "The Supreme Court earlier upheld a law that would ban the video app in the US unless its Chinese parent-company sells it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Al Fayed claimed 'poor health' when police investigated abuse",
        "description": "Pelham Spong reported to police in 2017 that Mohammed Al Fayed had assaulted her a decade before but the investigation was shut down.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "IMF warns on Trump's plans but upgrades UK outlook",
        "description": "Trump's policies could benefit the US, but not the rest of the world, the IMF says",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "US grounds SpaceX's Starship after test flight explosion",
        "description": "The rocket's upper stage disintegrated over the Caribbean, forcing airline flights to alter course.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Fears empty restaurant TikTok trend could last",
        "description": "There are fears that tax and wage rises mean restaurants and bars will be quieter than usual all year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Americans and Chinese share jokes on 'alternative TikTok' as US ban looms",
        "description": "RedNote's Chinese users say it is the first time they have been able to speak directly to Americans online.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Apple suspends error-strewn AI generated news alerts",
        "description": "The tech giant was facing pressure to pull the feature after it made repeated mistakes summarising headlines.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "US FDA officially authorises Zyn nicotine pouches for sale",
        "description": "The pouches are used by less than 2% of US teens, the FDA said in granting the application allowing them to continue to be sold.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Global growth forecast to flatline as tariffs add to strains",
        "description": "The World Bank predicts global economic growth of 2.7% this year amid concerns living standards will struggle to improve.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Mark Carney runs for leader of Canada's Liberal Party",
        "description": "The former central banker for the UK and Canada pitched himself as a someone who can help a country navigate economic challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Trump will 'put measures in place' to stop TikTok ban, top adviser says",
        "description": "Incoming National Security Adviser Mike Waltz says the law allows a 90-day grace period for the app's Chinese owner.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "United Health boss defends firm in first earnings results since CEO killing",
        "description": "Sir Andrew Witty says there is \"heightened energy\" to address customers' frustrations.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "Jeff Bezos blasts into commercial space race with rocket launch",
        "description": "The Amazon boss's space company is vying to challenge the dominance of Elon Musk's SpaceX.",
        "source": "BBC Business",
        "fetched_date": "2025-01-20T07:23:12.474754"
    },
    {
        "title": "L.A. Realtors to the Rescue: “I’m a Public Servant Now”",
        "description": "The city’s A-list brokers are ignoring old rivalries and working round the clock to house the city’s displaced elite.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Fire Escape: Where Hollywood Is Taking Shelter",
        "description": "From Palm Springs to the Peninsula Hotel, here’s where celebrities and industry insiders are hunkering down to evade the flames.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Snoop Dogg Blasted for Performing at Crypto Ball Ahead of Donald Trump Inauguration",
        "description": "Despite publicly vowing to “roast” anyone who endorsed Trump during his previous administration, the rapper topped the bill at a Washington D.C. event honoring the president-elect.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "ATTN:’s Matthew Segal, Archewell Alum Mandana Dayani Appointed to Holocaust Memorial Council Board of Trustees",
        "description": "Outgoing President Joe Biden made the announcement ahead of his official exit.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "SoCal Fire Fund Auctioning Off Lunch With Julia Roberts and ‘Only Murders in the Building’ Set Visit to Support Relief Efforts",
        "description": "The wildfire relief fund was launched by the CAA Foundation, CORE and the Los Angeles Unified School District Education Foundation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Donald Trump Says He Will “Probably” Travel to L.A. After Inauguration to View Wildfire Aftermath",
        "description": "\"I thought it would be better if I went as president,\" the president-elect told NBC News.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Menendez Brothers’ Sentencing Postponed Due to Raging L.A. Wildfires",
        "description": "The DA’s office announced Friday yet another turn in the twisted saga of the Menendez brothers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "This Just In: TV News Still Matters",
        "description": "The L.A. fires have put old-fashioned broadcast reportage back in the spotlight, with both national correspondents — like NBC’s Jacob Soboroff — and a slew of local newscasters proving that legacy media isn’t over just yet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "What Fire Wants: Understanding the Enemy",
        "description": "What long has been considered merely a chemical reaction perhaps is best compared to another all-too-familiar scourge — a virus.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "L.A.’s Now in a Doom Era. It’ll Boom Again",
        "description": "History reminds us that this town eventually flips the script on its apocalyptic storyline.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Rick Caruso Tells Bill Maher He Predicted Palisades Fire: “I’m So Sad That I Was Right”",
        "description": "The former L.A. mayoral candidate said on 'Real Time' that people should be asking, \"Why wasn't more done\" to prevent the Los Angeles wildfires?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Speaker Mike Johnson Suggests “Conditions” Needed on Federal Aid for L.A. Wildfires",
        "description": "Johnson also blasted California’s Democratic leadership, saying, \"It appears to us that state and local leaders were derelict in their duty.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-20T07:23:12.799537"
    },
    {
        "title": "Djokovic scandal turns as host spills secret",
        "description": "More details have been revealed about Novak Djokovic’s boycott of a post-match interview with Jim Courier, as the fallout from the incident continues.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "New age Warner message driving finals run",
        "description": "The two teams who have catapulted themselves in to the Big Bash finals have one very big thing in common.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "New skipper support amid Smith injury",
        "description": "The sight of Steve Smith in an elbow brace across the weekend could open the door for a cult hero to take the reins in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "F1 star’s $4m Ferrari smashed",
        "description": "A quick test drive in Monaco turned disastrous for one of the biggest names in Formula 1.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "New age Warner message driving finals run",
        "description": "The two teams who have catapulted themselves in to the Big Bash finals have one very big thing in common.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "New skipper support amid Smith injury",
        "description": "The sight of Steve Smith in an elbow brace across the weekend could open the door for a cult hero to take the reins in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "‘Boneheaded’ vs mental warfare: Who’s right in Aus Open war?",
        "description": "Tony Jones’ taunt at Novak Djokovic and his fans has ignited the Australian Open off the court, but who is really in the right? Scott Gullan and Julian Linden make the case for both.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Sick star pushes through pain",
        "description": "World no. 1 Jannik Sinner has survived a mid-match health scare to keep his title defence alive at Melbourne Park.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Most popular: Ex-Dogs dominate early SuperCoach teams",
        "description": "The early SuperCoach AFL team picker has been open since December, and some clear trends are emerging. See the exclusive ownership numbers here.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "‘Weak boy’: Star torn to shreds over AO act",
        "description": "Media personality Abbie Chatfield has taken the gloves off and slapped down an AFL player over a comment he left on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Broncos cult hero set to make NRL history",
        "description": "Former Brisbane Broncos hardman Sam Thaiday has issued a blunt warning as he prepares to step outside of his comfort zone.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Hayne named for return, team list revealed",
        "description": "Jarryd Hayne is set to feature in an upcoming rugby league tournament but his incredible comeback won’t end there.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "’Scares me most’: Shayna Jack’s biggest fear",
        "description": "Olympian Shayna Jack has endured a horror past five years with the swimmer revealing what terrifies her more than anything.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Steph Rice shares stunning honeymoon pics",
        "description": "Aussie swimming legend Stephanie Rice is living her best life on honeymoon after getting married and celebrating in the style.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "‘Disgusting’: US turns on NFL’s golden child",
        "description": "NFL fans have turned on Patrick Mahomes after the superstar quarterback was at the centre of some fiery playoffs controversy.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Chiefs’ quest for historic NFL three-peat continues as star shoves coach in shocking moment",
        "description": "An NFL player was captured sensationally shoving one of his own coaches in the opening minute of the Kansas City Chiefs’ divisional round win over the Houston Texans.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "‘Never played the victim’: Ange takes blame for Spurs’ horror run",
        "description": "After a humbling loss to relegation battling Everton, Tottenham manager Ange Postecoglou says it is his responsibility to turn around a miserable Premier League season.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "EPL giant’s stance on sacking Aussie Ange",
        "description": "Ange Postecoglou’s future in the Premier League is in serious doubt after his side were beaten 3-2 by lowly Everton on Monday morning.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "History made as champ stuns UFC world",
        "description": "Two champions have cemented their place among the greats with displays left that jaws on the floor across the entire UFC world.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "F1 star’s $4m Ferrari smashed",
        "description": "A quick test drive in Monaco turned disastrous for one of the biggest names in Formula 1.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "$2bn Verstappen bombshell rocks F1",
        "description": "A report has stunned the entire F1 world with reports Max Verstappen has been offered the biggest deal in sporting history.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Red hot Vasiljevic leads 36ers thumping of Cairns",
        "description": "Dejan Vasiljevic’s equal career best shooting display from three has powered the Adelaide 36ers to a monster win against Cairns. Catch up on all the latest news from round 17.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Day’s drive clear after costly final-hole blunder",
        "description": "Jason Day cost himself an extra six-figures with a final-hole fade-out in California but still made a tidy sum for his podium finish.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Newcastle previews: Son of dud could be Soo good",
        "description": "A Gerald Ryan gelding whose dam was beaten by more than 60 lengths combined in bush maidens will make his debut at Newcastle on Tuesday after a couple of eye-catching trials.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Wallabies star confident of securing new deal",
        "description": "A leading Wallaby is yet to secure his future beyond this year, but he seems anything but concerned about it.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    },
    {
        "title": "Fan hospitalised in ‘awful, freak accident’",
        "description": "A devastating crash has marred Saturday’s Tour Down Under, leaving a fan hospitalized with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-01-20T07:23:15.286695"
    }
]