[
    {
        "title": "Starbucks baristas to strike in US, union says",
        "description": "It follows calls from the Workers United union for higher pay and better conditions for Starbucks baristas.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "The student who blew whistle on Kenya airport controversy",
        "description": "Nelson Amenya is hailed as a hero in Kenya after sharing details of a plan to lease the main airport.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "AI is trained to spot warning signs in blood tests",
        "description": "AI can spot patterns in the data from blood tests that can give an early warning of disease.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Musk joins Bezos and Trump dinner at Mar-a-Lago",
        "description": "The Amazon and Blue Origin founder is one of several tech leaders who has made the trip to Mar-a-Lago.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "The student who blew whistle on Kenya airport controversy",
        "description": "Nelson Amenya is hailed as a hero in Kenya after sharing details of a plan to lease the main airport.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "N Korea hackers stole $1.3bn of crypto this year - report",
        "description": "Some incidents may be linked to North Korean IT workers infiltrating tech firms, according to research firm Chainalysis.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Amazon hit by 'strike' during holiday season scramble",
        "description": "One of America's most powerful labour unions is staging a protest against the e-commerce giant.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Man convicted for repeatedly lying about inventing Bitcoin",
        "description": "Computer scientist Craig Wright was given a suspended prison sentence for what was described as \"legal nonsense.\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "The mega trade deal that has French farmers in uproar",
        "description": "The EU wants a trade deal with four South American nations, but France is strongly opposed.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "How Facebook restricted news in Palestinian territories",
        "description": "Palestinian news outlets have seen a steep drop in audience engagement since October 2023.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Robinhood CEO: Crypto under relentless assault - 19 Dec 2024",
        "description": "The CEO of online investing platform Robinhood says the Trump administration will be very good for business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Stocks slide as US central bank signals slower pace of rate cuts",
        "description": "The Federal Reserve warned it would be cautious about more interest cuts in the face of inflation concerns.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "UK minister named in Bangladesh corruption probe",
        "description": "Tulip Siddiq is alleged to have helped her aunt, the former prime minister of Bangladesh, embezzle up to £4bn.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Apple urged to axe AI feature after false headline",
        "description": "Reporters Without Borders has called for Apple to remove Apple Intelligence.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Malawi seeks billions of dollars from US firm over ruby sales",
        "description": "Columbia Gem House denies government claims that it owes $309bn in unpaid taxes and royalties.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Congress in disarray and shutdown looms as Trump, Musk slam spending deal",
        "description": "The president-elect and Elon Musk rejected the bipartisan spending plan that would prevent a government shutdown.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "UK interest rates held but Bank says economy doing worse",
        "description": "The Bank considered a rate cut as it thinks the economy has performed worse than it expected.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "World's first Bitcoin nation scales back crypto dream",
        "description": "El Salvador has eased its pro-cryptocurrency policies to help secure a $1.4bn loan from the IMF.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Harland & Wolff saved by deal with Spanish firm",
        "description": "Spain's state-owned shipbuilder confirms it is buying Harland & Wolff, best known for the Titanic.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Honda and Nissan hold merger talks",
        "description": "In March, the two Japanese car makers agreed to explore a strategic partnership for electric vehicles.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Amazon faces US strike threat ahead of Christmas",
        "description": "The walkout could affect several facilities across the US during the busy holiday season.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "BrewDog co-founder may delay marriage to max-out tax relief",
        "description": "James Watt has discussed his investment in fiance Georgia Toffolo's raw dog food venture.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Jaguar Land Rover electric car whistleblower sacked",
        "description": "Mechanical engineer Hazar Denli lost his job after publishing online concerns about an electric car.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "UK inflation rate hits highest level for eight months",
        "description": "Economists say the faster pace of price rises all but rules out an interest rate cut on Thursday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "Analysis: Is this the clearest proof yet Musk wants to get involved in UK politics?",
        "description": "Nigel Farage tells the BBC he is in \"open negotiations\" with Elon Musk but no figure has been agreed on.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "The city where shopkeepers fear their CCTV cameras could get them killed",
        "description": "Businessmen in Somalia's capital say jihadists have threatened to kill them if they install cameras.",
        "source": "BBC Business",
        "fetched_date": "2024-12-20T07:23:08.624196"
    },
    {
        "title": "The Weeknd to Superfans: I See You",
        "description": "“I f***ing love you!” the singer told fans at Spotify’s first-ever Billions Club Live, where the streaming platform awarded a number of top devotees access to an exclusive live concert.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Hollywood’s Most Notable Deaths of 2024",
        "description": "Carl Weathers, Shannen Doherty, Bob Newhart, Donald Sutherland, Liam Payne, Maggie Smith, James Earl Jones, Gena Rowlands and Jon Landau are among several entertainment legends the industry lost this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Sean “Diddy” Combs Appears in Court on Sex Trafficking Charges",
        "description": "Prosecutors in the case said that their investigation into Combs is still ongoing.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Violet Grohl Readying Debut Album (Exclusive)",
        "description": "The eldest daughter of Foo Fighters’ Dave Grohl has been working with producer Justin Raisen, say sources.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Nick Jonas Receives Backlash for Tweet Seemingly Supporting Elon Musk",
        "description": "The Jonas brother posted a photo of the Tesla owner with the caption \"Take us to the Year 3000.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Music Exec Jody Gerson to Be Honored at Clive Davis Pre-Grammy Gala",
        "description": "Gerson is chairman and CEO of Universal Music Publishing Group and the first female chairman of a global music company.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Atticus Ross, ‘Emilia Pérez’ Composers Lead Nominees for Society of Composers & Lyricists Awards",
        "description": "Miley Cyrus, Elton John, Finneas and Lainey Wilson also earned nominations at the event celebrating excellence and innovation in music for visual media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "The Year in Entertainment: The 24 Weirdest, Wildest Moments of ‘24",
        "description": "As the year comes to a bumpy close, THR winds things down with the two dozen people, moments and trends that made 2024 the scary, weird and sometimes even inspiring time.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "The Dark Roots of a Blonde Blowout: Influencer Matilda Djerf Responds to Bullying Claims",
        "description": "The Swedish influencer has become the face of an entire \"clean girl\" aesthetic for young women and launched her clothing brand, Djerf Avenue, in 2019.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Gracie Abrams Recalls What It Was Like Backstage on Final Night of Taylor Swift’s Eras Tour",
        "description": "The singer-songwriter opened for Swift on and off throughout her nearly two-year global tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Alec Baldwin Opens Up About ‘Rust’ Shooting Case: “I Think There’s More to Come”",
        "description": "The actor, who was facing a possible prison sentence in his involuntary manslaughter trial, appeared on David Duchovny’s 'Fail Better' podcast to discuss the legal nightmare.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Hiroyuki Sanada, ‘Avatar: The Last Airbender’ and More Honored at 2024 Unforgettable Gala",
        "description": "The annual awards gala held at the Beverly Hilton and produced by GoldenTV and Character Media honors the API community’s brightest talents in entertainment, arts and culture.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-20T07:23:09.668889"
    },
    {
        "title": "Cricket world erupts at messed up axing",
        "description": "The axing of Australia’s latest Test debutant has sparked fierce backlash among cricket fans with one man being called out.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Star’s shock axing officially confirmed",
        "description": "Australia’s latest Test debutant has been axed after just three matches, with a teen sensation earning a call up to the squad.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Heat remedy looms for McSweeney",
        "description": "Having been dropped from the Australian team, Nathan McSweeney could play in the BBL on Sunday night for the Brisbane Heat.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Storm hold off rivals for key signature",
        "description": "He knows he’s behind two superstars in the playmaking pecking order at Storm but an emerging talent has opted to stay in Melbourne.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Cricket world erupts at messed up axing",
        "description": "The axing of Australia’s latest Test debutant has sparked fierce backlash among cricket fans with one man being called out.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Star’s shock axing officially confirmed",
        "description": "Australia’s latest Test debutant has been axed after just three matches, with a teen sensation earning a call up to the squad.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Hewitt, Tomic get Australian Open lifelines",
        "description": "Two big tennis names at different stages of their careers will get the chance to fight for an Australian Open berth.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Hewitt, Tomic in huge Aussie Open update",
        "description": "The teenage son of Australian tennis legend Lleyton Hewitt, and former world No.17 Bernard Tomic, have received some huge news.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Nasty injury sidelines Dees skipper",
        "description": "A painful injury in pre-season training has derailed the summer plans of Melbourne’s star captain.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "‘Nothing like it’: Coach’s message to Lions",
        "description": "The “business” of winning back-to-back AFL premierships awaits the Brisbane Lions next month when they return to training after Christmas.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Storm hold off rivals for key signature",
        "description": "He knows he’s behind two superstars in the playmaking pecking order at Storm but an emerging talent has opted to stay in Melbourne.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Twist in Sullivan’s South Sydney deal",
        "description": "Jayden Sullivan is off to the Rabbitohs next year, but his time at the Wests Tigers is far from over.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Raygun comes clean, poster detail says it all",
        "description": "Rachael “Raygun” Gunn has hit back at claims she was demanding $10,000 from a comedian as she tried to put the saga to bed.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Mia Hewitt snags ‘nepo baby’ job",
        "description": "The daughter of a famous A-list Aussie couple has been seen working a very normal job – but there’s a famous twist.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Has a massive injury opened the door for a new Super Bowl favourite?",
        "description": "With three weeks left in the NFL season, there’s a new Super Bowl favourite: with a longtime nemesis injured, can it turn around years and years of losing?",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Superstar goes scorched earth on new format",
        "description": "NBA superstar Kevin Durant did not hold back when asked about the planned changes for this year’s All-Star Game festivities.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Business as usual for City amid Victory drama",
        "description": "Melbourne City remains focused on the club’s derby task rather than be worried about the consequences of Melbourne Victory losing the services of coach Patrick Kisnorbo.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Trophy bid stays alive in ‘unbelievable’ scene",
        "description": "Tottenham’s rollercoaster season has continued with Ange Postecoglou’s side winning a thriller to keep their trophy hopes alive.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Revealed: Two Aussies added to Sydney’s stacked UFC 312 line-up",
        "description": "Sydney’s UFC 312 line-up is getting stacked as two Aussies are added to the drawcard, with Jack Jenkins declaring his plans to springboard in to the top 15 in 2025.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "‘Absolute joke’: Fans react to Red Bull move",
        "description": "Red Bull Racing has finally made a call over who will replace Sergio Perez and partner Max Verstappen in the 2025 F1 season.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "‘Shameless’: Outrage as Red Bull drops axe",
        "description": "Red Bull has finally put a star driver out of his misery, but the decision on his replacement has caused a stir across the Formula 1 grid.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "‘Gut feeling’: Boomer Bullet set for return amid new signing plan",
        "description": "Injured last month during a stint with the national team, Josh Bannan has watched on as his Brisbane has revived its season. His return is locked in as the Bullets close in on a new signing.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Peake’s stunning start makes history at Sandbelt Invitational",
        "description": "West Australian Ryan Peake has made Sandbelt Invitational history after a stunning start to the final round – despite having to ask members of the crowd for shot advice.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Freedman filly in ‘decent’ class rise to extend winning run",
        "description": "Michael Freedman filly Codetta, a half-sister to late star Riff Rocket, will strive for a fourth straight win when she steps up to Saturday city grade at Randwick.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "NRL star’s heartwarming baby joy",
        "description": "An NRL star has stunned with a huge announcement – revealing a new addition to his family in a heartwarming Instagram post.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Aussie star’s big World Cup move",
        "description": "After being crowned the best Rugby Sevens player in the world an Australian try-scoring machine is taking a big step towards possibly earning a World Cup spot.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-20T07:23:11.611755"
    }
]