[
    {
        "title": "Reeves defends China visit and hails £600m boost to UK",
        "description": "The chancellor has been criticised for making the trip while the UK government is under pressure from rising borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Meta and Amazon axe diversity initiatives joining US corporate rollback",
        "description": "The companies are among the latest major corporations to alter their diversity programmes since Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "US top court leans towards TikTok ban over security concerns",
        "description": "The platform with nearly 170 million American users is challenging a law that would see it banned in the US in a matter of days.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "UK MPs urge checks as Shein refuses to answer questions",
        "description": "The chair of a committee of MPs has written to the London Stock Exchange with concerns over the fashion retailer.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Meta and Amazon axe diversity initiatives joining US corporate rollback",
        "description": "The companies are among the latest major corporations to alter their diversity programmes since Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "US and UK toughen sanctions on Russian oil industry",
        "description": "The actions are aimed at cutting off revenue Moscow is using to fund its war in Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Fewer rate cuts and higher loan costs - how US jobs surprise affects you",
        "description": "Jobs growth in the US surged unexpected last month. That's good news for the world's largest economy but could be \"punishing\" for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "'I don't like this Musk chap': Reform members say they're unbothered by spat",
        "description": "Activists gathering at a regional conference assess whether the US billionaire could help or hinder the party.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "How a viral post saved a Chinese actor from Myanmar's scam centres",
        "description": "Many Chinese are now asking: what about their loved ones still trapped in scam centres?",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "'Trump 2.0' looms large over the global economy",
        "description": "Donald Trump's planned tariffs are expected to greatly impact international trade in 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "US stocks under pressure after jobs report - 10 Jan 2025",
        "description": "The latest healthy US jobs report adds more uncertainty about whether the Fed will cut its key interest rate.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Can young Americans live without TikTok?",
        "description": "The BBC spoke to young people as the Supreme Court discusses a potential ban on the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Boeing and Google each give $1m for Trump inauguration",
        "description": "The US companies join other major firms donating funds for the ceremony on 20 January.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "LA wildfire damages set to cost record $135bn",
        "description": "Some of the most expensive properties in the US have been wiped out by the fires.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Man told he can't recover £598m of Bitcoin from tip",
        "description": "James Howells tried to sue a council for access to the site or get £495m in compensation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "UK Chancellor heads to China amid market trouble at home",
        "description": "The warning from a former Bank of England official comes in the wake of rising UK borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Price of resale tickets to be capped under UK plans to tackle touts",
        "description": "The UK government is suggesting a cap on the cost of resold tickets, potentially up to 30% on top of the original price.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Ex-UK PM Truss sends legal threat to Starmer over claim she crashed economy",
        "description": "No 10 insists millions of people share Sir Keir's view of the Truss government's economic record.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Pound falls to lowest in over a year as UK borrowing costs soar",
        "description": "Economists have warned the rise could mean further tax hikes or spending cuts by the UK government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "China bets on kitchen appliances to boost economy",
        "description": "A list of subsidised household goods has been expanded as Beijing tries to increase domestic spending.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Lloyds, Halifax and Bank of Scotland to share branches",
        "description": "The move is intended to make it easier for people to access banking services, but some warn it will lead to more branch closures.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "H-1B: Visa row under Trump fuels anxiety for Indian dreamers",
        "description": "Visa woes and an immigration row are sparking uncertainty for Indians who want to work in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Ryanair sues 'unruly' passenger over flight diversion",
        "description": "The airline hopes to claw back costs in damages over behaviour it says forced a plane to land early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "'Huge problems' with Instagram and Facebook changes, says oversight board",
        "description": "The body's co-chair says moving to community notes could have a big impact on gender rights and minority groups.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "People smugglers to have finances targeted with sanctions",
        "description": "The planned measures will target the finances of illegal smuggling networks, the Home Office says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "ChatGPT creator denies sister's childhood rape claim",
        "description": "Ann Altman filed a lawsuit alleging her brother sexually abused her between 1997 and 2006.",
        "source": "BBC Business",
        "fetched_date": "2025-01-12T07:21:05.205462"
    },
    {
        "title": "Will Grammy Awards Be Postponed Due to L.A. Wildfires? Discussions Are Underway",
        "description": "As devastation continues to move through Los Angeles, the broadcast may pivot to a fundraiser, sources reveal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "SAG-AFTRA Donates $1 Million for L.A. Fires Relief",
        "description": "The performers' union earmarked the funds for the SAG-AFTRA Foundation, a nonprofit that offers emergency financial aid and education to members.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Chateau Marmont, Sunset Tower Offer Refuge to Firefighters and Angelenos Amid L.A. Fires",
        "description": "The historic Hollywood hangouts are opening their doors to first responders and evacuees during the wildfires that have killed at least 11 people and destroyed more than 12,000 structures.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Lesli Linka Glatter Loses Home in L.A. Fires",
        "description": "The DGA president and top TV director-producer is just the latest high-profile figure to see her house destroyed by the wildfires across southern California.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Palatial Palisades House Reportedly Featured in ‘Succession’ Has Been Destroyed by L.A. Fires",
        "description": "The home, owned by tech mogul Austin Russell, appears to be the same place where the Roy siblings were shown strategizing at the beginning of season four of the HBO drama.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "James Woods Says House Is “Still Standing” Amid L.A. Fires: “A Miracle Has Happened”",
        "description": "The actor, who had initially indicated he lost his home to the blazes raging across Southern California this week, returned to his neighborhood on Friday where he documented the destruction caused by the flames.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Lakers, Kings Games Postponed as L.A. Wildfires Continue",
        "description": "The NFL has also moved the Rams' playoff game to Arizona.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Jennifer Garner Shares “Guilt” After She “Lost a Friend” in L.A. Wildfires",
        "description": "The actress was volunteering alongside World Central Kitchen founder José Andrés on Friday to feed those who evacuated due to the fires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Sam Moore, One-Half of Stax Records’ Sam & Dave, Dies at 89",
        "description": "Once called “the greatest of all soul duos,” he and late musical partner Dave Prater were inducted into the Rock and Roll Hall of Fame in 1992.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "CAA, Sean Penn’s CORE and LAUSD Launch Fund to Aid Wildfire Recovery",
        "description": "The SoCal Fire Fund, which will be administered by the Entertainment Industry Foundation (EIF), will support recovery initiatives that aid students, school employees and families impacted by the January 2025 fires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Laugh Factory Hollywood Sets Benefit Shows for Los Angeles Fire Foundation",
        "description": "The  iconic comedy club is mounting a benefit fundraiser Stand up for L.A. Heroes on Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "New Kenneth Fire Now 50 Percent Contained as Officials Warn of More Destruction in Coming Days",
        "description": "The Kenneth Fire was threatening houses in the Hidden Hills, home to many celebrities, including Kim Kardashian and Kris Jenner, and was 50 percent contained Friday afternoon.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-12T07:21:06.065999"
    },
    {
        "title": "Aussie Open change divides tennis world",
        "description": "Tennis viewers are going to see a big change at the Australian Open this year — and not everyone is a fan of the world-first project.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "‘Wow’: Comeback for the ages stuns Aus Open",
        "description": "A former world number four has left jaws on the floor after producing an absurd comeback during his opening round match.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Steph Rice shocks fans with second wedding",
        "description": "Stephanie Rice’s friends were all saying the same thing when the swimming champ and her new husband did it all again.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Fan pulls off ‘greatest crowd catch’ ever seen",
        "description": "Everyone loves a crowd catch and we may have just witnessed the best one ever with a fan leaving jaws on the floor with his display.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "1-0: Aussie veterans crush England in Women’s Ashes opener",
        "description": "Aussie captain Alyssa Healy put any concerns about her troublesome knee to rest with a matchwinning display to open the Women’s Ashes against England while Ash Gardner was also influential.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Fan pulls off ‘greatest crowd catch’ ever seen",
        "description": "Everyone loves a crowd catch and we may have just witnessed the best one ever with a fan leaving jaws on the floor with his display.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Aussie Open change divides tennis world",
        "description": "Tennis viewers are going to see a big change at the Australian Open this year — and not everyone is a fan of the world-first project.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "‘Wow’: Comeback for the ages stuns Aus Open",
        "description": "A former world number four has left jaws on the floor after producing an absurd comeback during his opening round match.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "‘Absolutely rocking’: Eddie’s son in title game",
        "description": "The sons of well-known AFL figures Eddie McGuire and Matt Rendell are going to face off in the national championship decider.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Demon’s worst nightmare comes true",
        "description": "The Demons have announced sad news surrounding Christian Petracca in the last thing Melbourne fans wanted to hear",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "NRL trials: First-look at new signings and positional puzzles",
        "description": "The countdown is on for NRL action with trials less than a month away. Find out when and where your team is playing and read every club’s in-depth season preview inside.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Broncos hard man keen for starting spot",
        "description": "Michael Maguire could face a selection headache in round 1 after the man he fought so hard to keep declared he wants to start matches for the Broncos this year.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Steph Rice shocks fans with second wedding",
        "description": "Stephanie Rice’s friends were all saying the same thing when the swimming champ and her new husband did it all again.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Strongman suffers horrific training injury",
        "description": "WATCH: England’s Strongest Man faces a long road to recovery after sustaining a horrendous injury lifting 172kg in training.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "‘Absolutely rocking’: Eddie’s son in title game",
        "description": "The sons of well-known AFL figures Eddie McGuire and Matt Rendell are going to face off in the national championship decider.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Liverpool star’s ‘unbelievable’ goal, PL side stunned: FA Cup Wrap",
        "description": "Manchester City dashed the dreams of Salford’s former Manchester United star owners with an 8-0 FA Cup rout, while Liverpool also cruised into the fourth round with a 4-0 victory over Accrington Stanley.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Football star’s sex tape arrest at training",
        "description": "Teammates of a Premier League star were left in shock after he was arrested while on the training pitch this week.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Aussie boxer’s world title hopes dashed",
        "description": "Aussie boxer Sam Goodman has been left broken hearted after he was forced to withdraw from a world title fight for the second time.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "‘Sour taste’: Aussie F1 gun in huge trouble",
        "description": "A rare, thinly-veiled driver move could spell trouble for Australia’s newest F1 driver Jack Doohan with eyebrows raised.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Cotton delivers masterclass in Wildcats thumping of Jackies",
        "description": "Another Bryce Cotton masterclass has fired the Perth Wildcats to a statement win against the Tasmania JackJumpers who were brought crashing back to earth. Get the latest news from round 16.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Rising star remains on top as WA domination continues",
        "description": "Tournament host Min Woo Lee can be confident the majority of the prize money will be staying in WA, as local golfers continue to dominate ahead of the final round of the Webex Players Series.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "How huge plunge kickstarted Greenhalgh’s love of racing",
        "description": "Noel Greenhalgh came out to Australia with no idea about racing after growing up in betting shops, but now loves the sport that has delivered him a Melbourne Cup and other big races.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Sales pitch begins to keep Wallabies coach",
        "description": "Public lauding of Wallabies coach Joe Schmidt will be the players’ way of convincing him to stay rather than private urgings that could put unwanted pressure on him.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Reds star aiming for stellar Super season",
        "description": "Queensland Reds star Tom Lynagh knows his best chance of regaining a Wallabies jersey is to shine for the Queensland Reds this year.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-12T07:21:09.053959"
    }
]