[
    {
        "title": "Jaguar says it has no plans to build cars in the US",
        "description": "The comment came after the company's boss refused to rule out opening production plants in America.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Relief on China's factory floors as US tariffs put on hold",
        "description": "A surprise deal in the trade war gives businesses breathing room - but many now want to find new markets.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Co-op narrowly avoided an even worse cyber attack, BBC learns",
        "description": "The revelation - from the criminals responsible - explains why the Co-op is getting back to business faster than M&S.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "UK hits back at claims US tariff deal bad for China",
        "description": "The UK government said there was \"no such thing as a veto on Chinese investment\" in its tariff deal with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Relief on China's factory floors as US tariffs put on hold",
        "description": "A surprise deal in the trade war gives businesses breathing room - but many now want to find new markets.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Why India could not stop IMF bailout to Pakistan",
        "description": "As one of 25 member groups on the IMF board, India's influence at the fund is limited, say experts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "UK tech tycoon Mike Lynch's yacht was toppled by 'extreme wind', report says",
        "description": "Investigators say 80mph winds \"violently\" knocked over the vessel, causing it to flood within seconds.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Trump touts 'record' Boeing-Qatar Airways deal",
        "description": "The commitment from the state-owned airline comes as Boeing pushes to rebuild its business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Letting off steam: How Dominica's volcanoes will boost its green energy",
        "description": "The Caribbean island is building a power station that will use steam naturally heated by volcanic rock.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Is the US finally on track to build a high-speed rail network?",
        "description": "The US currently has no high-speed rail services, but two are under construction, and more planned.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Burberry to cut 1,700 jobs as designer suffers heavy losses",
        "description": "The British designer brand - famed for its distinctive check pattern - has proposed cutting its global workforce by a fifth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Airbnb offers private chefs and massages as it revamps app",
        "description": "The short rental firm says it is aiming to offer a wider range of experiences for travellers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Plane crash victims' families file complaint against Jeju Air CEO",
        "description": "A criminal complaint was filed against 15 people, including the transport minister, for negligence.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Probe launched into Aviva's £3.7bn takeover of Direct Line",
        "description": "Britain's competition watchdog wants to review a £3.7bn deal that would see Aviva takeover Direct Line.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Trump pledges to lift Syria sanctions as he seals $142bn arms deal on Saudi visit",
        "description": "The US president gets a \"lavender-carpet\" reception on a whirlwind visit of Gulf countries mainly focused on shoring up investment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "How can traditional British TV survive the US streaming giants?",
        "description": "Senior figures in the UK TV industry are contemplating how best to secure its future",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Canada's Carney unveils cabinet of familiar and fresh faces amid US trade war",
        "description": "Prime Minister Mark Carney's cabinet reshuffle includes changes to the core team overseeing the fraught US-Canada relationship.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "'I can get my Christmas tree order' - firms give sigh of relief at tariff truce",
        "description": "Businesses are moving ahead with shipments, as the deal to reduce tariffs raises hopes over the economic outlook.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Nissan to cut 11,000 more jobs and shut seven factories",
        "description": "The planned layoffs mean the Japanese carmaker has now cut about 15% of its workforce in the past year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu",
        "description": "Chinese online retailers had previously relied on the \"de minimis\" loophole to ship low-value items to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "M&S says customer data stolen in cyber attack",
        "description": "The retail giant is still not taking online orders following a cyber attack three weeks ago.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Trump's order on US drug prices: What's in it, and will it work?",
        "description": "The president promises sweeping price cuts \"almost immediately\", but experts say these are unlikely.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "UK jobs market continues to weaken",
        "description": "The number of workers on payrolls fell in the first three months of the year, official figures show.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Gold is booming - but investors lured in by the hype could lose out, warn experts",
        "description": "Trade wars and volatile markets have contributed to a gold rush, but investors shouldn't put all their eggs in this one basket, warn experts",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "Fishing shouldn't block defence pact, says EU chief",
        "description": "The EU's foreign policy chief says talks over future fishing access should not block a defence deal.",
        "source": "BBC Business",
        "fetched_date": "2025-05-15T07:27:27.756856"
    },
    {
        "title": "After Tuesday’s Resentencing, What’s Next for the Menendez Brothers?",
        "description": "The pair, who have been imprisoned for more than 30 years for the murder of their parents, are now eligible for parole, but their freedom is not guaranteed.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Blake Lively’s Lawyers Are Extorting Taylor Swift, Justin Baldoni Claims",
        "description": "In a Wednesday letter to the court, lawyers for the 'It Ends With Us' director say that Lively's legal team threatened to release private text messages involving Swift. A lawyer for the actress denied the accusations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Jennifer Lopez Suffers Facial Injury While Rehearsing for 2025 American Music Awards",
        "description": "\"So this happened,” Lopez shared on her Instagram stories as she prepares to host and perform during the May 26 show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Jennifer Garner, Chelsea Handler, Scooter Braun Share ‘Borrowed Spotlight’ With Holocaust Survivors",
        "description": "In a new exhibition and book project, renowned fashion photographer Bryce Thompson captures stunning images of moving pairings.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Cassie Testifies Diddy Kept Her in Line by Threatening to Release “Freak-Off” Videos",
        "description": "The day's testimony began with Sean Combs' longtime ex-girlfriend detailing the bruises and black eye she says she was left with after a vicious beating from Combs that was caught on surveillance video at a Los Angeles hotel in 2016.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Rihanna to Release First Song in Three Years for ‘Smurfs’ Soundtrack",
        "description": "The superstar shared the news along with a trailer for the film on Wednesday, which also features snippets of the song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Anonymous No More: Inside the Complicated Life of Harvey Weinstein’s Key Accuser",
        "description": "The fallen mogul’s trial for sex crimes in Manhattan may hinge on the testimony of a recently revealed accuser, Kaja Sokola, a Polish ex-model who claims Weinstein sexually assaulted her when she was 16.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Trump May Hurt Hollywood With Remake of Copyright Office",
        "description": "The removal of veteran lawyer Shira Perlmutter could destroy the entertainment industry's leverage with AI companies.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Former NFL Player Isaac Rochell Sets Podcast ‘Don’t Worry I’ll Ask’ (Exclusive)",
        "description": "Rochell, who has a large social media following along with his wife Allison Kucharczyk, will interview pop culture personalities.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Menendez Brothers Resentenced for 1989 Murders of Parents, Clearing Major Hurdle to Regaining Freedom",
        "description": "The two-day proceeding in L.A. ended on its first day with the judge resentencing the brothers who have spent more than three decades behind bars for their parents' 1989 murders.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "At Diddy Trial, Ex-Girlfriend Cassie Details “Disgusting,” “Humiliating” “Freak-Off” Sex",
        "description": "The R&B singer revealed from the witness stand on Tuesday that she was fleeing a \"freak-off\" in the video of Combs attacking her in 2016 in a hotel hallway.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "Harvey Weinstein’s Defense Team Pushes Accuser Kaja Sokola on Diary and Career Aspirations",
        "description": "Cross-examination of Sokola, a former model, centered on whether the relationship had been consensual and a controversial journal from her past.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-15T07:27:28.118312"
    },
    {
        "title": "‘Where’s the logic’: Shock AFL move slammed",
        "description": "The AFL has announced a big change to its fixture for the end of the season, with a new schedule raising eyebrows around the league.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Kick in the guts’: Storm rage over Vegas snub",
        "description": "After being overlooked for a trip to Las Vegas in 2026 the Melbourne Storm has hit out at the NRL declaring certain teams got preferential treatment.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Final warning’: NRL anger at coach attacks",
        "description": "The NRL has had enough of one coach’s constant attacks on match officials and has brought the hammer down.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Roos’ ‘balancing act’ with young gun",
        "description": "North Melbourne is managing Colby McKercher’s role to balance the benefit of immediate impact and his long-term future.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Kick in the guts’: Storm rage over Vegas snub",
        "description": "After being overlooked for a trip to Las Vegas in 2026 the Melbourne Storm has hit out at the NRL declaring certain teams got preferential treatment.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Final warning’: NRL anger at coach attacks",
        "description": "The NRL has had enough of one coach’s constant attacks on match officials and has brought the hammer down.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Where’s the logic’: Shock AFL move slammed",
        "description": "The AFL has announced a big change to its fixture for the end of the season, with a new schedule raising eyebrows around the league.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Roos’ ‘balancing act’ with young gun",
        "description": "North Melbourne is managing Colby McKercher’s role to balance the benefit of immediate impact and his long-term future.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "South Africans make WTC final demand",
        "description": "As players weigh up whether to return to India for the delayed IPL, South African cricket bosses lost their bid to make a demand on their Test players that Cricket Australia didn’t.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Proteas fling more barbs, out to ‘topple’ Aussies",
        "description": "The one-off World Test Championship final between Australia and South Africa is firing up both sides, with a fast bowler’s drug ban the centre of attention.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Call Roger’: Djoker’s shock coaching move",
        "description": "Just weeks out from the French Open and Wimbledon, Novak Djokovic has announced a shock moving in his coaching ranks.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Jelena Dokic’s heartbreaking confession",
        "description": "Australian tennis great turned commentator Jelena Dokic has lifted the lid on her feelings towards her estranged father in a raw interview.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Real reason behind Broncos demise revealed",
        "description": "A handful of Broncos players who have gone “missing” have been urged to lift, as Brisbane look to turn their stuttering NRL season around.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Oscar Piastri bullying drama erupts",
        "description": "Oscar Piastri’s F1 team have sensationally claimed the young Aussie was ‘bullied’ when he was signed to rival team Alpine.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Piastri topples Ricciardo in the one area we never thought possible",
        "description": "For the first time ever, Oscar Piastri is officially Australia’s most popular F1 driver. But there’s one area he still trails Daniel Ricciardo – even after torching the F1 circuit this year.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Better news for Wallabies $5m man’s injury",
        "description": "The most expensive signing in Rugby Australia history could yet play for the Wallabies against the British and Irish Lions  after a serious injury revelation.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Reds lose Test trio for battle with Brumbies",
        "description": "The Queensland Reds’ depth will be tested when they take on the ACT Brumbies in Canberra on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Baseball world rocked by Aussie icon’s death",
        "description": "A massive ‘outpouring of shock and loss’ has swept through the Australian sporting world after the unexpected death of an Aussie Olympian.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Oh good lord’: Giddey twist has NBA reeling",
        "description": "The NBA is still coming to terms with the shocking result of the draft lottery, and how Josh Giddey inadvertently cost his team the No. 1 pick.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Friends to become foes in A-League semi",
        "description": "A friendship spanning almost 35 years will be put to one side during the two-legged A-League semi-final between Western United and Melbourne City.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "$4m carrot up for grabs for Ange as Tottenham suffer another blow",
        "description": "Alongside making Australian football history, Ange Postecoglou will be $4.13m richer if he leads Tottenham a drought-breaking trophy win. But his job has just been made that much harder.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘No! What the f***’: Garside fight called off",
        "description": "Harry Garside’s comeback boxing fight has ended in hugely controversial circumstances that left his opponent and Tim Tszyu stunned.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Lacks soul’: Star’s wild Kardashian hot take",
        "description": "Eyebrows have been raised around the world after a golfer compared this week’s PGA Championship course to a Kardashian.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Oh good lord’: Giddey twist has NBA reeling",
        "description": "The NBA is still coming to terms with the shocking result of the draft lottery, and how Josh Giddey inadvertently cost his team the No. 1 pick.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Williams gets unexpected shot at rare Group 1 hat-trick",
        "description": "A pair of events has presented Craig Williams with an opportunity to win the Group 1 Doomben 10,000 for the third year in a row.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Divorced’: Dennis’ battle with mental health",
        "description": "Rohan Dennis seemed to have everything going for him, but an ominous interview before his wife’s death revealed what was happening behind the scenes.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "‘Heart broken’: WWE legend dead at age 60",
        "description": "An icon of the wrestling world has died just weeks after his final match with stars of the industry left “heartbroken”.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    },
    {
        "title": "Brutal truth about Candice, David’s marriage",
        "description": "Candice Warner has opened up about her decade-long marriage to cricketer David Warner, saying the couple have faced their challenges.",
        "source": "News AU",
        "fetched_date": "2025-05-15T07:27:31.090210"
    }
]