[
    {
        "title": "Volvo gives up plan to sell only EVs by 2030",
        "description": "The car maker's decision comes as industry faces slowing demand in some major markets for electric vehicles.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Fast fashion drove Bangladesh - now its troubled economy needs more",
        "description": "The once booming garment industry faces an uncertain future amid political unrest and slowing demand.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Oasis hit out at Ticketmaster's dynamic pricing after backlash",
        "description": "The band say decisions on pricing were left \"entirely to their promoters and management\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "More than 440 Mitsubishi staff facing redundancy",
        "description": "The firm confirmed 443 jobs were at risk and blamed 'widespread downturn in demand' for its products.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Spotify wins case over 'billions' of Eminem streams",
        "description": "The ruling comes even though Spotify did not obtain the correct licences to stream the star's music.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Fast fashion drove Bangladesh - now its troubled economy needs more",
        "description": "The once booming garment industry faces an uncertain future amid political unrest and slowing demand.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Sell-off erases Trump Media shares' 2024 gains",
        "description": "Shares in Trump Media are now worth less than they were at the start of the year.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Grenfell victims say they're still waiting for justice after damning report",
        "description": "\"We lost friends, neighbours and loved ones in the most horrific way,\" bereaved families say.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "US plans to block Nippon Steel takeover of US Steel - US media",
        "description": "The controversial move comes during a heated election year in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Oasis hit out at Ticketmaster's dynamic pricing after backlash",
        "description": "The band say decisions on pricing were left \"entirely to their promoters and management\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Telegram apologises for handling of deepfake porn material",
        "description": "It comes days after South Korean police said they had launched an investigation into Telegram.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Nvidia plunges almost 10% as global markets fall",
        "description": "The artificial intelligence chip giant saw $279bn wiped off its stock market value in New York.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Biggest UK housing firm to build fewer homes",
        "description": "The house building giant built 18% fewer homes last year as profits tumbled.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "'No preaching' and other tactics as China woos African leaders",
        "description": "China is feting African leaders at a summit in Beijing aimed at strengthening ties.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "UK state pension to rise by over £400 next year",
        "description": "This will take the full state pension for men who have retired since 1951 and women since 1953 to around £12,000 in 2025/26.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Second class letter deliveries on Saturdays could be cut",
        "description": "Changes to the second class service could be allowed to maintain first class deliveries for six days a week.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Alert over potentially deadly counterfeit vodka in UK",
        "description": "The Food Standards Agency warns counterfeit bottles have been found to contain a dangerous substance.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Mablethorpe permanent banking hub confirmed",
        "description": "Customers of all major banks will be able to carry out regular cash transactions on weekdays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Watchdog makes big cut to fraud compensation plans",
        "description": "Post-summer life admin leaves some exposed to scams, campaigners say, as fraud and fears grow.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Cathay Pacific grounds planes after engine problem",
        "description": "The Airbus A350-1000's Trent XWB-97 engines were made by UK-based engineering giant Rolls-Royce.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Sanctioned Russian oligarchs take stake in largest UK oil firm",
        "description": "Petr Aven and Mikhail Fridman become minority shareholders after Harbour Energy buys German firm.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Nine offshore wind farm projects awarded in UK auction",
        "description": "The green energy deals follow last year's auction when no companies bid to build offshore wind farms.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Will Labour’s plan make train tickets cheaper?",
        "description": "What impact will Labour's pledge to nationalise the railways have?",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "Trial of former VW boss begins over 'dieselgate' scandal",
        "description": "Martin Winterkorn, who was head of the German carmaker in 2015, appeared in court on Tuesday.",
        "source": "BBC Business",
        "fetched_date": "2024-09-05T07:22:46.519967"
    },
    {
        "title": "The Titanic is disintegrating. Here's how it will end",
        "description": "The wreck of the Titanic is showing clear signs of decay on the sea floor miles below the surface. What will its final fate be?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "'Why I cycled 1,500km to avoid a flight'",
        "description": "Looking for alternatives to flying, Matilda Welin decided to embark on a long-distance cycle from London to Sweden. Here's what she learned.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "The flawed way we rank hurricanes",
        "description": "Scientists are racing to update the imperfect system we rely on to warn just how deadly a storm will be.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-05T07:22:46.586605"
    },
    {
        "title": "Queen Guitarist Brian May Reveals He Suffered a Minor Stroke, Temporarily Lost Mobility in Left Arm",
        "description": "Queen guitarist Brian May is on the road to recovery after suffering a minor stroke, which temporarily left him unable to move his left arm. The musician took to Instagram and YouTube to share the update, detailing his breakthrough following his health struggles. “I’m here to bring you—first of all—some good news, I think,” he […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "‘Megalopolis’ Finds a Fall Guy for AI Trailer Snafu and Hollywood Cries Foul",
        "description": "Megalopolis Finds a Fall Guy for AI Trailer Snafu We’ll find out whether Francis Ford Coppola’s Megalopolis is a masterpiece or a stinker when it arrives in theaters on Sept. 27, but the behind-the-scenes dramas have already been riveting. The latest twist was the snafu over the sci-fi drama’s trailer, which was pulled by distributor Lionsgate […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "‘Twilight’ Animated Series a Go at Netflix",
        "description": "Twilight is getting a second (after)life in the form of an animated series at Netflix. The streamer has given a straight-to-series order and begun development on a show based on Midnight Sun, author Stephenie Meyer’s companion novel to her mega-selling Twilight series. The book is a retelling of the events of Twilight from vampire Edward […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Venezuelan News Agency Turns to AI-Generated Newscasts to Protect Journalists",
        "description": "The new Venezuelan news service Connectas has turned to artificial intelligence-generated newscasts to protect its journalists during a post-election government crackdown in that country. After a disputed election in July, Connectas says the AI avatars used in news reports on YouTube and digital platforms are fake, but not the news reports themselves, as the newscasts […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Katy Perry Addresses Backlash Over Working With Dr. Luke on New Album After Kesha Lawsuit",
        "description": "Katy Perry is speaking out on the backlash she received over working with Dr. Luke (Lukasz Gottwald) on her new album. While appearing on the Call Her Daddy podcast, the singer was asked about the producer’s involvement in her upcoming sixth album. Perry received criticism over choosing to work with Gottwald given he had been in […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "The Black List Expands Into Fiction and Unpublished Manuscripts",
        "description": "The Black List – the company behind the annual list of Hollywood’s best unproduced screenplays — is expanding into fiction, launching several initiatives focused on unpublished manuscripts. In today’s announcement, The Black List said the goal of the expansion is to bridge the gap between early-career writers and the established publishing industry. Black List founder […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "London Film Fest Unveils Full Program, Including Doc and First Feature Competition Lineups, Series",
        "description": "The BFI London Film Festival (LFF) 2024 will screen documentaries about “witches,” and zoos and animal rescue centers in Argentina, first features from directors of varied backgrounds, and Ali Abbas’ Donald Trump film The Apprentice in its gala lineup organizers said on Wednesday as they unveiled the full program for this year’s event. Overall, LFF […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Venice Diary Day 6: Oddballs on the Red Carpet",
        "description": "The security guards guarding the stars on the Lido have an often tricky job. Not only do they have to protect divas from their fans — they also have to deal with more than the usual number of oddballs, imposters and seat-stealers. The Fan in a Thong A 50-year-old man was camped out all night […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Donald Trump Ordered by Judge to Stop Using Isaac Hayes-Penned Song at Rallies",
        "description": "At an emergency injunction hearing in Atlanta federal court on Tuesday, Donald Trump and his campaign were ordered to stop using a song written by songwriting legend Isaac Hayes that he has played at over 130 rallies.   U.S. District Court Judge Thomas Thrash Jr. issued an injunction as part of the 9:30 a.m. hearing called […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Gwyneth Paltrow, Gal Gadot and More Hollywood Figures React to Six Israeli Hostages Killed in Gaza",
        "description": "As protests seeking a ceasefire lit up across Israel this weekend, Gwyneth Paltrow, Gal Gadot and Debra Messing joined other Hollywood stars in expressing sorrow and sympathy for the families of six Israeli hostages whose bodies were discovered in a tunnel below Gaza after 11 months in captivity. Nearly a year after their abduction by […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Elton John Reveals He Has “Been Dealing With a Severe Eye Infection”",
        "description": "Elton John has revealed his struggles with a severe infection that has affected his vision. In a message shared on social media, the iconic singer shared that throughout the summer, he has “been dealing with a severe eye infection,” leaving him with “only limited vision in one eye. “I am healing, but it’s an extremely […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "‘Short N’ Sweet’ Is Officially Sabrina Carpenter’s First No. 1 Album",
        "description": "Sabrina Carpenter officially has her first No. 1 on the Billboard 200 chart. On Tuesday, Billboard announced that the 25-year-old singer’s latest release, Short N’ Sweet, had debuted at No. 1 on this week’s chart. The accomplishment marks Carpenter’s first No. 1 album of her career. Carpenter’s latest single “Taste” debuted at No. 2 on […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-05T07:22:46.771937"
    },
    {
        "title": "Reonic raises €13 million to help small installers of green tech like heat pumps and solar panels",
        "description": "European regulators are pushing hard for greener energy. The REPowerEU plan calls for 10 million additional heat pumps to be added by 2027, and solar panels are also on the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Boom’s macOS camera app lets you customize your video call appearance",
        "description": "As someone who talks to many people outside my time zone, I often spend at least a few minutes on a video call explaining my location, time, and weather. That…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Those ‘Founder mode’ memes keep coming",
        "description": "If you spend time on X or Threads, where snarky memes rise and fall, you’ve probably seen posts referencing “founder mode” over the last few days, like this: https://www.threads.net/@carnage4life/post/C_eaQAxyIcV Or…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Andreessen Horowitz shutters its Miami office after two years",
        "description": "Andreessen Horowitz (a16z) has closed a satellite office in Miami Beach just two years into a five-year lease it signed for an 8,300-square-foot space. The reason? Disuse, reports Bloomberg. Miami…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Boeing and NASA prepare to bring Starliner home without its crew on Friday",
        "description": "These final maneuvers will bring to a close a troubled first crewed mission for the Boeing-made Starliner.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Facebook says, ‘How do you do, fellow kids?’",
        "description": "As Meta tries to rekindle the flame between Facebook and socially anxious youths, the company released a blog post Wednesday titled, “Navigating your 20s with Facebook.”",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "E-bike maker Cowboy raises a small funding round as it targets profitability next year",
        "description": "Cowboy has closed funding of around $5.5 million. With this recent funding round, Cowboy is now valued at €40 million on a pre-money basis.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Paylocity is acquiring corporate spend startup Airbase for $325M",
        "description": "HR and payroll software company Paylocity has agreed to acquire corporate spend startup Airbase for $325 million, the companies announced Wednesday. The deal is subject to regulatory approval and is…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Publishers prevail in lawsuit over Internet Archive’s ’emergency’ e-book lending",
        "description": "A long-running lawsuit over the Internet Archive’s “emergency” e-book lending practices during the COVID-19 pandemic has ended in a loss for the website and a victory for publishers. The lawsuit…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Ryan Breslow’s $450M Bolt deal said to involve a restraining order now",
        "description": "Ryan Breslow’s plan to get himself reinstalled as CEO of fintech company Bolt — and push through a $450 million fundraising deal that would value the startup at a staggering $14 billion…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Short series app My Drama takes on Character.AI with its new AI companions",
        "description": "Maybe a lack of AI characters is what Quibi got wrong. At least, that’s what one startup appears to believe.  My Drama is a new short series app with more…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Woman who allegedly killed two people using Ford BlueCruise charged with DUI homicide",
        "description": "A 23-year-old woman who allegedly killed two men in March while using Ford’s hands-free system, BlueCruise, has been charged with DUI homicide by Pennsylvania State Police. The woman, Dimple Patel,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "X is hiring staff for security and safety after two years of layoffs",
        "description": "The hiring effort comes after X, formerly known as Twitter, laid off 80% of its trust and safety staff since Musk’s takeover.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "This Week in AI: VCs (and devs) are enthusiastic about AI coding tools",
        "description": "Hiya, folks, welcome to TechCrunch’s regular AI newsletter. If you want this in your inbox every Wednesday, sign up here. This week in AI, two startups developing tools to generate and…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "The Cosmos Institute, whose founding fellows include Anthropic co-founder Jack Clark, launches grant programs and an AI lab",
        "description": "The Cosmos Institute, a nonprofit whose founding fellows include Anthropic co-founder Jack Clark and former Defense Department technologist Brendan McCord, has announced a venture program and research initiatives to —…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "YouTube debuts new parental controls aimed at teens",
        "description": "Once linked, parents will be alerted to their teen’s channel activity, including the number of uploads, subscriptions and comments.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "As remote working keeps rolling, Oyster raises $59M Series D at $1.2B valuation",
        "description": "No one is putting the remote working genie back in the bottle. Which is good news for Oyster, a payroll and HR platform that specializes in distributed workforces — or…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "TechCrunch Minute: X lost millions of monthly active users after Brazil ban",
        "description": "Bluesky has gained 2 million new users over the last week, which can only mean one thing: Something fishy is going on at X. And,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Tinder update targets college students as dating apps struggle",
        "description": "For the college students who are satisfied with dating apps, which may not be many, Tinder announced Wednesday a series of updates to Tinder U, its in-app feature that caters…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "Ireland’s privacy watchdog ends legal fight with X over data use for AI after it agrees to permanent limits",
        "description": "The exact contents of X’s (now permanent) undertaking with the DPC have not been made public, but it’s assumed the agreement limits how it can use people’s data.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-05T07:22:47.039743"
    },
    {
        "title": "‘Definitely pushing’: Major move for LIV players",
        "description": "There’s one significant thing LIV Golf has done that an Australian gun thinks could have big ramifications for local events in the future.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Souths turn to lawyers in Latrell ban fight",
        "description": "After South Sydney’s medical evidence about Latrell Mitchell was rejected by the NRL, the Rabbitohs have taken the fight to a new level.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Epic tale from ‘minimum wage’ to favourite son",
        "description": "The Burgess name will be forever linked to South Sydney long after the fourth of a band of brothers plays his final game.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Plea to umpires to keep their ‘eyes open’",
        "description": "The Lions are preparing for one of their stars to be targeted in what they expect will be a “fiercely contested” elimination final against Carlton.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Cats suffer brutal finals blow ahead of Port blockbuster",
        "description": "It was already going to take a mighty effort for the Cats to go to Adelaide and knock off the Power in the first final of 2024. Now, that job just got even harder.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Hawk wants stadiums back on AFLW agenda",
        "description": "A Hawthorn AFLW star says a key aspect of playing at local grounds is affecting how the competition is perceived.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "NRL Live: Can Storm punish battling Broncos?",
        "description": "After resting 11 players last week, Melbourne have named a near full-strength side to take on Brisbane. And SuperCoaches are hoping Craig Bellamy’s men go big against the Broncos.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "NRL ladder: Where will your team finish in NRL finals race?",
        "description": "The final round of the season is here and there is still one top-eight spot up for grabs. See what every team needs to secure a home final match in Week One.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Aussies shatter records in cricket demolition",
        "description": "Australian skipper Mitch Marsh and Travis Head have set fire to cricket’s record books in a blistering display against Scotland.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Marsh whacks 30 in an over as records tumble",
        "description": "The boundaries at The Grange in Edinburgh were no match for Travis Head and Mitchell Marsh who put Scotland back in their T20 place with an unforgettable effort.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "$15 million secret behind this photo",
        "description": "Forget the cost of living, because there’s one item at the US Open that patrons are dishing out hundreds to get their hands on.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Concerning detail spotted as Aussie crushed",
        "description": "Australia’s top ranked tennis player has been swept off the court in devastating scenes at the US Open on Thursday morning.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Schumacher wife’s rare public outburst",
        "description": "Corinna Schumacher has caused a scene in front of the Formula 1 world in a confrontation with a long-time friend surrounding her family.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "‘Was I a prick?’: Ricciardo apologises for race incident",
        "description": "Australian F1 star Daniel Ricciardo has reached out to Nico Hulkenberg to apologise for an opening lap incident that did damage to both their races.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Gold medallist as you’ve never seen her",
        "description": "Surviving a horrific cycling accident was a feat in itself for Alexa Leary. After stealing the spotlight in Paris, read about her incredible story.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Aussies in near ‘catastrophic’ lightning strike",
        "description": "Aussie sailor Jimmy Spithill was caught up in a terrifying lightning episode that struck in the middle of a competition.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Travis Kelce hits back over ‘break-up contract’",
        "description": "Travis Kelce has hit back after a break-up “contract” that surfaced online apppeared to show he and Taylor Swift are set to call it quits.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "‘Absolute mayhem’: WWE challenger bringing wrestling to Brisbane",
        "description": "Wrestler the “Big Show” has no regrets about making the switch from WWE to AEW, which is expecting a crowd of more than 40,000 for its first Australian event. TICKET INFO HERE",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Matildas star’s four-goal stunner",
        "description": "A Matildas star slotted four goals for her club team in England just as she and her Australian teammates were snubbed in a major football award.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Big Irankunda question facing Socceroos",
        "description": "Whether he plays from the opening whistle or comes off the bench, Nestory Irankunda seems certain to have an influence against Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Tszyu makes history with US fight confirmed",
        "description": "Tim Tszyu’s next opponent has been confirmed — and the world title fight is set to make American boxing history.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "‘Definitely pushing’: Major move for LIV players",
        "description": "There’s one significant thing LIV Golf has done that an Australian gun thinks could have big ramifications for local events in the future.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "How players score points in SuperCoach NBL",
        "description": "The SuperCoach NBL scoring formula is simple enough to follow on TV or courtside. Check out this quick explainer – and who to consider for your team.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Wallabies hit back over fake injury claims",
        "description": "The next Wallabies clash with South Africa could explode after allegations the Australians faked head injuries in their fiery game in Perth.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "No flashbacks for Wallabies hero",
        "description": "Nearly two years after he fluffed a matchwinning kick against Italy, Ben Donaldson stepped up to the plate again and delivered for the Wallabies.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "‘Might have last crack at them’: Caballus’ Moir mission",
        "description": "Trainer Bjorn Baker believes the outside barrier will work in favour of promising sprinter Caballus for his Group 1 debut in the $750,000 Moir Stakes (1000m) at The Valley on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-09-05T07:22:48.282797"
    }
]