[
    {
        "title": "US tech giants announce AI plan worth up to $500bn",
        "description": "OpenAI, Oracle and Softbank join forces to build artificial intelligence infrastructure.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Trump considers 10% tariff on China from February",
        "description": "The new president accused Beijing of sending fentanyl to Mexico and Canada which ends up in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "China calls for 'win-win' solution to trade tensions",
        "description": "With the threat of a trade war looming, China's first vice premier says the country wants to boost imports.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "US markets rise as Trump holds off on tariffs",
        "description": "The US president stopped short of widespread import taxes but threatened Canada and Mexico with tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Trump considers 10% tariff on China from February",
        "description": "The new president accused Beijing of sending fentanyl to Mexico and Canada which ends up in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Netflix to raise prices as new subscribers soar",
        "description": "Squid Game 2 and live sports, including the Jake Paul v Mike Tyson fight, fuelled new memberships.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Trump pardons Silk Road dark web market creator Ross Ulbricht",
        "description": "Trump said he had called Ulbricht's mother to let her know he had granted her son a full pardon.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Ukraine's chief army psychiatrist arrested on $1m corruption charge",
        "description": "The man owned several properties as well as four BMW luxury cars, the Ukrainian security service said.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Best of 'frenemies': Trump's relationship with Europe this time may be very different",
        "description": "Weak, distracted and unprepared? How ready France, Germany and the rest of Europe really are for Trump's return to power.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Ros Atkins on... Donald Trump's new diversity policies",
        "description": "The president has moved to change the US government's policies on gender and diversity - here's what that means.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "US stocks open higher, 'no shock and awe' - 21 Jan 2025",
        "description": "Investment Strategist Edward Yardeni says Trump's threat of 25 percent tariffs by 1 February is negotiable.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Delay to TikTok ban gets Trump sign-off",
        "description": "The order was among a slew of directives Trump signed on Monday evening.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Musk responds to backlash over gesture at Trump rally",
        "description": "The billionaire says his critics \"need better dirty tricks\" after a gesture likened to a Nazi salute.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Instagram hides search results for 'Democrats'",
        "description": "Meta says it is working quickly to resolve the problem, which has prompted accusations of bias on social media.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Canada avoids Trump's tariffs - for now",
        "description": "President Donald Trump stopped short of imposing tariffs on Canada on day one but said they may come as soon as 1 February.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "UK pay after inflation rises at fastest rate since 2021",
        "description": "Wage growth increased by 3.4% after taking into account inflation, driven by strong increases in the private sector.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Trump makes 'two genders' and anti-DEI policy official",
        "description": "The president has vowed to use his post to fight elements of what conservatives have decried as \"woke\" culture.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Analysis: Scottish links may bring no special favours",
        "description": "The President's vow to use tariffs to protect America could have negative effects on Scotland's economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Inside Iceland's futuristic farm growing algae for food",
        "description": "Next to a geothermal plant in Iceland a start-up is growing microalgae for food.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Panama rejects Trump vow to 'take back' Panama Canal",
        "description": "Donald Trump claims China is operating the key US trade route but Panama says it belongs to them.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Melania Trump launches her own cryptocurrency",
        "description": "$Melania is announced after President-elect Donald Trump launched his own cryptocurrency, $Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Working from home 'not proper work' - ex-Asda boss",
        "description": "Lord Rose says it harms productivity but expert says hybrid work can be as good as full-time in the office.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "What does Trump's executive order mean for TikTok and who might buy it?",
        "description": "What does Donald Trump's executive order mean for the future of TikTok in the US?",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Shein backlash fails to deter shoppers: 'I spend £20 a month'",
        "description": "Some young shoppers will continue to buy from the fast fashion giant despite concerns over how workers are treated.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "TikTok restores service in US after Trump pledge",
        "description": "TikTok is resuming services to its 170 million users in US after President-elect Donald Trump said he would give the app a reprieve.",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "Trump launches cryptocurrency with price rocketing",
        "description": "Hours after its launch, the value of the coins for $Trump reached nearly $5.5bn (£4.5bn).",
        "source": "BBC Business",
        "fetched_date": "2025-01-22T07:22:36.448393"
    },
    {
        "title": "‘Morning Joe’ Hosts Have Tense Exchange Over Trump’s Jan. 6 Pardons",
        "description": "Mika Brzezinski called out the president calling the rioters \"hostages\" as he stood with the families of Israeli hostages while co-host Joe Scarborough said Democrats were \"quietly reminding themselves\" of the president's narrow margin of victory in the 2024 popular vote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Sometimes a Nazi Salute Is a Nazi Salute",
        "description": "Did Elon Musk intentionally \"sieg heil\" at Donald Trump's inauguration rally? Sometimes it only matters what you do, not what you intend.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Tyra Banks Reveals She Lost Her Home in the L.A. Wildfires",
        "description": "“I just didn’t want to pull a lot of attention to me,” she said. “I feel like there’s a lot of people that need that attention, so I haven’t really talked about it.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Billy Ray Cyrus Performs Chaotic A Cappella at Post-Inauguration Liberty Ball: “Is Anyone Awake?”",
        "description": "The country singer performed \"Old Town Road\" and \"Achy Breaky Heart\" with a hoarse singing voice and technical glitches Monday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Garth Hudson, Organist for The Band, Dies at 87",
        "description": "The Canadian virtuoso, known for his solo on “Chest Fever,” gave the group a “sound twice as big” and his mates music lessons.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "ACLU Responds to Trump’s Inauguration Speech: We “Have Already Begun to Fight the Administration’s Extreme Agenda”",
        "description": "\"While we know this president will issue orders with real, dire consequences on people here and abroad, many of his declarations do not and cannot change the law but instead are designed to engender chaos and confusion,\" the organization added on Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Trevor Noah to Return as Grammys Host",
        "description": "The awards show, set for Sunday, Feb. 2, had been without an emcee as it seeks to honor and raise funds for those affected by the Los Angeles wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Ariana Grande “Likes” Post Mocking Carrie Underwood’s Inauguration Performance",
        "description": "The 'Wicked' star and Kamala Harris supporter couldn't resist Liking a post that threw some shade at Underwood's \"America the Beautiful\" awkwardness.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Firefighters Extinguish Blaze in Los Angeles’ Griffith Park",
        "description": "The park is home to the Griffith Observatory, the Greek Theatre, the Los Angeles Zoo and the Hollywood Sign.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Ramaswamy Won’t Serve on Trump’s Government Efficiency Commission as He Mulls Run for Ohio Governor",
        "description": "The Department of Government Efficiency’s first order of business was itself.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "MusiCares Grateful Dead Tribute Lineup to Include Noah Kahan, Billy Strings, Maren Morris, More; Andy Cohen Set to Host Benefit Gala (Exclusive)",
        "description": "The event is scheduled for Jan. 31 ahead of the Grammy Awards.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "How Donald Trump Will War With Hollywood While Swiping All Its Tricks",
        "description": "No president has ever relied as much on the operating principles of the entertainment business. And none has ever had such a fraught relationship with it.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-22T07:22:37.239217"
    },
    {
        "title": "Lions star recovering well from surgery",
        "description": "A Brisbane Lions forward is tracking well in his recovery from off-season surgery.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Dragons’ blow as star enforcer wants out",
        "description": "A Dragons star is reportedly refusing to attend club training sessions as doubts surrounds his future with the NRL club.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Wests Tigers make huge captaincy call",
        "description": "Jarome Luai moved to the Wests Tigers to forge his own legacy and his new club has increased its investment in him beyond his massive pay cheque.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Outrage as Aussie stars wiped from history",
        "description": "Australian stars have been shamelessly snubbed with outrage surrounding the announcement of the world’s best cricket team.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Outrage as Aussie stars wiped from history",
        "description": "Australian stars have been shamelessly snubbed with outrage surrounding the announcement of the world’s best cricket team.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Aussie rookie in frame for Test call-up",
        "description": "All four of Georgia Voll’s internationals have come due to injuries to the Australian captain who remains under a cloud to see out the Ashes.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "World stunned as star does the unthinkable",
        "description": "Well that was just ridiculous. Nobody could believe their eyes when this Italian underdog pulled off what many are describing as a “miracle”.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Sinner fitness doubts explode after cancelling public practice",
        "description": "Alex de Minaur faces the biggest match of his career tonight – but his opponent, Jannik Sinner, is battling to even make the showdown. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Lions star recovering well from surgery",
        "description": "A Brisbane Lions forward is tracking well in his recovery from off-season surgery.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Carlton boss quits amid lewd photo scandal",
        "description": "Carlton president Luke Sayers has fallen on his sword after a social media scandal erupted earlier in the month.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Dragons’ blow as star enforcer wants out",
        "description": "A Dragons star is reportedly refusing to attend club training sessions as doubts surrounds his future with the NRL club.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Wests Tigers make huge captaincy call",
        "description": "Jarome Luai moved to the Wests Tigers to forge his own legacy and his new club has increased its investment in him beyond his massive pay cheque.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Aussie GOAT makes shock career call",
        "description": "She took last year off competition and still spent the year surfing, and now Steph Gilmore has decided what she’ll be doing in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "‘Pit of piranhas’: World title chase stirs Sally",
        "description": "Sally Fitzgibbons has been close to a world title in a rollercoaster career and the energetic Aussie can’t get enough of the ride as a 16th campaign begins.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Eddie McGuire’s son does the unthinkable",
        "description": "Joe McGuire, the son of broadcaster Eddie, has won an all-Aussie punting duel in a performance few would have seen coming.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "‘Disgusting’: US turns on NFL’s golden child",
        "description": "NFL fans have turned on Patrick Mahomes after the superstar quarterback was at the centre of some fiery playoffs controversy.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Matilda signs with German club",
        "description": "Brisbane Roar have secured a club record women’s fee from the transfer of a Matildas attacker to Germany.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Reds eyeing more Dutch delight",
        "description": "Adelaide United wants to further its hopes of winning the A-League title by adding another Dutch defender to its ranks.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Watch: Wild four-way stink erupts for chance to fight Tim Tszyu",
        "description": "Brock Jarvis and Keith Thurman delivered fireworks at their first press conference, but it was the revelation of a potential showdown with Tim Tszyu that really ignited proceedings.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "F1 world in meltdown over Hamilton photo",
        "description": "Seven-time world champion Lewis Hamilton has sent the F1 world into a spin over a simple photo he shared on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "‘Dream of racing in red’: Hamilton era begins at Ferrari",
        "description": "Lewis Hamilton has said he will bring everything to delivering first Ferrari championship since 2007 as he declares he always dreamed of racing in the iconic red of the Italian team.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "‘Car crash’ that broke Simmons – and how he can get back",
        "description": "Make no mistake, Ben Simmons was worth the hype; a genuine superstar of the NBA with an unbelievable ceiling. In a single moment, everything changed.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Aussie star’s truth bomb about PGA Tour",
        "description": "Only six of the world’s top 25 players will be at an event Tiger Woods won eight times as the profound impact of LIV on the PGA Tour plays out in real time.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Apache ‘on song’ for stern Australia Stakes test",
        "description": "Three straight wins over the Australia Stakes course has boosted Apache Song’s confidence ahead of the Michael Trotter-trained mare’s crack at Friday night’s Group 2 Australia Stakes at The Valley.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Wallabies skipper warns of ‘massive risk’",
        "description": "The Wallabies captain has urged Australian players to think about the 2027 Rugby World Cup when deciding about their future.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    },
    {
        "title": "Fan hospitalised in ‘awful, freak accident’",
        "description": "A devastating crash has marred Saturday’s Tour Down Under, leaving a fan hospitalized with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-01-22T07:22:38.437154"
    }
]