[
    {
        "title": "Trump tariffs can stay in place for now, appeals court rules",
        "description": "The president's signature import taxes win a legal reprieve, as the White House rails against \"activist judges\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon",
        "description": "Despite the legal mire, all signs point to this being a battle the Republican president won't give up easily.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Elon Musk leaves White House but says Doge will continue",
        "description": "Musk's exit comes after he criticised the legislative centrepiece of the president's agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Where does court ruling leave Trump's tariff agenda?",
        "description": "BBC Verify examines what the latest development means for US and global trade.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon",
        "description": "Despite the legal mire, all signs point to this being a battle the Republican president won't give up easily.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "How the West is helping Russia to fund its war on Ukraine",
        "description": "Data shows that Russian fossil fuel revenues are three times higher than aid allocated to Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "US green energy firms brace for federal funding cuts",
        "description": "Billions of dollars of US federal funding for green energy projects hangs in the balance.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Five ways the world's richest man changed the White House",
        "description": "The tech billionaire and Doge have spearheaded dramatic changes in the US government and Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Winemakers finding Trump's tariffs hard to swallow",
        "description": "Wine producers in both France and the US are unhappy at the US president's trade actions.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Cyber criminals contact BBC to claim hack on Co-op, M&S",
        "description": "Hackers reached out to the BBC's Joe Tidy on Telegram, frustrated that their ransom demands weren't being met.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Frugal tech: The start-ups working on cheap innovation",
        "description": "Indian start-ups are using local materials and innovative ideas to make useful and affordable products.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "UK car making plunges to lowest for over 70 years",
        "description": "The number of new vehicles made in the UK was the lowest figure for April - outside the pandemic - since 1952.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "The man making darts for the world's best players",
        "description": "Lee Huxtable has made darts for a legion of world champions, and pursues the perfect arrow.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Hailey Bieber's make-up brand sold to e.l.f.",
        "description": "Buyer e.l.f. Beauty calls it a \"beautiful brand that we believe is ready for rocketship growth\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Chile's salmon farms hope for calmer waters",
        "description": "Chilean salmon producers are being criticised for operating in some of the country's national parks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Nvidia revenues surge despite tariff uncertainty",
        "description": "Nvidia's share price rose by more than 5% in pre-market trading on Thursday after it beat Wall Street expectations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Musk 'disappointed' by Trump's tax and spending bill",
        "description": "As the former Doge chief, Musk had worked to reduce government spending which he says this bill contradicts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Telegram announces partnership with Musk's xAI",
        "description": "The $300m deal, which will last one year, will see xAI's assistant Grok integrated into Telegram.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Mars phases out controversial colour additive in Skittles",
        "description": "Confectionery giant Mars said it had stopped using titanium dioxide in its Skittles portfolio in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Temu's Chinese owner sees profits plunge as trade war bites",
        "description": "US-listed shares of PDD Holdings fell over 13% on Tuesday as the firm said its profit had almost halved.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "UK shoppers mock 'action replays' at self-checkouts",
        "description": "Tesco's latest use of technology to crack down on shoplifting has led to both jokes and complaints.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "'We make more money from weddings now than farming'",
        "description": "From falconry and helicopter rides to spas and solar farms, three quarters of farmers now have a side hustle.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Brazil sues China carmaker BYD over 'slave-like' conditions",
        "description": "The Public Labour Prosecutor's Office in the state of Bahia says 220 Chinese workers were rescued.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Trump administration seeks to pull estimated $100m in Harvard funding",
        "description": "Federal agencies will review their grants to the top university to decide whether they should be terminated.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Texas governor signs online safety law in blow to Apple and Google",
        "description": "Under the new law, minors will need parental approval before they can download apps or make in-app purchases.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Second suspect arrested in alleged crypto torture scheme",
        "description": "Police say the two men kidnapped an Italian businessman and tortured him with a gun, chainsaw and electrical wires for nearly three weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-30T07:26:45.009866"
    },
    {
        "title": "Sean “Diddy” Combs’ Assistant of 8 Years Accuses Him of Multiple Sexual Assaults During Testimony",
        "description": "The woman referred to as \"Mia\" in the rap mogul's trial said she was attacked on several occasions as prosecutors used her testimony to lay out their forced labor and racketeering case.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Harvey Weinstein “Seriously Contemplating” Testifying in Trial on Rape and Sexual Charges",
        "description": "His attorney, Arthur Aidala, said Weinstein may still take the stand as his trial winds down.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Sean “Diddy” Combs’ Ex-Assistant Testifies He Sexually Assaulted Her and Used Violence to Get His Way",
        "description": "The woman, speaking under the pseudonym \"Mia,\" alleged that he put his hand up her dress, forced her to perform oral sex and climbed into her bed to have sex with her against her will.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "John Fogerty Is Releasing “John’s Versions” of Creedence Clearwater Revival Classics",
        "description": "The legendary artist is sharing the new versions through his upcoming album 'Legacy: the Creedence Clearwater Revival years,' set to release Aug. 22.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Trump Pardons Rapper NBA Youngboy, Who Was Sentenced for Gun-Related Charges",
        "description": "“I want to thank President Trump for granting me a pardon and giving me the opportunity to keep building — as a man, as a father, and as an artist,\" the rapper said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "At Diddy Trial, Cassie’s Stylist Testifies About Decade of Bloody Abuse and Alleged Blackmail",
        "description": "Deonte Nash worked for Sean \"Diddy\" Combs for a decade as an intern and celebrity stylist with a focus on his close friend, Cassie Ventura, who he says he witnessed being violently abused.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Rick Caruso Confirms 2026 Reopening of Palisades Village, New Elyse Walker Flagship Boutique",
        "description": "The key player in L.A.’s post-fire revitalization efforts teased reopening plans (including a new restaurant and holiday gatherings) while praising a new retail partner: “I believe you have to have an economic engine.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Fifth Harmony, Minus Camila Cabello, in Talks to Reunite (Exclusive)",
        "description": "The group went on indefinite hiatus in 2018, a year after releasing their third album, following Cabello's 2016 departure.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Ben Stiller Calls Out Pat McAfee for “Weird” Comments About Him and Timothée Chalamet at Knicks Game",
        "description": "The actor was sitting courtside at the fourth game of the Knicks vs. Pacers playoffs, alongside Chalamet and Spike Lee.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Smokey Robinson Files $500M Countersuit After Being Accused of Sexual Assault",
        "description": "The famed Motown singer accuses the four women of defamation, slander, intentional infliction of emotional distress, financial elder abuse and invasion of privacy in his cross-complaint.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Brian Avnet, Longtime Artist Manager and Music Executive, Dies at 82",
        "description": "He collaborated with Jon Voight, Bette Midler, Lou Adler, Josh Groban, David Foster, The Manhattan Transfer and many others during his long career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Shaboozey Defends Megan Moroney Amid AMAs Backlash: “Let’s Not Twist the Message”",
        "description": "“She is amazing and someone who represents the country community in the highest light,” the five-time Grammy nominee said of Moroney.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-30T07:26:45.656661"
    },
    {
        "title": "Coach’s shock attack on Aus women’s football",
        "description": "Outgoing Matildas coach Tom Sermanni has launched a blistering attack on the current state of women’s football in Australia.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Wallabies open to Cleary code switch",
        "description": "Wallabies coach Joe Schmidt has addressed “rumours” that Penrith and NSW star Nathan Cleary might want to move from rugby league to rugby union.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Sick of it’: Benji moves on as Galvin video emerges",
        "description": "As video emerges of teen NRL star Lachlan Galvin training with the Bulldogs before his signing is confirmed, his former coach has moved on.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Bombshell NRL secret exposed by fan",
        "description": "A secretive fan video at Bulldogs training has revealed a very interesting Lachlan Galvin development, even before his move is confirmed.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Extra spice in this year’s battle of the west",
        "description": "Blaize Talagi was supposed to be Parramatta’s next long-term superstar, but instead he’s plotting their downfall on Sunday when he runs out with the Panthers.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Sick of it’: Benji moves on as Galvin video emerges",
        "description": "As video emerges of teen NRL star Lachlan Galvin training with the Bulldogs before his signing is confirmed, his former coach has moved on.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "AFLW shock in fixture release",
        "description": "There’s a few standout omissions in the 2025 AFLW fixture that has been finally released just months out from the start of the season.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Move on’: Lyon blind to ‘nepo baby’ fallout",
        "description": "It was hard to ignore the furious response from the Gold Coast Suns to a comment from St Kilda Ross Lyon, but it seems he managed to.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Hoff’s statement in shootout for WTC spot",
        "description": "There’s only one spot for either Josh Hazlewood or Scott Boland in the World Test Championship final and one of them is on fire.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Muddled mess’: Key factor in Marnus’ fate",
        "description": "Cameron Green looks a certainty to return to the Australian team, but a decision on who opens with Usman Khawaja could be determined by one thing.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Not normal’: Demon calls for big change",
        "description": "After tasting second-round defeat at the French Open, an exhausted Alex de Minaur demanded tennis authorities make a big change.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Alex de Minaur faces ugly tennis reality",
        "description": "Alex de Minaur’s impressive grand slam streak is over as his French Open defeat shone a light on a hard truth the Aussie must come to terms with.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Gimmick’ threatens F1’s $36bn juggernaut",
        "description": "A motorsport legend has dropped a truth bomb on F1 as the glamour sport grapples with a massive problem with no obvious solution.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Gimmick’ threatens F1’s $36bn juggernaut",
        "description": "A motorsport legend has dropped a truth bomb on F1 as the glamour sport grapples with a massive problem with no obvious solution.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "‘Rumours’ fly as rule change shakes up F1",
        "description": "F1 is clamping down with a new rule this weekend, with teams hopeful it will be a “game changer” and help end McLaren’s dominance.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Wallabies open to Cleary code switch",
        "description": "Wallabies coach Joe Schmidt has addressed “rumours” that Penrith and NSW star Nathan Cleary might want to move from rugby league to rugby union.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Cleary linked with shock Panthers exit",
        "description": "Nathan Cleary has been linked with a bombshell defection to rugby union with the Penrith halfback reportedly ‘keen’ on the switch.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "NBA on notice as Thunder make history",
        "description": "The Minnesota Timberwolves had no answers as the dominant OKC Thunder sent an ominous message and charged into the NBA Finals.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Aussie brutally axed in NFL cull",
        "description": "He went to two Super Bowls but after suffering a back injury an Aussie punter in the NFL has felt the axe.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Coach’s shock attack on Aus women’s football",
        "description": "Outgoing Matildas coach Tom Sermanni has launched a blistering attack on the current state of women’s football in Australia.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Dad charged with parade rampage unmasked",
        "description": "Paul Doyle, 53, has been hit with a string of charges as it’s revealed how his wife first heard about the ramming at the Liverpool celebrations.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "25yo star dies weeks after getting married",
        "description": "Tributes are flowing around the boxing world after a talented fighter died at the age of 25 in a heartbreaking tragedy.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "YouTube guide to conquer US Open beast",
        "description": "A baptism of fire awaits a rookie Australian pro at the US Open on a course that few of the field have ever laid eyes on other than through videos.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "NBA on notice as Thunder make history",
        "description": "The Minnesota Timberwolves had no answers as the dominant OKC Thunder sent an ominous message and charged into the NBA Finals.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Littlefield locks in flight as Muffin Man snares Derby start",
        "description": "Victorian trainer Charlotte Littlefield can confirm her Saturday plans after The Muffin Man snuck into the Group 1 Queensland Derby field.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-30T07:26:47.161131"
    }
]