[
    {
        "title": "The crypto bros who want to crowdfund a new country",
        "description": "How a group of Silicon Valley tech entrepreneurs plan to create \"the network state\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Taiwan says it did not make Hezbollah pager parts",
        "description": "The comments come after Taiwanese firm Gold Apollo said it did not make the devices used in the attack.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "What we know about firm linked to Lebanon pagers",
        "description": "BBC Verify has looked into a firm called BAC Consulting, which has been linked to the pagers' production.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Alstom creates new fleet for Egypt monorail project",
        "description": "The trains are part of a £2.3 billion contract to construct and run a 61-mile-long monorail network.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "US firm to open Yorkshire nuclear reactor factory",
        "description": "South Yorkshire mayor Oliver Coppard says the plant could support hundreds of “high-paying jobs”.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Taiwan says it did not make Hezbollah pager parts",
        "description": "The comments come after Taiwanese firm Gold Apollo said it did not make the devices used in the attack.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Nike boss steps down as company veteran returns",
        "description": "The company looks to shake things up as demand for its trainers falters in international markets.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Boeing strike: 'My $28-an-hour pay isn't enough to get by'",
        "description": "BBC News speaks to Boeing workers on the picket line about why they feel they have no choice but to strike.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Economy worries swirl after 'painful' UK Budget warning",
        "description": "Some economists have linked a drop in consumer confidence to officials' warnings of a painful Budget.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "What we know about firm linked to Lebanon pagers",
        "description": "BBC Verify has looked into a firm called BAC Consulting, which has been linked to the pagers' production.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "X says its return in Brazil after ban 'inadvertent'",
        "description": "The social media platform formerly known as Twitter was banned in the country in August.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "UK interest rates held at 5% but 'on the path down'",
        "description": "Economists are betting on rates being held in September with a cut to come in November instead.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Cathay Airbus fault could have caused major damage",
        "description": "The Hong Kong airline was forced to turn a flight around after an engine problem.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Mohamed Al Fayed accused of multiple rapes by staff",
        "description": "Five women who worked at the luxury store say they were raped by the billionaire - BBC documentary reveals.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "US goes big with first interest rate cut in four years",
        "description": "The Federal Reserve has cut its key lending rate by 0.5 percentage points - a larger cut than expected.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Why hundreds of Samsung workers are protesting in India",
        "description": "About 1500 workers in Tamil Nadu state have been striking work for the past 11 days.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Government borrowing in August highest since Covid",
        "description": "Higher spending on public services and benefits led to a rise in government borrowing, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Bates wants subpostmaster claims settled by March",
        "description": "The campaigner says it is time for a commitment for certain claims to be paid out over the next six months.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "One in five passengers forced to stand in morning peak",
        "description": "Official figures show that while commuter numbers have been rising, seating has barely budged.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Nintendo sues 'Pokémon with guns' video game firm",
        "description": "The Japanese company alleges that the Palworld video game \"infringes multiple patent rights\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Next may close stores if equal pay appeal fails",
        "description": "The High Street retailer said it expects to make nearly £1bn in full-year profit.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "How quickly are prices rising in the UK?",
        "description": "The rate at which prices are rising has nudged back above the Bank of England's target of 2%.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "When will interest rates go down again?",
        "description": "Bank of England interest rates affect the mortgage, loan and savings rates for millions of people.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Boeing suspends jobs for thousands after strike",
        "description": "Boeing says it is suspending jobs for thousands of staff in the US due to a worker strike.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "TGI Fridays' UK owner falls into administration",
        "description": "London-listed Hostmore has appointed Teneo as administrators to help it sell the restaurants.",
        "source": "BBC Business",
        "fetched_date": "2024-09-20T07:23:24.338489"
    },
    {
        "title": "Why rivers need their curves back",
        "description": "For centuries meandering rivers have been straightened – but experts say restoring their natural bends and curves can prevent flooding and create healthy habitats for wildlife.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The weird biology of the enormous smelly 'corpse plant'",
        "description": "It stands metres high, takes a decade to flower, smells like death and draws huge crowds when it blooms. But scientists are still unravelling the baffling lifecycle of the titan arum.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "How New Orleans prepared itself for a hurricane",
        "description": "As Hurricane Francine leaves households without basic power in New Orleans, a handful of \"community lighthouses\" could offer a crucial lifeline.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Iceland's vertical farm turning algae into food",
        "description": "A facility near the Icelandic capital, Reykjavik, is using innovative vertical-farming technology to grow algae.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Climate a more fundamental threat than terror - Lammy",
        "description": "Foreign Secretary David Lammy vows to put climate change at the heart of the UK's foreign policy.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Which is the 'dirty side' of a hurricane?",
        "description": "In tropical storms, location matters when it comes to what damage to expect – especially if you're on the \"dirty\" side of a hurricane, where winds can be up to 50% stronger.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Why humpback whales are changing course",
        "description": "The first humpback whale to return to the North Pacific's Salish Sea in decades tells a new story about the global threat to whale populations.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Mystery tremors were from massive nine-day tsunami",
        "description": "Scientists launched an investigation after being baffled by seismic signals picked up across the world",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The fisher folk reviving Finland's 'moonscape'",
        "description": "Finland's Linnunsuo wetland used to be a barren \"moonscape\". A local fishing community has transformed it into a biodiverse haven and an important carbon sink.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "'I wouldn't wish it on my worst enemy': The people who work inside the eye of a hurricane",
        "description": "As climate change makes hurricane systems more dangerous, the need to understand their inner workings is greater than ever.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "UK farming's 'net zero' climate target in doubt",
        "description": "Doubts are raised over UK farming's ability to reach \"net zero\" greenhouse gas emissions by 2040.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The town that should have burned, but didn't",
        "description": "In 2017, one of California's largest ever wildfires was steadily approaching Montecito. But it had long been preparing for just such an event.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-20T07:23:24.405195"
    },
    {
        "title": "Zach Bryan Apologizes for Saying He Prefers Kanye “Ye” West Over Taylor Swift: “Taylor Has Been a Force of Nature”",
        "description": "Zach Bryan has some regrets. After saying he preferred Kanye “Ye” West over Taylor Swift on X (formerly Twitter) on Tuesday, the musician has since deactivated his account on the platform and shared a lengthy apology on his Instagram Stories, with songs by the global superstar. “For the record guys I wasn’t coming for Taylor […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Margo Martindale Boards JonBenét Ramsey Series at Paramount+",
        "description": "Paramount+’s limited series about JonBenét Ramsey continues to attract a high-profile cast. The latest addition to the show is three-time Emmy winner Margo Martindale (The Americans, Justified). She’ll recur as Nedra, the mother of Patsy Ramsey (Melissa McCarthy) and grandmother to JonBenét. The character is described as “tough, blunt, outspoken, and unafraid to speak her […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "How Rhode Island’s Biggest Movie Showcase Became the “Fyre of Film Festivals”",
        "description": "Was RIIFF “The Fyre Festival of Film Festivals”? Every film festival has an occasional hiccup — remember the infamous screening of Reservoir Dogs at Sundance in 1992 when the lights came up before the movie ended? That said, according to one group of filmmakers, there was something going on at the Rhode Island International Film […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Who’ll Win Best New Artist at the Grammys?",
        "description": "At the 2024 Grammys, best new artist winner Victoria Monét’s nomination for record of the year made her the only breakthrough contender to compete in a Big 3 category (song, record and album of the year). This year, Chappell Roan, Shaboozey and Benson Boone also will comfortably stand proudly alongside veterans who’ve come before. Not […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "‘Veep’ Cast to Reunite for Table Read of Viral Episode at WisDems Event Hosted by Stephen Colbert (Exclusive)",
        "description": "When President Joe Biden announced he was dropping his 2024 re-election bid and endorsed Vice President Kamala Harris to be the Democratic presidential nominee, Veep started to see a resurgence both in Max viewership and on social media. And one of the most recirculated and memed moments in the wake of the Biden-Harris news was […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Sean “Diddy” Combs to Remain Detained Pending Trial",
        "description": "Sean Combs’ request to overturn a prior ruling denying him release on bail has been turned down, a court has ruled. U.S. District Judge Andrew Carter on Wednesday ordered Combs, also known as “Diddy,” to remain detained after he pleaded not guilty to sex trafficking and racketeering charges. He will stay at Metropolitan Detention Center […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Harvey Weinstein Pleads Not Guilty to New Sexual Assault Charge",
        "description": "Harvey Weinstein pleaded not guilty to one count of a criminal sexual act in the first degree Wednesday after Manhattan prosecutors arraigned the former mogul in a new indictment. The charge involves forcibly engaging in oral or anal sex with another person. It stems from a recent indictment returned by a grand jury and carries […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Kay Scarpetta Series Starring Nicole Kidman, Jamie Lee Curtis a Go at Amazon",
        "description": "Prime Video is hitting the books once again. The Amazon-owned streamer has greenlit Scarpetta, a crime drama based on author Patricia Cornwell’s best-selling series of novels about Virginia medical examiner Kay Scarpetta. The series, in the works for more than a year, landed a two-season order at Prime Video; Nicole Kidman will play the title […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "A Timeline of Sean “Diddy” Combs’ Recent Legal Troubles, From Cassie’s Lawsuit to His Arrest",
        "description": "While Sean “Diddy” Combs became a definitive figure in hip hop — as his career spread from music to fashion, spirits and more, climbing to the top echelons of these industries — reports over the past year have made clear that rumors of his conduct behind closed doors persisted for years. The first crack in the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Chelsea Handler, Connie Britton, Andy Cohen Among Artists Urging Biden and Harris to Bring Israeli Hostages Home",
        "description": "Chelsea Handler, Connie Britton, Andy Cohen, Mayim Bialik, Patricia Heaton, Jennifer Jason Leigh, Ali Landry, Rebecca Minkoff, Isaac Mizrahi, Michael Rapaport, Melissa Rivers, Gail Simmons, Amy Smart, Constance Zimmer and Ariel Martin are among 62 performers and artists — from across television, film, fashion, reality TV and social media — urging President Joe Biden and […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "Why Pro-Israel Hollywood Stars Like Debra Messing and Ginnifer Goodwin Turn to Hen Mazzig for Advice",
        "description": "Amid the cacophony of debate surrounding the Israel-Hamas War, it’s grown virtually impossible to avoid the thoughts of Hen Mazzig. As the face of the Israeli cause, one might argue that he’s an unlikely candidate: The 34-year-old influencer is gay (he was out throughout his tour of service in the IDF) and spends his time […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "‘Scandal’ Cast to Reunite for Kamala Harris Reproductive Freedom Bus Tour (Exclusive)",
        "description": "The Gladiators are back. The cast of Scandal is reuniting this weekend in Michigan for the Harris-Walz campaign’s Fighting for Reproductive Freedom Bus Tour. Kerry Washington, Tony Goldwyn, Guillermo Díaz, Bellamy Young, Katie Lowes, Dan Bucatinsky, Scott Foley, Portia de Rossi, George Newbern, Jeff Perry and Cornelius Smith Jr. will join hundreds of supporters and volunteers for […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-20T07:23:24.695407"
    },
    {
        "title": "India’s Physics Wallah raises $210M at $2.8B valuation even as edtech funding remains scarce",
        "description": "An Indian edtech startup has secured $210 million in fresh financing amid a tough funding environment for edtech companies in the country.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "John Mulaney skewers San Francisco tech crowd at Dreamforce",
        "description": "Attendees of the giant, annual Dreamforce conference in San Francisco love being the butt of the joke. Last year, Seth Myers entertained them during a 40-minute set that poked fun…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Indian filmmaker Ram Gopal Varma abandons human musicians for AI-generated music",
        "description": "Indian filmmaker Ram Gopal Varma is ditching human musicians for artificial intelligence, saying he’ll use only AI-generated tunes in future projects, a move that underscores AI’s growing reach in creative…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Here is what’s illegal under California’s 8 (and counting) new AI laws",
        "description": "California Governor Gavin Newsom is currently considering 38 AI-related bills, including the highly contentious SB 1047, which the state’s legislature sent to his desk for final approval. These bills try…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Gaming Lyft’s Citi Bike algos was a lucrative side hustle for a while",
        "description": "A New York Times article Thursday highlighted a lucrative side hustle that is emblematic of the times we live in: gaming algorithms to earn money. In this case, folks figured…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Chipmaker Qualcomm lays off hundreds of workers in San Diego",
        "description": "This is the chipmaker’s second round of layoffs over the past year, while the company recorded billions in revenue.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "SpaceX disputes $633K FAA fine, citing ‘systematic challenges’ with agency",
        "description": "SpaceX sent a letter to top congressional leaders on Wednesday denying allegations that it violated its launch licenses on two separate occasions last year, which has resulted in regulators seeking…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Elon Musk’s reposts of Kamala Harris deepfakes may not fly under new California law",
        "description": "California’s newest law could land social media users who post, or repost, AI deepfakes that deceive voters about upcoming elections in legal trouble. Governor Gavin Newsom suggests that AB 2839,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "MIT develops recyclable 3D-printed glass blocks for construction",
        "description": "The team points to glass’ optical properties and its “infinite recyclability” as reasons for turning to the material.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "FTC report on predatory social media data hoarding hints at future regulations",
        "description": "A new FTC report on how social media and streaming sites collect and monetize their hoards of user data doesn’t really feature a lot of surprises for anyone who’s followed…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "This robotic knee exoskeleton is made from consumer braces and drone motors",
        "description": "Test subjects were required to move a 30-pound kettlebell up and down a flight of stairs.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Apple, Google wallets now support California driver’s licenses",
        "description": "California residents can now store their driver’s license or state ID in their Apple Wallet apps, the state’s government announced on Thursday. California started allowing digital IDs through Google Wallet…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Virtuous, a fundraising CRM for nonprofits, raises $100M from Susquehanna Growth Equity",
        "description": "I recently adopted a kitten from a local animal shelter. The modern, well-staffed three-story facility relies almost entirely on donations to operate. It’s just one of the 1.8 million nonprofits…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "No, the FAA isn’t fining SpaceX because of Elon Musk’s politics, former FAA head says",
        "description": "Elon Musk is suing the FAA over fines he claims are “politically-motivated.” The former head of the FAA disagrees.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Apple Intelligence is now live in public beta. Here’s what it offers and how to enable it.",
        "description": "Starting Thursday, those who are enrolled in Apple’s public beta program will be able to experience the generative AI-fueled platform the company has been talking up since June.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "A leadership shake-up at Motional, inside the fight over TuSimple’s cash, and Fisker waffles on recall repairs",
        "description": "This week’s Mobility newsletter looks at a leadership shakeup at Motional, and we go inside the fight over TuSimple’s cash and much more.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Cruise robotaxis return to the Bay Area nearly one year after pedestrian crash",
        "description": "The company said Thursday that it will put “several” vehicles driven by humans in the two cities that will initially perform mapping.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "For $5, Photon Library brings back the feel of the old iOS Photos app",
        "description": "The company said it was inspired to create an alternative Photos app after seeing how frustrated iOS 18 early adopters were with Apple’s new design.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Apple’s new macOS Sequoia update is breaking some cybersecurity tools",
        "description": "On Monday, Apple released its latest computer operating system update called macOS 15, or Sequoia. And, somehow, the software update has broken the functionality of several security tools made by…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Google rolls out automatic passkey syncing via Password Manager",
        "description": "Passkeys, the digital credentials that let you sign into apps and websites without entering a password, are getting easier to use for Chrome users. You can now save passkeys to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-20T07:23:24.940738"
    },
    {
        "title": "Prickly NBL coach’s rude responses to female reporter",
        "description": "He is a legend in Tasmania but JackJumpers coach Scott Roth did not win any fans with his responses to respected NBL reporter Jo Healy.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘He’s a legend’: Superstar’s long road to major milestone",
        "description": "Few of the Sydney Roosters big signings in recent years have had as big an impact as James Tedesco who will bring up a major milestone against Manly.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Brisbane ‘brotherhood’ behind finals surge",
        "description": "Brisbane Lions players could have given up after losing five of their first seven games in 2024 but something special has them a win away from another AFL grand final",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Socceroos set for swift coach replacement",
        "description": "Graham Arnold’s decision to quit as coach of the Socceroos seemingly came from nowhere but his bosses were ready and have been looking at replacements.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Brisbane ‘brotherhood’ behind finals surge",
        "description": "Brisbane Lions players could have given up after losing five of their first seven games in 2024 but something special has them a win away from another AFL grand final",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘Complete disaster’: Cornes goes nuclear",
        "description": "Kane Cornes has delivered both barrels to one AFL club as he pointed out the horror list-management decision they’ve made.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘He’s a legend’: Superstar’s long road to major milestone",
        "description": "Few of the Sydney Roosters big signings in recent years have had as big an impact as James Tedesco who will bring up a major milestone against Manly.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Rugby league romance faces awkward test",
        "description": "One Roosters NRLW superstar faces an awkward choice on Saturday deciding if she’ll barrack for her club or her partner who plays for Manly. .",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Star under watch after scary collision",
        "description": "Australian players may want to re-think their warm-up games after a massive collision between two star teammates in Mackay sent shudders through the camp.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Records tumble as Travis Head explodes",
        "description": "Travis Head smashed 154 not out against England to extend Australia’s ODI winning streak to 13 – the second longest in cricket history.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Tennis star who fled country breaks silence",
        "description": "A former Italian tennis star has spoken out as ugly allegations over why she and her family fled the country continue to emerge.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘No shame’: Dokic shares powerful message",
        "description": "Former tennis champion Jelena Dokic has declared she feels “no shame” over how she looked before her recent weight loss.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Jets, Bono and the world’s most exclusive club: Inside Piastri’s world",
        "description": "It is the most exclusive club in sport. And, for Australian star Oscar Piastri, it’s opened the door to a whole new world – one of private jets, five-star hotels and the most famous neighbours in the world.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Piastri reveals crazy perks of being an F1 star",
        "description": "Oscar Piastri is living a life no other 23-year-old Aussie could ever imagine. And the rising star has now revealed the crazy perks that come with it.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Aussie tennis champ, model girlfriend split",
        "description": "Aussie tennis star Thanasi Kokkinakis’ has seemingly ended his 18-month relationship with his glamorous model girlfriend.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Disabled boy banned from sport over rule",
        "description": "A 12-year-old boy from Sydney with a disability has been banned from participating in his favourite hobby due to a  “heartbreaking” rule change.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Upsets, injuries, low scores: behind the NFL’s new era",
        "description": "Scoring is down, injuries are wreaking havoc and underdogs are pulling off more surprises than ever: what can we expect in Week 3?",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "NBA icon Shaq in X-rated photo storm",
        "description": "Shaquille O’Neal has responded to suggestions he is the secret boyfriend pictured in an X-rated photo shared by an Instagram influencer.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Socceroos set for swift coach replacement",
        "description": "Graham Arnold’s decision to quit as coach of the Socceroos seemingly came from nowhere but his bosses were ready and have been looking at replacements.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘Out of gas’: Socceroos speak out as Arnie quits in WC shock",
        "description": "Australia is on the hunt for a new coach – and already has several names in mind – after longtime mentor Graham Arnold quit in the midst of a dismal start to their World Cup qualification.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘Banned’: Fears arise over boxing bout",
        "description": "An ex-boxing world champ has detailed his dire fears for the sport as he called for Jake Paul’s fight with Mike Tyson to be called off.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Major PGA boost for LIV stars",
        "description": "There’s only one major LIV players don’t have full access to after a big move in the US.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "New to SuperCoach NBL? Pick this team",
        "description": "Need a SuperCoach NBL team in a hurry? We ran the numbers on six expert teams to deliver the ultimate starting line-up.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "PM’s message rams home record breaker’s feat",
        "description": "The two most important men in Australia were among those sending messages of congratulations to a Wallabies record breaker giving extra Bledisloe Cup motivation.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Huge update for commuters this weekend",
        "description": "A transport union has pulled back its threat to strike in Sydney this weekend.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "Options aplenty for Bieg’s talented Brute",
        "description": "Chris Bieg has already fielded Hong Kong offers for promising youngster Big Brute and a Group 1 tilt will be on the trainer’s radar if the gelding can again impress at Morphettville on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-20T07:23:26.067447"
    }
]