[
    {
        "title": "X braced for Brazil ban as judge's deadline passes",
        "description": "The social media giant says it refused to comply with a judge's order to appoint a legal representative.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Will sustainable aviation fuels take off?",
        "description": "Sustainable aviation fuels work, but can they be made in sufficient quantity to replace fossil fuels?",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Grand Canyon National Park hotels to close after water pipe failure",
        "description": "The park was forced to cancel overnight hotel stays ahead of a busy long weekend due to an ageing water pipeline.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Could 'super potatoes' save Scotland's tattie industry?",
        "description": "A major scientific breakthrough could halt a devastating pest and save the Scottish potato industry from collapse.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "India approves $8.5bn Reliance-Disney entertainment mega-merger",
        "description": "The venture will form India's biggest entertainment player, competing with Sony, Netflix, and Amazon.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Will sustainable aviation fuels take off?",
        "description": "Sustainable aviation fuels work, but can they be made in sufficient quantity to replace fossil fuels?",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "UK workers could get right to four-day week",
        "description": "Labour is said to be considering giving people more power to choose flexible working hours.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Trump says insurance or government should pay for IVF",
        "description": "The campaign pledge comes after Democrats have hammered his administration's effect on abortion and reproductive rights.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Mining boss opposes staff leaving office for coffee",
        "description": "Managing director of Mineral Resources Chris Ellison wants to \"hold staff captive all day long\".",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Grand Canyon National Park hotels to close after water pipe failure",
        "description": "The park was forced to cancel overnight hotel stays ahead of a busy long weekend due to an ageing water pipeline.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "From celebs and CEOS to sport stars and tech titans, find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire?Listen to season two. New episodes out on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "AI chip giant Nvidia shares fall despite record sales",
        "description": "The California-based technology giant has been one of the biggest beneficiaries of the AI boom.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Boss arrested over deadly fire at S Korea battery plant",
        "description": "The arrest of Aricell's chief executive follows an investigation that found multiple safety failings.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Star Wars Outlaws maker defends glitches in 'complex' game",
        "description": "Creative director Julian Gerighty feels the early bugs are partly a product of their ambition for the game.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Hotel chain denies reselling rooms booked by Oasis fans",
        "description": "A Manchester hotel chain faces claims it scrapped pre-made bookings to cash in on the band's reunion.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Telegram boss banned from leaving France in criminal probe",
        "description": "He has been placed under formal investigation as part of a probe into organised crime on the messaging app, French prosecutors say.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Are AI-created recipes hard to swallow?",
        "description": "Chefs are increasingly using AI to dream up new food combinations, but the results are mixed.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "'We were fined £50 each over £3 extra train fare'",
        "description": "The transport watchdog says ticket inspectors need to treat fare dodgers differently from people who make genuine mistakes.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "£1bn spent housing homeless families in England",
        "description": "Councils spent more 50% more in the past year on housing families in temporary accommodation.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Weekend strikes by LNER train drivers called off",
        "description": "Some 450 train drivers had been due to walk out this weekend before the dispute was resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Fuel duty cut could be scrapped, says RAC",
        "description": "The motoring group claims retailers not drivers have benefitted from lower tax on petrol and diesel.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "UK government will not fight Rosebank oil field legal challenge",
        "description": "Greenpeace and Uplift brought judicial reviews to stop the development of the Rosebank and Jackdaw fields.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Help with energy bills urged for struggling pensioners",
        "description": "The Citizens' Advice warning comes as energy firms meet the government for talks on help with bills.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Why is Thames Water in so much trouble?",
        "description": "There are fears that the UK's biggest water firm is close to collapse but how did it come to this?",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "UK water firms to say bill cap plan is 'material risk'",
        "description": "The boss of Water UK says the UK's system is old and that bill rises proposed should be higher.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "Gruffalo's Child to go on limited edition 50p coin",
        "description": "The main character of the sequel sharing her name will appear on several versions of the coin.",
        "source": "BBC Business",
        "fetched_date": "2024-08-30T07:21:26.362167"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Friends fur-ever: The dog and the binmen",
        "description": "Videos of Maddie's special relationship with her weekly visitors have gone viral online.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Meet the dog brightening up a weekly bin round",
        "description": "Some dogs don't like people in uniforms or high-vis jackets, but Maddie loves them.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Canalside 'contaminated dumping ground' concern",
        "description": "Campaigners are worried that waste from a building site is contaminating the Hereford canal",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Berkshire's Big Picture: Friday's image of the county",
        "description": "Showcasing the best images sent to us from around Berkshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Dorset's Big Picture: Friday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Oxfordshire's Big Picture: Friday's image of the county",
        "description": "Showcasing the best images sent to us from around Oxfordshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Hampshire & Isle of Wight: Friday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Ex-police officers turn to crafts at repair shop",
        "description": "Ryedale Remakes in Malton offers an upcycling service and runs workshops for community groups.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "Animal rescue centre closes six months after zoo",
        "description": "Cookham Rescue Centre said it was unable to keep paying rent at its site on Lower Mount Farm.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-30T07:21:26.428962"
    },
    {
        "title": "NCT’s Jaehyun on Making His Solo Album “Feel Classic,” Excitement Over Singing A Babyface Track",
        "description": "Editor’s Note: Yesterday, SM Entertainment announced in a social media post that NCT member Taeil had departed from the group after learning he was “accused in a criminal case related to a sexual crime.” Jaehyun was interviewed before this news broke. “Jump in if you feel it,” Jaehyun jokes to The Hollywood Reporter to kick […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Christina Aguilera on Why It’s “Corny” When Celebrities “Do Things Intentionally” to Stay Relevant",
        "description": "Christina Aguilera is “really proud” of the “risks and chances” she’s taken throughout her 25-year career in the music industry, no matter how they may be received by the public. In a recent interview with Paper magazine, the pop icon opened up about the thoughtful decisions behind each of her projects over the years, noting […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Planned Terrorist Attack at Taylor Swift Concert Was Intended to Kill “Tens of Thousands of People,” CIA Official Says",
        "description": "The thwarted terrorist attack on a Taylor Swift Eras Tour concert in Vienna was intended “to kill a huge number, tens of thousands of people,” including Americans, according to the deputy director of the CIA. At the annual Intelligence Summit just outside Washington, D.C., on Wednesday, David S. Cohen shared an update on the investigation […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Italy’s Minister of Culture Vows to Support the Film Industry",
        "description": "Italy’s Minister of Culture claims that he has been “passionate” about cinema his whole life.  Gennaro Sangiuliano, a former Rai executive who was appointed culture minister by right-wing Premier Giorgia Meloni in 2022, said he plans to keep investing heavily in grants to the Venice Film Festival, and through a generous program of tax credits […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Rapper Lil Baby Released on Bond After Arrest on Suspicion of Carrying a Concealed Weapon in Las Vegas",
        "description": "Rapper Lil Baby has reportedly been released from custody on bond in Las Vegas after he was arrested on Monday morning for carrying a concealed weapon without a permit. The 29-year-old Atlanta-born rapper, whose legal name is Dominique Armani Jones, was taken into custody on a suspicion of carrying a concealed weapon charge while on […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Armie Hammer Says He’s Selling His Truck Because He “Can’t Afford” the Gas Anymore",
        "description": "Armie Hammer is trading in his beloved truck for a “tiny” hybrid as he returns to Los Angeles to start a “new life.” The actor took to social media to share a video from a California CarMax, in which he shared he’s been back in Los Angeles for a couple of weeks, after retreating to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Venice Jury President Isabelle Huppert Voices Concern for “Very Weak” State of Film Industry",
        "description": "French screen icon Isabelle Huppert, president of the 81st Venice Film Festival’s main competition jury, took the stage Wednesday afternoon to share her thoughts on how she will approach her role as the event’s de facto artistic judge-in-chief. The gathering was marked by a triumphant tone from Venice artistic director Alberto Barbera, who sat by […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Ex-Soccer Star David Beckham to Speak at Royal Television Society’s London Convention",
        "description": "Former soccer star David Beckham has joined the lineup of industry leaders speaking at the Royal Television Society’s (RTS) London Convention this year. On Sept. 17, Beckham will be joined in conversation by Jane Featherstone, co-founder and chief creative officer of content company Sister. The ex-sportsman, who is married to Spice Girl Victoria Beckham, captured […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "LACMA Names Baz Luhrmann, Simone Leigh as Art+Film Gala Honorees",
        "description": "Honorees for this year’s edition of LACMA’s Art+Film Gala have been revealed. Multi-disciplinary artist Simone Leigh and Oscar-nominated filmmaker Baz Lurhmann will be honored at the 13th annual gala, held on Saturday, Nov. 2. The night will also feature a performance by musical guest Charli XCX, following her recent album Brat becoming one of the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Joe Jonas Says He’s “Not Trying to Come for Anyone” With New Album Following Sophie Turner Split",
        "description": "Joe Jonas isn’t looking to stir up any online drama with his upcoming album Music for People Who Believe in Love. The singer told Billboard during a recent interview that he’s “not trying to come for anyone on” his second solo album, which comes more than a decade after his debut solo album, 2011’s Fastlife. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "‘Star Trek’ Screenwriter Roberto Orci Accused of Beating, Sexually Assaulting Wife in Lawsuit",
        "description": "Roberto Orci, a screenwriter for several Star Trek and Transformers films as well as Hawaii Five-0, has been accused of beating and sexually assaulting his wife, actress Adele Heather Taylor. In a countersuit filed Monday, Taylor claims she has been the “target of [Orci’s] violent conduct” on multiple occasions dating back to March 2018. She […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Lil Rod, Producer Suing Diddy for $30M, Speaks Out in Interview: “He’s a Monster”",
        "description": "As a motion to dismiss Rodney “Lil Rod” Jones’ bombshell lawsuit against rap and fashion mogul Sean “Diddy” Combs has resurfaced the case in the courts and media, the upstart producer accusing the powerful industry player of grooming and exposing him to several crimes spoke out in an interview as he remains in hiding. Lil […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-30T07:21:26.860996"
    },
    {
        "title": "Google is working on AI that can hear signs of sickness",
        "description": "Given everything you’ve already heard about AI, you may not be surprised to learn that Google is among other outfits beginning to use sound signals to predict early signs of…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Apple and Nvidia could be OpenAI’s next big investors",
        "description": "Nvidia and Apple are reportedly in talks to contribute to OpenAI’s next fundraising round — a round that could value the ChatGPT maker at $100 billion. Per its sources, the…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "India’s Agrim snags $17.3M to help farmers get inputs like seeds and pesticides more easily",
        "description": "Agrim has raised $17.3 million to expand its B2B agri-inputs platform to more manufacturers and retailers in India.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Intuitive Machines wins $116.9M contract for a moon mission in 2027",
        "description": "Intuitive Machines, the venture-backed startup that went public last year, will send a moon lander to the lunar south pole in 2027 as part of a $116.9 million contract awarded…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "South Korean tech giant Naver launches crypto wallet in partnership with Chiliz",
        "description": "Many tech companies are expanding their reach into the web3 market, integrating blockchain and web3 technologies into their products and services. In the latest development, South Korean internet giant Naver…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Are Google’s monopoly cases 5 years too late or 2 years too early?",
        "description": "Google suffered a major defeat when U.S. District Court Judge Amit Mehta found that the tech giant had acted illegally to maintain its monopoly in…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Atlassian acquires Rewatch as it gets into AI meeting bots",
        "description": "Atlassian plans to integrate Rewatch into its recently launched Rovo AI platform so that transcripts become searchable within the overall business context.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Sub.club aims to fund the fediverse via premium feeds",
        "description": "Sub.club thinks premium feeds could also serve other use cases, like supporting helpful bots or generating funds to help maintain a community’s Mastodon server, for instance.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Gmail users on Android can now chat with Gemini about their emails",
        "description": "Gmail users on Android devices can now chat directly with Google’s AI assistant, Gemini, about their emails in the Gmail app. Google rolled out the new feature, Gmail Q&A, on…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Tesla keeps putting its digital history in the memory hole",
        "description": "It seems that the Ministry of Truth has been busy at Tesla. Some sharp-eyed folks, including reporters at Electrek, noticed that Tesla has deleted all of its blog posts prior…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Spotify points finger at Apple over an unwelcome change to volume control technology",
        "description": "When streaming to connected devices via Spotify Connect on iOS, users were previously able to use the physical buttons on their iPhone to adjust the volume. But this will no…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Generative AI coding startup Magic lands $320M investment from Eric Schmidt, Atlassian and others",
        "description": "Magic, an AI startup creating models to generate code and automate a range of software development tasks, has raised a large tranche of cash from investors, including ex-Google CEO Eric…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Uber cozies up to more AV companies, Canoo loses another founder and Waymo sees potential in teen riders",
        "description": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! The EV…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Apple Sports gets updated ahead of football season with Live Activities, play-by-play and more",
        "description": "Ahead of the NFL and college football (NCAAF) seasons, Apple announced updates for its sports-focused app, including Live Activities for all leagues, a new “dynamic drive tracker” that visualizes where…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "After winning a landmark case against real estate agents, this startup aims to replace them with a flat fee",
        "description": "One of the people who successfully sued the National Association of Realtors (NAR) to change real estate commissions has co-founded a new real estate startup. It all began in 2017…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "X caught blocking links to NPR, claiming the news site may be ‘unsafe’",
        "description": "X, the Elon Musk-owned platform formerly known as Twitter, is marking some links to news organization NPR’s website as “unsafe” when users click through to read the latest story about…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Apple event 2024: How to watch the iPhone 16 launch",
        "description": "Apple is likely to unveil its iPhone 16 series of phones and maybe even some Apple Watches at its Glowtime event on September 9.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "TechCrunch Minute: Here’s why AI has a hard time spelling ‘strawberry’",
        "description": "Is AI going to take my job one day? I hope not. But in the meantime, I can do something that ChatGPT can’t: I can…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "GitHub Copilot competitor Codeium raises $150M at a $1.25B valuation",
        "description": "Codeium, a startup developing an AI-powered tool to rival GitHub Copilot, has raised $150 million at a $1.25 billion valuation.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Flying through Seattle’s hacked airport",
        "description": "Seattle’s Airport is still largely offline, causing chaos among travelers and acting as a standing warning against taking cybersecurity lightly.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-30T07:21:27.063008"
    },
    {
        "title": "Socceroo banned for slur",
        "description": "A Socceroo’s start to his career in the MLS hasn’t gone to plan after he was suspended after being ruled to have violated the competition’s anti-discrimination policy.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Demon gun gets up Round 1",
        "description": "Melbourne will delay a major positional move but says Tayla Harris is fit and firing after an eyebrow-raising overseas trip.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Unique’: AFL’s bold rescheduling move",
        "description": "Fans who bought $15 tickets for a Whitten Oval game have come into a surprise windfall after a major AFLW schedule change.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Tennis rocked by unthinkable US Open scene",
        "description": "Carlos Alcaraz has crashed out of the US Open in stunning fashion, going down in straight sets to unseeded Botic van de Zandschulp.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Demon gun gets up Round 1",
        "description": "Melbourne will delay a major positional move but says Tayla Harris is fit and firing after an eyebrow-raising overseas trip.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Unique’: AFL’s bold rescheduling move",
        "description": "Fans who bought $15 tickets for a Whitten Oval game have come into a surprise windfall after a major AFLW schedule change.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "NRL Live: Will Bulldogs seize the day against Sea Eagles?",
        "description": "The Bulldogs are pushing for a top four finish while the Sea Eagles need to build momentum for their own finals charge. Follow all the action from the big clash between the two here.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Epic finish to Dally M race predicted",
        "description": "This year’s Dally M race could come down to the final round, with two superstars of the game locked in an epic battle.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Aussie one-Test prodigy ‘forced to retire’ at 26",
        "description": "Luckless one-Test Australian cricketer Will Pucovski will forever be one of the sport’s biggest what ifs after a heartbreaking decision.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Maxi’s main obstacle to Test comeback",
        "description": "Australian all-rounder Glenn Maxwell has opened up on what he needs to show selectors to once again wear the Baggy Green.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Tennis rocked by unthinkable US Open scene",
        "description": "Carlos Alcaraz has crashed out of the US Open in stunning fashion, going down in straight sets to unseeded Botic van de Zandschulp.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Don’t want to play’: Star left seething",
        "description": "A veteran tennis star was left seeing red at the US Open as he took aim at the chair umpire in a lengthy and fiery outburst.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Star’s message pours fuel all over F1 feud",
        "description": "A Formula 1 star has poured fuel all over his ongoing feud with a rival as their championship battle looks set to go down to the wire.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Damning admission as F1 blown wide open",
        "description": "Red Bull’s run of dominance in F1 is crumbling around them as the team boss made a startling admission over one of their rivals.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Influencers go to war in heated feud",
        "description": "Two sporting social media influencers are engaged in an ugly online spat after one called out the other for stealing her content.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Should be cancelled’: Star’s shock admission",
        "description": "Former UFC and WWE star Ronda Rousey has delivered a stunning admission after sharing a conspiracy theory video online.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Former AFL rookie wins NFL spot",
        "description": "There was a guarantee an Australian would be punting for the New Orleans Saints this NFL season and it was a former AFL draftee who took the spot.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "NBA legend fires up over star’s remarks",
        "description": "Magic Johnson had the perfect response to silence Anthony Edwards after the young star’s shot at 90s NBA players.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Socceroo banned for slur",
        "description": "A Socceroo’s start to his career in the MLS hasn’t gone to plan after he was suspended after being ruled to have violated the competition’s anti-discrimination policy.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Surprise to me’: Socceroos squad revealed as teenage sensation named despite injury scare",
        "description": "Nestory Irankunda is among a host of wingers selected in the Socceroos squad for matches against Bahrain and Indonesia.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Life ban’: Huge twist in ugly Zerafa drama",
        "description": "The brother of Michael Zerafa has been banned for life after the ugly scenes on Wednesday night but Team Zerafa has hit back.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Where Aussie fans can see Cameron Smith play",
        "description": "Australian golf fans are set to have more chances to see Cam Smith in action this summer.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Step-by-step guide to picking a gun SuperCoach NBL team",
        "description": "Playing SuperCoach NBL for the first time or need a quick refresher? You’ve come to the right place. See where to start, and the players you need to piece together a winning side.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Another new captain, 15th debutant for Wallabies",
        "description": "After two thrashings by South Africa, Wallabies coach Joe Schmidt has made another five changes as his team seeks redemption in Argentina.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "‘Hurting us’: Wallabies’ ‘narrow’ focus",
        "description": "The Wallabies are still adjusting to the style of rugby coach Joe Schmidt wants them to play.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Rosehill Inside Mail: Bjorn’s bolter ‘better than ever’",
        "description": "Amor Victorious is Ray Thomas’ best bet of the day … but trainer Bjorn Baker has warned punters not to discount another runner who’s currently priced at a juicy $16 at Rosehill on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-08-30T07:21:28.641539"
    }
]