[
    {
        "title": "Cuba suffers nationwide blackout after main power plant fails",
        "description": "Millions of people are left without power on the Caribbean island, paralysing an already struggling economy.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "US probing Elon Musk's Tesla over self-driving systems",
        "description": "The National Highway Traffic Safety Administration's evaluation is the first step toward a potential recall of 2.4 million Tesla vehicles",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Tobacco firms to pay $23.6bn in proposed Canada settlement",
        "description": "The deal includes up to C$100,000 in compensation for some smokers and would resolve a decades-long legal fight with cigarette-makers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Boohoo considers break-up as sales slide",
        "description": "The online fashion firm is mulling whether to offload its brands as sales remain under pressure.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "China's economic slowdown deepens",
        "description": "Gross domestic product rose by 4.6% on a yearly basis, below Beijing's \"around 5%\" annual target.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "US probing Elon Musk's Tesla over self-driving systems",
        "description": "The National Highway Traffic Safety Administration's evaluation is the first step toward a potential recall of 2.4 million Tesla vehicles",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Meet the TikTokers buying up Japan’s empty homes",
        "description": "Content creators are going viral for renovating abandoned Japanese homes for low prices - but is all as it seems?",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "More than 100 customers contact BBC about scams, saying Revolut failed them",
        "description": "People say they have been poorly treated by the firm after being tricked out of cash while using app.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "What to know about London Stansted Airport's £1bn expansion",
        "description": "It is set to become the UK's second-busiest airport, behind Heathrow.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Tobacco firms to pay $23.6bn in proposed Canada settlement",
        "description": "The deal includes up to C$100,000 in compensation for some smokers and would resolve a decades-long legal fight with cigarette-makers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Pound falls as UK inflation declines - 16 Oct 2024",
        "description": "The British currency fell greater than expected and came up against a very strong dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "What could happen if Donald Trump drastically increases tariffs as he has promised to do?",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "How the India-Canada fallout could affect trade and immigration",
        "description": "The stakes for both countries are high as the rift over allegations that India ran a campaign to intimidate Sikh separatists in Canada deepens.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Netflix raises prices as password boost fades",
        "description": "The streaming giant will charge subscribers more in some countries to fuel growth.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Meta fires staff for buying toothpaste, not lunch",
        "description": "Meta workers reportedly used vouchers that should have been spent on meals to buy household goods.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Inheritance tax increases expected in UK Budget",
        "description": "It is not known how many people are likely to end up paying more under the government's plan.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Copy of US Constitution found in filing cabinet sells for $9m",
        "description": "Believed to be the only privately held copy of the charter in existence, it was discovered in a North Carolina home.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "UK Treasury hints it will spend billions on infrastructure",
        "description": "Government claims the move contrasts with former PM Liz Truss's controversial mini-Budget.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Planners reject plans for M5 services solar panels",
        "description": "Solar panels have been banned from Exeter's M5 Services' roof because they could dazzle drivers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Who has to pay inheritance tax?",
        "description": "Inheritance tax is again creating political debate so how does it work and who pays?",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Fraudsters steal more than £3m a day as cases rise",
        "description": "Fraud cases rise by 16% in the first half of the year, but total losses are down slightly, new data shows.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Ministers complain to Starmer over spending cuts",
        "description": "Some Cabinet members are alarmed at the scale of cuts being sought to plug a rumoured £40bn gap.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "US 'click to cancel' rule to ban subscription traps",
        "description": "New rule requires businesses to make subscribing and cancelling subscriptions equally simple.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as WhatsApp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Inquiry announced after carers forced to repay benefits",
        "description": "Some carers had to pay back thousands of pounds to the government, pushing them into financial distress.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Surprise fall in UK inflation paves way for interest rate cuts",
        "description": "The drop to 1.7% paves the way for the Bank of England to cut interest rates again next month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-19T07:23:07.445396"
    },
    {
        "title": "Donald Trump Says He’ll Ask Rupert Murdoch to Direct Fox News to Halt Negative Ads Against Him",
        "description": "The former president and White House hopeful also referred to himself as \"the most stable human being\" in a lengthy appearance on 'Fox & Friends,' where he got the seat on the curvy couch.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Kamala Harris Campaign Targets Taylor Swift Concertgoers in Snapchat Push",
        "description": "Swifties in Miami for the next Eras Tour stop will see ads and filters promoting their \"Kamala era.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Niall Horan Rounds Out One Direction Tributes to Liam Payne: “The Bond We Had Doesn’t Happen Often in a Lifetime”",
        "description": "The Irishman wrote on his Instagram on Friday after Payne, who died from a hotel balcony fall in Buenos Aires Wednesday night, had attended Horan's concert in South America just two weeks ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Former NBC Exec Regrets Helping Market ‘The Apprentice’ in Op-Ed: “We Created a Monster”",
        "description": "\"I want to apologize to America,\" John D. Miller wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Molly Shannon’s Mary Katherine Gallagher Interrupts Kamala Harris’ Virtual Speech at Al Smith Charity Dinner",
        "description": "\"I just want to say that I'm Catholic and tonight is one of the biggest dinners next to the Last Supper,\" Gallagher tells the vice president.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "One Direction Speaks Out on Liam Payne’s Death: “The Memories We Shared With Him Will Be Treasured Forever”",
        "description": "Harry Styles, Niall Horan, Louis Tomlinson and Zayn Malik released a joint statement to address the tragic passing of their former bandmate: \"In time, and when everyone is able to, there will be more to say. But for now, we will take some time to grieve and process the loss of our brother, who we loved dearly.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Liam Payne Died of Trauma, Internal and External Bleeding, Autopsy Shows",
        "description": "Substances believed to be narcotics were found in the room of the former One Direction band member, who plummeted to his death from the balcony of a hotel room in Buenos Aires on Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Amazon Reveals Brian Williams Election Night Special in Big News Experiment",
        "description": "'Election Night Live with Brian Williams' will be produced and directed by live event veteran Glenn Weiss.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "“We Are Heartbroken”: Liam Payne’s Family Mourns “Funny, Brave Soul” Following His Death at 31",
        "description": "\"Liam will forever live in our hearts and we'll remember him for his kind, funny and brave soul,\" said a family statement, released Thursday, after the One Direction star fell from a hotel balcony in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Backstreet Boys, Steve Aoki, Rita Ora, Charlie Puth Among Those Paying Tribute to Liam Payne: “He Had the Kindest Soul”",
        "description": "The former One Director member died Wednesday after falling from a hotel balcony in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Nicole Maines on Her New Memoir and the Trouble With Social Media: “It Sucks That We Can’t Have Nuanced Conversations”",
        "description": "The 'Supergirl' and 'Yellowjackets' actress is opening up about her new book, 'It Gets Better...Except When It Gets Worse: And Other Unsolicited Truths I Wish Someone Had Told Me.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "At an L.A. Courthouse, Menendez Brothers’ Netflix Series Spurs Rallying Cry",
        "description": "Amid intense interest in a docuseries and documentary about Lyle and Erik Menendez, their extended family called for the Los Angeles District Attorney to help in resentencing the brothers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-19T07:23:08.412709"
    },
    {
        "title": "Auckland silence Roar in dream debut",
        "description": "A-League life has started on a winning note for expansion outfit Auckland FC.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Late drama rocks Randwick’s $20m Everest",
        "description": "Super mare Bella Nipotina has taken out the $20 million Everest at Randwick racecourse, but not before late drama in Sydney.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Cricket legend’s daughter stuns at Everest",
        "description": "The daughter of an Aussie cricketing legend made a rare public appearance in Sydney with her boyfriend, cotton heir Wilson Statham.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Eddie McGuire ‘in awe’ of lookalike son",
        "description": "Joe McGuire is taking massive steps to emerge from his famous dad’s imposing shadow in the cutthroat US college football system.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Eddie McGuire ‘in awe’ of lookalike son",
        "description": "Joe McGuire is taking massive steps to emerge from his famous dad’s imposing shadow in the cutthroat US college football system.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "‘Drop out of existence’: AFL icon’s collapse",
        "description": "AFL legend Kevin Sheedy has opened up about the mystery health scare he suffered earlier this year that prompted him to reassess his mortality.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Broncos star tests positive after car crash",
        "description": "The NRL is investigating after Brisbane Broncos star Ezra Mam was hospitalised following a car crash in Brisbane on Friday.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Records tumble in historic Aussie drubbing",
        "description": "The Jillaroos have made a major statement in the opening game of the Pacific Championships by thrashing the PNG Orchids in a record scoreline.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Cricket world erupts over mega England fail",
        "description": "England captain Ben Stokes was stumped as his bat flew through the air to sum up a horrible Test match effort against Pakistan.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "‘Bit different’: Aussie bowlers watch India implode",
        "description": "Mitchell Starc and Scott Boland have weighed in after India was routed for 46 on the eve of the Border-Gavaskar series.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Demon’s bid to recreate United Cup magic",
        "description": "Alex de Minaur will lead Australia’s team in a star-studded Australian Open warm-up event that includes seven of the women’s world top 10.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Kyrgios reveals only motivation for comeback",
        "description": "Australian tennis star Nick Kyrgios has revealed when he will be returning to the court this summer in news that will delight tennis fans.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "How rabbit, seagull, mishaps hurt Miller’s Aus MotoGP hopes",
        "description": "Hometown MotoGP hero Jack Miller has revealed he rode the the Australian Sprint race at Phillip Island with a seagull wedged into the front of his KTM machine. That run-in with wildlife came just hours after a high-speed  mishap involving an unlucky rabbit.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Bizarre twist after Bathurst 1000 ‘assault’",
        "description": "A motorsport engineer has been arrested after he allegedly falsely claimed he had been assaulted at the Bathurst 1000  race event.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "WAG ‘files for divorce’ over love child scandal",
        "description": "A wife whose famous sports star husband fathered not one, but two children with another woman, has reportedly taken action.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Banished Olympian cashes in on OnlyFans",
        "description": "An Olympic swimmer who was kicked out of the athlete’s village has announced her next career move following the Paris Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Eddie McGuire ‘in awe’ of lookalike son",
        "description": "Joe McGuire is taking massive steps to emerge from his famous dad’s imposing shadow in the cutthroat US college football system.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Manhunt for fan as viral clip shocks USA",
        "description": "Police have identified and issued an arrest warrant for the NFL fan at the centre of a troubling, viral video that shocked the country.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Auckland silence Roar in dream debut",
        "description": "A-League life has started on a winning note for expansion outfit Auckland FC.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "WAG ‘files for divorce’ over love child scandal",
        "description": "A wife whose famous sports star husband fathered not one, but two children with another woman, has reportedly taken action.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Viva Las Vegas! Tszyu’s shock move to conquer world",
        "description": "Tim Tszyu is leaving Australia. He has sold his $100,000 Chevy and ready to start a new life in America with his fiancee in his bid to scale world boxing’s highest of heights.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "‘The course is mint’: Stunning eagle gives Maxwell WA Open lead",
        "description": "A stunning eagle has put Queensland’s Zachary Maxwell  in a strong position to win his first Challenger PGA Tour of Australasia title at the WA Open at Mandurah Country Club.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Kings heap misery on spluttering JackJumpers",
        "description": "The Sydney Kings moved to the top of the NBL ladder on Friday night with their dramatic come-from-behind win against Tasmania to continue the JackJumpers’ spluttering title defence.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Late drama rocks Randwick’s $20m Everest",
        "description": "Super mare Bella Nipotina has taken out the $20 million Everest at Randwick racecourse, but not before late drama in Sydney.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-19T07:23:10.612757"
    }
]