[
    {
        "title": "US and UK toughen sanctions on Russian oil industry",
        "description": "The actions are aimed at cutting off revenue Moscow is using to fund its war in Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Reeves pledges to 'make UK better off' on China visit",
        "description": "The chancellor has been criticised for making the trip while the UK government is under pressure from rising borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "MPs urge checks as Shein refuses to answer questions",
        "description": "The chair of a committee of MPs has written to the London Stock Exchange with concerns over the fashion retailer.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Fewer rate cuts and higher loan costs - how US jobs surprise affects you",
        "description": "Jobs growth in the US surged unexpected last month. That's good news for the world's largest economy but could be \"punishing\" for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Reeves pledges to 'make UK better off' on China visit",
        "description": "The chancellor has been criticised for making the trip while the UK government is under pressure from rising borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Meta and Amazon axe diversity initiatives joining US corporate rollback",
        "description": "The companies are among the latest major corporations to alter their diversity programmes since Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Boeing and Google each give $1m for Trump inauguration",
        "description": "The US companies join other major firms donating funds for the ceremony on 20 January.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "US top court leans towards TikTok ban over security concerns",
        "description": "The platform with nearly 170 million American users is challenging a law that would see it banned in the US in a matter of days.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "How a viral post saved a Chinese actor from Myanmar's scam centres",
        "description": "Many Chinese are now asking: what about their loved ones still trapped in scam centres?",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "'Trump 2.0' looms large over the global economy",
        "description": "Donald Trump's planned tariffs are expected to greatly impact international trade in 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "US stocks under pressure after jobs report - 10 Jan 2025",
        "description": "The latest healthy US jobs report adds more uncertainty about whether the Fed will cut its key interest rate.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Can young Americans live without TikTok?",
        "description": "The BBC spoke to young people as the Supreme Court discusses a potential ban on the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "LA wildfire damages set to cost record $135bn",
        "description": "Some of the most expensive properties in the US have been wiped out by the fires.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Man told he can't recover £598m of Bitcoin from tip",
        "description": "James Howells tried to sue a council for access to the site or get £495m in compensation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "UK Chancellor heads to China amid market trouble at home",
        "description": "The warning from a former Bank of England official comes in the wake of rising UK borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Price of resale tickets to be capped under UK plans to tackle touts",
        "description": "The UK government is suggesting a cap on the cost of resold tickets, potentially up to 30% on top of the original price.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Ex-UK PM Truss sends legal threat to Starmer over claim she crashed economy",
        "description": "No 10 insists millions of people share Sir Keir's view of the Truss government's economic record.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Pound falls to lowest in over a year as UK borrowing costs soar",
        "description": "Economists have warned the rise could mean further tax hikes or spending cuts by the UK government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "China bets on kitchen appliances to boost economy",
        "description": "A list of subsidised household goods has been expanded as Beijing tries to increase domestic spending.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Lloyds, Halifax and Bank of Scotland to share branches",
        "description": "The move is intended to make it easier for people to access banking services, but some warn it will lead to more branch closures.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "H-1B: Visa row under Trump fuels anxiety for Indian dreamers",
        "description": "Visa woes and an immigration row are sparking uncertainty for Indians who want to work in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Ryanair sues 'unruly' passenger over flight diversion",
        "description": "The airline hopes to claw back costs in damages over behaviour it says forced a plane to land early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "'Huge problems' with Instagram and Facebook changes, says oversight board",
        "description": "The body's co-chair says moving to community notes could have a big impact on gender rights and minority groups.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "People smugglers to have finances targeted with sanctions",
        "description": "The planned measures will target the finances of illegal smuggling networks, the Home Office says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "ChatGPT creator denies sister's childhood rape claim",
        "description": "Ann Altman filed a lawsuit alleging her brother sexually abused her between 1997 and 2006.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Rolls-Royce to build bespoke cars for super-rich",
        "description": "The luxury carmaker will almost double the size of its factory to build more one-offs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-11T07:21:18.850383"
    },
    {
        "title": "Laugh Factory Hollywood Sets Benefit Shows for Los Angeles Fire Foundation",
        "description": "The  iconic comedy club is mounting a benefit fundraiser Stand up for L.A. Heroes on Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "New Kenneth Fire Now 50 Percent Contained as Officials Warn of More Destruction in Coming Days",
        "description": "The Kenneth Fire was threatening houses in the Hidden Hills, home to many celebrities, including Kim Kardashian and Kris Jenner, and was 50 percent contained Friday afternoon.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Paris Hilton Launches Emergency Fund for Displaced Families After Losing Malibu Home in Wildfires",
        "description": "\"As a mom, I can’t imagine the pain and fear of not having a safe place for your babies so I’m launching an emergency fund through my nonprofit 11:11 Media Impact,\" Hilton wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Miles Teller’s Wife Keleigh Shares Last Photo of Home Before It Was Destroyed in Palisades Fire",
        "description": "\"Pacific Palisades I love you beyond measure you are a little slice of heaven, we will come back stronger than ever,\" Keleigh wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Disney to Donate $15M to L.A. Fire Relief Efforts",
        "description": "Studios are mobilizing their own response efforts amid the devastation; Paramount Global commits $1 million to multiple nonprofits.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "FireAid Benefit Concert for California Wildfire Victims Set at Intuit Dome",
        "description": "The fundraising show, set for Jan. 30, will announce its performers in the upcoming days.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Studio Where Nicki Minaj, Doja Cat Recorded Albums Burned Down in Palisades Wildfire",
        "description": "Zach Brandon, founder of Harbor Studios, confirmed the news in an Instagram post on Friday: \"We will come back stronger from this.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "‘Jurassic World’ Franchise Actress Daniella Pineda “Grateful to Be Alive” After Losing Home in L.A. Fires: “I Have 1 Pair of Shoes to My Name”",
        "description": "The actress says all she could save was her laptop and dog.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "L.A. Music Community Galvanizes to Help Victims of Wildfires",
        "description": "A shared spreadsheet circulating among the industry has swelled to over 100 names of people impacted by the fires, including Billie Eilish’s publicist, Foo Fighters guitarist Chris Shiflett and Sting’s son Joe Sumner.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Palisades Fire Destroys Family Home of Sundance Institute’s Michelle Satter, Film Producer David Latt",
        "description": "Satter, a beloved entertainment industry figure with ties to countless writers, filmmakers and producers, shared the news, adding, \"Our heart goes out to everyone who’s experiencing loss during this devastating time in our city.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Altadena Mansion Showcased in ‘Hacks’ Destroyed in Eaton Fire",
        "description": "The house was used as a location in two seasons of the Max comedy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "Jennie Garth Tearfully Thanks Ex Peter Facinelli for Shelter Amid L.A. Fires: “Our Home Was Spared”",
        "description": "The actress brought her husband, Dave Abrams, and daughters she shares with Facinelli to stay at his home.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-11T07:21:19.041858"
    },
    {
        "title": "One question Djokovic refuses to answer",
        "description": "On the eve of his shot at an 11th Australian Open title, Novak Djokovic had no interest in addressing his dramatic Melbourne claim.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Strongman suffers horrific training injury",
        "description": "WATCH: England’s Strongest Man faces a long road to recovery after sustaining a horrendous injury lifting 172kg in training.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Smith brings up 50 as Henriques unleashes for the Sixers",
        "description": "Steve Smith has a half-century in his return to the BBL as the Sydney Sixers look to punish the Perth Scorchers in their crucial clash at the SCG.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Football star’s sex tape arrest at training",
        "description": "Teammates of a Premier League star were left in shock after he was arrested while on the training pitch this week.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Then and now: Every Australian women’s cricket star",
        "description": "This is the photo which sums up the stunning rise of women’s cricket in Australia. We look back on our Ashes stars and their rise from the backyard to the big stage.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Smith brings up 50 as Henriques unleashes for the Sixers",
        "description": "Steve Smith has a half-century in his return to the BBL as the Sydney Sixers look to punish the Perth Scorchers in their crucial clash at the SCG.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "One question Djokovic refuses to answer",
        "description": "On the eve of his shot at an 11th Australian Open title, Novak Djokovic had no interest in addressing his dramatic Melbourne claim.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "World No.1’s doping case set for hearing",
        "description": "World number one Jannik Sinner will front up to the Court of Arbitration to fight doping allegations with a two-year ban looming.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Demon’s worst nightmare comes true",
        "description": "The Demons have announced sad news surrounding Christian Petracca in the last thing Melbourne fans wanted to hear",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Veteran reporter retires after 40-year career",
        "description": "The AFL community has paid tribute to Mark Robinson after the veteran reporter called time on his career after more than four decades.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "NRL trials: First-look at new signings and positional puzzles",
        "description": "The countdown is on for NRL action with trials less than a month away. Find out when and where your team is playing and read every club’s in-depth season preview inside.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Broncos hard man keen for starting spot",
        "description": "Michael Maguire could face a selection headache in round 1 after the man he fought so hard to keep declared he wants to start matches for the Broncos this year.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Strongman suffers horrific training injury",
        "description": "WATCH: England’s Strongest Man faces a long road to recovery after sustaining a horrendous injury lifting 172kg in training.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Steph Rice wedding photo detail dazzles",
        "description": "Aussie swimming star Stephanie Rice has had the wedding she always dreamed of, just 10 months after she started seeing a pastor.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Football star’s sex tape arrest at training",
        "description": "Teammates of a Premier League star were left in shock after he was arrested while on the training pitch this week.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Sam Kerr news blindsides football world",
        "description": "Matildas superstar Sam Kerr has been thrust into the spotlight with fans left blindsided by a rival team’s social media upload.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Aussie boxer’s world title hopes dashed",
        "description": "Aussie boxer Sam Goodman has been left broken hearted after he was forced to withdraw from a world title fight for the second time.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Deng stars as JackJumpers steal miracle OT win against 36ers",
        "description": "Tasmania’s never die attitude has kept the JackJumpers in pole position in the race for the NBL’s top-six with a thrilling win over the Adelaide 36ers.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "‘Mind-blowing’: Aussie golfer turning heads with daring technique",
        "description": "Aussie golfer Jack Poutney is not a household name like Cameron Smith or Adam Scott, but he’s trying something on the course that not even the best players in the world would dare consider.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Flemington double brings joy to ex-footy star after tragic year",
        "description": "Few would begrudge Ex-North Melbourne star and racehorse owner Kerry Good his winning double at Flemington after the loss of his daughter last year.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Sales pitch begins to keep Wallabies coach",
        "description": "Public lauding of Wallabies coach Joe Schmidt will be the players’ way of convincing him to stay rather than private urgings that could put unwanted pressure on him.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Reds star aiming for stellar Super season",
        "description": "Queensland Reds star Tom Lynagh knows his best chance of regaining a Wallabies jersey is to shine for the Queensland Reds this year.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-11T07:21:20.723291"
    }
]