[
    {
        "title": "Trump puts all US government diversity staff on paid leave 'immediately'",
        "description": "A new executive order signed on Tuesday calls for an end to DEI practices in the federal government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "LinkedIn accused of using private messages to train AI",
        "description": "The lawsuit alleges LinkedIn tried to conceal its actions but the firm says the claims are false.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Tesco, Aldi and Lidl hit back at UK farm inheritance tax",
        "description": "Tesco, Aldi and Lidl call for rethink of inheritance levy announced in Budget",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Sun owner to pay Prince Harry 'substantial' damages",
        "description": "News Group Newspapers offers an \"unequivocal apology\" to the Duke of Sussex for \"serious intrusion\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "LinkedIn accused of using private messages to train AI",
        "description": "The lawsuit alleges LinkedIn tried to conceal its actions but the firm says the claims are false.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "EU 'could consider' UK joining pan-Europe customs scheme",
        "description": "The UK joining the Pan-Euro-Mediterranean Convention is up for discussion in reset talks, says Maros Sefcovic.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Canada changes tone in bid to stave off Trump tariffs",
        "description": "It is the latest pitch by Justin Trudeau as his country tries to avoid a trade war with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Does China 'operate' Panama Canal, as Trump says?",
        "description": "The US president says the US should \"take back\" the famous waterway because China runs it now.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Best of 'frenemies': Trump's relationship with Europe this time may be very different",
        "description": "Weak, distracted and unprepared? How ready France, Germany and the rest of Europe really are for Trump's return to power.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Ros Atkins on... Donald Trump's new diversity policies",
        "description": "The president has moved to change the US government's policies on gender and diversity - here's what that means.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Expert optimistic about UK economy - 22 Jan 2025",
        "description": "The Europe boss of JP Morgan, Patrick Thomson, says he's very optimistic about the UK economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Tech giants are putting $500bn into 'Stargate' to build up AI in US",
        "description": "Trump has extolled the project as an important investment, but Elon Musk is throwing shade on it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Netflix to raise prices as new subscribers soar",
        "description": "Squid Game 2 and live sports, including the Jake Paul v Mike Tyson fight, fuelled new memberships.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Reeves optimistic despite surprise rise in UK borrowing",
        "description": "Borrowing - the difference between spending and tax revenue - hit its highest December level for four years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "TikTokers offered $5,000 to join Facebook and Instagram",
        "description": "Meta's attempt to lure creators to its platforms comes as questions remain over the future of its main rival in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Trump considers 10% tariff on China from February",
        "description": "The new president accused Beijing of sending fentanyl to Mexico and Canada which ends up in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Trump pardons Silk Road dark web market creator Ross Ulbricht",
        "description": "Trump said he had called Ulbricht's mother to let her know he had granted her son a full pardon.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Ukraine's chief army psychiatrist arrested on $1m corruption charge",
        "description": "The man owned several properties as well as four BMW luxury cars, the Ukrainian security service said.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "China calls for 'win-win' solution to trade tensions",
        "description": "With the threat of a trade war looming, China's first vice premier says the country wants to boost imports.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "US markets rise as Trump holds off on tariffs",
        "description": "The US president stopped short of widespread import taxes but threatened Canada and Mexico with tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Delay to TikTok ban gets Trump sign-off",
        "description": "The order was among a slew of directives Trump signed on Monday evening.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Musk responds to backlash over gesture at Trump rally",
        "description": "The billionaire says his critics \"need better dirty tricks\" after a gesture likened to a Nazi salute.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Instagram hides search results for 'Democrats'",
        "description": "Meta says it is working quickly to resolve the problem, which has prompted accusations of bias on social media.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Canada avoids Trump's tariffs - for now",
        "description": "President Donald Trump stopped short of imposing tariffs on Canada on day one but said they may come as soon as 1 February.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "UK pay after inflation rises at fastest rate since 2021",
        "description": "Wage growth increased by 3.4% after taking into account inflation, driven by strong increases in the private sector.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Trump makes 'two sexes' official and scraps DEI policies",
        "description": "The president has vowed to use his post to fight elements of what conservatives have decried as \"woke\" culture.",
        "source": "BBC Business",
        "fetched_date": "2025-01-23T07:23:41.741713"
    },
    {
        "title": "Arnold Schwarzenegger Announces $1M Donation to Los Angeles Fire Relief",
        "description": "\"I don’t like when companies or rich people ask their fans to make their donations for them,\" the actor wrote on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Simu Liu Calls Trump’s Proposed Tax Plan Benefitting High-Income Earners “Really Shitty”",
        "description": "After realizing he would likely get a tax cut under the president's proposal, he said, \"I believe I should pay taxes, and I actually believe that people like me should probably pay more taxes.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Saving the Sword: An L.A. Fire Victim’s Quixotic Quest",
        "description": "After losing his home in the Eaton Fire, one Altadena-based entertainment worker searches through fire-ravaged rubble in the hopes of finding a family heirloom his grandfather brought back from World War II.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Apple Music Taps Industry Veteran Mika El-Baz to Lead PR (Exclusive)",
        "description": "The Los Angeles-based executive arrives from gamma, prior to which she spent 17 years at RCA Records.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Nine Inch Nails Announce Summer Tour",
        "description": "The Peel It Back Tour 2025 will kick off June 15 in Dublin and visit North America on Aug. 6.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Taylor Swift, Morgan Wallen Lead iHeartRadio Music Awards Nominees",
        "description": "Kendrick Lamar, Sabrina Carpenter and Post Malone also scored multiple nominations at the March 17 event that will pay tribute to the rebuilding of Los Angeles following the devastating wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "2025 Songwriters Hall of Fame Class: George Clinton, Doobie Brothers, Mike Love",
        "description": "Rodney “Darkchild” Jerkins, Tony Macaulay and Ashley Gorley also make up the 2025 class. They will be inducted on June 12 in New York.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Leading French Newspaper Le Monde Quits X Over Elon Musk’s Alliance With Donald Trump",
        "description": "France's newspaper of record joins The Guardian in exiting the site formerly known as Twitter over Musk's increasingly extreme politics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "K-Pop Stars MEOVV Are Ready To Be Your New Favorite “It” Girls",
        "description": "The rookie girl group, hailing from iconic K-Pop producer Teddy Park’s THEBLACKLABEL imprint, have been hard at work establishing themselves on the global stage: “We really love what we do.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Flavor Flav Launches Fundraiser for Black Families Displaced by L.A. Wildfires",
        "description": "\"Not enough is being done for the Black families and community in the aftermath of the California fires,\" the rapper wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Bill Burr and Shane Gillis to Co-Host L.A. Wildfire Relief Comedy Show",
        "description": "The comedians will take the stage at the Wiltern theater on Jan. 27, with all proceeds benefiting the Wildfire Relief Program.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "‘Morning Joe’ Hosts Have Tense Exchange Over Trump’s Jan. 6 Pardons",
        "description": "Mika Brzezinski called out the president calling the rioters \"hostages\" as he stood with the families of Israeli hostages while co-host Joe Scarborough said Democrats were \"quietly reminding themselves\" of the president's narrow margin of victory in the 2024 popular vote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-23T07:23:42.978825"
    },
    {
        "title": "Young BBL star’s sledge shot down by teammate",
        "description": "After a young star called his cross-town rivals scared the facts thrown back at him could make for a spiteful Big Bash final on Friday.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "‘Poison in my heart’: Adesanya’s final call on Whittaker trilogy",
        "description": "After a bitter rivalry which spawned two cracking UFC bouts, Israel Adesanya and Robert Whittaker have become an unlikely pair of mates – even if a cup of coffee threatened to ruin it all.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Star ignores opponent, war of words erupts",
        "description": "A tennis champion who was accused of bad sportsmanship says she was threatened by her opponent at the Australian Open in an ugly incident.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Channel 9’s horror Aus Open gets worse",
        "description": "Tony Jones and a host of other Nine presenters have attempted to bring humour to the Aus Open but the tennis world clearly isn’t laughing.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Young BBL star’s sledge shot down by teammate",
        "description": "After a young star called his cross-town rivals scared the facts thrown back at him could make for a spiteful Big Bash final on Friday.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "‘Brilliant’: Warner goes from banned to best",
        "description": "He was banned from ever captaining Australia, but when the door opener for David Warner in the Big Bash, he has proven all his doubters wrong.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Star ignores opponent, war of words erupts",
        "description": "A tennis champion who was accused of bad sportsmanship says she was threatened by her opponent at the Australian Open in an ugly incident.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Channel 9’s horror Aus Open gets worse",
        "description": "Tony Jones and a host of other Nine presenters have attempted to bring humour to the Aus Open but the tennis world clearly isn’t laughing.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Bombers gun’s big call on fitness",
        "description": "A second-year Essendon rising star is talking up his pre-season campaign as the Bombers eye a new look up forward in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Tigers to get early look at young guns",
        "description": "Richmond’s No.1 pick Sam Lalor has revealed how the Tigers’ bumper draft class is tracking as the pre-season games approach.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Dragons’ shock as star refuses to train",
        "description": "A Dragons star is reportedly refusing to attend club training sessions as doubts surrounds his future with the NRL club.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Wests Tigers make huge captaincy call",
        "description": "Jarome Luai moved to the Wests Tigers to forge his own legacy and his new club has increased its investment in him beyond his massive pay cheque.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Aussie GOAT makes shock career call",
        "description": "She took last year off competition and still spent the year surfing, and now Steph Gilmore has decided what she’ll be doing in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "‘Pit of piranhas’: World title chase stirs Sally",
        "description": "Sally Fitzgibbons has been close to a world title in a rollercoaster career and the energetic Aussie can’t get enough of the ride as a 16th campaign begins.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Which two teams do the stats back to make Super Bowl LIX?",
        "description": "Only four teams remain: who are the two that the stats back to meet in New Orleans for Super Bowl LIX?",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Eddie McGuire’s son does the unthinkable",
        "description": "Joe McGuire, the son of broadcaster Eddie, has won an all-Aussie punting duel in a performance few would have seen coming.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Aussie A-League star chased by China",
        "description": "One of the A-League’s most talented midfielders who captained Australia’s under-17 team is pondering an offer to play his senior international football for China.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Item top of sport’s wish list for Olympics",
        "description": "With plans for the 2032 Brisbane Olympics yet to be cemented, Football Australia has proposed one thing it says will enhance Queensland’s “global reputation”.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "‘Poison in my heart’: Adesanya’s final call on Whittaker trilogy",
        "description": "After a bitter rivalry which spawned two cracking UFC bouts, Israel Adesanya and Robert Whittaker have become an unlikely pair of mates – even if a cup of coffee threatened to ruin it all.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "F1 world in meltdown over Hamilton photo",
        "description": "Seven-time world champion Lewis Hamilton has sent the F1 world into a spin over a simple photo he shared on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "SuperCoach NBL finals: Fast trades, tips for Round 18",
        "description": "Win and stay alive, lose and it’s season over – that’s the equation in SuperCoach NBL round 18, which starts Thursday. Get all your trade tips here.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Aussie star’s truth bomb about PGA Tour",
        "description": "Only six of the world’s top 25 players will be at an event Tiger Woods won eight times as the profound impact of LIV on the PGA Tour plays out in real time.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Port Macquarie and Queanbeyan best bets, inside mail for Friday",
        "description": "A wife and husband trainer and jockey combination can make some early honey for punters at Port Macquarie if their stable newcomer can salute.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Wallabies skipper warns of ‘massive risk’",
        "description": "The Wallabies captain has urged Australian players to think about the 2027 Rugby World Cup when deciding about their future.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    },
    {
        "title": "Fan hospitalised in ‘awful, freak accident’",
        "description": "A devastating crash has marred Saturday’s Tour Down Under, leaving a fan hospitalized with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-01-23T07:23:45.125192"
    }
]