[
    {
        "title": "Nick Clegg leaves Meta ahead of Trump's return as US president",
        "description": "The former UK deputy prime minister said he was departing the company after nearly seven years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Why Apple is offering rare iPhone discounts in China",
        "description": "Rival technology giant Huawei has also cut smartphone prices in the run-up to the Lunar New Year holiday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Court strikes down US net neutrality rules",
        "description": "The ruling marks a significant moment in the long running battle over how to regulate internet providers.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Rosita Missoni, co-founder of Italian label, dies aged 93",
        "description": "Lombardy's president, who confirmed the news, says Missoni's death is \"a great loss for Italy\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Why Apple is offering rare iPhone discounts in China",
        "description": "Rival technology giant Huawei has also cut smartphone prices in the run-up to the Lunar New Year holiday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Slovakia threatens to cut benefit for  Ukrainians",
        "description": "A dispute between Slovakia and Ukraine over Russian natural gas transit has been escalating.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Sweden's green industry hopes hit by Northvolt woes",
        "description": "Financial problems at battery maker Northvolt have shaken hopes for Sweden's green industry sector.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "How a home-made snack empowered Indian women",
        "description": "The Lijjat co-operative, run by women, employs more than 45,000 people and is famous for its crispy poppadoms.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "What we know about US visas Trump supporters are clashing over",
        "description": "A row has erupted over a long-standing US visa programme, We looked into the figures behind the scheme.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "'It was destiny': How Jimmy Carter embraced China and changed history",
        "description": "It set the stage for China's economic ascent - and its rivalry with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Robinhood CEO: Crypto under relentless assault - 19 Dec 2024",
        "description": "The CEO of online investing platform Robinhood says the Trump administration will be very good for business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Tesla sales stall as China's BYD closes in",
        "description": "Tesla's ranking as the world's top electric vehicle seller is threatened after sales fell last year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "UK house prices rose by 4.7% in 2024, says lender",
        "description": "Housing market activity remained \"remarkably resilient\" despite affordability challenges, the lender says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "'I quit my job with Google to follow my dreams'",
        "description": "Entrepreneur Simmy Dhillon says he grew up wanting to help his parents retire from their jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Police probe if blast at Trump hotel is linked to New Orleans attack",
        "description": "President Biden said \"any possible connection\" was being investigated, but \"thus far, there is nothing to report\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Era of cheap Russian gas to EU ends as transit across Ukraine stops",
        "description": "The EU says most states will not be affected but other European countries, including Moldova, are facing shortages.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Moldova faces energy crisis as flow of Russian gas ends",
        "description": "Russian gas has stopped passing through Ukraine after a five-year deal expired, leaving Moldova at risk of a crisis.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Elon Musk changes his name to Kekius Maximus on X",
        "description": "The world's richest man sparks speculation after changing his name and using a picture of Pepe the Frog.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Pre-flight checks found 'no issues' before S Korea air crash",
        "description": "Jeju Air says the plane that crashed in South Korea killing 179 people had passed a pre-flight inspection.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Do not wipe toilet seat with toilet paper: Japanese maker",
        "description": "Social media users have complained that their seats were scratched after being wiped with toilet paper.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Crypto fugitive Do Kwon extradited to US over $40bn crash",
        "description": "US authorities allege he was responsible for the collapse of two coins, prompting a massive crypto sell-off.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Madoff fraud victims get $4.3bn as fund completes payouts",
        "description": "Victims of one of the biggest frauds in US history set to recover more than 90% of proven losses.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "US Treasury says it was hacked by China in 'major incident'",
        "description": "A Chinese state-sponsored hacker broke into the US Treasury Department's systems and accessed some unclassified documents.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "'There aren't enough jobs to go round for everyone'",
        "description": "James Harrison's online videos talking about graduate job rejection have been seen by millions.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "South Korea orders air safety probe after deadly plane crash",
        "description": "The order came after the nation's deadliest aviation disaster in decades in which 179 people were killed.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "'I have 22 million followers but kept my day job'",
        "description": "Miles Laflin encourages others to create online content and says there is an audience for every job.",
        "source": "BBC Business",
        "fetched_date": "2025-01-03T07:22:45.468323"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Katy Perry, Shakira and Ed Sheeran are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Neil Young Pulls Out of Glastonbury 2025, Saying Festival Is Under the BBC’s “Corporate Control”",
        "description": "\"We were told that BBC was now a partner in Glastonbury and wanted us to do a lot of things in a way we were not interested in,\" Young said about the decision to not play with his new band, the Chrome Hearts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Sugar Bowl Postponed After Deadly Truck Attack in New Orleans",
        "description": "The college football quarterfinal between Georgia and Notre Dame was set to take place at Louisiana's Superdome on New Year's Day but will now take place Thursday night after the tragedy in which at least 10 people were killed.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Best Moments and Biggest Surprises From Janet Jackson’s New Las Vegas Residency",
        "description": "The star debuted her new show, set for 10 nights over the next two months, at Resorts World Las Vegas on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Hollywood’s Most Notable Deaths of 2024",
        "description": "Carl Weathers, Shannen Doherty, Bob Newhart, Donald Sutherland, Liam Payne, Maggie Smith, James Earl Jones, Gena Rowlands and Jon Landau are among several entertainment legends the industry lost this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "How to Watch the Times Square New Year’s Eve Celebration and 2025 Ball Drop Live",
        "description": "Tune in to watch Jonathan Bennett and Jeremy Hassell return as this year's hosts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Angelina Jolie and Brad Pitt Reach Divorce Settlement After Eight-Year Legal Battle",
        "description": "The pair married in 2014 and split two years later, with Jolie later claiming that Pitt was abusive toward her and their children, but he was cleared of the allegations in an investigation and the FBI declined to press charges.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "King Charles III Knights Stephen Fry, Carey Mulligan Also Stars on U.K. New Year’s Honors List",
        "description": "'Happy Valley' star Sarah Lancashire, 'Bad Sisters' star Anne-Marie Duff and veteran actor Eddie Marsan are among the other big entertainment industry names receiving honors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Boy George Opens up Ahead of New Year’s Concert in Rome: “All Human Beings Are Multi-Universes”",
        "description": "The 1980s pop icon, who will ring in 2025 with a free concert in the Eternal City, talked to THR Roma in an exclusive interview.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Lily-Rose Depp on Why She’s Doing Everything She Can to “Protect a Sense of Anonymity”",
        "description": "The actress has found her way into the spotlight with her roles in 'The Idol' and 'Nosferatu.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Did Beyoncé Clinch an Album of the Year Win With Her Netflix Xmas Halftime Show?",
        "description": "With the Grammy Awards voting deadline still days away, an NFL halftime show may be the key to locking in a seemingly overdue honor.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "Kate Beckinsale Details Years of On-Set Harassment: “Complaining About Abuse Should Not Beget More Abuse”",
        "description": "In an Instagram video, the actress recalled being physically harmed by a male co-star while filming a fight scene, a publicist forcing her to do a photo shoot “the day after I had a miscarriage\" and being \"felt up\" by a crewmember at age 18.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-03T07:22:45.824421"
    },
    {
        "title": "CONTROVERSY ERUPTS: Cricket world divided by fresh snicko drama",
        "description": "An Indian all-rounder has been called out by cricket fans after producing a moment of madness at the SCG on Friday.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Sydney keeper’s form rewarded",
        "description": "Having only joined Sydney FC in the off-season, goalkeeper Harrison Devenish-Meares has already earned himself a contract extension.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Top-ranked Australian cops brutal snub",
        "description": "For the second straight year, Australia’s top-ranked woman may not even make the Australian Open after a brutal reality check.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Indian star sledges Smith, loses the plot",
        "description": "Steve Smith got the last laugh after a prickly sledging exchange with an Indian batter was overheard during the SCG Test.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "India fume as Australia take control of series decider",
        "description": "After tearing through India’s batting order, Australia is looking to leave a dent in their attack on day one at the SCG. FOLLOW DAY 1 LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "CONTROVERSY ERUPTS: Cricket world divided by fresh snicko drama",
        "description": "An Indian all-rounder has been called out by cricket fans after producing a moment of madness at the SCG on Friday.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Heartbreak as Birrell’s dream Brisbane run finally ends",
        "description": "After knocking over both the World No.8 and 35, Kimberly Birrell’s inspiring Brisbane International campaign has ended in heartbreak, crashing out of the quarter-finals.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Top-ranked Australian cops brutal snub",
        "description": "For the second straight year, Australia’s top-ranked woman may not even make the Australian Open after a brutal reality check.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "‘Can’t wait’: Ch7 star shares huge news",
        "description": "AFLW great turned TV commentator Abbey Holmes has dropped a bombshell from out of nowhere, much to the delight of fans.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "AFL star arrested and charged",
        "description": "A Richmond Tigers premiership star has been charged with assault following an alleged late-night incident in New South Wales.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Raiders snubbed as $3.5m star leaves Knights",
        "description": "One of the biggest dominoes in the NRL player market has fallen with a star forward deciding on a move to a Sydney-based club.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "‘Tragedy’: Tigers rocked by 15-year ban",
        "description": "The Wests Tigers’ civil war has taken an explosive turn with senior powerbrokers banished by a so-called “Gang of Four”.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Star deletes Instagram after racy video",
        "description": "Angel Reese scrubbed her Instagram account after posting this video of her revealing New Year’s outfit.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "First ever Aussie women’s sports bar closes",
        "description": "A women’s sports bar opened with much fanfare and enthusiasm but just a few months later, it’s had no choice but to call last drinks.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Trade means more headaches for Simmons",
        "description": "Ben Simmons’ career has again been plunged into uncertainty after his NBA team pressed the trigger on a surprise trade.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Has a massive injury opened the door for a new Super Bowl favourite?",
        "description": "With three weeks left in the NFL season, there’s a new Super Bowl favourite: with a longtime nemesis injured, can it turn around years and years of losing?",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Star touches down but faces fight for spot",
        "description": "Melbourne Victory was buzzing after an Australian star came back through the doors, but when will he see A-League action?",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Sydney keeper’s form rewarded",
        "description": "Having only joined Sydney FC in the off-season, goalkeeper Harrison Devenish-Meares has already earned himself a contract extension.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Utter chaos in boxing ‘freak show’ brawl",
        "description": "There have been insane scenes at a traditional New Year’s Eve boxing event with an all-in brawl erupting after illegal acts.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Schumacher reveals massive family news",
        "description": "Formula One legend Michael Schumacher’s daughter has shared some beautiful news about their family, months after her wedding.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Former MVP explodes in second half to helps Kings snap losing streak",
        "description": "A second half explosion from Jaylen Adams has lifted the Kings to a monumental home comeback to snap their losing run and end SEM Phoenix’s run of three-straight wins.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Australia bans professional trans golfer",
        "description": "Transgender golfer Breanna Gill, who won last year’s Australian Women’s Classic, is about to be kicked off the WPGA Tour.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Kembla preview: Ryan and Alexiou fillies to strike an early double",
        "description": "Trainers Gerald Ryan and Sterling Alexiou are out to keep their winning momentum going and start 2025 on a winning note with a couple of winners at Kembla.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "David Pocock reveals major life update",
        "description": "It’s the first glimpse fans have been given of the Pocock family’s newest member since their pregnancy announcement earlier this year.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Rookie Reds prop in Wallabies training squad",
        "description": "An emerging Queensland Reds prop has been included in a 40-man Wallabies training squad.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-03T07:22:47.132497"
    }
]