[
    {
        "title": "Hooters restaurant chain files for bankruptcy",
        "description": "Like many other casual dining chains, Hooters has struggled in recent years with rising costs and wages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Markets mixed as investors brace for Trump tariffs",
        "description": "The US president suggests the new import taxes he is set to announce this week will hit all countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Primark boss quits after complaint about behaviour",
        "description": "Paul Marchant leaves after an allegation about his behaviour towards a woman \"in a social environment\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "AI was enemy No. 1 during Hollywood strikes. Now it's in Oscar-winning films",
        "description": "Tech companies say AI will make productions cheaper and faster - but many in Hollywood think it will replace their jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Markets mixed as investors brace for Trump tariffs",
        "description": "The US president suggests the new import taxes he is set to announce this week will hit all countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "The Finnish defence firms 'on steroids'",
        "description": "Helsinki has become one of the top five cities in Europe for investment in defence and security technologies.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "UK expects to be hit by Trump tariffs, No 10 says",
        "description": "Downing Street does not rule out retaliating if new tariffs are imposed on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Harrods launches compensation scheme for Al Fayed victims",
        "description": "Survivors of alleged sexual abuse by the department store's former boss could get up to £385,000.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "The Swedish city fined for missing an environmental target",
        "description": "Gothenburg has to pay a financial penalty if it misses certain annual sustainability goals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Week in Markets - 28 Mar 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Musk gives away $1m cheques ahead of Wisconsin's Supreme Court election",
        "description": "The state's attorney general tried to block the giveaway arguing it was an illegal bid to buy votes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Trump wants India to buy US corn - but here's why it probably won't",
        "description": "India feeds over a billion people, yet low yields and poor infrastructure keep agriculture lagging.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Al Fayed estate faces legal action from alleged victims",
        "description": "The women worked as nannies or private air stewards for the late billionaire and former owner of Harrods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Trump says he 'couldn't care less' about higher car prices",
        "description": "Trump says he hopes foreign carmakers raise prices as it means people will buy US-made cars.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "The US firms backing Trump's fight over trade",
        "description": "Businesses think Trump is right about unfair trade. But are the US president's reciprocal tariffs the answer?",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "UK prepared to retaliate against US tariffs, No 10 sources say",
        "description": "The UK is in last-minute negotiations with the White House ahead of US tariffs being implemented.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Why British boarding schools are so eager to open in Nigeria",
        "description": "With UK school fees rising, Nigeria's elite can now choose to give their offspring a British education at home.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Japan chain shuts eateries after pests found in food",
        "description": "Sukiya announced the temporary closure after customers found an insect and a rat in their food.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Protesters target Musk in rallies outside showrooms",
        "description": "The protest is part of a global day of action against Tesla's billionaire owner.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Disney faces US investigation over DEI practices",
        "description": "The probe is part of a wider crackdown on diversity and inclusion practices by the Trump administration.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "'It's going to get worse': US car buyers brace for sweeping auto tariffs",
        "description": "\"The prices in the wholesale market have skyrocketed already and it's going to get worse,\" one car seller tells the BBC.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Musk's xAI buys his social media platform X",
        "description": "The move could be aimed at protecting investors, who helped him buy purchase X, from losing money.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
        "description": "The US president described the talks as \"extremely productive\" and said the two leaders would meet after Canada holds elections.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Defiance or diplomacy - how Canadians want to deal with Trump",
        "description": "The BBC asked voters in Toronto how they would approach Donald Trump if they were PM - would it be through defiance or diplomacy?",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "UK car firms urge help as Trump tariffs loom",
        "description": "Manufacturers are expected to ask for state support ahead of next week's 25% tax on exports.",
        "source": "BBC Business",
        "fetched_date": "2025-04-01T07:26:29.147768"
    },
    {
        "title": "Trump, Joined By Kid Rock, Signs Executive Order Targeting Ticket Scalpers",
        "description": "Trump has called on the FTC to enforce the BOTS Act, a 2016 legislation designed to stop scalpers from using bots to acquire mass amounts of tickets.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Miley Cyrus Sets the Stage for “Something Beautiful” With Release of First Two Songs From Upcoming Album",
        "description": "'Something Beautiful,' out May 30, is the singer's follow-up to 2023's 'Endless Summer Vacation,' which included the hit \"Flowers\" and earned Cyrus her first Grammys more than a decade into her music career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "The White House PR Battle With White House Correspondents Nears a Boiling Point",
        "description": "The AP is still banned from covering some, events, the White House is poised to take control of the Brady Briefing Room seat assignments, and Amber Ruffin is a casualty of the feud.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "How the Collapse of Prince Harry’s Charity Sentebale Has Unfolded Amid “Bullying” Claims",
        "description": "After the Duke of Sussex resigned from his role at the HIV and AIDS charity working in Africa on Wednesday, its chairwoman has now accused Harry of \"harassment and bullying.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Korean Actor Kim Soo-hyun Denies He Groomed and Dated Late Actress When She Was Underage",
        "description": "At a surprise press conference, Kim Soo-hyun denied claims he groomed Kim Sae-ron, who died by suicide in February.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Far-Right Leader Marine Le Pen Found Guilty of Embezzlement, Banned From Running for Office",
        "description": "A court found her guilty of fraud for the misuse of European Union funds, meaning the front-runner to replace Emmanuel Macron as French President has been deemed ineligible for public office.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Halle Berry Reflects on Being the Only Black Best Actress Oscar Winner: “Did It Really Change Anything for Women of Color?”",
        "description": "\"The system is not really designed for us, and so we have to stop coveting that which is not for us,\" the actress says in the Apple TV+ documentary 'Number One on the Call Sheet.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Billie Eilish, Finneas Enlist Jason Owen and Sandbox Entertainment for Management (Exclusive)",
        "description": "Parting with longtime managers Danny Rukasin and Brandon Goodman, the two join a roster that includes Kacey Musgraves and Kelsea Ballerini.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Papa Roach Marks 25th Anniversary With L.A.  Concert: “It’s a Celebration of Life”",
        "description": "The rock band performed \"Last Resort\" and other hits at the Kia Forum, with singer Jacoby Shaddix telling the crowd that everyone in attendance is \"willing to stand up and fight the good fight.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Sean Kingston and His Mother Found Guilty of Wire Fraud Scheme, Sentencing Scheduled for July",
        "description": "They both are facing decades in prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "White House Correspondents’ Association Cancels Amber Ruffin Performance at Annual Gala Dinner",
        "description": "Ruffin had been a target of criticism from the White House, though the WHCA says it will focus the event on recognizing \"journalistic excellence.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Chet Hanks Taps Father Tom Hanks for ‘Forrest Gump’-Inspired “You Better Run” Music Video",
        "description": "The 'Running Point' actor also recreates multiple scenes from the 1994 classic film.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-01T07:26:29.846136"
    },
    {
        "title": "Odd reason star deliberately scored own goal",
        "description": "Basketball star Marie Pardon has incredibly nailed a buzzer beater … only problem was it was for the wrong team.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Shock detail exposed in $12m AFL race",
        "description": "An eyebrow-raising new detail on St Kilda’s high-profile pursuit of Carlton superstar Tom De Koning has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Bombshell Latrell Mitchell move locked in",
        "description": "Latrell Mitchell is set to return from injury for his first game of the season, but his selection in the squad came with one major shock.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Bomber blow: Essendon forward suffers ACL",
        "description": "An Essendon forward’s fledgling AFL career has been put on hold after he went down with an ACL injury at training.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Bombshell Latrell Mitchell move locked in",
        "description": "Latrell Mitchell is set to return from injury for his first game of the season, but his selection in the squad came with one major shock.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Mixed news for injured Panthers stars",
        "description": "Nathan Cleary has been named to return, but the Panthers are still without some of their biggest stars for Friday’s game against the Cowboys.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Shock detail exposed in $12m AFL race",
        "description": "An eyebrow-raising new detail on St Kilda’s high-profile pursuit of Carlton superstar Tom De Koning has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "AFL Now: Tigers relying on Lalor case to overturn Mansell ban",
        "description": "Richmond have begun their quest to free Rhyan Mansell at the tribunal tonight, using Reuben Ginbey’s shove on Sam Lalor as evidence. Follow live.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Konstas rewarded with huge pay rise",
        "description": "Teenage cricket sensation Sam Konstas has taken a step in his emerging career after putting pen to paper on a monster new deal.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Warnie’s open sex secret before death",
        "description": "Shane Warne frequently used Viagra for erectile dysfunction prior to his shock death in 2022, it has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Djokovic image sparks serious concern",
        "description": "Tennis fans were left expressing their concern for the wellbeing of Novak Djokovic after worrying images emerged before a key final.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Kyrgios’ Insta comment ignites rumour mill",
        "description": "Nick Kyrgios has poured fuel all over the rumours surrounding his split from his influencer partner with one single Instagram comment.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Bombshell Max prophecy flips F1 on its head",
        "description": "A ticking time bomb is set to explode on Red Bull, as the team grapples with a crippling problem and rumours swirl about Max Verstappen.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Tsunoda targets home race podium after ‘unreal’ car switch",
        "description": "Ahead of his first race as an official Red Bull driver – and Max Verstappen teammate- Yuki Tsunoda has set his sights at the top end of the grid, with a podium finish in store for his home race.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Bombshell Max prophecy flips F1 on its head",
        "description": "A ticking time bomb is set to explode on Red Bull, as the team grapples with a crippling problem and rumours swirl about Max Verstappen.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Australia miss out on gold but snare Hong Kong Sevens double",
        "description": "There were no gold medals this time but Australia did at least finish on the podium in both the men’s and women’s tournaments at the prestigious Hong Kong Rugby Sevens.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Late try saves Reds as side secures historic 13-year first",
        "description": "Queensland Reds are back on the top of the Super Rugby ladder for the first time since 2012, as a late try got them home against the Western Force at a rain-soaked Suncorp Stadium.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "NBA ‘Bad Boy’ team goes rogue in wild fight",
        "description": "Seven players were ejected after a wild NBA brawl broke out featuring a team that is quickly earning a feisty reputation.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Coach axing leaves NBA world in shock",
        "description": "An NBA championship contender has left fans in disbelief after sacking their head coach only weeks out from the playoffs starting.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "‘Definitely not’: Matildas speak up over controversial Kerr call",
        "description": "Sam Kerr is back – but should she be captain? It’s a debate which has raged ever since news broke of the superstar’s police racism saga. And now her teammates have had their say.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Ref KO’s irate coach who stormed the pitch",
        "description": "After a coach charged onto the field following his side’s loss, a referee took matters into his own hands, showing off his martial arts background.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "‘I tried everything’: Tszyu makes call on cutman’s return",
        "description": "One year to the day since his Las Vegas bloodbath defeat to Sebastian Fundora, Tim Tszyu has made a call on the make up of his corner for his fight against Joey Spencer.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Aussie beats World No. 1 in thrilling win",
        "description": "Australian golfer Min Woo Lee has held on for an “unbelievable” maiden PGA Tour win less than two weeks out from the Masters.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Odd reason star deliberately scored own goal",
        "description": "Basketball star Marie Pardon has incredibly nailed a buzzer beater … only problem was it was for the wrong team.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Moment to Treasure as gun filly dominates Vinery Stud",
        "description": "Star Victorian filly Treasurethe Moment enhanced her standing as the ATC Oaks favourite with a commanding victory in the Group 1 Vinery Stud Stakes at Rosehill.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    },
    {
        "title": "Spiranac lifts lid on ‘sexual favour’ rumours",
        "description": "Golfer and social media sensation Paige Spiranac has spoken out over rumours that plagued her in the early stages of her career.",
        "source": "News AU",
        "fetched_date": "2025-04-01T07:26:32.133945"
    }
]