[
    {
        "title": "Global markets rebound after Trump reversal, but 125% US tariffs on China take effect",
        "description": "London's FTSE 100 is up 6% after Trump's 90-day suspension of the severest tariffs on imports from most countries trading with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Why Trump is hitting China on trade - and what might happen next",
        "description": "There is much more to this than straightforward retaliation, writes John Sudworth, and it traces back to his first term.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "US pauses higher tariffs for most countries after market havoc, but hits China harder",
        "description": "Trump authorises a \"lowered reciprocal tariff of 10%\" for most countries, except China, while negotiations continue.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Retreat or negotiating strategy? Trump steps back from all-out trade war",
        "description": "The US is now making nice – or at least nicer - with nations that had faced their retaliatory trade fire, writes Anthony Zurcher.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Why Trump is hitting China on trade - and what might happen next",
        "description": "There is much more to this than straightforward retaliation, writes John Sudworth, and it traces back to his first term.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Meta whistleblower alleges company worked with China on censorship",
        "description": "The whistleblower told US lawmakers the company undermined national security to make billions in China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "The plans to put data centres in orbit and on the Moon",
        "description": "Proponents say space-based data centres will be more secure, but sceptics say big hurdles remain.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Are 10-minute online deliveries killing the Indian corner shop?",
        "description": "Online apps are posing a threat to physical stores, but their presence so far is limited to big cities.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "The Canadians and Danes boycotting American products",
        "description": "As anger grows over Trump's tariffs, apps and social media groups are helping people avoid US goods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "It's Microsoft's 50th birthday - what comes next?",
        "description": "It's Microsoft's 50th anniversary and BBC technology editor Zoe Kleinman tours its Redmond headuarters.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "How exposed is the UK to Trump's tariff chaos?",
        "description": "The exact impact remains uncertain - but some of the emerging fallout may have an upside - here's why.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Why US markets skyrocketed after Trump tariffs pause",
        "description": "The S&P 500 index soared 9.5% in the biggest one-day rally since 2008, following days of turmoil sparked by the tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "China retaliates against Trump's 'trade tyranny' with 84% tariffs",
        "description": "Manufacturers and exporters are scrambling after 104% tariff on China-made goods comes into effect.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Meta may have used books by Gerry Adams to train AI",
        "description": "The former Sinn Féin president is among a number of authors who say their books have been taken without permission.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "US stocks make historic gains after Trump pauses some tariffs",
        "description": "But Trump also raises tariffs on goods from China to at least 125% \"effective immediately\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Is the US making $2bn a day from tariffs? Trump claims fact-checked",
        "description": "President Trump has made a series of claims about how the US faces \"unfair trade\"  as he justifies his sweeping tariffs on imports from other countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Trump threatens to end pharmaceuticals tariff exemption",
        "description": "The US president vows \"major\" tariffs on imported medicines - raising fears of an increase in costs for Americans.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Canada hits back at US car tariffs with reciprocal measures",
        "description": "Ottawa says it has started a 25% tax on some vehicle imports from the US, retaliating against American measures.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "UK government considers nationalising British Steel",
        "description": "There are fears among ministers that the company's blast furnaces could run out of raw materials within days.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "BBC Verify: What would a US-China trade war do to the world economy?",
        "description": "After the US president hit China with tariffs of over 100%, Beijing retaliates with higher taxes on American imports.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "India cuts rates as Trump's tariffs put growth at risk",
        "description": "India's central bank has cut interest rates by 0.25% and lowered its growth projections for this year.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Trump's tariffs are a huge blow to Vietnam's economic ambitions",
        "description": "US exports have driven the economic success of countries like Vietnam and Cambodia.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "At a glance: Trump's tariffs on China, EU and rest of the world",
        "description": "Besides a 10% rate globally, some countries billed as \"worst offenders\" have higher rates including 104% for China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "AI chips, not ice creams - minister's dig at Indian start-ups sparks debate",
        "description": "Commerce Minister Piyush Goyal says Indian start-ups need to focus more on deep-tech innovations.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "UK investigating claims green fuel contains virgin palm oil",
        "description": "The BBC finds evidence of fraud in the production of a \"green\" diesel meant to cut emissions.",
        "source": "BBC Business",
        "fetched_date": "2025-04-10T07:26:09.494167"
    },
    {
        "title": "Alice Tan Ridley, New York City Subway Sensation Turned Recording Artist, Dies at 72",
        "description": "The mother of ‘Precious' actress Gabourey Sidibe spent 30 years as an underground performer before hitting it big on ‘America’s Got Talent.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Jennifer Lopez to Host 2025 American Music Awards",
        "description": "The awards show will air on May 26 on CBS and stream on Paramount+.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Warner Bros. Seeks to Quash Diddy’s Move to Access Raw Documentary Interview Footage",
        "description": "The rap mogul's legal team is attempting to subpoena all footage and notes from interviews with his ex-chef and former girlfriend, who spoke out in 'The Fall of Diddy' docuseries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "RIAA CEO, Grammys CEO and SAG-AFTRA’s Chief Negotiator Pen Open Letter Backing “No Fakes” Bill",
        "description": "The legislation \"hits the sweet spot of protecting people, free speech, and AI innovation all at the same time,\" say RIAA's Mitch Glazier, the Recording Academy's Harvey Mason Jr. and SAG-AFTRA's Duncan-Crabtree Ireland.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Anjelica Huston Says She’s “in the Clear” After “Bout With Cancer” Four Years Ago",
        "description": "“I'm very proud of myself, and I've been very lucky. My doctors have been wonderful,” she said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "The Hollywood Reporter Names Lori O’Connor Executive VP and Publisher",
        "description": "Her appointment comes as the brand continues to grow and expand across events, video, branded content and international operations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Mr. Beast Criticizes Trump’s Tariffs: “Nail in the Coffin for Small Businesses”",
        "description": "The 'Beast Games' host on how the tariffs are already making his chocolate bar prices climb.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Diddy’s Attorneys, Feds Spar Over Including “Sexual Abuse of Other Victims” Testimony in Looming Trial",
        "description": "The beleaguered rap mogul's trial begins in a few weeks — but attorneys on both sides have already locked horns in the battle that may end with him jailed for life.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Dominican Republic Nightclub Roof Collapse Leaves More Than 60 Dead and 160 Injured",
        "description": "Relatives of merengue singer Rubby Pérez, who was performing, initially said that he had been rescued, but later Tuesday, officials said rescue crews were still looking for Pérez.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "BAFTA Games Awards: ‘Astro Bot’ Tops Winners",
        "description": "The platform game earned five honors, while the psychological horror game 'Still Wakes the Deep' received three BAFTAs, including two performance awards, during the annual ceremony in London.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "France’s #MeToo Investigation Condemns “Endemic” Sexual Violence in Film, Culture Industries (Report)",
        "description": "The report, which follows a wave of high-profile sexual assault cases, recommends an overall of French funding and regulations to protect the vulnerable, especially minors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Billy Idol On The Rock Hall and “Telling The Story Of My Life” On Upcoming Album ‘Dream Into It’",
        "description": "Idol's new album comes out April 25, and he awaits the news on whether he'll be accepted into the Rock & Roll Hall of Fame later this month.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-10T07:26:09.700710"
    },
    {
        "title": "Ex-AFL boss’ wife dumps him over pic drama",
        "description": "Three months after his lewd photo scandal, former Carlton boss Luke Sayers has been dumped and already pictured with another lady.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "World stunned by Aussie star’s outfit",
        "description": "As the golf world gears up for the Masters, fans couldn’t believe their eyes when an Aussie contender turned up in a seriously bold look.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Aussies outclassed by Kazakhstan",
        "description": "Kazakhstan was too strong for Australia in Thursday’s Billie Jean King Cup qualifier in Brisbane.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Aussie lawyer sacked after sick leave lie",
        "description": "A young Melbourne lawyer has had his unfair dismissal case thrown out after he was fired for lying about being sick to watch the AFL and go to the pub.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "‘Stop the mess’: Meninga’s call on Kangaroos",
        "description": "Kangaroos coach Mal Meninga wants international rugby league to thrive but says eligibility rules are a mess.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Aussie sport star’s freakish secret talent",
        "description": "It’s the other sport some of Australia’s top athletes would give up their day jobs for. And so many don’t just love golf, they’re also learning to master it.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "AFL Live: Huge late change ahead of Crows-Cats clash",
        "description": "Adelaide and Geelong will face-off in the Gather Round opener tonight, but one side will be without one of their biggest stars. Follow for live updates here.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Ex-AFL boss’ wife dumps him over pic drama",
        "description": "Three months after his lewd photo scandal, former Carlton boss Luke Sayers has been dumped and already pictured with another lady.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Aussie sport star’s freakish secret talent",
        "description": "It’s the other sport some of Australia’s top athletes would give up their day jobs for. And so many don’t just love golf, they’re also learning to master it.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Fight is on after Olympic cricket reveal",
        "description": "Cricket is back in the Olympics in LA in 2028, but confirmation of how many countries will compete could make the fight for spots intense.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Aussies outclassed by Kazakhstan",
        "description": "Kazakhstan was too strong for Australia in Thursday’s Billie Jean King Cup qualifier in Brisbane.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Djokovic sad admission after hitting new low",
        "description": "Former World No. 1 Novak Djokovic has plunged to a sad new low in what he described as his ‘worst day’ at the Monte Carlo Masters.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "‘Scary’ star set to tear Australia apart",
        "description": "One player is tipped to make such a difference to Super Netball that “something will have to go horribly wrong” for her team not to win the premiership.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Max twists knife with brutal sledge at rivals",
        "description": "Max Verstappen has rubbed salt in the wound with a brutal comment about McLaren after their missed chance at the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Fireball crash traps driver inside vehicle",
        "description": "A terrifying fireball crash has brought a race to a standstill after a driver was left trapped inside her car as flames broke out.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Broken arm sidelines Wallabies captain",
        "description": "Wallabies captain Harry Wilson has suffered an unfortunate injury blow ahead of Queensland’s battle with the ACT Brumbies.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Kiss could coach Reds and Wallabies",
        "description": "A potential hurdle to Queensland Reds coach Les Kiss taking charge of the Wallabies has been removed by Rugby Australia.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Josh Giddey stuns America with ‘monster’ game",
        "description": "Josh Giddey’s NBA hot streak has continued with the Aussie young gun notching up a milestone that puts him in an exclusive club.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "$68m star dead in tragic scenes",
        "description": "America has been rocked by the death of a world champion, who is among at least 44 people killed in the South American nightclub tragedy.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "‘Never easy’: Reds coach shown the door",
        "description": "Adelaide United will have a new coach next season after deciding against offering Carl Veart a new contract.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "‘I’m gone’: Ange blows up at critics, bares soul",
        "description": "Ange Postecoglou has blown up at an innocent question and hit out at the vibe around Tottenham, explosively claiming “I’m gone anyway”.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "‘No photos with terrorists’: 13yo sparks storm",
        "description": "A teenage athlete has gone viral and sparked a massive global reaction after staging a podium protest against an opponent.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "World stunned by Aussie star’s outfit",
        "description": "As the golf world gears up for the Masters, fans couldn’t believe their eyes when an Aussie contender turned up in a seriously bold look.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Josh Giddey stuns America with ‘monster’ game",
        "description": "Josh Giddey’s NBA hot streak has continued with the Aussie young gun notching up a milestone that puts him in an exclusive club.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Orange, Port Macquarie Friday tips: Excited for a winner",
        "description": "Still Excited, a David Pfieffer-trained daughter of Lonhro from The Galaxy winner I Am Excited, heads to Orange in search of an early career win. BEST BETS, INSIDE MAIL",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "12yo quits rugby league over ugly incident",
        "description": "The father of a schoolboy whose shoulder was shattered after a dangerous tackle during a division three rugby league match is calling for change.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    },
    {
        "title": "League hits back after brutal tackle on 12yo",
        "description": "Footage of the tackle shows Oliver being lifted by the other boy and landing on his shoulder.",
        "source": "News AU",
        "fetched_date": "2025-04-10T07:26:10.860418"
    }
]