[
    {
        "title": "Mining giants sign $30bn settlement for 2015 Brazil dam collapse",
        "description": "The dam collapse released toxic waste and mud, which flooded nearby towns, rivers and forests.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Cubans endure days without power as energy crisis hits hard",
        "description": "People cook with firewood after days of blackouts and supply issues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Action demanded over surge in illegal meat imports into UK",
        "description": "The government is warned of a \"foot-and-mouth\" level crisis over potentially diseased meat flooding into the UK.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "What we know about the McDonald's E. coli outbreak",
        "description": "Health officials say the number of people infected after eating McDonald's Quarter Pounders has risen to 75 across 13 states.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "India's balancing act with the West as Brics flexes new muscles",
        "description": "Brics enables India to work with some of its closest friends and espouses principles close to Delhi's heart.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Cubans endure days without power as energy crisis hits hard",
        "description": "People cook with firewood after days of blackouts and supply issues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Ex-Abercrombie CEO pleads not guilty to sex trafficking charges",
        "description": "Mike Jeffries and his partner are accused of using fraud and force to sexually abuse young men.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Microsoft boss gets 63% pay rise despite asking for reduction",
        "description": "Satya Nadella asked for a reduction because of cyber attacks the firm suffered - but still saw his earnings increase massively.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "'I can't run a business like this': Why the WordPress row matters",
        "description": "WordPress's tools are used by 40% of the world's websites, making this a spat with big consequences.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Action demanded over surge in illegal meat imports into UK",
        "description": "The government is warned of a \"foot-and-mouth\" level crisis over potentially diseased meat flooding into the UK.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "US markets open up after Tesla stock boom — 25 Oct 2024",
        "description": "Expert says the firm's stronger than expected profits give optimism to the markets.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "'It's rough out here': Why Trump and Harris should listen to this mum of seven",
        "description": "Inflation and high prices are primary concerns for Sin City's voters ahead of the 5 November vote.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "US warns Musk political group that $1m voter giveaway may be illegal",
        "description": "The Department of Justice is probing whether the prizes violate laws against paying people to vote.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "US gets $100m settlement for Baltimore bridge collapse",
        "description": "The US justice department sued the owners of the Dali container ship after it crashed into a bridge in Baltimore in March.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Twice homeless millionaire tops UK black power list",
        "description": "The now multimillionaire began his career in a call centre after failing to become a professional footballer.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Would Harris's price gouging plan really help US consumers?",
        "description": "The Democrat has proposed a federal ban in certain circumstances - economists are divided on whether it would work.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "The software extending the life of your phone",
        "description": "Greener software could make devices last longer and use less electricity.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "UK chancellor to change debt rules to release billions",
        "description": "Reeves has said the government will change these rules to free up billions for spending on big projects.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "The water industry is in crisis. Can it be fixed?",
        "description": "Simon Jack asks what reform of the troubled sector could mean for customers and their bills.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "What form could reparations for slavery take in the UK?",
        "description": "How likely is the UK to provide reparations for the slave trade, and what could that look like?",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Rare typed copy of The Little Prince to go on sale for $1.25m",
        "description": "A typed copy of children's story The Little Prince, hand-annotated by the author, will go on sale in November.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Fishermen on Scottish trawler win £20,000 modern slavery claim",
        "description": "The Ghanaian fishermen were rescued from Annan-based scallop-trawler Olivia Jean in 2020.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Striking Boeing workers reject 35% pay rise offer",
        "description": "Earlier, Boeing's boss warned the firm was at a \"crossroads\" as losses surged to roughly $6bn.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "IMF warns world to avoid global trade war",
        "description": "Economic fears have been rising over Donald Trump's mega-tariff plan and rising US debts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Customers 'shocked' by hefty Juul settlement payouts",
        "description": "He wasn't expecting much from a class-action suit against vaping firm Juul. Then he got $3,000.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "All aboard Tanzania's electric train breaking new ground for East Africa",
        "description": "An electric fast train - the first in East Africa - now links Tanzania's capital to its commercial hub, Dar es Salaam, in under four hours.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Workers in UK could get right to strike for a year",
        "description": "A government document says the mandate to take industrial action could be extended.",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Starbucks boss shakes up menu to win back customers",
        "description": "The coffee shop chain has also promised to look at pricing and staffing to prevent bottlenecks",
        "source": "BBC Business",
        "fetched_date": "2024-10-26T07:21:48.467852"
    },
    {
        "title": "Hollywood’s Highest-Profile Harris Endorsements: Taylor Swift, George Clooney, Bruce Springsteen and More",
        "description": "Celebrities have expressed their support for the Democratic ticket this November. Here's 11 of the biggest names.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Grammy-Winning Rapper Lil Durk Charged With Orchestrating 2022 Los Angeles Killing",
        "description": "Durk was arrested Thursday night in South Florida as he attempted to flee the country.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Phil Lesh, Grateful Dead Bassist, Dies at 84",
        "description": "\"Phil brought immense joy to everyone around him and leaves behind a legacy of music and love,\" a statement announcing his death reads.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "ESPN’s Stephen A. Smith Rips Sean Hannity In Interview About Harris-Trump Race",
        "description": "The two top broadcast personalities locked horns over the GOP candidate's cognitive abilities, Harris' honesty and who the sports journalist will ultimately vote for this year on Fox News Thursday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Nicole Scherzinger, Who Helped Form One Direction on ‘X Factor’, Pays Tribute to Liam Payne: “So Hard to Process”",
        "description": "The former Pussycat Dolls singer is credited as being responsible for the formation of the best-selling band during the 2010 season of 'The X Factor' alongside Simon Cowell.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Luther Vandross’ Cover of The Beatles’ “Michelle” Released: “Another Classic Song Has Been Lutherized!”",
        "description": "The release coincides with the documentary 'Luther: Never Too Much,' which opens in select cities on Nov. 1. The 'Never Too Much: Greatest Hits' album is out on Dec. 13.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Charlamagne tha God Slams CNN for “Bullsh**” Trump Coverage: “Nobody’s Had an Honest Conversation About Donald Trump Since 2016”",
        "description": "The podcaster and radio host also excoriated what he saw as the media's double standards and failure to convey the true danger of Trump's rhetoric.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Billie Eilish and Mother’s Org Support+Feed Announce Overheated Sustainability Event in Atlanta",
        "description": "Previously a U.K. event, Overheated now heads back across the pond with Eilish in tow.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Kim Kardashian Reacts to L.A. District Attorney’s Call for Menendez Brothers’ Resentencing",
        "description": "'Monsters' star Cooper Koch also wrote that the \"recommendation has ignited a renewed sense of possibility that Lyle and Erik could finally be released after decades behind bars.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "K-Pop Group Kiss of Life on New EP ‘Lose Yourself,’ Meeting Fans on Tour: “I Feel Like I’m Going to Cry”",
        "description": "The four-piece girl group chats with The Hollywood Reporter about exploring different genres and finding success as an artist from a smaller agency: \"If you put in the effort, nothing is impossible.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Tim Burton on Why He Tries “to Avoid” the Internet",
        "description": "The 'Beetlejuice Beetlejuice' filmmaker said, \"Anybody who knows me knows I'm a bit of a technophobe.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "Edd Griles, Director of Cyndi Lauper’s “Girls Just Want to Have Fun” Music Video, Dies at 78",
        "description": "Instrumental in getting the wrestler Captain Lou Albano on board, he also helmed videos for Huey Lewis and the News, Eddie Murphy and Lee Greenwood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-26T07:21:49.400837"
    },
    {
        "title": "’Winx-like’ Cox Plate insanity stuns Australia",
        "description": "Via Sistina has romped to a record victory in the 2024 Cox Plate but it’s just part of the story after a nightmare start to the week.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Ex-international footballer dead at 35",
        "description": "Tributes have flowed from across the football world after a former Olympian and international star died suddenly at the age of 35.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "‘Balled out’: Giddey changes NBA’s tune",
        "description": "It’s still very much a work in progress but Josh Giddey gave Chicago Bulls fans a glimpse of what they can expect from the Aussie star.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Verstappen rocked by ‘disturbing’ F1 drama",
        "description": "Three-time world champion and series leader Verstappen failed to clock a flying lap time after struggling with a major drama in Mexico.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "‘Best quarter ever played in a final’: Davis’ 2005 heroics recalled",
        "description": "Sydney’s drought-breaking premiership never would have happened without 20 of the best individual minutes ever played in an AFL final. Paul Roos reflects on Nick Davis’ heroics on the SACKED podcast.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Historic draft haul to be late recruiting guru’s Punt Road legacy",
        "description": "Richmond will lean on its list boss and the man who recruited Dustin Martin to spearhead planning for next month’s pivotal draft following the tragic death of recruiting guru Chris Toce.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Legend stunned as Broncos ‘sack Santa Claus’",
        "description": "Broncos legend Wally Lewis has revealed his shock after news dropped of a Brisbane axing that felt like ‘sacking Santa Claus’.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Hunt’s Kyle dig angered Dragons coach",
        "description": "Shane Flanagan has labelled Ben Hunt’s sly dig “a little bit frustrating”, with the Red V coach opening up on his halfback’s contract saga.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Two big omissions as India names squad for Australia Tests",
        "description": "Injured pace bowler Mohammed Shami will miss India’s tour of Australia next month with three uncapped players named in the squad on Friday.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "India cops huge blow for Australia tour",
        "description": "India has suffered a huge setback with a star player unavailable for the highly-anticipated tour of Australia this summer.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Tennis bad boy nearing shock Aus return",
        "description": "He’s been forgotten and virtually disowned in Australian tennis circles, but Bernard Tomic has quietly been improving his ranking.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Tennis stars hit out: ‘Stop ruining the sport’",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Supreme Waters stuns in clinical Gold Coast win",
        "description": "Cam Waters has produced a sensational drive at the unforgiving Surfers Paradise street circuit, converting pole position into victory in race 21 of the Supercars season.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Fans say same thing as Daniel breaks silence",
        "description": "Daniel Ricciardo may not have an F1 seat any more but the Aussie has once again shown he’s still one of the sport’s biggest names.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Brutal sledge as Raygun shows off new look",
        "description": "Raygun has opened up about the emotional toll the Olympic breakdancing saga took on here, and one thing her critics need to get over.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "‘Went crazy’: Aussie golden girl’s sad reveal",
        "description": "Aussie swimming star Ariarne Titmus has opened up on a major health scare, revealing she would give up her Olympic medals for one thing.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "‘Balled out’: Giddey changes NBA’s tune",
        "description": "It’s still very much a work in progress but Josh Giddey gave Chicago Bulls fans a glimpse of what they can expect from the Aussie star.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Brutal NBA scenes rock Giddey in Bulls debut",
        "description": "Josh Giddey’s debut for the Chicago Bulls has not gone to plan after the Aussie star was stunned by the scenes in New Orleans.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Ex-international footballer dead at 35",
        "description": "Tributes have flowed from across the football world after a former Olympian and international star died suddenly at the age of 35.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Youngsters crucial to Adelaide hopes",
        "description": "Adelaide United coach Carl Veart has made it ‘very clear’ to club officials about the quality of players he would like to be able to lure to the Reds.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "The Greg Inglis ‘insult’ that motivates Rob Whittaker",
        "description": "Rob Whittaker and his coach Alex Prates share a unique bond, yet Prates’ comparison of him to an NRL great still manages to raise the ire of the UFC star.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Mountcastle storms to top of the Webex Players Series leaderboard",
        "description": "Another day, another course record at Willunga as New Zealander Kerry Mountcastle stormed to the top the leaderboard of the Webex players Series event in South Australia.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Kings upset in Perth while 36ers mount epic comeback",
        "description": "The Sydney Kings went down to a Keanu Pinder led Wildcats in Perth while in Cairns, 36ers star Montrezl Harrell produced one of the most dominant performances in recent NBL history to help his team across the line.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "NRL convert in shock Wallabies call",
        "description": "His last game was in an NRL final and now Joseph-Aukuso Suaalii is set to play his next match as a Wallaby in the UK after a rapid elevation and confirmation he’s not going to England just for a ride.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "’Winx-like’ Cox Plate insanity stuns Australia",
        "description": "Via Sistina has romped to a record victory in the 2024 Cox Plate but it’s just part of the story after a nightmare start to the week.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    },
    {
        "title": "Second tragedy hits Olympian icon after reveal",
        "description": "After dropping heartbreaking news about his terminal diagnosis, Sir Chris Hoy has gone public with his family’s second secret tragedy.",
        "source": "News AU",
        "fetched_date": "2024-10-26T07:21:50.928250"
    }
]