[
    {
        "title": "Executive order delaying TikTok ban gets Trump sign-off",
        "description": "The order was among a slew of directives Trump signed on Monday evening.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Canada avoids Trump's tariffs - for now",
        "description": "President Donald Trump stopped short of imposing tariffs on Canada on day one but said they may come as soon as 1 February.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Melania Trump launches her own cryptocurrency",
        "description": "$Melania is announced after President-elect Donald Trump launched his own cryptocurrency, $Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Working from home 'not proper work' - ex-Asda boss",
        "description": "Lord Rose says it harms productivity but expert says hybrid work can be as good as full-time in the office.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Canada avoids Trump's tariffs - for now",
        "description": "President Donald Trump stopped short of imposing tariffs on Canada on day one but said they may come as soon as 1 February.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Stock markets cautious as Trump signals new tariffs",
        "description": "The US president said he is considering imposing new tariffs on Canada and Mexico from 1 February.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Inside Iceland's futuristic farm growing algae for food",
        "description": "Next to a geothermal plant in Iceland a start-up is growing microalgae for food.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Panama rejects Trump vow to 'take back' Panama Canal",
        "description": "Donald Trump claims China is operating the key US trade route but Panama says it belongs to them.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Why is TikTok back after being banned for one day?",
        "description": "What happens to TikTok in the US now that Donald Trump becomes president?",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Shein backlash fails to deter shoppers: 'I spend £20 a month'",
        "description": "Some young shoppers will continue to buy from the fast fashion giant despite concerns over how workers are treated.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Bank performance signals boost to US economy - 16 Jan 2025",
        "description": "Jason Betz from Ameriprise Financial says that there is untapped resilience in the American economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "TikTok restores service in US after Trump pledge",
        "description": "TikTok is resuming services to its 170 million users in US after President-elect Donald Trump said he would give the app a reprieve.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Trump launches cryptocurrency with price rocketing",
        "description": "Hours after its launch, the value of the coins for $Trump reached nearly $5.5bn (£4.5bn).",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Toyota unit to settle emissions scandal for $1.6bn",
        "description": "The truck company will also be banned from importing its diesel engines into the US for five years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Has Trump promised too much on US economy?",
        "description": "He won the election partly to fix inflation but Trump may find his pledges on prices and tariffs conflict, say experts.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Mark Carney, the 'unreliable boyfriend' who ran UK's central bank",
        "description": "Carney is now running for the Liberal Party leadership in Canada. What does his time in London tell us?",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "US Supreme Court upholds TikTok ban law",
        "description": "A law passed last year requires TikTok's Chinese parent company to sell the video platform or face a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "TikTok says it will 'go dark' on Sunday without US government action",
        "description": "The Supreme Court earlier upheld a law that would ban the video app in the US unless its Chinese parent-company sells it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Al Fayed claimed 'poor health' when police investigated abuse",
        "description": "Pelham Spong reported to police in 2017 that Mohammed Al Fayed had assaulted her a decade before but the investigation was shut down.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "IMF warns on Trump's plans but upgrades UK outlook",
        "description": "Trump's policies could benefit the US, but not the rest of the world, the IMF says",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "US grounds SpaceX's Starship after test flight explosion",
        "description": "The rocket's upper stage disintegrated over the Caribbean, forcing airline flights to alter course.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Americans and Chinese share jokes on 'alternative TikTok' as US ban looms",
        "description": "RedNote's Chinese users say it is the first time they have been able to speak directly to Americans online.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Three reasons Trump tariffs aren't China's only problem",
        "description": "China's economy has hit the government's 5% growth target for 2024 in the face of multiple challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Apple suspends error-strewn AI generated news alerts",
        "description": "The tech giant was facing pressure to pull the feature after it made repeated mistakes summarising headlines.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "US FDA officially authorises Zyn nicotine pouches for sale",
        "description": "The pouches are used by less than 2% of US teens, the FDA said in granting the application allowing them to continue to be sold.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Global growth forecast to flatline as tariffs add to strains",
        "description": "The World Bank predicts global economic growth of 2.7% this year amid concerns living standards will struggle to improve.",
        "source": "BBC Business",
        "fetched_date": "2025-01-21T07:22:36.159603"
    },
    {
        "title": "Cecile Richards, Former Planned Parenthood President, Women’s Rights Activist, Dies at 67",
        "description": "The daughter of the late Texas Gov. Ann Richards, had glioblastoma, an aggressive form of brain cancer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Trump Inauguration’s Surprise Celebrities: Joe Rogan, Logan Paul, More",
        "description": "Donald Trump's second inauguration included several celebrities in attendance who weren't announced in advance.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "After Tech Issues, Carrie Underwood Performs A Cappella at Inauguration Ceremony",
        "description": "The audience, including outgoing President Biden and Vice President Kamala Harris, sang along with country singer for her performance of “America the Beautiful” during Trump’s inauguration ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Nina Dobrev Says She Has Survivor’s Guilt After House Near L.A. Fires “Made It”",
        "description": "The actress revealed she had to evacuate her home on her Jan. 9 birthday and urged people to donate and help those affected by the wildfires as her \"birthday wish.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "First Responders Get the Star Treatment at Chateau Marmont",
        "description": "Plus, Matthew Perry’s Palisades home miraculously survives and a burning AI Oscar fools Isabella Rossellini.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Melania Trump Draws Carmen Sandiego Comparisons With Inauguration Outfit",
        "description": "The First Lady's inauguration outfit has everybody on social media making the same joke.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Donald Trump Promises Sweeping Change, Rips Biden Administration in Inaugural Address",
        "description": "With temperatures reaching a high of 24 degrees in Washington, D.C., Trump's political comeback was cemented inside the Capitol Rotunda, with a reduced audience.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Biden, in Final Act in Office, Pardons His Family Due to “Unrelenting Attacks” From Trump and Allies",
        "description": "Biden also issued pardons to Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol in his final hours to guard against potential “revenge” by the incoming Trump administration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Iranian Pop Star Tataloo Sentenced to Death for “Blasphemy” (Reports)",
        "description": "Iranian media is reporting that Iran's Supreme Court has sentenced the musician to death for insulting the Prophet Muhammad.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Chappell Roan: “I’d Be More Successful If I Was OK Wearing a Muzzle”",
        "description": "\"If I were to override more of my basic instincts, I would be bigger. I would be way bigger…. And I would still be on tour right now,\" the pop star said about being dubbed a diva in the music industry.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Olivia Rodrigo, Billie Eilish, Lady Gaga, Jelly Roll to Perform at FireAid Benefit Concert for L.A. Wildfire Victims",
        "description": "Tate McRae, No Doubt, Katy Perry, Alanis Morissette, Anderson .Paak, Dawes, Graham Nash, John Fogerty, Peso Pluma, Stevie Wonder and the Black Crowes are also set to take the stage for the benefit show, with John Mayer and Dave Matthews performing together for the first time.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Three Israeli Hostages Arrive in Israel as Fragile Ceasefire Passes First Hurdle; 90 Palestinian Prisoners and Detainees Released by Israel",
        "description": "In Tel Aviv, thousands of people gathered to watch the news on large screens erupted in cheers. In the Israeli-occupied West Bank, families and friends had gathered excitedly as cars honked and people waved the Palestinian flag.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-21T07:22:37.069483"
    },
    {
        "title": "Eddie McGuire’s son does the unthinkable",
        "description": "Joe McGuire, the son of broadcaster Eddie, has won an all-Aussie punting duel in a performance few would have seen coming.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Quite remarkable’ young star’s leadership rise",
        "description": "A young star has been elevated to a significant leadership position at North Melbourne who will have a solo skipper in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Reds eyeing more Dutch delight",
        "description": "Adelaide United wants to further its hopes of winning the A-League title by adding another Dutch defender to its ranks.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "New age Warner message driving finals run",
        "description": "The two teams who have catapulted themselves into the Big Bash finals have one very big thing in common.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "New age Warner message driving finals run",
        "description": "The two teams who have catapulted themselves into the Big Bash finals have one very big thing in common.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Nothing’: Rookie waits for word on Test debut",
        "description": "Steve Smith is on his way to the Australian team camp in Dubai where a 21-year-old all-rounder is waiting to learn if he’ll be making his Test debut in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Bomb drops as off-camera moment revealed",
        "description": "There has been a huge twist in the Australian Open’s Novak Djokovic problem with word about an off-camera moment leaking out.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Buddy, it’s a feather’: Tempers flare over let calls",
        "description": "Tommy Paul and Alexander Zverev have both blown up on Rod Laver Arena over umpire calls at key moments, with Zverev livid over a feather. FOLLOW DAY 10 LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Quite remarkable’ young star’s leadership rise",
        "description": "A young star has been elevated to a significant leadership position at North Melbourne who will have a solo skipper in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Bulldogs explain No.1 pick’s absence",
        "description": "A star forward has been mysteriously absent from pre-season training sessions, and the Western Bulldogs have given an update.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "SuperCoach is back with extra features and new FLEX position",
        "description": "Welcome to the best season of NRL SuperCoach yet, featuring a host of game improvements and the biggest rule change in years.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Carney, reality TV star married in style",
        "description": "Former NRL bad boy Todd Carney and MAFS contestant Susie Bradley have dropped the first photos of their glitzy wedding day.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Pit of piranhas’: World title chase stirs Sally",
        "description": "Sally Fitzgibbons has been close to a world title in a rollercoaster career and the energetic Aussie can’t get enough of the ride as a 16th campaign begins.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "’Scares me most’: Shayna Jack’s biggest fear",
        "description": "Olympian Shayna Jack has endured a horror past five years with the swimmer revealing what terrifies her more than anything.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Eddie McGuire’s son does the unthinkable",
        "description": "Joe McGuire, the son of broadcaster Eddie, has won an all-Aussie punting duel in a performance few would have seen coming.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Disgusting’: US turns on NFL’s golden child",
        "description": "NFL fans have turned on Patrick Mahomes after the superstar quarterback was at the centre of some fiery playoffs controversy.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Reds eyeing more Dutch delight",
        "description": "Adelaide United wants to further its hopes of winning the A-League title by adding another Dutch defender to its ranks.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Socceroo to join exodus to UK club",
        "description": "Another talented young Australian player is set to join English Championship club Portsmouth.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "History made as champ stuns UFC world",
        "description": "Two champions have cemented their place among the greats with displays left that jaws on the floor across the entire UFC world.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Dream of racing in red’: Hamilton era begins at Ferrari",
        "description": "Lewis Hamilton has said he will bring everything to delivering first Ferrari championship since 2007 as he declares he always dreamed of racing in the iconic red of the Italian team.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "F1 star’s $4m Ferrari smashed",
        "description": "A quick test drive in Monaco turned disastrous for one of the biggest names in Formula 1.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "‘Car crash’ that broke Simmons – and how he can get back",
        "description": "Make no mistake, Ben Simmons was worth the hype; a genuine superstar of the NBA with an unbelievable ceiling. In a single moment, everything changed.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Day’s drive clear after costly final-hole blunder",
        "description": "Jason Day cost himself an extra six-figures with a final-hole fade-out in California but still made a tidy sum for his podium finish.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Kensington preview: Pride in pursuit of double",
        "description": "With luck in running trainer Joe Pride holds high hopes of snaring a winning double at the Randwick Kensington meeting on Wednesday.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Wallabies star confident of securing new deal",
        "description": "A leading Wallaby is yet to secure his future beyond this year, but he seems anything but concerned about it.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    },
    {
        "title": "Fan hospitalised in ‘awful, freak accident’",
        "description": "A devastating crash has marred Saturday’s Tour Down Under, leaving a fan hospitalized with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-01-21T07:22:39.165706"
    }
]