[
    {
        "title": "China announces retaliatory action as Trump tariffs take effect",
        "description": "China's tariffs on US goods, due to begin on Monday, include 15% on coal and 10% on crude oil and pick-up trucks.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Who won and lost as Trump's trade war is delayed - for now",
        "description": "BBC reporters in the US, Canada and Mexico assess the fallout after Trump gets border promises in return for a 30-day pause on tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "US and Mexico reach deal to put tariffs on hold - for now",
        "description": "A trade war between the US and Mexico has been temporarily averted after the two sides agreed a deal.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Ontario ends contract with Musk's Starlink over US tariffs",
        "description": "It is part of Canada's response to sweeping tariffs levied by US President Donald Trump on its imports.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Who won and lost as Trump's trade war is delayed - for now",
        "description": "BBC reporters in the US, Canada and Mexico assess the fallout after Trump gets border promises in return for a 30-day pause on tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Trump sows uncertainty - and Xi Jinping sees an opportunity",
        "description": "President Xi Jinping has made no secret of his ambition for China to lead an alternate world order.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "US sovereign wealth fund could buy TikTok, Trump says",
        "description": "The president has kickstarted the creation of a national fund, which he says could buy the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Share falls ease after Trump tariff turmoil",
        "description": "US shares regained some ground after falling sharply in early trade as Trump paused tariffs on Mexico and Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "How world responds to Trump's tariffs is what matters next",
        "description": "Retaliatory taxes against the US by other nations could lead global trade into uncharted territory.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Tax relief for Indian middle class - but will it boost economy?",
        "description": "The finance minister announced steps to tackle slowing growth, rising prices and low middle-class consumption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Tariffs 'bound to have a negative impact' - 3 Feb 2025",
        "description": "Matt Rowe from Nomura Capital Management says impact on markets depends on how long the tariffs are maintained.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Six things that could get more expensive for Americans under Trump tariffs",
        "description": "Economists warn that the introduction of tariffs could lead to prices rising on a wide range of products.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "UK not choosing between US and EU, says Starmer",
        "description": "US President Donald Trump threatens EU with trade taxes but hints he could reach a deal with the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "What are tariffs and will prices rise?",
        "description": "The cost of cars, fruit and pharmaceuticals could increase because of Trump's tariff announcement.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Bill Gates: We've given away $100bn, but my children won't be poor when I'm gone",
        "description": "The Microsoft co-founder says he enjoys giving away his fortune and it won't leave his kids poor.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Chinese fashion giant Shein re-enters India five years after ban",
        "description": "Shein's re-entry to the Indian market comes with strict terms, which include saving all data within the country.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "EU tariffs 'pretty soon' but UK can be worked out - Trump",
        "description": "Trump accuses the EU of taking advantage of the US but says UK PM Starmer has been \"very nice\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Canadian fans boo US anthem as tariffs spur 'buy local' pledge",
        "description": "Canadians have begun booing the US anthem at sports games, signalling the depth of anger at steep tariffs issued by Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Thames Water seeks court approval for emergency cash",
        "description": "Thames Water is hoping to secure an emergency cash injection or face runing out of money in weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Musk team given access to sensitive federal payment system - reports",
        "description": "The Trump administration grants Musk's team access to system that controls the flow of trillions of dollars in funds, US media report.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Canada imposes 25% tariffs in trade war with US",
        "description": "Canada announces retaliatory tariffs against the US, in a move that is likely to be costly for both nations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Barclays working to update account balances after tech outage",
        "description": "The bank says a technical issue, which began on Friday and impacted the its app, online banking and payments, has been resolved.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "'Is it for a day or four years?': Tariff uncertainty spooks small businesses",
        "description": "Entrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Davey urges Starmer to start EU customs union talks",
        "description": "Sir Ed Davey calls for PM to use meeting with EU leaders to \"fire the starting gun\" on new trade deal.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Why Dynasty Warriors makers scrapped sequel to reinvent series",
        "description": "Tomohiko Sho says the unreleased game was something fans were 'starting to get a bit bored of'.",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Take-off or bail out? The airport even Ryanair thinks is a tough sell",
        "description": "After Rachel Reeves pledges her support, is Doncaster Sheffield Airport clear for take-off?",
        "source": "BBC Business",
        "fetched_date": "2025-02-04T07:22:51.836833"
    },
    {
        "title": "Janelle Monáe Says “F*** You Nelly” for Singer’s Trump Inauguration Performance: “You Sold Out”",
        "description": "Monáe rapped her comments during a Grammys afterparty, where she sang a cover of Nelly’s “Hot in Herre.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Lil Nas X Joins Crush Music Management Roster",
        "description": "The chart-topping rapper was previously signed to Adam Leber’s Rebel Management.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Grammys 2025: Inside the Star-Studded Parties and Events",
        "description": "Though many of the celebrations surrounding music's biggest night were canceled following the L.A. fires, there was still plenty of activity around Grammys weekend.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Taylor Swift’s Epic Night, Beyoncé’s A-List Cheering Squad and Chappell Roan Takes a Tumble: 17 Things the Grammy Cameras Missed",
        "description": "Take a peek inside Crypto.Com Arena during Sunday night's ceremony to see all the celebrity interactions that the broadcast cameras didn't catch during the star-studded show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Kendrick Lamar Dominated Grammys With “Not Like Us,” Cementing His Place as West Coast Royalty",
        "description": "L.A.’s native son swept five awards with his 2024 anthem, celebrating his unmatched ability to bridge artistry, commercial success and cultural commentary.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Beyoncé Announces Cowboy Carter Tour Dates After Grammys Big Night",
        "description": "The singer-songwriter had a record-breaking night at the 2025 Grammys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Grammys Snubs and Surprises: Billie Eilish and Taylor Swift Shut Out as Bradley Cooper’s ‘Maestro’ Wins",
        "description": "Other notable snubs include Post Malone failing to win an award this year despite seven nominations and Charli XCX winning only three awards, all presented in the Premiere Ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Sabrina Carpenter Scores Two Wins During Charismatic Grammy Debut",
        "description": "The ‘Short n’ Sweet’ singer, who had one of the biggest years musically in 2024, cemented her status as a pop superstar during the 2025 Grammys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Most Memorable Grammy Moments, From Beyoncé’s Historic Wins to L.A. Wildfire Tributes to Kanye West’s Shocking Red Carpet Moment",
        "description": "From Lady Gaga and Bruno Mars' beautiful tribute to Los Angeles following the devastating wildfires to The Weeknd's surprise performance, here are some of the night's highlights.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Charli XCX Goes Full ‘Brat’ Alongside Julia Fox and Alex Consani During Debut Grammys Performance",
        "description": "The British pop star won her first Grammys award earlier in the night for best pop dance recording with “Von Dutch,” best dance/electronic album and best recording package with ‘Brat.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Grammys: Reporter Apologizes for Disrespectful Babyface Interview",
        "description": "A red carpet interview between the 13-time winner and journalists from the Associated Press went viral for all of the wrong reasons Sunday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "Beyoncé Wins Album of the Year for First Time at 2025 Grammy Awards",
        "description": "The award, presented by the Los Angeles Fire Department, ended the singer’s long-running streak as the most nominated female artist without a win in the category.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-04T07:22:52.205486"
    },
    {
        "title": "NRL’s big call on rule changes for new season",
        "description": "Given the chance to introduce rule changes around sin-bins for head injuries the NRL has decided to have a look first.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Star’s shock death at 40 rocks AFL world",
        "description": "The shock death of AFL player and coach Troy Selwood has left the football community broken hearted with tributes pouring in.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Kerr question Matildas coach won’t answer",
        "description": "The interim Matildas coach was peppered with questions about Sam Kerr and her future on Tuesday and didn’t have a lot of answers.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Stars everywhere in NRL teams for pre-season games",
        "description": "Everything in the world feels right again with the release of the first team list Tuesday of the season ahead of two key matches this weekend.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Star’s plea for more after award glory",
        "description": "After being crowned the best player in the country days after making history at the MCG, Annabel Sutherland says her all-conquering Australian team deserves more respect.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "More calls for Aussie star to be sent home",
        "description": "Calls are growing louder for Sam Konstas to return to Australia to play in the Sheffield Shield, with the teen star set to miss out on the second Test squad.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "‘Villain’: Star smacks butt in Australia’s face",
        "description": "Tennis star Danielle Collins has chosen not to forgive and forget Australia after the nation turned on her in Melbourne.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Tennis in uproar over ‘unbelievable scenes’",
        "description": "The tennis world has been left gobsmacked after a rogue shoulder charge celebration took out a player in wild scenes at the Davis Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Star’s shock death at 40 rocks AFL world",
        "description": "The shock death of AFL player and coach Troy Selwood has left the football community broken hearted with tributes pouring in.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "‘It’s massive’: Blues’ worst nightmare drops",
        "description": "A rival club is reportedly preparing a plot to make a Carlton star the highest-paid player in Australian football history.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "NRL’s big call on rule changes for new season",
        "description": "Given the chance to introduce rule changes around sin-bins for head injuries the NRL has decided to have a look first.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Stars everywhere in NRL teams for pre-season games",
        "description": "Everything in the world feels right again with the release of the first team list Tuesday of the season ahead of two key matches this weekend.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "All-Stars dealt in more NBA trade drama",
        "description": "A day after perhaps the biggest NBA trade of all time, another mega-deal has been done, seeing two All-Stars swap teams.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Text message says it all in NBA bombshell",
        "description": "The NBA is in meltdown over one of the biggest trades in basketball history — and the cloak-and-dagger deal has sparked bombshell rumours.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Kerr question Matildas coach won’t answer",
        "description": "The interim Matildas coach was peppered with questions about Sam Kerr and her future on Tuesday and didn’t have a lot of answers.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Matildas call on fresh blood amid star’s extended mystery absence",
        "description": "Interim Matildas coach Tom Sermanni has named his SheBelieves Cup squad – bringing a fresh face into the mix amid Cortnee Vine’s continued unexplained absence.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "UFC boss Dana White en route to Sydney",
        "description": "UFC president Dana White is expected to touch down in Sydney this afternoon ahead of the city’s UFC 312 pay per view event.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Supercars team owner airborne in terrifying Bathurst crash",
        "description": "Supercars team owner Stephen Grove has been hospitalised after a scary airborne crash at the top of Mount Panorama in the Bathurst 12 Hour.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "All-Stars dealt in more NBA trade drama",
        "description": "A day after perhaps the biggest NBA trade of all time, another mega-deal has been done, seeing two All-Stars swap teams.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "LPGA winner’s plan to honour idol and snare Aussie title",
        "description": "Australian LPGA winner Grace Kim has opened up on the pressure to achieve the WPGA Championship on home soil, as she strives to honour her idol, golfing icon Karrie Webb.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Warwick Farm preview: Smith can get off to Flyer",
        "description": "An exciting filly from the Matthew Smith stable can take the next stwp towards a stakes race with a win at Warwick Farm on Wednesday where she is the $1.50 favourite.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Tahs suffer early Suaalii blow with injury icing debut",
        "description": "Superstar Joseph-Aukuso Suaalii’s hotly anticipated debut in the NSW Waratahs jersey has been cruelled by an injury.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Wallabies grudge match secured with Jones’ Japan",
        "description": "He left the Wallabies after a horror World Cup campaign to take a job in Japan some say he’d already lined up and now Eddie Jones will have to coach against his former players.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    },
    {
        "title": "Anna Kournikova went from star to recluse",
        "description": "The Russian beauty had a cocktail and even computer virus named after her at height of fame before her horror stalking ordeal.",
        "source": "News AU",
        "fetched_date": "2025-02-04T07:22:55.646477"
    }
]