[
    {
        "title": "Multi-billion dollar Honda-Nissan merger talks collapse",
        "description": "The Japanese car making giants aimed to combine their businesses to compete against Chinese rivals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Trump moves to close entries to government worker buyout programme",
        "description": "About 75,000 government employees have reportedly opted into the programme, which is designed to shrink the workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Is it checkmate for South Africa after Trump aid freeze?",
        "description": "The US president is ratcheting up pressure on South Africa over its domestic and foreign policy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Canada leaders take push against tariffs to White House",
        "description": "All 13 of Canada's provincial and territorial leaders were in the US capital as the country seeks to avoid punitive trade tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Trump moves to close entries to government worker buyout programme",
        "description": "About 75,000 government employees have reportedly opted into the programme, which is designed to shrink the workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "'On a power trip' or 'obviously brilliant'? Americans weigh Musk's influence",
        "description": "The world's richest man is leading a sweeping cost-cutting drive. What do voters in a key swing state make of his role?",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Erasing Escobar: Will Colombia ban the sale of memorabilia of the drug lord?",
        "description": "Politicians in the country want to prohibit the sale of such items, but they face opposition.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "US inflation unexpectedly increases",
        "description": "US inflation increased by more than expected last month, pushing up the cost of living for Americans.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Why India fails to protect its domestic workers despite decades of abuse",
        "description": "Despite the high demand for domestic workers, they remain India's most vulnerable and exploited people.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Three American goods that could rise in price due to metal tariffs",
        "description": "Donald Trump's plans for tariffs risk raising prices for items from cars to canned food.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Ex-Google boss fears AI could be used by terrorists",
        "description": "Eric Schmidt says AI technology could \"harm innocent people\" if it ends up in the wrong hands.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Santorini fears for summer tourist season as earthquakes hit island",
        "description": "The Greek island's most important industry will bounce back, but staffing is a worry say hoteliers",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Chevron to cut as much as 20% of workforce",
        "description": "Chevron said the move was part of a wider cost-cutting effort, which will see it expand automation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Elon Musk denies 'hostile takeover' of government in surprise White House appearance",
        "description": "The world's richest man took questions for the first time since he was appointed to lead a sweeping government cost-cutting effort.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Coca-Cola says it may use more plastic due to Trump tariffs",
        "description": "Beverage giant's boss says his company may need to action if aluminium cans become more expensive.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Goldman axes diversity rule that has 'served purpose'",
        "description": "The bank ditches a policy that stopped it acting on flotations for firms with an all male, all white board.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Amazon bans number plates as illegal supply found",
        "description": "A BBC investigation finds seven companies on the platform selling plates without checking customers' documents.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Oil clean-up 'scam' warnings ignored by Shell, whistleblower tells BBC",
        "description": "The oil giant faces allegations it ignored warnings that a clean-up scheme was beset by corruption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Trade, tariffs and visas to dominate Trump-Modi talks",
        "description": "The leaders share a warm relationship, but both will have their own wish list when they meet this week.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Germany's once-mighty car industry is in crisis. What will it take to fix it?",
        "description": "With the economy a key factor in German elections this month, can the auto sector get back on the road to recovery?",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Law firm restricts AI after 'significant' staff use",
        "description": "The chief technology officer of Hill Dickinson warned of the use of AI tools.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Heathrow expects third runway take offs in 10 years",
        "description": "The chief executive of the UK's largest airport will unveil plans to develop terminals two and five.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "UK and US refuse to sign international AI declaration",
        "description": "It follows a warning from US Vice-President JD Vance that excessive regulation could \"kill a transformative industry.\"",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Trump halts prosecution of firms accused of bribery abroad",
        "description": "Trump has paused enforcement of an anti-corruption law, saying it \"overreached\" and stopped US firms from winning business overseas.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Canada vows swift retaliation to 'unjustified' Trump tariffs",
        "description": "As top exporter of steel and aluminium to the US, Canada sees new trade barriers as a threat to its economy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-13T07:22:51.099496"
    },
    {
        "title": "Ben Folds Resigns as Artistic Director of NSO After Trump Move to Replace Leadership",
        "description": "On Wednesday, Trump posted on Truth Social that he had been elected chair of the Kennedy Center. President Deborah F. Rutter has also departed the institution, as has Renée Fleming and Shonda Rhimes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Grimes Speaks Out After Ex-Partner Elon Musk Brings Their Son to Oval Office Press Conference",
        "description": "The 4-year-old made for an adorable distraction as the DOGE hatchet man spoke of deep cuts across the government.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Naya Rivera’s Ex Shares Her Final Moments Recalled by Their Son",
        "description": "\"It just rocks my world that he had to witness her last moments,\" Ryan Dorsey said of their son, who was with Rivera before she drowned while swimming in Lake Piru.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "The Social Stars Who Broke Out During Trump’s First Term Return for an Encore None of Them Wanted",
        "description": "Sarah Cooper, Randy Rainbow and other jesters who came to fame during Trump 1.0 explain why they can’t quit him, even if they desperately want to: “It’s hard to take our nation as seriously after re-electing him.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Elizabeth Holmes, Speaking in Prison Interview, Says She Wants to Continue a Health Care Technology Career",
        "description": "\"I refused to plead guilty to crimes I did not commit. Theranos failed. But failure is not fraud,\" she said in a new interview, her first from prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Celebrities Protest Kanye West in Fake AI Video; Scarlett Johansson Makes Statement",
        "description": "Celebrities — including David Schwimmer, Steven Spielberg, Jerry Seinfeld, Adam Sandler and Sacha Baron Cohen — are depicted giving Kanye the finger, while the real Johansson pushes back against the viral deepfake.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Mariah Carey, Oasis, Outkast, The White Stripes Among 2025 Rock & Roll Hall of Fame Nominees",
        "description": "Cyndi Lauper, Soundgarden, The Black Crowes and Joy Division/New Order also made the list of 14 performer nominees.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "David Johansen’s Cancer Treatment Fundraiser Lists Donations by Martin Scorsese, Colin Jost, More",
        "description": "Donors to the Sweet Relief fund also include Sony Music’s Rob Stringer, Pearl Jam’s Mike McCready and the George Lopez Foundation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "LA Opera’s 40th Season Will Begin With ‘West Side Story’",
        "description": "James Conlon will conduct that classic as well as productions of ‘Falstaff’ and ‘The Magic Flute’ as he concludes his 20-year run as music director.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Armie Hammer Says He Once Took “a Bite Out” of an Animal’s Heart During Hunting Trip",
        "description": "The actor, who has faced previous allegations of cannibalistic fantasies, said it was a \"tradition.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Jennie Garth Opens Up About How She Reconnected With Ex Peter Facinelli",
        "description": "Last month, Garth, her daughters and husband stayed at Facinelli's home to find safety from the L.A. wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "Liam Payne’s Ex-Fiancée Speaks Out as One Direction Singer’s Final Days Are Detailed in Rolling Stone",
        "description": "The international pop star struggled with demons, his sexuality and his stuttering career ahead of his death in Argentina last year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-13T07:22:52.013111"
    },
    {
        "title": "‘Fifth major’: Smith revels in Open change",
        "description": "His strong criticism helped prompt officials to dump a format players didn’t like and Cam Smith declared just what the Australian Open should now look like.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "NRL star tipped to follow Mailata’s footsteps",
        "description": "Jordan Mailata’s decision to quit the NRL for American football paid off big time – now the NFL has their eyes on another Aussie.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Everything you need to know about Matildas’ next tournament",
        "description": "The Matildas are loading up for the SheBelieves Cup – their biggest fixtures of the year. But who is playing? What is on the line? And what even is this tournament? Here’s everything you need to know.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Starc 2.0? Johnson’s hope for Champions Trophy",
        "description": "Spencer Johnson will step into Mitchell Starc’s shoes for the Champions Trophy and hopes to replicate the Australia champion’s impact.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Starc 2.0? Johnson’s hope for Champions Trophy",
        "description": "Spencer Johnson will step into Mitchell Starc’s shoes for the Champions Trophy and hopes to replicate the Australia champion’s impact.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "‘Substandard’: Factor holding BBL club back",
        "description": "Melbourne Renegades coach Cameron White says there’s a reason the franchise struggles to attract top talent, particularly batters.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Shock career move after star flees country",
        "description": "Italian tennis star Camila Giorgi has changed her career again after sensationally quitting tennis to become a lingerie model last year.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Tennis world loses it over de Minaur speech",
        "description": "Alex de Minaur lost the final, but won the crowd with a classy speech before he let slip a secret he had carried all week.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Larger-than-life AFL legend’s new role",
        "description": "A former AFL goalkicking guru has taken on a specialist coaching role to mentor the next wave of forwards.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Damning details of AFL GF review exposed",
        "description": "New Swans coach Dean Cox has lifted the lid on just how intense the club’s probe into their 2024 Grand Final humiliation really was.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "NRL star tipped to follow Mailata’s footsteps",
        "description": "Jordan Mailata’s decision to quit the NRL for American football paid off big time – now the NFL has their eyes on another Aussie.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Sleeping NRL giants wide awake",
        "description": "The Bulldogs ended their finals drought last season, but skipper Stephen Crichton says they’re driven to do even better in 2025.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "‘Expect greatness’: Simmons fired up for new start",
        "description": "After getting to work at his new NBA team, the Australian star says he’s ready to put years of frustration and disappointment behind him.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Aussies stunned by incredible Mailata photo",
        "description": "Jordan Mailata blew everyone away to make Australian sporting history — and now a photo has emerged that’s dropping jaws.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "‘F***ing scary’: How 34-min police tape changed my mind on Kerr",
        "description": "Listening to the full 34 minutes of Sam Kerr’s interaction with police — and the heart-sinking moment her voice breaks — changed my view completely, writes SAM SQUIERS.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Everything you need to know about Matildas’ next tournament",
        "description": "The Matildas are loading up for the SheBelieves Cup – their biggest fixtures of the year. But who is playing? What is on the line? And what even is this tournament? Here’s everything you need to know.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Olympics chaos as bombshell lawsuit drops",
        "description": "Imane Khelif has hit out after a bombshell lawsuit dropped regarding her controversial gold medal win at the Paris Games.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "‘Expect greatness’: Simmons fired up for new start",
        "description": "After getting to work at his new NBA team, the Australian star says he’s ready to put years of frustration and disappointment behind him.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "‘Fifth major’: Smith revels in Open change",
        "description": "His strong criticism helped prompt officials to dump a format players didn’t like and Cam Smith declared just what the Australian Open should now look like.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Canterbury, Tamworth previews: Pride’s high hopes for promising mare",
        "description": "Following a luckless run first-up. trainer Joe Pride of looking for Weeping Woman to get back to winning form at Canterbury.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Suaalii’s new position revealed ahead of Super Rugby opener",
        "description": "After missing NSW’s final trial match against the Brumbies a fortnight ago, Super Rugby’s highest-profile recruit has been given a positional switch for his Waratahs debut.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Reds primed for Super season",
        "description": "The Reds don’t want to waste their good work on a successful pre-season tour of the United Kingdom when they kick-off their Super Rugby Pacific season later this month.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-13T07:22:53.371262"
    }
]