[
    {
        "title": "‘I lost £165k to fraud in an hour’ - customers say they were let down by Revolut",
        "description": "There were more reports of fraud naming Revolut last year than any other financial institution, BBC finds.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Dreaming of diamonds: Generations dig for fortune in India's gem town",
        "description": "In Panna, families hunt for diamonds hoping to strike rich and escape the cycle of poverty.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Boeing to axe a tenth of its workers as strike continues",
        "description": "The company says all jobs are at risk as it cuts 10% of its workforce.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Meet the team paid to break into top-secret bases",
        "description": "Hear from the team who test security by breaking into secure military facilities.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Why global gaming hit's boss has a Brummie accent",
        "description": "The Chinese game sold more than 4.5 million copies within 24 hours.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Dreaming of diamonds: Generations dig for fortune in India's gem town",
        "description": "In Panna, families hunt for diamonds hoping to strike rich and escape the cycle of poverty.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "How Georgia is helping old US cars end up in Russia",
        "description": "The South Caucasus nation has a huge used car market, with many vehicles ending up in Russia.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Man's six-year hunt to expose Al Fayed abuse",
        "description": "Keaton Stone spent years compiling evidence after his fiancee told him she was a victim.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Video games industry is booming in Northern Ireland",
        "description": "According to NI Screen, there are about 40 gaming companies active in Northern Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Boeing to axe a tenth of its workers as strike continues",
        "description": "The company says all jobs are at risk as it cuts 10% of its workforce.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Tesla stock sell-off after robotaxi launch - 11 Oct 2024",
        "description": "The chair of the EV committee at Morningstar says it's less about the technology than the timing.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Trump electric vehicle attacks hit home for Michigan voters",
        "description": "Trump’s EV criticism is part of his broader economic message as he tries to appeal to voters in the key swing state.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Swing state voters bombarded with ads - will they make a difference?",
        "description": "Record sums are being spent on advertising in the US election - but will that make a difference?",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Forty new allegations against Al Fayed made to police",
        "description": "The Metropolitan Police had urged people to come forward with allegations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Tata leadership to remain in the family",
        "description": "Ratan Tata's half-brother Noel Tata is the new chairman of the influential Tata Trusts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Canada to cover cost of contraception and diabetes drugs",
        "description": "The government said it is the initial phase of a plan that would expand to become a publicly funded national programme.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "How China’s crackdown turned finance high-flyers into ‘rats’",
        "description": "Chinese authorities have been cracking down on businesses from real estate to technology to finance.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Tesla shares slide after Cybercab robotaxi revealed",
        "description": "Elon Musk revealed a prototype of the long-awaited robotaxi at a Hollywood film studio - but investors aren't wowed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "China detains iPhone maker workers in 'strange' case",
        "description": "The Taiwanese government suggested the detentions may be a case of \"abuse of power\" by Chinese police.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Starmer pledges to scrap red tape to boost UK investment",
        "description": "Some of the world's biggest firms have voiced confidence in the economy ahead of an investment summit.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Force says it is 'envy' of others on retail crime",
        "description": "Northamptonshire Police says it has seen increases in detection and charges for retail crime.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Mortgage costs 'unlikely' to return to low levels",
        "description": "The boss of the UK's biggest lender says mortgage costs are unlikely to fall to levels seen in the past decade.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "UK Budget rule change could mean fewer tax rises",
        "description": "Here is how the chancellor could choose to tweak the government's borrowing rules to free up more cash.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "P&O owner to attend summit despite row over UK minister's comments",
        "description": "It had been feared they might pull out after Transport Secretary Louise Haigh criticised the ferry firm and urged consumers to boycott the company.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Post Office scandal: Five things we learned from the boss",
        "description": "The quizzing of Post Office chief executive Nick Read this week produced some  key revelations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Talks over £1bn UK port expansion ongoing after row",
        "description": "Reports have suggested the plan was at risk after Transport Secretary Louise Haigh's comments.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Labour accused of 'riding roughshod' on solar farms",
        "description": "A council leader hits out after a project becomes the third to be unveiled in Norfolk recently.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "Firms 'pausing' hiring and investing ahead of UK government Budget",
        "description": "A leading business group says firms are delaying decisions, wanting \"more clarity\" over the government's policies.",
        "source": "BBC Business",
        "fetched_date": "2024-10-14T07:27:02.175438"
    },
    {
        "title": "The Blacklisting of a Great Artist: Paul Robeson’s Exile From Hollywood",
        "description": "A preeminent artist-activist of the mid-twentieth century, his banishment by the studios lasted longer than any other performer of the blacklist era — twenty-five years, ending only with his death.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Channing Dungey Praises Debra Lee for Shattering Barriers, Paving the Way for Women of Color in Media",
        "description": "The former BET CEO and Warner Bros. Motion Picture Group co-CEO Pamela Abdy were both honored at Big Brothers Big Sisters Los Angeles gala.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Toni Vaz, NAACP Image Awards Creator, Dies at 101",
        "description": "The trailblazer, who worked as an actress, stuntwoman and extra, appeared in more than 50 films and shows like 'The Singing Nun,' 'Tarzan, the Ape Man' and as Cicely Tyson's double in 'Mission: Impossible.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Harris-Walz Campaign Partners With Stars, Filmmakers and Former Presidents for Video Series",
        "description": "The series features Barack Obama, Bill Clinton, Doug Emhoff, Spike Lee, Stevie Wonder, Kerry Washington, Ava DuVernay, Eva Longoria, J.J. Abrams and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Nicky Hilton Blows Out Some Candles (And Sells Some Minis)",
        "description": "The now 41-year-old hotel chain heiress celebrated her birthday with a bash in Bel Air, where she also unveiled her new clothing collab with Aussie designer Rebecca Vallance.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Upgrade Your Cinematic Experience this Festival Season with LG CineBeam Q",
        "description": "This cutting-edge projector brings award-winning films right to your home.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Ryan Reynolds and Blake Lively Donate $1M to Feeding America for Hurricane Relief",
        "description": "The couple's donation for relief efforts comes on the heels of a $5 million gift from one of their closest friends, Taylor Swift.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Sean “Diddy” Combs Sex Trafficking Trial Set to Begin in May",
        "description": "The hip-hop mogul is accused of directing a vast criminal enterprise through which he assaulted and trafficked women with the help of his various businesses from at least 2008.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Ethel Kennedy, Social Activist and Widow of Robert F. Kennedy, Dies at 96",
        "description": "She had been hospitalized after suffering a stroke in her sleep last week, her family said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Rafael Nadal to Retire From Tennis After Davis Cup Finals Next Month",
        "description": "The 22-time Grand Slam champion said in his video announcement that recent years have been \"difficult\" amid injuries, adding \"I don't think I have been able to play without limitations.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Sean “Diddy” Combs Moves to Suppress Evidence of Cassie Assault Video",
        "description": "Lawyers for the hip-hop mogul claim that the government leaked footage of Combs beating the singer to secure a grand jury indictment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Taylor Swift Donates $5M to Feeding America for Hurricane Relief, Org Says",
        "description": "\"Together, we can make a real impact in supporting families as they navigate the challenges ahead,\" the organization said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-14T07:27:02.353698"
    },
    {
        "title": "Jarryd Hayne returns to rugby league",
        "description": "Former Parramatta Eels superstar Jarryd Hayne is returning to rugby league for the first time since he was released from jail this year.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Star’s bomb leaves Australia in ugly hole",
        "description": "The Australian Test team has been dealt a big blow ahead of the series against India with one call putting them back at square one.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "‘Without consent’: Bombshell trade call",
        "description": "An AFL great has called on the league to make a radical change to the trade landscape with a move that would shake things up.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Smith makes final call on opening experiment",
        "description": "After a brief stint as a Test opener, Steve Smith has decided where he wants to bat in the blockbuster five-match series against India.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "‘Without consent’: Bombshell trade call",
        "description": "An AFL great has called on the league to make a radical change to the trade landscape with a move that would shake things up.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "‘Wouldn’t go near him’: AFL star in disarray",
        "description": "An AFL player and his girlfriend have broken a “sacrosanct” football rule with the star’s career plunged into disarray.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Jarryd Hayne returns to rugby league",
        "description": "Former Parramatta Eels superstar Jarryd Hayne is returning to rugby league for the first time since he was released from jail this year.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "‘Disrespectful’ remark slammed as ‘80s stuff’",
        "description": "Penrith boss Brian Fletcher has moved to defend his divisive comments about Mary Fowler which have been branded “disrespectful”.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Star’s bomb leaves Australia in ugly hole",
        "description": "The Australian Test team has been dealt a big blow ahead of the series against India with one call putting them back at square one.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Smith makes final call on opening experiment",
        "description": "After a brief stint as a Test opener, Steve Smith has decided where he wants to bat in the blockbuster five-match series against India.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Tomic breaks record in 39-minute bloodbath",
        "description": "Forgotten Aussie tennis star Bernard Tomic has made history in disappointing fashion as he continues on the comeback trail.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "‘Bloody long journey’: Hewitt’s update on son",
        "description": "Lleyton Hewitt has revealed his excitement at son Cruz’s progress ahead of a potential Australian Open return.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Bathurst crew winner ‘attacked’, hospitalised",
        "description": "Bathurst champion Brodie Kostecki has dropped shock news a member of his team has been “attacked”. Police are investigating.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Sick champion still grabs Bathurst pole",
        "description": "Reigning Supercars champion Brodie Kostecki battled illness to claimed Bathurst 1000 pole after a stunning effort in the Shootout.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Surprising side of WAG’s cancer diagnosis",
        "description": "An AFL WAG battling a horrific bowel cancer diagnosis has shared some of the unexpected side effects of her illness.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Hollywood icon finds love after wife tragedy",
        "description": "Hollywood hardman Vinnie Jones has spilled the beans on finding love again after the tragic death of his former wife.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Aussie star’s sad reaction to brutal trolls",
        "description": "Bulls guard Josh Giddey has had a devastating response to an Instagram post from his new NBA club that quickly blew up.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "NBA superstar open to shock Boomers switch",
        "description": "Superstar Kyrie Irving, who was born in Australia, has discussed the shock possibility of joining the Boomers for the LA Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Socceroos desperate to ‘flip script’",
        "description": "It has been 15 years since the Socceroos have beaten Japan, and it’s a run of outs the Australians are determined to end on Tuesday night.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "A-League new boys finalise squad",
        "description": "It has taken several months, but the A-League’s newest club has finally completed its playing roster just days out from debuting in the competition.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Grim warning for Tszyu ahead of toughest test of his career",
        "description": "More than a few experts say this will be the toughest fight of Tim Tszyu’s career, with Bakhram Murtazaliev unlike anyone the Australian has ever fought.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "SA star comes up clutch to win in second playoff hole at WA PGA",
        "description": "It took a second sudden-death playoff hole to split South Australian Jack Buchanan and West Australian Jordan Doull in an epic finish to the WA PGA Championship.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Barbs fly as massive NBA trade turns spicy",
        "description": "Tensions were high as Donte DiVincenzo had some words for the New York Knicks in a spicy post script to a blockbuster NBA trade.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Faith could bring special result in Coongy Cup",
        "description": "The in-form combination of Berkeley Square and apprentice Jaylah Kennedy will chase a special win in Wednesday’s Group 3 Coongy Cup at Caulfield.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-14T07:27:04.641093"
    }
]