[
    {
        "title": "Jaguar Land Rover bets $80m on bespoke paint services",
        "description": "The firm says it will more than double its capacity for bespoke paint orders for wealthy customers.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Inside the race for Greenland's mineral wealth",
        "description": "The territory's untapped mineral wealth has caught the eye of both mining firms and Donald Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Meta is ditching fact checkers for X-style community notes. Will they work?",
        "description": "Many have questioned Meta's motivations for ditching fact checkers - but could it be a positive change?",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Growth at all costs? Why Reeves is in a sudden rush on the UK economy",
        "description": "The chancellor raised taxes in the Budget - but now she wants to get rid of barriers to business. Why the change of focus?",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Inside the race for Greenland's mineral wealth",
        "description": "The territory's untapped mineral wealth has caught the eye of both mining firms and Donald Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "'We are not lazy' - Working from home criticism sparks anger",
        "description": "Hundreds of BBC readers disagreed with former Asda boss Lord Rose's view that working from home is \"not proper work\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "'I'm slowly paying off £7,000' – Tips from those tackling debt",
        "description": "People who have fought their way out of debt give their best advice on coping in tough financial times.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Trump imposes 25% tariffs on Colombia as deported migrant flights blocked",
        "description": "It comes after Colombian President Gustavo Petro denied entry to US military planes carrying deported migrants.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Elon Musk, MrBeast, Larry Ellison: Who might buy TikTok?",
        "description": "Several potential US buyers have expressed interest in purchasing the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "'A mockery': Trump's new meme-coin sparks anger in crypto world",
        "description": "The president's meme-coin launch is being criticised as a stunt, while impatience grows for deregulation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Leaders leave Davos with 'cautious optimism' - 24 Jan 2025",
        "description": "As the World Economic Forum closes, senior WEF official says leaders leave Davos with constructive optimism.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "'I don't want to buy a £4 coffee just so I can use the loo'",
        "description": "Should cafés let people who don't buy anything use their toilets?",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "The French winemaker whose wines are illegal in his home country",
        "description": "Maxime Chapoutier makes wines that combine French and Australian grapes, a strict no-no in the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Davos elite nod along as Trump delivers ultimatum",
        "description": "President Trump's 'America First' message takes shape, as the rest of the world begins to digest what it might mean for them and global trade.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "'I fled Ukraine as a refugee - now I've won investment on Dragons' Den'",
        "description": "Yana resettled in Huddersfield and set up business importing clothing from Ukraine to distribute.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Trump urged not to put massive tariffs on UK",
        "description": "Business Secretary Jonathan Reynolds says there is no need for tariffs because the US has no goods trade deficit with the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Bank of Japan raises rates to highest in 17 years",
        "description": "The move comes hours after economic data showed prices rose last month at the fastest pace in 16 months.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Clampdown on fake Google reviews announced",
        "description": "Businesses which boost their star ratings will have warnings attached to them - fake reviewers will be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "US doesn't need Canadian energy or cars, says Trump",
        "description": "Speaking to business leaders in Davos, Trump also repeated his jibe that Canada could become a US state and would avoid tariffs if it did.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "UnitedHealthcare names new boss after former CEO killed",
        "description": "The company's former chief executive Brian Thompson was shot and killed in December.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Rolls-Royce strikes £9bn nuclear submarine deal",
        "description": "A deal for nuclear submarine reactors is agreed between the Ministry of Defence and Rolls-Royce.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "US government workers told to report DEI efforts or face 'consequences'",
        "description": "Government employees received emails threatening \"consequences\" if they did not report DEI work to the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Purdue and Sackler family agree $7.4bn opioid settlement",
        "description": "Under the terms, the opioid maker agreed to pay $900m, and the family behind it agreed to pay up to $6.5bn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Trump urges Opec countries to slash oil prices",
        "description": "The president says he wants Opec and Saudi Arabia to bring down the price of oil which he says is fuelling the Russia-Ukraine war.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "EU 'could consider' UK joining pan-Europe customs scheme",
        "description": "The UK joining the Pan-Euro-Mediterranean Convention is up for discussion in reset talks, says Maros Sefcovic.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Meta denies forcing users to follow Trump accounts",
        "description": "The Facebook and Instagram owner says the official profiles were updated to reflect the new position holders.",
        "source": "BBC Business",
        "fetched_date": "2025-01-27T07:23:01.916497"
    },
    {
        "title": "Trace Cyrus Says Dad Billy Ray Cyrus Threatened Legal Action Following a Plea for Him to Get Help",
        "description": "\"Everyone close to you is terrified to tell you how they really feel,\" Trace wrote on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Sara Bareilles Debuts World Premiere of Song Co-Written by Brandi Carlile at Sundance",
        "description": "During a Sundance gala, Bareilles delivered a two song set that featured \"Salt Then Sour Then Sweet\" from Ryan White's doc 'Come See Me in the Good Light,' and \"She Used to Be Mine\" from 'Waitress.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Dark Horse Comics Drops Neil Gaiman, Cancels Upcoming Releases Following Abuse Allegations",
        "description": "The news comes two weeks after new claims of sexual assault and abuse against the celebrated author.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Watch Duty CEO Honored at American Cinematheque Event: “‘Hero’ is Something I Find Hard to Bear”",
        "description": "John Clarke Mills, the man behind the wildfire alert app that kept millions of Angelenos informed, was presented an award by Steve Guttenberg, who was also active in helping during the Palisades fire.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Trump Shifts Tone on California After Touring Palisades Fire Damage: “We’re Going to be With You”",
        "description": "The president was greeted by Gov. Newsom in L.A. Friday afternoon for a brief trip where he announced that the state will receive full federal backing to rebuild.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Jesse Eisenberg on Tech Bros Pivoting to Politics: “Why Are They Not Spending Every Day Helping People?”",
        "description": "The actor, who notably portrayed Mark Zuckerberg in 'The Social Network,' made an appearance on 'Real Time With Bill Maher.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "K-Pop Festival KCON Announces 2025 L.A. Return",
        "description": "The CJ ENM-produced festival will kick off its 2025 season in Japan before returning to L.A. this summer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Pete Hegseth Confirmed as Trump’s Defense Secretary in Tie-Breaking Vote",
        "description": "Vice President J.D. Vance was on hand to cast a tie-breaking vote, unusual in the Senate for Cabinet nominees, who typically win wider support.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Sterling K. Brown Gives Update on ‘This Is Us’ Co-Stars Mandy Moore and Milo Ventimiglia, Who Lost Their Homes to the L.A. Fires",
        "description": "The Emmy winner revealed that he's spoken to both of his former TV family members since the fires occurred and says, \"It's difficult ... It’s one day at a time.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "‘What If…?’ Writer A.C. Bradley Lost Her Home in the L.A. Fires. Now She Faces Her Own ‘What If…?’ Moments With Young Daughter",
        "description": "The scribe and her three-year-old were out of the country when the blaze took their Altadena home, and are now trying to rebuild their lives.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Marilyn Manson Won’t Be Charged After Long Investigation of Sexual Assault Allegations",
        "description": "Los Angeles County District Attorney Nathan Hochman said the allegations are too old under the law and the evidence is not sufficient to charge the 56-year-old shock rocker.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Björk on Her Wild New Apple TV+ Concert Film, ‘Cornucopia’: “Something I Hadn’t Done Before”",
        "description": "The Icelandic songstress used VR technology and bespoke flutes to create what she calls \"digital theater.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-27T07:23:02.423239"
    },
    {
        "title": "Who comes out on top in BBL’s historic decider?",
        "description": "Will David Warner be able to guide the Sydney Thunder to their first title win since Mike Hussey was captain? Or will the Hobart Hurricanes prevail at home for their first-ever franchise win? FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Stars involved in heated training scuffle",
        "description": "Two Richmond teammates were forced to be separated after coming to blows during a fiery training session on Monday.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Brutal KO sends internet into meltdown",
        "description": "A rising star of the bare knuckle world has delivered one of the nastiest knockouts ever seen in the history of the sport.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Jockey whips rival in shocking scenes",
        "description": "A jockey has landed himself in hot water after he inexplicably decided to whack a rival several times with his whip.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Who comes out on top in BBL’s historic decider?",
        "description": "Will David Warner be able to guide the Sydney Thunder to their first title win since Mike Hussey was captain? Or will the Hobart Hurricanes prevail at home for their first-ever franchise win? FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "‘Duty bound’: CA rejects calls for Afghan boycott",
        "description": "Australia will play Afghanistan at the upcoming Champions Trophy but not in other internationals until their leaders change one significant thing.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Tennis fans’ pleas ignored by Aus Open chief",
        "description": "Tennis Australia boss Craig Tiley was urged throughout the Aus Open to make tweaks to the scheduling but he has completely ignored those concerns.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "What happened to woman who heckled star",
        "description": "More details have emerged about what happened to the woman who yelled out in protest during the Australian Open trophy ceremony.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Stars involved in heated training scuffle",
        "description": "Two Richmond teammates were forced to be separated after coming to blows during a fiery training session on Monday.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Newman explains controversial Aus Day act",
        "description": "AFL personality Sam Newman has addressed his controversial act during an Acknowledgement of Country at an Australia Day event.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Roosters make telling salary cap move",
        "description": "Trent Robinson’s men head into 2025 without both strike centres who lifted them to a finals berth, but the Roosters have a plan.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Former NRL star sweats on scan results",
        "description": "Maika Sivo’s switch to the Super League has suffered a major setback with the former Eels star injuring his knee.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Steph Rice reveals fears she joined a ‘cult’",
        "description": "Stephanie Rice has shared eye-opening details about her family’s fear that she had “lost her mind” before marrying her pastor husband.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Aussie GOAT makes shock career call",
        "description": "She took last year off competition and still spent the year surfing, and now Steph Gilmore has decided what she’ll be doing in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "History beckons as Swift’s Chiefs book Super Bowl date with Eagles",
        "description": "The Chiefs are one win away from the first three-peat of the NFL era, with a New Orleans showdown booked against a Philadelphia Eagles team hunting revenge.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Aussie hulk stuns America, into Super Bowl",
        "description": "Australia’s Jordan Mailata has made his mark in the NFL playoffs with a steamrolling play to book his shot at Super Bowl redemption.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "‘Pathetic’: Postecoglou incident says it all",
        "description": "Ange Postecoglou has been forced to address his future after the Tottenham manager sunk to a new low with an ugly incident caught on camera.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Auckland goes top of the A-League in last minute thriller",
        "description": "Auckland FC has climbed to the top of the A-League table with a stunning 95th minute winner against the Western Sydney Wanderers in a game full of opportunities.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Brutal KO sends internet into meltdown",
        "description": "A rising star of the bare knuckle world has delivered one of the nastiest knockouts ever seen in the history of the sport.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "F1 world in meltdown over Hamilton photo",
        "description": "Seven-time world champion Lewis Hamilton has sent the F1 world into a spin over a simple photo he shared on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Basketball Australia U20 Nationals Hub: How to watch live, schedules, key info",
        "description": "Hoops stars of the future are set to shine at the Basketball Australia Under-20 & Ivor Burge National Championships in Ballarat. See how to watch every match LIVE from Tuesday.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "‘Best golf I’ve played’: Veteran’s return to winning ways",
        "description": "As Michael Wright secured his first win in 14 years, the only person recording the moment with their phone missed one of the most important elements, but he’s not concerned. Here’s how it happened.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "‘I enjoy winning’: Purton reveals Group 1 he wants most",
        "description": "Zac Purton has ridden more winners than anyone else in Hong Kong racing history but there’s one elusive Group 1 race he is determined to secure this autumn.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "‘Absolutely awesome’: New star rises for Aussies",
        "description": "A new Aussie star stood up to deliver a victory on home soil for one of Australia’s best performed teams.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Wallabies skipper warns of ‘massive risk’",
        "description": "The Wallabies captain has urged Australian players to think about the 2027 Rugby World Cup when deciding about their future.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-01-27T07:23:05.571675"
    }
]