[
    {
        "title": "Late Harrods boss Mohamed Al Fayed accused of multiple rapes by staff",
        "description": "Five women who worked at the luxury store say they were raped by the billionaire - BBC documentary reveals.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "X says its return in Brazil after ban 'inadvertent'",
        "description": "The social media platform formerly known as Twitter was banned in the country in August.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Nintendo sues 'Pokémon with guns' video game firm",
        "description": "The Japanese company alleges that the Palworld video game \"infringes multiple patent rights\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "US sues ship firms for $100m over Baltimore bridge crash",
        "description": "The Justice Department said repair costs should be carried by the companies responsible, not US citizens.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Firm making drones for Ukraine plans more jobs",
        "description": "The company hopes to generate 200 jobs in the UK over the next three years across its two sites.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "X says its return in Brazil after ban 'inadvertent'",
        "description": "The social media platform formerly known as Twitter was banned in the country in August.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "UK interest rates expected to be held at 5%",
        "description": "Economists are betting on rates being held in September with a cut to come in November instead.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Why hundreds of Samsung workers are protesting in India",
        "description": "About 1500 workers in Tamil Nadu state have been striking work for the past 11 days.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "What's the point of buying the latest smartphone?",
        "description": "It is the time of year when new handsets are unveiled, but they may offer only small improvements.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Nintendo sues 'Pokémon with guns' video game firm",
        "description": "The Japanese company alleges that the Palworld video game \"infringes multiple patent rights\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Why finding out salary of UK PM’s chief of staff matters",
        "description": "Political editor Chris Mason explains why the story about PM Keir Starmer's chief of staff Sue Gray earning £170,000 a year matters.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "What will a US interest rate cut mean for me?",
        "description": "It will influence mortgages, credit card and saving rates for millions of people in the US - and even around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "How both campaigns will seize on interest rate cut in US election",
        "description": "With less than 50 days until the US election, Anthony Zurcher looks at how the rate cut will shape the presidential campaign.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "US goes big with first interest rate cut in four years",
        "description": "The Federal Reserve has cut its key lending rate by 0.5 percentage points - a larger cut than expected.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Boeing suspends jobs for thousands after strike",
        "description": "Boeing says it is suspending jobs for thousands of staff in the US due to a worker strike.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "TGI Fridays' UK owner falls into administration",
        "description": "London-listed Hostmore has appointed Teneo as administrators to help it sell the restaurants.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Train drivers accept pay deal to end strike action",
        "description": "Aslef said 96.6% of its members who voted backed the deal, marking the end of long-running strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "What are NI and income tax and what do I pay?",
        "description": "Two National Insurance cuts came info effect in 2024, but many people are still paying more in tax.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Post Office boss to step down from role next year",
        "description": "The chief executive had already stepped back from front-line duties to prepare for the Horizon IT inquiry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "How the government raises and spends £1 trillion a year",
        "description": "Where the government's income comes from - and what it spends that money on.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Party over for Tupperware as it files for bankruptcy",
        "description": "The US company says it will ask for court permission to start a sale process of the business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Inflation holds steady despite jump in air fares",
        "description": "Lower fuel prices helped offset the higher cost of flying in the year to August.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "How quickly are prices rising in the UK?",
        "description": "The rate at which prices are rising has nudged back above the Bank of England's target of 2%.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "New bank hubs to open but many don't have printers",
        "description": "New rules on branch closures take effect but questions remain over the facilities in shared hubs.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Marlboro owner sells asthma inhaler firm over backlash",
        "description": "Philip Morris International bought Vectura Group just three years ago in a deal worth more than £1bn.",
        "source": "BBC Business",
        "fetched_date": "2024-09-19T07:22:26.563334"
    },
    {
        "title": "Drought leaves Amazon basin rivers at all-time low",
        "description": "The current drought is concerning because it comes relatively early in the Amazon's dry season.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The weird biology of the enormous smelly 'corpse plant'",
        "description": "It stands metres high, takes a decade to flower, smells like death and draws huge crowds when it blooms. But scientists are still unravelling the baffling lifecycle of the titan arum.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "How New Orleans prepared itself for a hurricane",
        "description": "As Hurricane Francine leaves households without basic power in New Orleans, a handful of \"community lighthouses\" could offer a crucial lifeline.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Climate a more fundamental threat than terror - Lammy",
        "description": "Foreign Secretary David Lammy vows to put climate change at the heart of the UK's foreign policy.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Which is the 'dirty side' of a hurricane?",
        "description": "In tropical storms, location matters when it comes to what damage to expect – especially if you're on the \"dirty\" side of a hurricane, where winds can be up to 50% stronger.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Why humpback whales are changing course",
        "description": "The first humpback whale to return to the North Pacific's Salish Sea in decades tells a new story about the global threat to whale populations.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Mystery tremors were from massive nine-day tsunami",
        "description": "Scientists launched an investigation after being baffled by seismic signals picked up across the world",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The fisher folk reviving Finland's 'moonscape'",
        "description": "Finland's Linnunsuo wetland used to be a barren \"moonscape\". A local fishing community has transformed it into a biodiverse haven and an important carbon sink.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "'I wouldn't wish it on my worst enemy': The people who work inside the eye of a hurricane",
        "description": "As climate change makes hurricane systems more dangerous, the need to understand their inner workings is greater than ever.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "UK farming's 'net zero' climate target in doubt",
        "description": "Doubts are raised over UK farming's ability to reach \"net zero\" greenhouse gas emissions by 2040.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The town that should have burned, but didn't",
        "description": "In 2017, one of California's largest ever wildfires was steadily approaching Montecito. But it had long been preparing for just such an event.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-19T07:22:26.673487"
    },
    {
        "title": "Chelsea Handler, Connie Britton, Andy Cohen Among Artists Urging Biden and Harris to Bring Israeli Hostages Home",
        "description": "Chelsea Handler, Connie Britton, Andy Cohen, Mayim Bialik, Patricia Heaton, Jennifer Jason Leigh, Ali Landry, Rebecca Minkoff, Isaac Mizrahi, Michael Rapaport, Melissa Rivers, Gail Simmons, Amy Smart, Constance Zimmer and Ariel Martin are among 62 performers and artists — from across television, film, fashion, reality TV and social media — urging President Joe Biden and […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Why Pro-Israel Hollywood Stars Like Debra Messing and Ginnifer Goodwin Turn to Hen Mazzig for Advice",
        "description": "Amid the cacophony of debate surrounding the Israel-Hamas War, it’s grown virtually impossible to avoid the thoughts of Hen Mazzig. As the face of the Israeli cause, one might argue that he’s an unlikely candidate: The 34-year-old influencer is gay (he was out throughout his tour of service in the IDF) and spends his time […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "‘Scandal’ Cast to Reunite for Kamala Harris Reproductive Freedom Bus Tour (Exclusive)",
        "description": "The Gladiators are back. The cast of Scandal is reuniting this weekend in Michigan for the Harris-Walz campaign’s Fighting for Reproductive Freedom Bus Tour. Kerry Washington, Tony Goldwyn, Guillermo Díaz, Bellamy Young, Katie Lowes, Dan Bucatinsky, Scott Foley, Portia de Rossi, George Newbern, Jeff Perry and Cornelius Smith Jr. will join hundreds of supporters and volunteers for […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "JD Souther, Famed Songwriter, Eagles and Linda Ronstadt Collaborator, Dies at 78",
        "description": "JD Souther, the singer and songwriter who co-wrote songs with the Eagles and Linda Ronstadt, has died. He was 78. Souther died peacefully at his home in New Mexico, according to his rep. No cause of death was given. He was about to embark on a tour with Karla Bonoff. Souther, a Songwriters Hall of […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Chappell Roan on Why She’s “Kind of Hoping” She Doesn’t Win a Grammy",
        "description": "Chappell Roan may have taken home some hardware last week at the VMAs, but she’s not jumping at the idea of winning a Grammy, music’s highest honor. Given the singer’s rapid climb to fame in the past year following the release of her debut album The Rise and Fall of a Midwest Princess in 2023, it […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Sean “Diddy” Combs to Be Detained Pending Trial as Mogul Pleads Not Guilty to Sex Trafficking",
        "description": "Sean “Diddy” Combs was ordered to be detained pending trial Tuesday after he pleaded not guilty to charges including sex trafficking and racketeering. On Tuesday morning, the government unsealed a three-county indictment accusing Combs of various crimes related to an alleged decades-long pattern of physical and sexual violence against women in his orbit. Federal prosecutors […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Billie Eilish and Finneas Endorse Kamala Harris",
        "description": "Billie Eilish and Finneas have endorsed Kamala Harris in her 2024 presidential bid. The sibling musicians took to Instagram on Tuesday, National Voter Registration Day, to share their election preference. “We are voting for Kamala Harris and Tim Walz because they are fighting to protect our reproductive freedom, our planet and our democracy,” Eilish says […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Penélope Cruz Scores Latin Grammy Nomination",
        "description": "Penélope Cruz is an official Latin Grammy nominee. The Oscar-winning actress earned a nomination for best short form music video for Residente’s “313,” which starts with Cruz delivering a poetic narration. She also stars in the music video.  The track also earned a nomination for song of the year — a nomination that goes to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Gracie Abrams Is Taking a “Curious and Sensitive” Approach to Life, Music and Aspirations",
        "description": "The past few years may have been a whirlwind for Gracie Abrams but she’s enjoying every moment, especially all the “firsts happening all the time.” Though Abrams is quite busy performing in sold-out venues on her headlining tour, which kicked off earlier this month, Abrams recently took some time to chat with The Hollywood Reporter […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Sean “Diddy” Combs Charged With Sex Trafficking and Racketeering in Unsealed Indictment",
        "description": "Sean “Diddy” Combs has been charged with sex trafficking and racketeering for directing a vast criminal enterprise through which he assaulted and trafficked women with the help of his various businesses from at least 2008. Federal prosecutors, in an indictment unsealed on Tuesday, accused the music mogul of engaging in a “pervasive pattern of abuse” […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "BlumFest to Include ‘Paranormal Activity’ Re-Release",
        "description": "BlumFest has found its lineup for this year’s Halloween season. It will kick off with the 2009 found footage feature Paranormal Activity, that will get a one-night only re-release. Writer-director Oren Pel’s Paranormal Activity kicks off the fest on Sept. 25 in 150 AMC locations in 54 cities. It will be followed every Wednesday by […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "Hollywood Stars from Marginalized Communities Urge Fellow Americans to Get Out to Vote in New PSA (Exclusive)",
        "description": "A half-dozen showbiz figures, each of whom hails from a marginalized community within America, have recorded a public service announcement that is launching on Tuesday — which is National Voter Registration Day, and exactly seven weeks to the day from the 2024 presidential election — calling upon their fellow Americans to register to vote. Participants in […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-19T07:22:27.050532"
    },
    {
        "title": "India weighs easing market share limits for UPI payment operators",
        "description": "The governing body overseeing India’s popular UPI payments rail is considering increasing its proposed market share cap for operators like Google Pay, PhonePe and Paytm.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Palmer Luckey returns to headsets as Anduril partners with Microsoft on U.S. military tech",
        "description": "Palmer Luckey, the Hawaiian-shirt wearing founder who sold Oculus VR for $2 billion before co-founding the military tech company Anduril, is back in the headset business — in a sense.…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "CEO of self-driving startup Motional is stepping down",
        "description": "Motional, the autonomous vehicle startup backed by Hyundai, is shaking up its leadership ranks. Karl Iagnemma, an early pioneer in the autonomous vehicle industry whose startup Nutonomy lies at the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Craig Newmark pledges $100M to fight hacking by foreign governments",
        "description": "Craigslist founder Craig Newmark plans to donate $100 million to further strengthen U.S. cybersecurity, addressing what he sees as a growing threat from foreign governments, he tells the WSJ. Half…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "JP Morgan’s head of startup banking says ‘Founder Mode’ won’t get you a unicorn",
        "description": "Ashraf Hebela, J.P. Morgan’s Head of Startup Banking, may sit on the finance side of startups these days. But he once sat in the founder…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Bluesky addresses trust and safety concerns around abuse, spam, and more",
        "description": "The company is in various stages of developing and piloting a range of initiatives focused on dealing with bad actors, harassment, spam, fake accounts, video safety, and more.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Fal.ai, which hosts media-generating AI models, raises $23M from a16z and others",
        "description": "Fal.ai, a dev-focused platform for AI-generated audio, video, and images, today revealed that it’s raised $23 million in funding from investors including Andreessen Horowitz (a16z), Black Forest Labs co-founder Robin…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Bill requiring AM radio in new cars gets closer to law",
        "description": "A House committee overwhelmingly voted to approve a bill that would require new cars to be built with AM radio at no additional cost to the owner. The AM for…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "HTC takes on Apple’s Vision Pro and PC Gaming with $1,000 Vive Focus Vision",
        "description": "The Vive Focus Vision has enough firepower under the hood to appeal to PC gamers tethered via the DisplayPort.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Fisker reverses course on making Ocean owners pay for recall repairs",
        "description": "The reversal comes as EV startup Fisker prepares to enter the fourth month of its Chapter 11 bankruptcy process.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Three new ways to personalize your iPhone’s Home Screen in iOS 18",
        "description": "iOS 18 offers the most control over the look and feel of your iPhone’s user interface than any other version of Apple’s mobile operating system to date.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "LinkedIn scraped user data for training before updating its terms of service",
        "description": "LinkedIn may have trained AI models on user data without updating its terms. LinkedIn users in the U.S. — but not the EU, EEA, or Switzerland, likely due to those…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "This Week in AI: Why OpenAI’s o1 changes the AI regulation game",
        "description": "Hiya, folks, welcome to TechCrunch’s regular AI newsletter. If you want this in your inbox every Wednesday, sign up here. It’s been just a few days since OpenAI revealed its latest…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "US government ‘took control’ of a botnet run by Chinese government hackers, says FBI director",
        "description": "The FBI, NSA and other U.S. government agencies detailed a Chinese-government operation that used 260,000 of internet-connected devices to launch cyberattacks.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Luminate’s hair-saving chemo helmet nears release, as new funding goes toward home cancer care",
        "description": "The pitch sounds a bit sci-fi: a helmet called Lily that people undergoing chemotherapy wear to prevent hair loss, which is a common side effect of the treatment.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "TechCrunch Minute: Everything you need to know about iOS 18",
        "description": "It’s time to upgrade your iPhone to iOS 18. We know — updating your phone is annoying, and sometimes those software downloads can take a…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "YouTube launches Communities, a Discord-like space for creators and fans to interact with each other",
        "description": "At its Made On YouTube event on Wednesday, the company announced a new dedicated space for creators to interact with their fans and viewers. The space, called “Communities,” is kind…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Amazon adds PayPal as a payment option to Buy with Prime",
        "description": "Amazon’s Buy with Prime program, which lets shoppers with a Prime membership purchase items from third-party stores and check out using their Amazon account, is getting a new payment option:…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Edera is building a better Kubernetes and AI security solution from the ground up",
        "description": "Edera, a startup looking to simplify and improve how Kubernetes containers and AI workloads are secured by offering a new hypervisor, today announced that it has raised a $5 million…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "YouTube unveils ‘Hype,’ a new way for fans to help smaller creators grow their reach",
        "description": "YouTube creators no longer have to rely solely on the recommendation algorithm, search results, or collabs to help them grow their audience. At the company’s Made On YouTube event on…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-19T07:22:27.313684"
    },
    {
        "title": "Concerts lead to Roar looking elsewhere",
        "description": "An A-League club wants to move one of their home games to a much smaller venue after being forced to play it midweek due to the scheduling of a concert.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Ricciardo reveals surprise retirement location",
        "description": "Daniel Ricciardo’s F1 career is on shaky ground and now it’s emerged he’s already thinking about where he’d like to retire.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Utterly reprehensible’: Cricket coach cops 20-year ban",
        "description": "After an investigation into allegations of seriously improper behaviour a former Test batter and WBBL coach has been given a two-decade ban.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Contract detail seals Ricciardo’s F1 fate",
        "description": "Daniel Ricciardo’s Formula 1 fate seems all but sealed after contract details were brought to light in the wake of swirling rumours.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Star Hawk to undergo surgery",
        "description": "A star Hawthorn midfielder will spend the off-season in recovery as the semi-finalists prepare for a premiership tilt in 2025.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Gives us a chance’: Dees happy with fixture chaos",
        "description": "The Demons look like a team on the decline, but their coach says they can make good use of the AFLW’s controversial scheduling call.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "NRL star caught up in pub incident",
        "description": "Police are investigating after Canberra Raiders star Josh Papalii was allegedly involved in a pub incident early on Monday morning.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Made it ten times worse’: Star to be axed",
        "description": "Josh Addo-Carr is widely expected to be sacked as he prepares to front the NRL integrity unit and explain his side of the cocaine drama.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Utterly reprehensible’: Cricket coach cops 20-year ban",
        "description": "After an investigation into allegations of seriously improper behaviour a former Test batter and WBBL coach has been given a two-decade ban.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Biggest loser from Comm Games revamp",
        "description": "Cricket’s future in a more “sustainable” Commonwealth Games is murky as other sports also face the chop in a streamlined format.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Tennis star who fled country breaks silence",
        "description": "A former Italian tennis star has spoken out as ugly allegations over why she and her family fled the country continue to emerge.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘No shame’: Dokic shares powerful message",
        "description": "Former tennis champion Jelena Dokic has declared she feels “no shame” over how she looked before her recent weight loss.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Ricciardo reveals surprise retirement location",
        "description": "Daniel Ricciardo’s F1 career is on shaky ground and now it’s emerged he’s already thinking about where he’d like to retire.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Swirling Ricciardo rumour is worst one yet",
        "description": "Daniel Ricciardo is at the centre of the Formula 1 rumour mill again with the Australian reportedly set to be told some crushing news.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Aussie tennis champ, model girlfriend split",
        "description": "Aussie tennis star Thanasi Kokkinakis’ has seemingly ended his 18-month relationship with his glamorous model girlfriend.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Disabled boy banned from sport over rule",
        "description": "A 12-year-old boy from Sydney with a disability has been banned from participating in his favourite hobby due to a  “heartbreaking” rule change.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "NBA icon Shaq in X-rated photo storm",
        "description": "Shaquille O’Neal has responded to suggestions he is the secret boyfriend pictured in an X-rated photo shared by an Instagram influencer.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Taylor Swift stuns at latest NFL game",
        "description": "Taylor Swift made another stunning entrance and showed off her support for boyfriend Travis Kelce at his latest NFL game.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Concerts lead to Roar looking elsewhere",
        "description": "An A-League club wants to move one of their home games to a much smaller venue after being forced to play it midweek due to the scheduling of a concert.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Brazilian star ready for Sky Blues debut",
        "description": "Sydney FC is intent on growing its ‘brand’ and ‘reputation’ throughout Asia with good performances that will also reward the Sky Blues financially.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Banned’: Fears arise over boxing bout",
        "description": "An ex-boxing world champ has detailed his dire fears for the sport as he called for Jake Paul’s fight with Mike Tyson to be called off.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Cam’s redemption quest after wasted homecoming",
        "description": "Cam Smith’s preparations for a tilt at a fourth Australian PGA title will include playing in a second event in Queensland this year.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "New to SuperCoach NBL? Pick this team",
        "description": "Need a SuperCoach NBL team in a hurry? We ran the numbers on six expert teams to deliver the ultimate starting line-up.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Wallabies history will be made in Sydney",
        "description": "Nearly 15 years after making his Wallabies debut, a national treasure will set a new Australian record against the All Blacks.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "Wallabies keen to silence ‘external noise’",
        "description": "The soul searching continues for the Wallabies ahead of their Bledisloe Cup clash against New Zealand on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "I Am Me takes Shorts route to The Everest",
        "description": "I Am Me, the brilliant mare stablemate Bella Nipotina has never beaten, gets another chance to press her claims for the $20 million The TAB Everest at Royal Randwick on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-19T07:22:28.939145"
    }
]