[
    {
        "title": "World braces as Trump set to announce sweeping tariffs",
        "description": "The US president is set to announce a raft of new tariffs on Wednesday - which he has dubbed \"Liberation Day\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Three big unknowns ahead of Trump's 'Liberation Day' tariffs",
        "description": "The president is expected to unveil details of his plans for a wider set of import taxes. But what tariffs and when?",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "US prosecutors to seek death penalty for Luigi Mangione",
        "description": "The 26-year-old is accused of shooting dead healthcare CEO Brian Thompson outside a Manhattan hotel.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Massive layoffs begin at top US health agency",
        "description": "Health Secretary Robert F Kennedy Jr announced last week that the health agency would cut 20,000 employees.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Three big unknowns ahead of Trump's 'Liberation Day' tariffs",
        "description": "The president is expected to unveil details of his plans for a wider set of import taxes. But what tariffs and when?",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Trump-endorsed news channel sees shares surge 2,200%",
        "description": "Conservative US cable TV channel Newsmax started trading on the New York Stock Exchange on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Analysis: Jitters, uncertainty and hope as UK awaits Trump tariff decision",
        "description": "Talks are continuing between London and Washington at quite an intensity, our political editor writes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Analysis: Trump poised to reshape global economy and how world does business",
        "description": "The BBC’s economics editor Faisal Islam explains why a US tariff on goods imported into America is such a big deal for both consumers and countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "The Swedish city fined for missing an environmental target",
        "description": "Gothenburg has to pay a financial penalty if it misses certain annual sustainability goals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Week in Markets - 28 Mar 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Top Australian universities close Chinese Confucius Institutes",
        "description": "Australia has ramped up scrutiny on the centres over fears China is using them to spread propaganda.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Car firms fined in UK for withholding recycling information",
        "description": "BMW, Ford, JLR, Peugeot Citroen, Mitsubishi, Nissan, Renault, Toyota, Vauxhall and Volkswagen have all been fined.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Hooters restaurant chain files for bankruptcy",
        "description": "Like many other casual dining chains, Hooters has struggled in recent years with rising costs and wages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Trump tariffs: Ireland expected to be among hardest hit",
        "description": "EU goods are expected to face a tariff of around 20% when entering the United States.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Investigation launched into UK's statistics agency",
        "description": "The Office for National Statistics is under review after criticism about the reliability of its data.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "UK will take calm approach to US tariffs, PM says",
        "description": "Keir Starmer says he is \"keeping all options on the table\" to respond to new US trade tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "The Finnish defence firms 'on steroids'",
        "description": "Helsinki has become one of the top five cities in Europe for investment in defence and security technologies.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Markets mixed as investors brace for Trump tariffs",
        "description": "The US president suggests the new import taxes he is set to announce this week will hit all countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Harrods launches compensation scheme for Al Fayed victims",
        "description": "Survivors of alleged sexual abuse by the department store's former boss could get up to £385,000.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "AI was enemy No. 1 during Hollywood strikes. Now it's in Oscar-winning films",
        "description": "Tech companies say AI will make productions cheaper and faster - but many in Hollywood think it will replace their jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Primark boss quits after complaint about behaviour",
        "description": "Paul Marchant leaves after an allegation about his behaviour towards a woman \"in a social environment\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "UK expects to be hit by Trump tariffs, No 10 says",
        "description": "Downing Street does not rule out retaliating if new tariffs are imposed on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Musk gives away $1m cheques ahead of Wisconsin's Supreme Court election",
        "description": "The state's attorney general tried to block the giveaway arguing it was an illegal bid to buy votes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Trump wants India to buy US corn - but here's why it probably won't",
        "description": "India feeds over a billion people, yet low yields and poor infrastructure keep agriculture lagging.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Al Fayed estate faces legal action from alleged victims",
        "description": "The women worked as nannies or private air stewards for the late billionaire and former owner of Harrods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-02T07:25:36.791536"
    },
    {
        "title": "Gene and Betsy Hackman’s Estate Wins Partial Victory in Footage and Death Records Court Ruling",
        "description": "A mixed ruling handed down on Monday afternoon stipulates that images of the very private couple’s partially decomposing bodies will not be released.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Kid Rock Says Meeting He Brokered With President Trump and Bill Maher ‘Could Not Have Been Better’",
        "description": "The rocker told 'Fox & Friends' all about the success of the White House meeting he orchestrated between the onetime foes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Long Before Cory Booker, Patton Oswalt Delivered an Epic Star Wars Filibuster on ‘Parks and Recreation’",
        "description": "The comedian played a Pawnee history buff who resisted change.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Armin van Buuren’s Armada Music Teams With Peloton for DJ Residency",
        "description": "Armada touts the \"exciting way to merge fitness with the music we love, creating a space where people can push their limits while feeling completely immersed in the sound.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Latin Music Revenue Hits $1.4B in the U.S., Outpacing Overall Growth",
        "description": "Latin outpaced the broader market stateside for the ninth year in a row, but growth slowed to 6 percent compared to 16 percent from the year prior.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Dove Cameron to Hold Shoppable Livestream Benefit Concert “Everything Must Go”",
        "description": "The event, put on by Wells Fargo Credit Cards, will feature new music from the pop star and benefit the National Alliance on Mental Illness.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Amber Ruffin Responds to Being Dropped from White House Correspondents’ Dinner: “I Would Have Been So Terrifically Mean”",
        "description": "Ruffin participated in a comedy bit on NBC's 'Late Night': \"We have a free press so that we can be nice to Republicans at fancy dinners. That's what it says in the First Amendment.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Megyn Kelly Insists She’s “Still a Journalist” While Explaining Endorsement of Donald Trump",
        "description": "The former anchor and successful podcaster also reveals her distaste for Gretchen Carlson and softened her language about late Fox News chairman Roger Ailes, who she accused of sexual harassment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "KiiiKiii is Ready to Be Your New Favorite Girl Group",
        "description": "The five-piece K-Pop group, hailing from Korean entertainment agency Starship Entertainment, is already climbing domestic charts with their pre-release single, “I Do Me.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Trump, Joined By Kid Rock, Signs Executive Order Targeting Ticket Scalpers",
        "description": "Trump has called on the FTC to enforce the BOTS Act, a 2016 legislation designed to stop scalpers from using bots to acquire mass amounts of tickets.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Miley Cyrus Sets the Stage for “Something Beautiful” With Release of First Two Songs From Upcoming Album",
        "description": "'Something Beautiful,' out May 30, is the singer's follow-up to 2023's 'Endless Summer Vacation,' which included the hit \"Flowers\" and earned Cyrus her first Grammys more than a decade into her music career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "The White House PR Battle With White House Correspondents Nears a Boiling Point",
        "description": "The AP is still banned from covering some, events, the White House is poised to take control of the Brady Briefing Room seat assignments, and Amber Ruffin is a casualty of the feud.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-02T07:25:37.119676"
    },
    {
        "title": "Kerr makes statement with T-shirt message",
        "description": "Superstar Sam Kerr has stepped out in Sydney in style, with candid photos revealing plenty after her dramatic return to the Matildas.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Wallabies stars return for Reds",
        "description": "The Reds have called on some key personnel in their bid to beat the Chiefs in Waikato on Friday.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Axe dangles for underperforming Dees",
        "description": "Simon Goodwin says he could be forced to send some of his players back to the VFL after Melbourne was on the end of back-to-back thumpings.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Cleary looking for that winning feeling",
        "description": "Penrith are searching for that winning feeling with Nathan Cleary returning from a head knock against North Queensland on Friday.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Cleary looking for that winning feeling",
        "description": "Penrith are searching for that winning feeling with Nathan Cleary returning from a head knock against North Queensland on Friday.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Gus’ fiery defence of Reed Mahoney",
        "description": "Phil Gould has launched to the defence of Reed Mahoney after the rugged Bulldogs hooker was charged for two incidents over the weekend.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Axe dangles for underperforming Dees",
        "description": "Simon Goodwin says he could be forced to send some of his players back to the VFL after Melbourne was on the end of back-to-back thumpings.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "AFL great’s truth bomb amid secret meeting",
        "description": "Colingwood legend Nathan Buckley has delivered some pointed advice to under-fire Eagles captain Oscar Allen after he was caught meeting a rival coach.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Warne medical report uncovers third drug",
        "description": "The medical report of Shane Warne’s death has come to light for the first time, revealing the truth behind claims made about his final hours.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Sam Konstas move could seal fate of veteran",
        "description": "Cricket Australia’s move could come at a cost for Marnus Labuschagne , with Sam Konstas viewed as Australia’s Test future.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "New Aussie breaks silence on defection",
        "description": "Daria Kasatkina has opened up about the defection call she “had to make” and why it simply had to be Australia.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Djokovic image sparks serious concern",
        "description": "Tennis fans were left expressing their concern for the wellbeing of Novak Djokovic after worrying images emerged before a key final.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Bombshell Max prophecy flips F1 on its head",
        "description": "A ticking time bomb is set to explode on Red Bull, as the team grapples with a crippling problem and rumours swirl about Max Verstappen.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Tsunoda targets home race podium after ‘unreal’ car switch",
        "description": "Ahead of his first race as an official Red Bull driver – and Max Verstappen teammate- Yuki Tsunoda has set his sights at the top end of the grid, with a podium finish in store for his home race.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Bombshell Max prophecy flips F1 on its head",
        "description": "A ticking time bomb is set to explode on Red Bull, as the team grapples with a crippling problem and rumours swirl about Max Verstappen.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Wallabies stars return for Reds",
        "description": "The Reds have called on some key personnel in their bid to beat the Chiefs in Waikato on Friday.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Australia miss out on gold but snare Hong Kong Sevens double",
        "description": "There were no gold medals this time but Australia did at least finish on the podium in both the men’s and women’s tournaments at the prestigious Hong Kong Rugby Sevens.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "NBA ‘Bad Boy’ team goes rogue in wild fight",
        "description": "Seven players were ejected after a wild NBA brawl broke out featuring a team that is quickly earning a feisty reputation.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Coach axing leaves NBA world in shock",
        "description": "An NBA championship contender has left fans in disbelief after sacking their head coach only weeks out from the playoffs starting.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Kerr makes statement with T-shirt message",
        "description": "Superstar Sam Kerr has stepped out in Sydney in style, with candid photos revealing plenty after her dramatic return to the Matildas.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Major blow sours Arsenal win, wonder goal burns Utd",
        "description": "EPL WRAP: Arsenal has kept its title hopes alive, but victory came a potentially serious cost against Fulham. Elsewhere, a length of the field goal from a United reject burnt the Red Devils.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Tszyu sends message to ‘sooky’ Spencer after judging drama",
        "description": "Tim Tszyu has shrugged off the judging drama that has overshadowed the lead-up to his blockbuster fight against American Joey Spencer, and taken a swipe at his opponent.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "‘Fanboying’: Lee’s friendship with pop icon",
        "description": "Min Woo Lee isn’t short of support from big names in sport and music as he prepares for next week’s Masters at Augusta.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Odd reason star deliberately scored own goal",
        "description": "Basketball star Marie Pardon has incredibly nailed a buzzer beater … only problem was it was for the wrong team.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Wyong Thursday tips: Godolphin filly poised for a first-up win",
        "description": "The James Cummings-trained Reducio was good in both starts of her first campaign and can kick off her second preparation with a win. BEST BETS, INSIDE MAIL",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    },
    {
        "title": "Spiranac lifts lid on ‘sexual favour’ rumours",
        "description": "Golfer and social media sensation Paige Spiranac has spoken out over rumours that plagued her in the early stages of her career.",
        "source": "News AU",
        "fetched_date": "2025-04-02T07:25:40.277450"
    }
]