[
    {
        "title": "What we know about US-Ukraine minerals deal",
        "description": "The White House said the deal, which would give the US access to mineral deposits, was not signed on Friday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "US judge says mass firings of some federal workers likely illegal",
        "description": "Thousands of workers have been fired by the Trump administration as part of its effort to slash the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Free trade deal with India could come this year - EU Commission chief",
        "description": "The two sides discussed ways to further strengthen the Indo-EU strategic partnership.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Trump says US will impose additional 10% tariff on China",
        "description": "He also said he would move ahead with 25% tariffs on imports from Mexico and Canada, which had been paused.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "US judge says mass firings of some federal workers likely illegal",
        "description": "Thousands of workers have been fired by the Trump administration as part of its effort to slash the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Microsoft announces Skype will close in May",
        "description": "The internet chat and phone service, which is owned by Microsoft, made the announcement on X.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "UK-US trade deal could mean tariffs 'not necessary', says Trump",
        "description": "The US president says a trade deal could happen very quickly and avoid taxes on UK imports.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Analysis: Any Starmer deal with Trump is all about avoiding tariffs",
        "description": "A deal to avoid further trade barriers appears very much on the cards, but challenges remain.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Cook Islands China deal riles allies as West's grip loosens",
        "description": "The recent spree of deals between the two is upsetting traditional allies wary of Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "BP shareholders want it to make money, not climate policy",
        "description": "The oil and gas producer faces criticism for its shift away from green energy, but many support it.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Hundreds in US climate agency fired in latest cuts",
        "description": "Around 880 workers - including weather forecasters - are reported to have lost their jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Qatar Airways says crew handled dead passenger 'appropriately'",
        "description": "An Australian couple said it was \"traumatic\" to sit next to the body of the woman who died mid-flight.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Goldman Sachs pledges £1.5m to support apprentices",
        "description": "The funds will help small businesses and charities in the region to invest in and develop staff.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Trump administration unveils bird flu plan as egg prices soar",
        "description": "A US bird flu epidemic has resulted in the deaths of tens-of-millions of poultry and strained the country's egg supply.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Amazon joins quantum race with 'cat qubit' powered chip",
        "description": "The prototype chip it dubs Ocelot follows similar announcements by Microsoft and Google",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Succession-like feud engulfs one of Singapore's richest families",
        "description": "Kwek Leng Beng, the chairman of property giant CDL, has accused his son of plotting a boardroom coup.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Trump says 25% tariffs on EU will be announced soon",
        "description": "\"The EU was formed to screw the United States,\" Trump says.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Instagram may launch separate Reels app to take on TikTok - report",
        "description": "It comes as Chinese-owned short-video app TikTok's future remains uncertain in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Nvidia says AI chip sales strong despite DeepSeek fears",
        "description": "Boss Jensen Huang responds to concerns about an AI bubble sparked by Chinese firm DeepSeek.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Bezos focuses Washington Post opinion section on free markets and liberties",
        "description": "The move marks a major shift and prompted the outlet's opinion editor David Shipley to resign.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Trump says $5m 'gold card' immigration visas will 'sell like crazy'",
        "description": "Trump say wealthy investors will buy the visas and create jobs in the US, while helping pay off US debt.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "US Supreme Court hears arguments in 'straight discrimination' case",
        "description": "Justices appeared sympathetic to a woman who claims she was denied jobs because she is heterosexual.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Pokémon boss believes series can last another 50 to 100 years",
        "description": "CEO Tsunekazu Ishihara speaks to the BBC about the future of the world's most valuable media franchise.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "Zelensky to meet Trump in Washington to sign minerals deal",
        "description": "President Trump says the pair are poised to sign a \"very big agreement\", which Zelensky described as a \"framework\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "US intelligence head 'not told' about UK's secret Apple data demand",
        "description": "Tulsi Gabbard said she was seeking further information from the FBI and other US agencies.",
        "source": "BBC Business",
        "fetched_date": "2025-03-01T07:21:56.121731"
    },
    {
        "title": "The Vocal Coach Who Keeps Ariana Grande in Tune — and Taught Timothée Chalamet to Sing",
        "description": "Eric Vetro may be Hollywood’s most in-demand vocal teacher, having worked with Angelina Jolie ('Maria'), Jonathan Bailey ('Wicked') and Austin Butler ('Elvis').",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Notorious B.I.G. Catalog Sale in the Works (Exclusive)",
        "description": "The late rapper’s publishing and publicity rights have a suitor in Primary Wave, with the asking price of $100 million to $150 million.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Trump Supporters Fume at AG Pam Bondi Over Epstein Files Debacle: “She Should Resign”",
        "description": "MAGA diehards like Laura Loomer, Jeremy Hambly and Kevin Sorbo demanded the transparency the Trump administration had promised over documents related to Jeffrey Epstein.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Blackpink Add Additional Shows to 10-City Summer 2025 Stadium World Tour",
        "description": "The “Pink Venom” singers are currently in the midst of a banner year as solo artists.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Joy Reid Says Black Women “Are Living at a Time of Theft” at Essence Awards Days After MSNBC Dismissal",
        "description": "Of Black women, Reid continued: \"In each of the spaces that we exist, we tend to be the best.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "The Day Gene Hackman Almost Punched Me (Guest Column)",
        "description": "'Under Suspicion' screenwriter W. Peter Iliff on the moment he found the guts to stand up to the acting legend and how it led to their lifelong friendship.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "James Cameron Is Happy to Get New Zealand Citizenship After Trump’s “Horrifying” Re-election",
        "description": "\"It’s like watching a car crash over and over and over,\" he said of Trump's second presidency so far.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "James Bundy to Retire As Dean of David Geffen School of Drama at Yale",
        "description": "The longtime dean has overseen the prestigious graduate school through many transitions, including the gift of free tuition.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "If Fernanda Torres Wins an Oscar It Could Save Actual Lives in Brazil",
        "description": "Her film ‘I’m Still Here’ has fueled a legal reckoning that experts say will get taken to the next level if she brings home an Academy Award.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "‘Shrinking’ Star Michael Urie to Host GLAAD Media Awards in Los Angeles",
        "description": "The Juilliard-trained talent said he's honored to get the gig: \"Our queer siblings across the country who are being unfairly persecuted and villainized deserve a night that reminds them that they’re not alone.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Ethan Millman Joins The Hollywood Reporter as Music Editor",
        "description": "Millman joins THR from Rolling Stone and will lead the publication's music coverage in print and online.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Gayle King, Katy Perry and Lauren Sanchez Will Fly to Space on One of Jeff Bezos’ Rockets",
        "description": "Blue Origin announced the crew for its upcoming space flight Thursday morning.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-01T07:21:57.081177"
    },
    {
        "title": "Smylie, Koh, in strong positions at New Zealand Open",
        "description": "Elvis Smylie took a stranglehold on the PGA Tour of Australasia order of merit title as Korea’s Guntaek Koh threatened to run away with the New Zealand Open in Queenstown.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "USA introduced to ‘trash-talker’ Ricky Stuart",
        "description": "Ahead of the Raiders’ season-opening clash with the Warriors, the New York Post sat down with “all-time trash talker”, Ricky Stuart.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘Isn’t he injured?’: Fans fume at NRL footage",
        "description": "Penrith fans were frustrated after seeing footage of one of their four-time premiership stars in Vegas that raised some eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘Why can’t we?’: Matildas’ truth bomb",
        "description": "A core group of Matildas players that have been part of the national team for several years need to take responsibility for the side’s current form.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "USA introduced to ‘trash-talker’ Ricky Stuart",
        "description": "Ahead of the Raiders’ season-opening clash with the Warriors, the New York Post sat down with “all-time trash talker”, Ricky Stuart.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘Isn’t he injured?’: Fans fume at NRL footage",
        "description": "Penrith fans were frustrated after seeing footage of one of their four-time premiership stars in Vegas that raised some eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "AFL star’s injury ruins leaves club in ruins",
        "description": "The AFL has a full-blown crisis on its hands after a trio of superstar players were struck down and will miss the start of the season.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Wife’s handwritten note in Bali brothel case",
        "description": "The estranged wife of a former AFL player has handed judges a 20-word handwritten note as she defends herself after police raided a Bali “brothel”.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "How the Gilchrist family supported WNCL star through family tragedy",
        "description": "Ahead of the WNCL final, Lismore native and NSW star Sammy-Jo Johnson has opened up about the support she has received from Adam Gilchrist’s family after her father’s suicide in 2012.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "England captain quits, Poms in shambles",
        "description": "England’s ODI captain has fallen on his sword and quit after the Poms missed the knockout stages in a dire Champions Trophy campaign.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘It’s torture’: Aussie star makes sad decision",
        "description": "Aussie tennis star Thanasi Kokkinakis has been forced to make a tough choice after his season was yet again hampered by injury.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Sinner wiped from awards in brutal face slap",
        "description": "Tennis top dog Jannik Sinner has taken his first body blow after accepting a doping suspension that continues to divide opinions.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Deafening verdict on NRL’s Vegas experiment",
        "description": "The NRL and its broadcasters are selling rugby league to US audiences as commentators give their verdict on the foray into America.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Russell edges Verstappen to post fastest testing time",
        "description": "George Russell struck late on the third and final day of Formula One pre-season testing as he edged four-time reigning world champion Max Verstappen to post Friday’s fastest time.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘Unique and cherished’: Aus GP lifts ban on post-race tradition",
        "description": "Fans at the Australian Grand Prix will be allowed to storm the track after this year’s race following the lifting of a ban thanks to unruly behaviour in 2023.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Reds recruit to add ‘different dimension’",
        "description": "An injury to Jock Campbell has given a New Zealand recruit the chance to shine at fullback for the Queensland Reds.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Boost for Reds as Wallabies star returns",
        "description": "It has been a long wait for Reds star Liam Wright, but the Queensland flanker is finally ready to return from a shoulder injury.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "NFL team torched as Trump rumours swirl",
        "description": "There has been an angry backlash against the Super Bowl champions with the team told to “go f*** yourselves” over Donald Trump rumours.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘Why can’t we?’: Matildas’ truth bomb",
        "description": "A core group of Matildas players that have been part of the national team for several years need to take responsibility for the side’s current form.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "‘Response’ needed from rattled Reds",
        "description": "Having lost two successive matches, Adelaide United can ill-afford a third consecutive defeat on Saturday against Auckland FC.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Aussie’s career derailed by latest defeat",
        "description": "Aussie Jason Moloney faces a long climb back into world title contention after suffering his second straight loss on Japanese soil.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Smylie, Koh, in strong positions at New Zealand Open",
        "description": "Elvis Smylie took a stranglehold on the PGA Tour of Australasia order of merit title as Korea’s Guntaek Koh threatened to run away with the New Zealand Open in Queenstown.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Harvey, Kell, fire up for Hawks to overcome hot Phoenix",
        "description": "Illawarra has a breakthrough NBL championship in its sights, and they’ve drawn first blood against SEM Phoenix to be closer to breaking that 24-year title drought.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Collett’s Slipper conundrum after two-year-old double",
        "description": "After getting Rivellino home in the Skyline Stakes, jockey Jason Collett nabbed the Sweet Embrace Stakes on Within The Law to give himself a choice of two top Golden Slipper rides.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Legend’s daughter’s big news after break-up",
        "description": "The daughter of a football icon has announced big personal news after her split from disgraced NRL player Brett Finch.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    },
    {
        "title": "Teen crushed to death in horror gym accident",
        "description": "Graphic Warning: Gym goers have been left shaken after a teenager was crushed to death in a shocking weightlifting accident.",
        "source": "News AU",
        "fetched_date": "2025-03-01T07:21:58.629774"
    }
]