[
    {
        "title": "The Onion's purchase of Alex Jones's Infowars rejected by judge",
        "description": "Judge Christopher Lopez ruled that an auction for Infowars did not result in the best bids possible.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Coffee price surges to highest on record",
        "description": "Coffee drinkers are set to feel the pinch from high prices after crops got hit by drought and heavy rainfall.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Monthly rent soars by £270 since pandemic, says Zoopla",
        "description": "The cost of renting rose sharply after lockdown was lifted but the rate of increase is now slowing.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "UK car loan scandal victims told to complain",
        "description": "Aggrieved car buyers who feel they were mis-sold a loan should complain to their lender, MPs hear.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Coffee price surges to highest on record",
        "description": "Coffee drinkers are set to feel the pinch from high prices after crops got hit by drought and heavy rainfall.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "General Motors pulls plug on robotaxi business",
        "description": "After the announcement, the project's co-founder posted on social media \"GM are a bunch of dummies.\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Is the fastest-growing big economy losing steam?",
        "description": "India's economy slumped to 5.4%, below the central bank's 7% forecast. What's going on?",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "More jobs and no 'nuisance taxes' - Ghanaians' great expectations",
        "description": "John Mahama will struggle to fulfil his promises as the economy is in deep crisis, some analysts say.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "What is rage-baiting and why is it profitable?",
        "description": "Called rage-baiting, making people angry with social media posts can be a business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "How Jaguar lost its way - long before that polarising advert",
        "description": "What is really happening behind the scenes at the car brand",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Expert: Narrative still pretty positive on tech - Dec 10",
        "description": "Michelle Fleury talks to Steven Schoenfeld about concerns the tech market is overvalued.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Amazon and eBay to pay 'fair share' for e-waste recycling",
        "description": "Firms which produce e-cigarettes will also be asked to pay more towards UK recycling.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Blow for UK as equipment giant Ashtead chooses US",
        "description": "The building equipment rental firm joins others who have moved to the US from London.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Luigi Mangione charged with murdering healthcare CEO in New York",
        "description": "The 26-year-old man was taken into custody at a McDonald's in the town of Altoona, Pennsylvania, on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Murdoch loses bid to change trust in real-life 'Succession' battle",
        "description": "The court says Murdoch acted in \"bad faith\" by trying to give control of his empire to his eldest son.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Hershey shares jump on Cadbury owner buyout report",
        "description": "A deal between Mondelez and Hershey could create a food giant with sales of almost $50bn a year.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Will bribery charges against Adani derail India's green goals?",
        "description": "The Adani Group is aiming to contribute to a tenth of India's renewable energy needs by 2032.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "UK sanctions Kenyan businessman over illicit gold trade",
        "description": "Pattni has been accused of smuggling gold and exploiting natural resources in Africa for decades.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Google unveils 'mind-boggling' quantum computing chip",
        "description": "It solves in five minutes a problem computers now would need 10,000,000,000,000,000,000,000,000 years to work out, Google says.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Nvidia targeted by China in new chip war probe",
        "description": "The investigation follows a US decision to further restrict sales to chip equipment makers in China.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Hit by blackouts, Cuba’s tourism industry now braces for Trump",
        "description": "Cuba's hotels, already hit by power cuts, are now worried about Donald Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "TikTok asks for emergency pause to looming US ban",
        "description": "The app says the Supreme Court - and incoming Trump administration - needs more time to consider the case.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Pubs warn Guinness being limited could 'cripple' their business",
        "description": "Pubs say they're trying to find alternative stouts as wholesalers put limits on how much Guinness they can get.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Fears loom over India's 'Hong Kong' project on a remote island",
        "description": "Experts say the multi-billion project would be a 'death sentence' for the Shompen people.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Rachel Reeves signals wider reset of EU relations",
        "description": "Labour has ruled out rejoining the EU but may be open to alignment on areas such as farm and food exports.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "A $6.2m banana, a crypto empire and Trump's potential conflicts",
        "description": "Trump's expanding business ventures have made it easier than ever for those hoping to influence US policy to steer money his way.",
        "source": "BBC Business",
        "fetched_date": "2024-12-11T07:26:48.279458"
    },
    {
        "title": "Taylor Swift Calls Eras Tour “Most Challenging Thing I’ve Ever Done” at Final Show",
        "description": "Emotions ran high at the last night of the superstar singer-songwriter's Eras jaunt in Vancouver, which made history as the first-ever $2 billion tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Jay-Z Lawyer Says Jane Doe Accusing Rapper of Rape Must Reveal Her Identity or Drop Lawsuit",
        "description": "The accuser alleges that Jay-Z and Sean \"Diddy\" Combs raped her at a house party after the 2000 MTV Video Music Awards.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Taylor Swift’s Eras Tour Makes History After Grossing Record $2 Billion",
        "description": "The singer took her final bow of the tour in Vancouver on Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "“Polarization”: Merriam-Webster Word of the Year Reflects Political Divides",
        "description": "The dictionary publisher said Americans from competing tribes looked up the definition to better understand divided politics at home and worldwide.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Musicians at the Golden Globes: Ariana Grande, Miley Cyrus, Selena Gomez Score Nominations",
        "description": "Maren Morris, Robbie Williams, Cynthia Erivo, Trent Reznor and Atticus Ross are also competing at the show, where music from 'Emilia Pérez' picked up three nominations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Sabrina Carpenter Makes Surprise Appearance on ‘BBC Maestro’ to Talk Songwriting (Exclusive)",
        "description": "\"That song was obviously based on real-life events,\" Carpenter told singing coach Eric Vetro, who worked with both Ariana Grande and Jonathan Bailey ahead of their performances in 'Wicked'.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Francis Ford Coppola, The Grateful Dead Among Those Feted at Kennedy Center Honors",
        "description": "Arturo Sandoval, Bonnie Raitt and The Apollo also were honored Sunday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Jay-Z Accused of Raping 13-Year-Old Girl in Lawsuit; Rapper Says “Idiotic” Accusations Are Part of a “Blackmail Attempt”",
        "description": "In the lawsuit, the accuser, identified only as \"Jane Doe,\" alleges Jay-Z and Sean Combs raped her at a house party after the 2000 MTV Video Music Awards, which the rapper denied in a lengthy post on X (formerly Twitter).",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Azealia Banks Sends Cease & Desist Letter to Matty Healy Demanding $1 Million in Damages",
        "description": "The letter comes after swirling tension between the two singers as a result of an online feud.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Alisyn Camerota to Exit CNN, Last Show Set for Sunday Afternoon",
        "description": "Camerota joined the network in 2015.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "McLaren Wins F1 Constructors’ Championship for First Time in 26 Years",
        "description": "The Formula 1 team's drivers Lando Norris and Oscar Piastri brought the trophy home to the papaya family as the 2024 racing season comes to a close.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "Barry Keoghan Deactivates Instagram Account Due to “Disgusting Commentary” About His Character and Family",
        "description": "The actor's comments follow reports that he and singer Sabrina Carpenter ended their relationship.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-11T07:26:49.118542"
    },
    {
        "title": "‘It would be incredible’: DDP eyes shock training partner for UFC 312",
        "description": "He was one of Dricus du Plessis’ heroes, and now the South African middleweight champion wants to train alongside him.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Aussie opener wants another go at Bumrah",
        "description": "Indian quick Jasprit Bumrah is under an injury cloud and   despite getting out to him three times in his first two Tests the Australian batting rookie wants the challenge of facing him.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Former bad boy’s shock Broncos move",
        "description": "Former NRL bad boy Todd Carney has played a surprise role at the Brisbane Broncos as Michael Maguire shakes up the club.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Replacement emerges, axe hovers over F1 star",
        "description": "Red Bull will have to pay a massive amount to get rid of Sergio Perez as speculation mounts that the team has settled on his replacement.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘Like that pressure’: Sydney rookie’s bold Buddy request",
        "description": "Famous football numbers can be a blessing or a curse, but a Sydney Swans draftee asked to fill the biggest possible shoes.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "No trade deal for AFLW star",
        "description": "The biggest name of the AFLW trade period failed to get to a new home and her immediate future is now clouded.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Former bad boy’s shock Broncos move",
        "description": "Former NRL bad boy Todd Carney has played a surprise role at the Brisbane Broncos as Michael Maguire shakes up the club.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Kangaroos star ends Aussie Golden Boot drought",
        "description": "Australia may be the best team in the world, but they’ve had to wait seven years for one of their players to win the Golden Boot award.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Aussie opener wants another go at Bumrah",
        "description": "Indian quick Jasprit Bumrah is under an injury cloud and   despite getting out to him three times in his first two Tests the Australian batting rookie wants the challenge of facing him.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘More in them’: December key to Gabba success",
        "description": "There’s a significant reason why hosting India at the Gabba in December plays strongly into Australia’s favour for the third Test.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Dokic’s spine-tingling speech drops jaws",
        "description": "Jelena Dokic has delivered a raw, passionate speech, showing her transformation from when she “couldn’t string a sentence together”.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Tennis in shock over rocket launcher photo",
        "description": "A top tennis player has stunned fans around the world, sharing gripping photos of herself holding a rocket launcher.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Aussie trio about to shock the fight world",
        "description": "In just a month, three Aussie boxers can call themselves world champion and bring Australia to the top of the sport after Tim Tszyu’s loss.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Replacement emerges, axe hovers over F1 star",
        "description": "Red Bull will have to pay a massive amount to get rid of Sergio Perez as speculation mounts that the team has settled on his replacement.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Brad Pitt’s unforgivable F1 act angers fans",
        "description": "F1 fans have taken aim at Brad Pitt after the Hollywood star took over the season finale and rubbed salt in the wound for a beloved driver.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Dokic’s spine-tingling speech drops jaws",
        "description": "Jelena Dokic has delivered a raw, passionate speech, showing her transformation from when she “couldn’t string a sentence together”.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Star’s $18m fortune could fall off a cliff",
        "description": "A forgotten tennis star and grand slam champion has been warned she could lose her massive fortune if her struggles continue.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Kelce flips, crashes car in scary video",
        "description": "The NFL has been left stunned as viral video captured the scary moment Jason Kelce’s car went flying off the rails.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Model’s spicy claim after viral flashing act",
        "description": "A model’s bizarre flashing stunt has taken a twist after she shared a private message thread that has got fans asking the same question.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘Honour’: Matildas legend’s $7.5m legacy",
        "description": "Matildas legend Clare Polkinghorne’s legacy will include a multimillion-dollar football centre named in her honour.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘Many will die’: Protest rocks World Cup vote",
        "description": "The vote for 2034 World Cup hosting rights has descended into farce with claims a $1 trillion “atrocity” is about to be made official.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘It would be incredible’: DDP eyes shock training partner for UFC 312",
        "description": "He was one of Dricus du Plessis’ heroes, and now the South African middleweight champion wants to train alongside him.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Dumped Aussie vying for LIV golden ticket",
        "description": "There aren’t a host of big names looking to secure a LIV Golf spot in 2025, but a dozen Aussies are among the hopefuls chasing their piece of the giant paydays.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 12",
        "description": "After some early doubts it’s time to back in the Bullets – while one player is a must-have regardless of the schedule. Here’s how to get your team set for round 12.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘Extremely tragic’: Rugby star feared dead",
        "description": "Police have released a devastating photo with a former rugby star feared dead after being swept away in shocking scenes.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "‘Golden decade’: Bold predictions for resurgent Aussies",
        "description": "A win over England raised hopes the Wallabies are on the way back and a bold new strategy for the code in Australia is predicting more waves of success.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Preusker chasing rich payday in Sydney’s The Ingham",
        "description": "Horsham trainer Paul Preusker has a two-pronged attack on the $2m The Ingham (1600m) at Randwick on Saturday with Steparty and Poison Chalice.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-11T07:26:50.947270"
    }
]