[
    {
        "title": "Trump crypto soars as president offers dinner to top holders",
        "description": "The meme coin's website says its 220 top investors will be invited to a gala event with the president.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Opportunity for big US-China trade deal, says Bessent",
        "description": "The comments from the US Treasury Secretary come as the trade war between the world's two biggest economies has escalated.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Musk to reduce Doge role after Tesla profits plunge",
        "description": "The tech boss says he intends to spend only one to two days a week on Trump administration matters.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "UK could lower US car tariffs in push for trade deal",
        "description": "UK negotiators are working \"flat out\" to get a trade deal with the US, Chancellor Rachel Reeves says.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Opportunity for big US-China trade deal, says Bessent",
        "description": "The comments from the US Treasury Secretary come as the trade war between the world's two biggest economies has escalated.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Five cards China holds in a trade war with the US",
        "description": "From rare earths to billions in US debt, here's what China has in its arsenal - and how strong they are.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Nissan boss says building cars in UK too expensive",
        "description": "The Sunderland factory pays more for electricity than any other Nissan plant, says Alan Johnson.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "A dozen US states sue to halt Trump's tariffs",
        "description": "The lawsuit argues President Trump did not have the authority to enact the levies and start a global trade war",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "The record-breaking tunnel being built from Denmark to Germany",
        "description": "The rail and road link will slash journey times between much of Scandinavia and continental Europe.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Firms say Meta not helping them to recover hacked accounts",
        "description": "Businesses around the world say they are unable to get back into their Facebook and Instagram pages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "China sends Boeing planes back to US over tariffs",
        "description": "Boeing's boss says it's looking to sell 50 more planes China has on order to other countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Apple and Meta attack 'unfair' €700m EU fines",
        "description": "The tech giants have reacted with fury, accusing the EU of unfairly pursuing US companies.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Trump hints at softening China tariffs and says no plan to sack Fed boss",
        "description": "His comments come amid a trade war with Beijing, and after his attacks on the US central bank's boss.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Pressure builds on UK finances as Reeves pushes for US trade deal",
        "description": "The government borrowed more than expected last year, placing more pressure on the public finances ahead of the full impact of US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "ChatGPT-maker wants to buy Google Chrome",
        "description": "An OpenAI executive told a US judge the company would be interested in buying the popular browser.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Why the IMF is worried about the economy - three things to know",
        "description": "The influential financial agency is projecting slower economic growth in the US due to uncertainty around President Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Why should I care if the US dollar falls?",
        "description": "Why movements in the US dollar have a massive impact internationally - and how it could affect you.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Vance calls for stronger India-US relations as trade talks progress",
        "description": "US Vice-President JD Vance is currently on a four-day visit to India with his wife and three children.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "Global growth forecast slashed by IMF over tariff impact",
        "description": "The US suffers the biggest downgrade to growth among advanced economies, in the influential International Monetary Fund's latest forecast.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
        "description": "Several Chinese solar companies with factories across the region could face steep new tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "US stocks and dollar plunge as Trump attacks Fed chair Powell",
        "description": "The president amps up attack against US central bank boss calling him \"a major loser\" for not lowering interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "US FTC sues Uber, alleging deceptive subscription practices",
        "description": "The FTC accused Uber of charging people for its Uber One subscription service without getting their consent.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "China warns nations against 'appeasing' US in trade deals",
        "description": "Beijing was responding to reports that the US will pressure other nations to restrict trade with China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "'I was careful and followed instructions closely, but still lost my crypto'",
        "description": "A customer's experience highlights issues dealing with cryptocurrency, where many regular banking safeguards do not apply.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "DHL suspends high value US deliveries over tariffs",
        "description": "The postal giant will stop shipping packages to American consumers after a rise in red tape at customs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-24T07:26:41.512185"
    },
    {
        "title": "New Harvey Weinstein Accuser Revealed as Opening Statements Begin in Retrial",
        "description": "The former Hollywood producer is being retried on a criminal sexual charge and a rape charge from his 2020 trial and a criminal sexual charge related to former model Kaja Sokola.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "American Music Awards Nominations: Kendrick Lamar Leads With 10; Post Malone Has 8; Billie Eilish, Chappell Roan and Shaboozey Earn 7 Each",
        "description": "Bruno Mars, Lady Gaga, Morgan Wallen, Sabrina Carpenter, SZA and Taylor Swift make up a group of artists with six nominations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Larry David Pens Satirical “My Dinner With Adolf” Essay, Mocking Bill Maher’s White House Visit",
        "description": "\"Here I was, prepared to meet Hitler, the one I’d seen and heard — the public Hitler. But this private Hitler was a completely different animal. And oddly enough, this one seemed more authentic, like this was the real Hitler,\" David jokes in his guest essay for The New York Times.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Carlos Santana Postpones Concert After Suffering From Dehydration",
        "description": "\"He is doing well and is looking forward to coming back to San Antonio soon as well as continuing his US Tour,\" Santana's manager said Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Roy Thomas Baker, Queen and The Cars Producer, Dies at 78",
        "description": "He notably produced the 1975 hit single “Bohemian Rhapsody,” the most-streamed song from the 20th century.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Quinta Brunson Recalls Sharing a Super Bowl Suite With Jill Biden and Secret Service Agents",
        "description": "“I was scared because they said that somebody was going to be there who is currently running the country,” the Emmy-winner said of potentially being seated alongside President Donald Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Amrit Kaur to Receive The Hollywood Reporter’s Women in Entertainment Canada Honor",
        "description": "The 'Sex Lives of College Girls’ star will receive the Breakthrough Award on May 29 in Toronto.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Latin Grammys Returning to Las Vegas for 2025",
        "description": "The annual award show comes back to Sin City for the 15th time, and the first time since 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Kevin Hart to Host 2025 BET Awards",
        "description": "The actor, comedian and mogul will emcee the 25th anniversary celebration in June.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Tina Knowles Has Been the Brains Behind the Business of Beyoncé; Now It’s Her Turn to Shine",
        "description": "“It came at a time that I was open to writing my history down,” says the author of her new book, ‘Matriarch: A Memoir.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Harvey Weinstein’s Life Behind Bars: “He’s Still Running Sh**” (Exclusive)",
        "description": "On the eve of his New York retrial, the fallen mogul spends 23 hours a day alone in his cell, reading biographies and compulsively calling his \"prison consultant\" (who also looks out for Luigi Mangione). And he still manages to phone in the occasional Page Six item.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "Maggie Baird Wants to Leave a Better World for Her Children (You Know, Billie Eilish and Finneas)",
        "description": "The Support+Feed founder — and mother of two Grammy winners — speaks with THR about plant-based eating and how the business can have a better eco footprint.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-24T07:26:42.285928"
    },
    {
        "title": "McDermott tips Kiss to succeed as Wallabies coach",
        "description": "Queensland Reds mentor Les Kiss has been endorsed ahead of his expected elevation to the role of Wallabies coach.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Brad Arthur set for shock NRL return",
        "description": "The former Parramatta Eels coach is set to be unveiled as an NRL coach once again in the coming days after a short stint in England.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "‘Elite talent’ turns back on homesickness",
        "description": "One of the AFL’s most exciting players has turned his back on lucrative offers to return to his home state.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "World’s strongest man’s wild transformation",
        "description": "Eddie Hall has undergone a spectacular body transformation ahead of his first ever MMA fight this weekend.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Brad Arthur set for shock NRL return",
        "description": "The former Parramatta Eels coach is set to be unveiled as an NRL coach once again in the coming days after a short stint in England.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "The biggest issues facing the Bears in 2027",
        "description": "Rival coaches insist player depth won’t be an issue with two new clubs set to join the NRL in coming years, with recruitment set to be the biggest test for the Bears in 2027.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Young Saints star closes in on return after latest King blow",
        "description": "The Saints are set to be without Max King for a while longer, but another young star is closing in a return to Ross Lyon’s side after a pre-season setback.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "‘Elite talent’ turns back on homesickness",
        "description": "One of the AFL’s most exciting players has turned his back on lucrative offers to return to his home state.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Cricket world stunned as star walks off",
        "description": "The cricket world couldn’t quite believe what they were watching when a star walked off the field in a head-scratching moment.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "‘I thought my face had come off’: Flintoff reveals horror crash details",
        "description": "Former England cricketer Andrew Flintoff has revealed harrowing details of his shocking Top Gear car crash, in which he suffered serious facial injuries and broken ribs.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Tennis world slams ‘creepy’ shower rule",
        "description": "Tennis players will have to abide by a new ‘creepy’ shower rule as the sport works to implement stricter doping measures.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "De Minaur powerless as Alcaraz curse extends",
        "description": "It’s the same old story for Alex de Minaur after the Aussie star got in the way of a red-hot Carlos Alcaraz on Saturday morning.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Formula 1 rocked by bombshell theory",
        "description": "A new storm is brewing after a year of internal warfare that threatened to up-end the contract of the sport’s most prized asset.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "‘Going to be painful’: F1 star’s sad reveal",
        "description": "One of the biggest moves in sporting history is already showing signs of crumbling into an embarrassing heap in 2025.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "McDermott tips Kiss to succeed as Wallabies coach",
        "description": "Queensland Reds mentor Les Kiss has been endorsed ahead of his expected elevation to the role of Wallabies coach.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Rivalry round shake up forecast. 1st Colts Rugby talking points",
        "description": "There’s nothing like a rivalry round to get the blood pumping and the adrenaline racing. And in 1st Colts, these grudge games could be extra significant. Round four news, injuries and talking points",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Hall of Fame icon loses tragic health battle",
        "description": "The NFL is mourning the loss of a Hall of Fame star who lost his battle with a debilitating disease.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Graphic texts exposed in NFL rape lawsuit",
        "description": "NFL legend turned TV star Shannon Sharpe has been accused of violently assaulting a woman and threatening to “kill” her.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Reds made to wait for PL glory as Gunners hold on",
        "description": "Liverpool remain on the brink of winning the Premier League title, with Arsenal doing just enough to delay trophy celebrations for the Reds.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Disgraced radio star’s replacement revealed",
        "description": "Marty Sheargold lost his job at Triple M in February after making vile remarks about the Matildas and he’s now been replaced.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "World’s strongest man’s wild transformation",
        "description": "Eddie Hall has undergone a spectacular body transformation ahead of his first ever MMA fight this weekend.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Aussie gun’s plan to end major drought",
        "description": "No Australian has won the opening major of the women’s season since 2006 and a the world No.5 wants to end that drought this week.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "‘Hard to get your head around’: Kembla track record holder comes to town",
        "description": "Exciting sprinter Sunrise will attempt to back up her explosive Kembla Grange victory in Saturday’s Midway Handicap at Randwick.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Shaq forced to bolt from live TV",
        "description": "While analysing a compelling Nuggets-Clippers on “Inside the NBA” alongside the rest of the crew, O’Neal made a hurried, flustered exit.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    },
    {
        "title": "Politician’s outrageous netball rant backfires",
        "description": "A self-styled “America First nationalist” who recently called for the deportation of Selena Gomez has gone on another online tirade.",
        "source": "News AU",
        "fetched_date": "2025-04-24T07:26:43.798838"
    }
]