[
    {
        "title": "Al Fayed 'used cash gifts in bid to own directors'",
        "description": "Harrods boss manipulated and controlled managers to conceal his crimes, ex-director tells the BBC.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Black Friday weekend: How to spot a deal and not get ripped off",
        "description": "Experts tell us how to work out if a deal is a genuine bargain or could leave you out of pocket.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Capturing the scent of Palestinian life in a bottle",
        "description": "Palestinian perfumers try to evoke memories of a better time with \"ingredients\" of their heritage.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Uniqlo faces China backlash over cotton comments",
        "description": "Commentators call for a boycott of the chain in China after it told the BBC it does not use Xinjiang cotton.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Black Friday weekend: How to spot a deal and not get ripped off",
        "description": "Experts tell us how to work out if a deal is a genuine bargain or could leave you out of pocket.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Major Canadian news outlets sue OpenAI",
        "description": "The suit, a first for Canada, alleges OpenAI's chatbot was illegally scraping news articles, which the firm denies.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "The specialty coffee wave sweeping small-town India",
        "description": "Once restricted to only big cities, high-end specialty coffee chains are finding new customers across India.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "'Everything's on fire': Another tough year for game developers",
        "description": "Making games is hard and, in 2024, getting people to buy them is another challenge.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "How vital is a company's CEO?",
        "description": "Boeing, Nike and Starbucks have changed their bosses, but how much difference can one person make?",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Trump proves he is serious on tariffs - but it's not about trade",
        "description": "The US president-elect is using tariffs as a weapon of diplomacy, even coercion, says BBC economics editor Faisal Islam.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "'Trump tariffs may backfire on US auto firms' - Nov 27, 2024",
        "description": "Expert says Trump's tariffs could hurt US firms as much as their Canadian counterparts in the auto industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Rupert Grint to pay £1.8m after losing tax battle",
        "description": "The former Harry Potter star is ordered to pay the sum after losing a tax appeal.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Canada’s oil patch rattled by Trump's tariff threat",
        "description": "The proposed tariffs, if applied to oil and gas, could hammer Canada's economy and hike prices at the pump for Americans, analysts say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Crypto entrepreneur eats banana artwork bought for $6.2m",
        "description": "Justin Sun described Maurizio Cattelan's infamous 2019 work as \"much better than other bananas\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Indian airlines hit by nearly 1,000 hoax bomb threats",
        "description": "More than 500 of the year's bomb threats were received just in the last two weeks of October.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Canada watchdog sues Google over alleged anti-competitive conduct",
        "description": "The suit is the latest regulatory headache for Google, which is facing similar action in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Australia approves social media ban on under-16s",
        "description": "The ban aims to reduce \"harms\" on children and will take at least a year to implement, the PM says.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "A fatal car crash in India sparks concerns over Google Maps",
        "description": "Three men allegedly using Google Maps for directions died after their car fell off an unfinished bridge.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Mark Zuckerberg dines with Donald Trump at Mar-a-Lago",
        "description": "Relations appear to have improved markedly from Trump's threat earlier this year to throw the Meta boss in jail.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Uniqlo does not use Xinjiang cotton, boss says",
        "description": "It is the first time the CEO of the chain's owner, Fast Retailing, has directly addressed the issue.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "UK electric car production drops with firms 'under pressure'",
        "description": "The trade body for the sector says these are \"deeply concerning times\" for the UK's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Uber probed by US regulator over subscription plan",
        "description": "The ride-hailing giant says it received inquiries from the FTC about Uber One cancellation procedures.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Chinese companies apologise for 'shrunken' sanitary pads",
        "description": "Chinese women have taken it upon themselves to prove that the length of sanitary pads often fall short of what is advertised.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Ford calls for incentives to buy electric cars as backlash grows",
        "description": "The government faces pressure from the industry to make changes to electric vehicle sales quotas.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Europe's flying taxi dreams falter as cash runs short",
        "description": "Makers of a new generation of European electric aircraft are struggling to raise money.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "'It's going to be hard': US firms race to get ahead of Trump tariffs",
        "description": "The US president-elect's import taxes may be just talk until he takes office - but they are having an impact anyway.",
        "source": "BBC Business",
        "fetched_date": "2024-11-30T07:24:14.206861"
    },
    {
        "title": "Sean “Diddy” Combs Denied Bail After Third Try",
        "description": "The court stressed rap mogul's propensity for violence in addition to evidence indicating his \"willingness to skirt\" rules during his stay in prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Sharon Stone Says “Ignorant” and “Uneducated” Americans to Blame for Trump Re-Election",
        "description": "The actress had some strong words about America when discussing politics at the Turin Film Festival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "The Weeknd Pairs New Album Release With One-Night-Only Concert at Rose Bowl",
        "description": "'Hurry Up Tomorrow' will drop on Jan. 24, and a day after the pop star will hold at special concert at the famed stadium.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Kamala Harris’ Team Says ‘Hot Ones’ Turned Her Down and Clarifies Joe Rogan Decision",
        "description": "Campaign staffers explain some of their podcast decisions — including not going on Joe Rogan's podcast — and how some shows rejected the candidate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Marilyn Manson Drops Defamation Lawsuit Against Evan Rachel Wood",
        "description": "The two sides reached the settlement for Manson to pay Wood's legal fees after the court last year dismissed defamation claims.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Jason Kelce Says It’s an “Immediate No” When People Ask for Taylor Swift Tickets",
        "description": "Kelce says the superstar singer has told him \"she will take care of anybody\" he asks for but that he \"doesn't want it to be that kind of dynamic.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Zach Bryan Scolds Concertgoer From Stage: “Don’t Throw Sh**”",
        "description": "The tense moment during the country singer's Washington gig over the weekend comes after ex-girlfriend Brianna \"Chickenfry\" LaPaglia claimed he was emotionally abusive.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Drake Claims UMG, Spotify “Artificially Inflated” Kendrick Lamar’s Diss Track “Not Like Us”",
        "description": "UMG says the allegations about \"Not Like Us\" — one of the biggest hits of the year — are “offensive and untrue.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Rod Stewart Will Play Coveted Legends Slot at Glastonbury Festival 2025",
        "description": "\"After all these years, I’m proud and ready and more than able to take the stage again to pleasure and titillate my friends at Glastonbury in June,\" the rock star said Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Gavin Creel Memorial to Include U.S. and U.K. Livestream",
        "description": "The memorial will be held in New York City on Dec. 2, with Broadway set to dim lights in honor of the late star on Dec. 3.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Menendez Resentencing Hearing Delayed Until January",
        "description": "During Monday's court proceeding, the brothers' attorneys asked a judge to reconsider their convictions.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Shaboozey’s “A Bar Song” Ties “Old Town Road” for Most Weeks at No.1 on Billboard Hot 100 Chart",
        "description": "The country-rap smash is spending its 19th week on top of the chart, matching a record set by Lil Nas X and Billy Ray Cyrus in 2019.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-30T07:24:14.520940"
    },
    {
        "title": "Last hope to end 10-year Aussie drought",
        "description": "There’s seven Australian flags in the top 10 going in to the final round of the Australian Open but they’ll have to stop a golfing marvel to end a winless decade for locals.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Much tougher’: Smith’s marathon effort fizzles",
        "description": "After making it his main target of a five week campaign the Australian Open title won’t be Cam Smith’s in 2024 after an almighty implosion,",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Doesn’t probably care’: Aussie gun’s Open challenge to US rival",
        "description": "After a frustrating third round Lucas Herbert will leads the Australian Open going in to the final day and has one really patriotic reason he wants to win.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Blame game erupts over F1 flop’s latest farce",
        "description": "The F1 world has finally drawn a line in the sand after Red Bull’s Sergio Perez suffered yet horrific low in what has been a disastrous season.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "AFLW GF: Where Roos-Lions blockbuster will be won",
        "description": "The AFLW Grand Final is here! Can North Melbourne go undefeated all the way to the flag? Or it will it be those big-game Lions again? Here’s everything you need to know.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Profound’: Key Dogs official steps down",
        "description": "A Western Bulldogs great has stepped down from his major administrative role after an interesting development last season.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Gutherson opens up on Eels exit",
        "description": "Clint Gutherson hasn’t thought about whether he’ll captain the Dragons next year, but he appears to be the best man for the job.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Can’t force me’: Star’s brutal NRL swipe",
        "description": "Roosters hooker Brandon Smith didn’t hold back when asked about a rumour linking him to a potential NRL destination.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Extraordinary’ proof cricket has lost the plot",
        "description": "An Australian team featuring plenty of non-Aussies has pulled off a massive but bizarre upset that sums up the modern game in a nutshell.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Aussie cricket star injured in huge Test blow",
        "description": "A key member of Australia’s Test team has been ruled out of the second Test against India due to injury in a massive blow.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Our sport is cooked’: Kyrgios blasts No. 1s",
        "description": "Aussie tennis star Nick Kyrgios has remained consistent after it was revealed former world No. 1 Iga Swiatek tested positive for a banned substance.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Tennis WAG ‘fights for life’ after F1 race",
        "description": "She forms one of tennis’ most recognisable couples with US star Taylor Fritz but Morgan Riddle has gone through the ringer recently.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Blame game erupts over F1 flop’s latest farce",
        "description": "The F1 world has finally drawn a line in the sand after Red Bull’s Sergio Perez suffered yet horrific low in what has been a disastrous season.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Schumacher’s son walks out on F1 team",
        "description": "Mick Schumacher has left his role at a Formula One team as the seven-time world champion’s son’s future hangs in the balance.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "McGregor’s fiancee says the unthinkable",
        "description": "Conor McGregor’s partner has spoken out after the civil court findings and her response is horrifying.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Ring girl’s fame reaches absurd heights",
        "description": "Boxing’s latest viral sensation continues to take the internet by storm with Sydney Thomas left overwhelmed by her new-found fame.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "20-year-old alive after death announced",
        "description": "US university Alabama A&M has explained just how it came to announcing the death of one of its students who remains alive.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "NBA world erupts over Ben Simmons act",
        "description": "Ben Simmons had one of his best games in years, but that has been largely overlooked after two on-court moments went viral.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Ange silences his critics with one answer",
        "description": "Ange Postecoglou’s face said it all after he was asked the same question twice in the space of 24 hours, and his answers were as good as it gets.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Much more to legend’s Matildas photo storm",
        "description": "Everyone was asking the same question after an NRL legend stepped into the spotlight on a Matildas icon’s big night.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "‘Most fixed thing ever’: Boxing farce stuns",
        "description": "Boxing fans have been left bewildered and horrified after an utter debacle of a fight finished in farcical scenes that many believe was fixed.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Last hope to end 10-year Aussie drought",
        "description": "There’s seven Australian flags in the top 10 going in to the final round of the Australian Open but they’ll have to stop a golfing marvel to end a winless decade for locals.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Aggressive Wildcats leave Bullets ace firing blanks",
        "description": "When the Wildcats and Bullets last met, James Batemon put 51 points on the West Australian team. On Friday night the Brisbane sharpshooter was shut down – hard.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Update on Wallabies gun after ‘stinger’ shock",
        "description": "The Wallabies have one final chance to frank their improving form with a win over the world’s second best team and have a key inclusion to help.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Wallabies coach having ‘huge’ impact",
        "description": "As the Wallabies prepare for their final Test of the year, coach Joe Schmidt’s impact on the team has been praised.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Belvedere Boys serves up a classy performance in Country Classic",
        "description": "Trainer Matthew Dunn admitted he hadn’t thought beyond the Country Classic with Belvedere Boys but he now has several options after the gelding’s impressive win at Rosehill.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    },
    {
        "title": "Australia bans Olympic medallist for life",
        "description": "Australian cycling has thrown the book at Olympic medallist Matthew Richardson, slamming the door shut after his shock defection.",
        "source": "News AU",
        "fetched_date": "2024-11-30T07:24:17.444172"
    }
]