[
    {
        "title": "Top Brazil court to vote on ban of Musk's X",
        "description": "Justice Alexandre Moraes has called on the court to vote on whether or not to uphold the suspension.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Hiking energy tax will hit growth, oil industry says",
        "description": "Investment will be cut and thousands of jobs put at risk if the windfall tax is raised, an industry body says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "UK and EU airports are sticking with 100ml liquid rule - but why?",
        "description": "Air travellers who hoped the era of \"tiny toiletries\" was nearly over are facing fresh disappointment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Collapse after collapse - why Lagos buildings keep crashing down",
        "description": "These tragedies keep occurring in Nigeria's megacity, and yet no-one is ever held to account.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Musk's X banned in Brazil after disinformation row",
        "description": "The social media giant says it refused to comply with a judge's order to appoint a legal representative.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Hiking energy tax will hit growth, oil industry says",
        "description": "Investment will be cut and thousands of jobs put at risk if the windfall tax is raised, an industry body says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Málaga tourism: 'People feel the city is collapsing'",
        "description": "Protesting locals say hordes of tourists make the city feel like a \"theme park\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "A £400m reunion? The potential risks and rewards of Oasis tour",
        "description": "After tickets for the band's reunion went on sale, many are asking: how much do the Gallaghers stand to make?",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "'A tech firm stole our voices - then cloned and sold them'",
        "description": "A voice over artist found out his voice had been taken when he heard a chatbot on a podcast using it.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "UK and EU airports are sticking with 100ml liquid rule - but why?",
        "description": "Air travellers who hoped the era of \"tiny toiletries\" was nearly over are facing fresh disappointment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "From celebs and CEOS to sport stars and tech titans, find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire?Listen to season two. New episodes out on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "'Black tax': Why some young Africans want to stop sending money home",
        "description": "Kenyan influencer Elsa Majimbo's now-deleted rant against giving family members cash renews a debate.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Mining boss opposes staff leaving office for coffee",
        "description": "Managing director of Mineral Resources Chris Ellison wants to \"hold staff captive all day long\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Will things get worse like UK PM Keir Starmer says?",
        "description": "The prime minister says the Autumn Budget will be \"painful\", so what might be in store?",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Sober Diaries: Workplace drinking culture in spotlight",
        "description": "An alcohol control coach tells BBC London about some of the clients she is helping.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Workers' rights to four-day week could be strengthened",
        "description": "Employees could get greater powers to work their contracted hours over fewer days.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Will sustainable aviation fuels take off?",
        "description": "Sustainable aviation fuels work, but can they be made in sufficient quantity to replace fossil fuels?",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Post Office handles record amount of cash",
        "description": "The increasing use of the Post Office to handle cash comes as bank branch closures continue.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Toys R Us to return to city after six years",
        "description": "The new store will open as part of a wider UK relaunch of the toy shop.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "'We were fined £50 each over £3 extra train fare'",
        "description": "Ticket inspectors are urged to treat fare dodgers differently from people who make genuine mistakes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "£1bn spent housing homeless families in England",
        "description": "Councils spent more 50% more in the past year on housing families in temporary accommodation.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Weekend strikes by LNER train drivers called off",
        "description": "Some 450 train drivers had been due to walk out this weekend before the dispute was resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "AI chip giant Nvidia shares fall despite record sales",
        "description": "The California-based technology giant has been one of the biggest beneficiaries of the AI boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Fuel duty cut could be scrapped, says RAC",
        "description": "The motoring group claims retailers not drivers have benefitted from lower tax on petrol and diesel.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "What taxes might UK chancellor Rachel Reeves raise?",
        "description": "The government says taxes will have to rise to fix the public finances - but which ones could go up?",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "UK government will not fight Rosebank oil field legal challenge",
        "description": "Greenpeace and Uplift brought judicial reviews to stop the development of the Rosebank and Jackdaw fields.",
        "source": "BBC Business",
        "fetched_date": "2024-09-02T07:21:58.010901"
    },
    {
        "title": "Thailand wages war against 'alien' tilapia fish",
        "description": "The invasive blackchin tilapia has spread to 17 provinces, threatening agriculture.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "'Why I cycled 1,500km to avoid a flight'",
        "description": "Looking for alternatives to flying, Matilda Welin decided to embark on a long-distance cycle from London to Sweden. Here's what she learned.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The flawed way we rank hurricanes",
        "description": "Scientists are racing to update the imperfect system we rely on to warn just how deadly a storm will be.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The deceptive power of a category 1 hurricane",
        "description": "Don't be lured into a false sense of security by a category one hurricane – storm surge and flooding mean they can be as dangerous as a category five.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "The tornadoes spinning over Europe’s waters",
        "description": "Spinning over water and land, these terrifying phenomena are more common than we might think",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Why animals attack humans in the wild",
        "description": "Following a spate of predator attacks on hikers and park rangers in the US, Ally Hirschlag investigates why animals attack humans in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "What if a giant solar superstorm rocked the Earth?",
        "description": "The Sun is going through a period of high activity, but it is nothing compared to an enormous solar event that slammed into our planet 14,000 years ago.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-02T07:21:58.086168"
    },
    {
        "title": "Ketanji Brown Jackson Recalls Being Scene Partners With Matt Damon in Harvard Drama Class",
        "description": "Ketanji Brown Jackson and Matt Damon once shared the stage together — and she did better than he did. In an interview with CBS Sunday Morning, the Supreme Court justice recalled being in a drama class with the Oscar winner when they were both attending Harvard University. She explained that the two never did an […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Venice Diary Day 5: A Bicycle in the Gala Theatre, Harmony Korine’s Cigar and Late Night Libations on the Lido",
        "description": "A Bicycle in the Gala Theatre Saturday kicks off with an accredited guest casually attempting to enter the Sala Grande on a bicycle. Security immediately stops him, but he retorts: “But there’s so much unused space in the foyer.” Harmony Korine’s Lighted Cigar Harmony Korine shows up at his press conference for his delirious Baby […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Family Confirms Death of Israeli-American Hostage Hersh Goldberg-Polin",
        "description": "The family of Israeli-American hostage Hersh Goldberg-Polin announced the young man’s death early Sunday, ending a relentless campaign by his parents to rescue him that included meetings with world leaders and an address to the Democratic convention last month. Goldberg-Polin, 23, was seized by militants at a music festival in southern Israel on Oct. 7. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Telluride: ‘Nickel Boys,’ Adapted from Colson Whitehead’s Book, Will Challenge Oscar Voters",
        "description": "Nickel Boys, RaMell Ross’ big screen interpretation of Colson Whitehead’s Pulitzer Prize-winning book The Nickel Boys, had its world premiere at the Telluride Film Festival’s Herzog Theatre on Friday night. Reactions among attendees, including numerous Academy members, have been strongly divided — many were impressed and deeply moved by the film, while others were left […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Venice Diary Day 3: Sex and Controversy, A Pizza for Matteo, Diapers on the Red Carpet",
        "description": "Some Like it Hot (Some Don’t) Friday was supposed to be all about eroticism. Or so they say. Halina Reijn’s Babygirl centers around a middle-aged, successful woman who, married with children, embarks on an intense sexual relationship with a young intern. She jeopardizes her career and family, but everything resolves itself in the end. Nothing […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Missy Elliott, Questlove, Ludacris and More Remember Fatman Scoop: “His Impact Is Huge”",
        "description": "Missy Elliott, Questlove and Ludacris are some of the music legends to pay tribute to Fatman Scoop, the Grammy-winning DJ and hype man who died after collapsing during a performance on Friday. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing in Connecticut. His family announced his death on Saturday morning, but […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Fatman Scoop Dead After Collapsing Onstage: DJ Was 53",
        "description": "Fatman Scoop, the Grammy-winning DJ, hype man and radio personality, died after collapsing onstage this weekend. He was 53. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing at Town Center Park in Hamden, Connecticut, per video obtained by TMZ. His family announced his death on Saturday morning, but gave no cause. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Musical Acts Who’ve Called Out 2024 Trump Campaign for Illegal Use of Their Songs",
        "description": "Over the past nine or so years the same strange and uncomfortable moment has been experienced by some of our top recording artists. Presumably, this is felt and marks an experience reserved just for them because of their talents, and it seems that it would hit as a combination of feelings: sheer dread and stark […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Drew Barrymore on Why She Regrets “Chaste” ‘Playboy’ Photos: “Never Knew There Would Be an Internet”",
        "description": "Drew Barrymore is looking back at her Playboy cover nearly 30 years later, but now with a different pair of eyes since becoming a mother to two daughters. The actress opened up in a lengthy Instagram post on Friday, titled “PHONE HOME” (referencing her 1982 movie E.T. the Extra-Terrestrial), saying she wanted to “put myself out there […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Maren Morris Says Her Son Received Death Threats After She Called Out Morgan Wallen for Using Racial Slur",
        "description": "Maren Morris shares her son Hayes received death threats after she spoke out against Morgan Wallen for using a racial slur in 2021. While appearing on Thursday’s episode of Sophia Bush’s podcast Work in Progress, Morris said that the situation “as a young mother was obviously scary.” The Grammy-winning artist continued, “It wasn’t death threats […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Adnan Syed’s Murder Conviction Still Stands in ‘Serial’ Case as Court Orders New Hearing",
        "description": "Adnan Syed’s murder conviction still stands after Maryland’s highest court Friday ordered a redo of the hearing that freed him. The court ruled that the earlier proceeding violated the rights of the victim’s family, marking the latest development in a legal saga that gained widespread attention through the hit podcast Serial. The 4-3 ruling upheld […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Doctor in Matthew Perry Death Probe Set to Plead Guilty to Conspiracy to Distribute Ketamine Charge",
        "description": "Following an appearance in a Los Angeles federal court on Friday, one of the two California doctors indicted as part of the investigation into the overdose death of actor Matthew Perry is expected to plead guilty in the coming weeks to conspiring to distribute the surgical anesthetic ketamine, a Department of Justice official confirmed with […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-02T07:21:58.437953"
    },
    {
        "title": "Validus, a Singapore-based digital SME lending platform, secures $50M debt financing to help enterprises in Indonesia",
        "description": "Validus, a Singapore-based digital lending platform for small and medium businesses, has secured $50 million in debt financing from HSBC under the ASEAN Growth Fund strategy. Validus will use the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Apple may ditch those old familiar USB-A ports in the new Mac mini",
        "description": "The Mac mini will be the next Apple device to say goodbye to USB-A, according to Bloomberg’s Mark Gurman. Apple customers have probably gotten used to seeing the familiar, rectangular…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "The case against AI art",
        "description": "No matter who powerful generative AI becomes, writer Ted Chiang says it will never create true art. Chiang is one of the most admired science fiction authors writing today, best…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Palantir’s CTO, and 13th employee, has become a secret weapon for Valley defense tech startups",
        "description": "Palantir CTO Shyam Sankar is determined to help Palantir become a driving force for defense tech startups.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "‘Emotion AI’ may be the next trend for business software, and that could be problematic",
        "description": "As businesses experiment with embedding AI everywhere, one area starting to gain more attention is Emotion AI.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Why do so many home robots still suck?",
        "description": "Home robots’ unfulfilled potential is neither because of lack of demand on the part of consumers nor lack of effort from manufacturers.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "From InstaDeep to Paystack: Here are Africa’s biggest startup exits and how much they raised",
        "description": "As we continue to monitor the growth of Africa’s tech ecosystem, it’s essential to highlight and analyze the biggest disclosed acquisitions.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Bolt reportedly threatens legal action against Silverbear Capital",
        "description": "In the latest twist in Bolt’s aggressive fundraising efforts, the fintech company’s CEO appears to have made a veiled threat of legal action against Silverbear Capital, the investment bank whose…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Bluesky tops app charts and sees ‘all-time-highs’ after Brazil bans X",
        "description": "A Brazilian court’s decision to ban X (formerly Twitter) seems to be benefiting its rivals, especially Bluesky. The microblogging platform announced late Friday that it was seeing “all-time-highs for activity”…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Is OpenAI worth $100B?",
        "description": "OpenAI could reportedly increase its valuation to $100 billion. Nvidia and Apple are apparently in talks to contribute to the company’s next fundraising round, and Thrive Capital would lead the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Amazon hires the founders of AI robotics startup Covariant",
        "description": "Amazon announced Friday evening that it has hired Covariant’s founders — Pieter Abbeel, Peter Chen, and Rocky Duan — along with “about a quarter” of the startup’s employees. It’s also…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Grammy CEO says music industry also has AI concerns",
        "description": "The rise of AI has consumed the arts, just as it has Silicon Valley. Everyone is pondering: Will AI replace me?",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Before Midjourney, there was NightCafe — and it’s still kicking",
        "description": "Learn about NightCafe’s origins, some of the challenges the platform faces, and where NighCafe will evolve from here.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "AI brings a whole new dimension to the challenge of organizational transformation",
        "description": "Organizations are people and people are messy, and you have to look beyond the tech to the end goal: implementing new software that could transform the business.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Watch out for these 10 hot startups from South Korea",
        "description": "Most of the biggest South Korean tech startups intend to pursue public offerings in either South Korea or the United States as part of their exit strategy.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Top court orders ban on Elon Musk’s X in Brazil",
        "description": "A top court in Brazil ordered an immediate, country-wide suspension of the X platform on Friday after a months-long legal battle with Elon Musk’s social media company over content moderation,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Investors are already valuing OpenAI at over $100B on the secondaries market",
        "description": "OpenAI is in talks to raise a new round of funding at an eye-popping $100 billion-plus valuation, sources told The Wall Street Journal this week. It turns out investors have…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "California’s legislature just passed AI bill SB 1047; here’s why some hope the governor won’t sign it",
        "description": "SB 1047 has drawn the ire of Silicon Valley players large and small, including venture capitalists, big tech trade groups, researchers and startup founders.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Carta’s ill-fated secondaries business finally found a buyer",
        "description": "Stock-trading startup Public has acquired the brokerage accounts of Carta’s secondaries business, TechCrunch has confirmed.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Redfin is already trying to defend against a new flat-fee real estate startup",
        "description": "Redfin is responding to a new startup that is hoping to upend the way people search for and buy homes by offering a flat-fee service. On August 29, TechCrunch reported…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-02T07:21:58.626435"
    },
    {
        "title": "Eagles great still hopes for Cox return",
        "description": "He ruled himself out days into West Coast’s coaching search – but a former teammate hopes a “heart and soul” Eagle could change his mind.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Bronco skipper returns serve to club great",
        "description": "After being accused of not supporting his coach amid a failed NRL season, Broncos captain Adam Reynolds has hit back.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "NRL denies high shot ‘crackdown’",
        "description": "The NRL admits there’s been a spike in penalties for high tackles but those at league headquarters are adamant it’s not part of their plan.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Grim fallout of Bombers collision",
        "description": "Scans have revealed the extent of damage to Bonnie Toogood’s knee after the Essendon star was in a horror collision with a teammate.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Eagles great still hopes for Cox return",
        "description": "He ruled himself out days into West Coast’s coaching search – but a former teammate hopes a “heart and soul” Eagle could change his mind.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Grim fallout of Bombers collision",
        "description": "Scans have revealed the extent of damage to Bonnie Toogood’s knee after the Essendon star was in a horror collision with a teammate.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Bronco skipper returns serve to club great",
        "description": "After being accused of not supporting his coach amid a failed NRL season, Broncos captain Adam Reynolds has hit back.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "NRL denies high shot ‘crackdown’",
        "description": "The NRL admits there’s been a spike in penalties for high tackles but those at league headquarters are adamant it’s not part of their plan.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "‘Bazball’ opener No. 1 pick in BBL Draft",
        "description": "England opener Ben Duckett, a key member of the ‘Bazball’ set up, will join the Melbourne Stars for this summer’s Big Bash.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "$20k spent to fly didgeridoo player to India",
        "description": "Australian diplomats spent nearly $20,000 of taxpayer money to fly a didgeridoo performer to India for a brief performance earlier this year.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Aussie eliminated after mid-match implosion",
        "description": "Alexei Popyrin’s breakthrough summer in North America is at an end after the rising Australian star fell to Frances Tiafoe at the US Open.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Popyrin concedes he ‘choked’ in push for first grand slam QF",
        "description": "America’s Frances Tiafoe has ended Alexei Popyrin’s chances at his first grand slam quarter final, with the Aussie conceding he ‘choked’ in a crucial game defining moment.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "‘Was I a prick?’: Ricciardo apologises for race incident",
        "description": "Australian F1 star Daniel Ricciardo has reached out to Nico Hulkenberg to apologise for an opening lap incident that did damage to both their races.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Lewis Hamilton’s F1 replacement revealed",
        "description": "Mercedes have locked in their driver line up for the 2025 F1 season, with Lewis Hamilton’s replacement finally revealed.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Hero police officer breaks her silence",
        "description": "The police officer who shot dead the Bondi Westfield stabber has reflected on the tragedy after being honoured by the NRL.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "AFL legend ‘reason’ Oasis is back together",
        "description": "Oasis left music fans across the world giddy about the Gallagher brothers’ reunion but one Aussie legend might have been behind it all.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "NFL star rookie shot over Rolex watch",
        "description": "Ricky Pearsall, a first-round draft pick by San Francisco, is in a serious but stable condition after being shot reportedly over a luxury watch.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Former AFL rookie wins NFL spot",
        "description": "There was a guarantee an Australian would be punting for the New Orleans Saints this NFL season and it was a former AFL draftee who took the spot.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "‘Matter of time’ before Socceroo stars in Bundesliga",
        "description": "Two former A-League teammates have reunited at Socceroos level for Thursday night’s World Cup qualifier against Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Aussie suspended over ‘word of endearment’",
        "description": "A Socceroo has been slapped with a two-game ban in America’s top competition for committing the most Australian moment ever.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "‘Life ban’: Huge twist in ugly Zerafa drama",
        "description": "The brother of Michael Zerafa has been banned for life after the ugly scenes on Wednesday night but Team Zerafa has hit back.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Scott’s big Tiger call after Scheffler’s $80m stunner",
        "description": "Adam Scott played through the peak Tiger Woods era and says the dominance of Tour Championship winner Scottie Scheffler is pretty similar.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Heartbreak in ‘terrifying’ $5 billion lockout",
        "description": "Australian grassroots basketball is exploding but an astonishing amount of kids are being rejected from playing, with ugly consequences.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "History beckons for Wallabies great",
        "description": "The Wallabies are buzzing after ending a significant losing streak and there’s another historic milestone set to keep the good vibes rolling.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Another new captain, 15th debutant for Wallabies",
        "description": "After two thrashings by South Africa, Wallabies coach Joe Schmidt has made another five changes as his team seeks redemption in Argentina.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Lindsay Park’s bold call to bypass Moir",
        "description": "Speedy filly Bold Bastille won’t tackle the older horses again in Saturday’s Group 1 Moir Stakes but the Lindsay Park camp will test smart sprinter Arkansaw Kid at The Valley.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-09-02T07:21:59.575834"
    }
]