[
    {
        "title": "'A tech firm stole our voices - then cloned and sold them'",
        "description": "A voice over artist found out his voice had been taken when he heard a chatbot on a podcast using it.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Collapse after collapse - why Lagos buildings keep crashing down",
        "description": "These tragedies keep occurring in Nigeria's megacity, and yet no-one is ever held to account.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Musk's X banned in Brazil after disinformation row",
        "description": "The social media giant says it refused to comply with a judge's order to appoint a legal representative.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Telegram: 'The dark web in your pocket'",
        "description": "The arrest of Telegram’s chief executive in France has ignited a debate about moderation on his app.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "'Black tax': Why some young Africans want to stop sending money home",
        "description": "Kenyan influencer Elsa Majimbo's now-deleted rant against giving family members cash renews a debate.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Collapse after collapse - why Lagos buildings keep crashing down",
        "description": "These tragedies keep occurring in Nigeria's megacity, and yet no-one is ever held to account.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Oasis: The supersonic business of band reunions",
        "description": "After tickets for the band's reunion went on sale this weekend, how much do the Gallaghers stand to make?",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Will things get worse like UK PM Keir Starmer says?",
        "description": "The prime minister says the Autumn Budget will be \"painful\", so what might be in store?",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Oasis gigs sell out as fans criticise 'dynamic pricing'",
        "description": "Some fans faced difficulties accessing websites selling tickets for the band's comeback gigs in the UK and Ireland next year.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Musk's X banned in Brazil after disinformation row",
        "description": "The social media giant says it refused to comply with a judge's order to appoint a legal representative.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "From celebs and CEOS to sport stars and tech titans, find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire?Listen to season two. New episodes out on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Sober Diaries: Workplace drinking culture in spotlight",
        "description": "An alcohol control coach tells BBC London about some of the clients she is helping.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Workers' rights to four-day week could be strengthened",
        "description": "Employees could get greater powers to work their contracted hours over fewer days.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Will sustainable aviation fuels take off?",
        "description": "Sustainable aviation fuels work, but can they be made in sufficient quantity to replace fossil fuels?",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Oasis fans angry after Airbnb booking declined",
        "description": "Liz Greenwood and Ian Wood say the property reappeared on the booking site at double the price.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "X braced for Brazil ban as judge's deadline passes",
        "description": "The social media giant says it refused to comply with a judge's order to appoint a legal representative.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Trump says insurance or government should pay for IVF",
        "description": "The campaign pledge comes after Democrats have hammered his administration's effect on abortion and reproductive rights.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "The 100ml liquid rule is back in all UK and EU airports - but why?",
        "description": "Air travellers who hoped the era of \"tiny toiletries\" was nearly over are facing fresh disappointment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Toys R Us to return to city after six years",
        "description": "The new store will open as part of a wider UK relaunch of the toy shop.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "'We were fined £50 each over £3 extra train fare'",
        "description": "Ticket inspectors are urged to treat fare dodgers differently from people who make genuine mistakes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Mining boss opposes staff leaving office for coffee",
        "description": "Managing director of Mineral Resources Chris Ellison wants to \"hold staff captive all day long\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "£1bn spent housing homeless families in England",
        "description": "Councils spent more 50% more in the past year on housing families in temporary accommodation.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Weekend strikes by LNER train drivers called off",
        "description": "Some 450 train drivers had been due to walk out this weekend before the dispute was resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "AI chip giant Nvidia shares fall despite record sales",
        "description": "The California-based technology giant has been one of the biggest beneficiaries of the AI boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Fuel duty cut could be scrapped, says RAC",
        "description": "The motoring group claims retailers not drivers have benefitted from lower tax on petrol and diesel.",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "What taxes might UK chancellor Rachel Reeves raise?",
        "description": "The government says taxes will have to rise to fix the public finances - but which ones could go up?",
        "source": "BBC Business",
        "fetched_date": "2024-09-01T07:20:13.703219"
    },
    {
        "title": "Thailand wages war against 'alien' tilapia fish",
        "description": "The invasive blackchin tilapia has spread to 17 provinces, threatening agriculture.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "First seal pup of the season arrives at sanctuary",
        "description": "Maggot's arrival comes amid a warning to people to stay away from seals in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Oxfordshire's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Oxfordshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Berkshire's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Berkshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Dorset's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Hampshire & Isle of Wight: Sunday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Dead whale washes back up on Norfolk beach",
        "description": "The RSPB who are the landowners of the beach say people and their pets should keep away.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Watch: Toad enjoys 'spa massage' in water feature",
        "description": "It is regularly seen sitting in the watermill ornament, letting water gently wash over its back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Jersey Zoo hosts world's top wildlife photography",
        "description": "The show offers a glimpse into the lives of some of the world’s most extraordinary species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Nuclear power scheme given £5.5bn of funding",
        "description": "The government says it is \"committed\" to carrying out the Sizewell C project in Suffolk.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-01T07:20:13.770834"
    },
    {
        "title": "Fatman Scoop Dead After Collapsing Onstage: DJ Was 53",
        "description": "Fatman Scoop, the Grammy-winning DJ, hype man and radio personality, died after collapsing onstage this weekend. He was 53. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing at Town Center Park in Hamden, Connecticut, per video obtained by TMZ. His family announced his death on Saturday morning, but gave no cause. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Musical Acts Who’ve Called Out 2024 Trump Campaign for Illegal Use of Their Songs",
        "description": "Over the past nine or so years the same strange and uncomfortable moment has been experienced by some of our top recording artists. Presumably, this is felt and marks an experience reserved just for them because of their talents, and it seems that it would hit as a combination of feelings: sheer dread and stark […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Drew Barrymore on Why She Regrets “Chaste” ‘Playboy’ Photos: “Never Knew There Would Be an Internet”",
        "description": "Drew Barrymore is looking back at her Playboy cover nearly 30 years later, but now with a different pair of eyes since becoming a mother to two daughters. The actress opened up in a lengthy Instagram post on Friday, titled “PHONE HOME” (referencing her 1982 movie E.T. the Extra-Terrestrial), saying she wanted to “put myself out there […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Maren Morris Says Her Son Received Death Threats After She Called Out Morgan Wallen for Using Racial Slur",
        "description": "Maren Morris shares her son Hayes received death threats after she spoke out against Morgan Wallen for using a racial slur in 2021. While appearing on Thursday’s episode of Sophia Bush’s podcast Work in Progress, Morris said that the situation “as a young mother was obviously scary.” The Grammy-winning artist continued, “It wasn’t death threats […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Adnan Syed’s Murder Conviction Still Stands in ‘Serial’ Case as Court Orders New Hearing",
        "description": "Adnan Syed’s murder conviction still stands after Maryland’s highest court Friday ordered a redo of the hearing that freed him. The court ruled that the earlier proceeding violated the rights of the victim’s family, marking the latest development in a legal saga that gained widespread attention through the hit podcast Serial. The 4-3 ruling upheld […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Doctor in Matthew Perry Death Probe Set to Plead Guilty to Conspiracy to Distribute Ketamine Charge",
        "description": "Following an appearance in a Los Angeles federal court on Friday, one of the two California doctors indicted as part of the investigation into the overdose death of actor Matthew Perry is expected to plead guilty in the coming weeks to conspiring to distribute the surgical anesthetic ketamine, a Department of Justice official confirmed with […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Tom Hanks Warns Fans About AI-Generated Ads Using His Likeness to Sell “Wonder Drugs”",
        "description": "Tom Hanks warned fans about AI-generated ads featuring his likeness to sell “wonder drugs.” “There are multiple ads over the internet falsely using my name, likeness, and voice promoting miracle cures and wonder drugs,” the actor wrote. “These ads have been created without my consent, fraudulently and through AI.” Hanks confirmed that he has “nothing […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Beyoncé, Taylor Swift, Sabrina Carpenter Among Social Category Nominees at MTV VMAs",
        "description": "MTV announced the four social categories and their nominees for its 2024 Video Music Awards. The categories that fans can vote on include song of summer, presented by Hilton, best group and two all-new categories with VMAs most iconic performance and best trending video.  Voting for the categories will be hosted on MTV’s Instagram Story. The best trending video category […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "‘Dancing With the Stars’ Pro Artem Chigvintsev Arrested on Suspicion of Domestic Violence",
        "description": "Dancing With the Stars pro Artem Chigvintsev was arrested Thursday morning on suspicion of domestic violence. According to online jail records, the professional dancer was booked into Napa County jail at 10:40 a.m. PT for California penal code 273.5(a), which states that “any person who willfully inflicts corporal injury resulting in a traumatic condition upon” a […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "In First Interview of Presidential Campaign, Harris Defends Shifting From Some Liberal Positions",
        "description": "Vice President Kamala Harris on Thursday defended shifting away from some of her more liberal positions in the first major television interview of her presidential campaign, but insisted her “values have not changed” even as she is “seeking consensus.” Sitting with her running mate, Minnesota Gov. Tim Walz, Harris was asked about changes in her policies over […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "RFK Jr. Defends Wife Cheryl Hines From Bradley Whitford’s “Bullying,” Who Chastised Her After Trump Alliance",
        "description": "Fresh off of drawing to a close his independent presidential run and joining forces with former President Donald Trump, Robert. F Kennedy Jr. spoke with TMZ on Tuesday regarding several recent events involving his wife, actress Cheryl Hines, and defended her against attacks from fellow actor Bradley Whitford, who chastised her online for standing by […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Streaming Ratings: No Originals Make Overall Top 10 for First Time Ever",
        "description": "The Olympics brought in very strong streaming numbers for Peacock during the first full week of the games. For other streamers? Not so much. No original series or movie made the overall top 10 titles in Nielsen’s streaming rankings for the week of July 29-Aug. 4. That’s a first in the four-year history of the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-01T07:20:13.868768"
    },
    {
        "title": "Bolt reportedly threatens legal action against Silverbear Capital",
        "description": "In the latest twist in Bolt’s aggressive fundraising efforts, the fintech company’s CEO appears to have made a veiled threat of legal action against Silverbear Capital, the investment bank whose…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Bluesky tops app charts and sees ‘all-time-highs’ after Brazil bans X",
        "description": "A Brazilian court’s decision to ban X (formerly Twitter) seems to be benefiting its rivals, especially Bluesky. The microblogging platform announced late Friday that it was seeing “all-time-highs for activity”…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Is OpenAI worth $100B?",
        "description": "OpenAI could reportedly increase its valuation to $100 billion. Nvidia and Apple are apparently in talks to contribute to the company’s next fundraising round, and Thrive Capital would lead the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Amazon hires the founders of AI robotics startup Covariant",
        "description": "Amazon announced Friday evening that it has hired Covariant’s founders — Pieter Abbeel, Peter Chen, and Rocky Duan — along with “about a quarter” of the startup’s employees. It’s also…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Grammy CEO says music industry also has AI concerns",
        "description": "The rise of AI has consumed the arts, just as it has Silicon Valley. Everyone is pondering: Will AI replace me?",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Before Midjourney, there was NightCafe — and it’s still kicking",
        "description": "Learn about NightCafe’s origins, some of the challenges the platform faces, and where NighCafe will evolve from here.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "AI brings a whole new dimension to the challenge of organizational transformation",
        "description": "Organizations are people and people are messy, and you have to look beyond the tech to the end goal: implementing new software that could transform the business.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Watch out for these 10 hot startups from South Korea",
        "description": "Most of the biggest South Korean tech startups intend to pursue public offerings in either South Korea or the United States as part of their exit strategy.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Top court orders ban on Elon Musk’s X in Brazil",
        "description": "A top court in Brazil ordered an immediate, country-wide suspension of the X platform on Friday after a months-long legal battle with Elon Musk’s social media company over content moderation,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Investors are already valuing OpenAI at over $100B on the secondaries market",
        "description": "OpenAI is in talks to raise a new round of funding at an eye-popping $100 billion-plus valuation, sources told The Wall Street Journal this week. It turns out investors have…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "California’s legislature just passed AI bill SB 1047; here’s why some hope the governor won’t sign it",
        "description": "SB 1047 has drawn the ire of Silicon Valley players large and small, including venture capitalists, big tech trade groups, researchers and startup founders.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Carta’s ill-fated secondaries business finally found a buyer",
        "description": "Stock-trading startup Public has acquired the brokerage accounts of Carta’s secondaries business, TechCrunch has confirmed.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Redfin is already trying to defend against a new flat-fee real estate startup",
        "description": "Redfin is responding to a new startup that is hoping to upend the way people search for and buy homes by offering a flat-fee service. On August 29, TechCrunch reported…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Apple stands by decision to terminate account belonging to WWDC student winner",
        "description": "Apple moved to terminate the Appstun developer account after multiple rejections of its app that Apple says violates its App Store guidelines.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Airbnb and fashion app By Rotation partner for free destination wedding outfits",
        "description": "By Rotation has a partnership with Airbnb to let those who’ve booked an Airbnb receive a complimentary outfit rental.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "The org behind the dataset used to train Stable Diffusion claims it has removed CSAM",
        "description": "LAION, the German research org that created the data used to train Stable Diffusion, among other generative AI models, has released a new dataset that it claims has been “thoroughly…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "North Korean hackers exploited Chrome zero-day to steal crypto",
        "description": "The North Korean hackers’ attack started by tricking a victim into visiting a web domain under the hackers’ control.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Fundraising is a lot easier when you have traction",
        "description": "Some stories emerge and die in a matter of days. Others require us to stay tuned for more, and this week brought us several of these.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Google rolls out safeguards for more of its AI products ahead of the US presidential election",
        "description": "Google is gearing up for the upcoming U.S. presidential election by rolling out safeguards for more of its generative AI products. Although the company already previously announced that it would…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "Hello Wonder is building an AI-powered browser for kids",
        "description": "Across the world, regulators have ramped up their efforts to try and increase the safety of kids on the internet. Major social networks are facing scrutiny, and as a countermeasure,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-01T07:20:14.153455"
    },
    {
        "title": "‘Cruel blow’ rocks Roosters NRL title hopes",
        "description": "The Sydney Roosters’ premiership hopes have been dealt a massive blow after a disastrous injury to star half Sam Walker.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "NFL star rookie shot over Rolex watch",
        "description": "Ricky Pearsall, a first-round draft pick by San Francisco, is in a serious but stable condition after being shot reportedly over a luxury watch.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Aussie suspended over ‘word of endearment’",
        "description": "A Socceroo has been slapped with a two-game ban in America’s top competition for committing the most Australian moment ever.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "De Minaur rewrites Aussie record books",
        "description": "Tennis star Alex de Minaur has done something no Australian male player has achieved on the court in more than two decades.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Thought she was black’: Comment goes viral",
        "description": "A comment during a footy match on Saturday stopped some in their tracks and the truth behind it has now been revealed.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "AFL legend ‘reason’ Oasis is back together",
        "description": "Oasis left music fans across the world giddy about the Gallagher brothers’ reunion but one Aussie legend might have been behind it all.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Cruel blow’ rocks Roosters NRL title hopes",
        "description": "The Sydney Roosters’ premiership hopes have been dealt a massive blow after a disastrous injury to star half Sam Walker.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Quite serious’: ACL concerns as Walker limps off",
        "description": "The Sydney Roosters have suffered a huge blow for their premiership tilt with playmaker Sam Walker suffering a serious knee injury.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "$20k spent to fly didgeridoo player to India",
        "description": "Australian diplomats spent nearly $20,000 of taxpayer money to fly a didgeridoo performer to India for a brief performance earlier this year.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Aussie one-Test prodigy ‘forced to retire’ at 26",
        "description": "Luckless one-Test Australian cricketer Will Pucovski will forever be one of the sport’s biggest what ifs after a heartbreaking decision.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "De Minaur rewrites Aussie record books",
        "description": "Tennis star Alex de Minaur has done something no Australian male player has achieved on the court in more than two decades.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "World says the same thing as Novak stunned",
        "description": "Aussie Alexei Popyrin’s wild victory over Novak Djokovic has triggered a moment the tennis world has been waiting for for over two decades.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Lewis Hamilton’s F1 replacement revealed",
        "description": "Mercedes have locked in their driver line up for the 2025 F1 season, with Lewis Hamilton’s replacement finally revealed.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Star’s message pours fuel all over F1 feud",
        "description": "A Formula 1 star has poured fuel all over his ongoing feud with a rival as their championship battle looks set to go down to the wire.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "AFL legend ‘reason’ Oasis is back together",
        "description": "Oasis left music fans across the world giddy about the Gallagher brothers’ reunion but one Aussie legend might have been behind it all.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Teen dies in her sleep aged 19: ‘So sad’",
        "description": "A promising law student and football player died suddenly last month leaving her community reeling in shock.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "NFL star rookie shot over Rolex watch",
        "description": "Ricky Pearsall, a first-round draft pick by San Francisco, is in a serious but stable condition after being shot reportedly over a luxury watch.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Former AFL rookie wins NFL spot",
        "description": "There was a guarantee an Australian would be punting for the New Orleans Saints this NFL season and it was a former AFL draftee who took the spot.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Aussie suspended over ‘word of endearment’",
        "description": "A Socceroo has been slapped with a two-game ban in America’s top competition for committing the most Australian moment ever.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Worst red card ever’: Piers Morgan erupts",
        "description": "Veteran broadcaster Piers Morgan led a chorus of backlash after an Arsenal star was sent off following an innocuous act on Sunday.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Life ban’: Huge twist in ugly Zerafa drama",
        "description": "The brother of Michael Zerafa has been banned for life after the ugly scenes on Wednesday night but Team Zerafa has hit back.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Where Aussie fans can see Cameron Smith play",
        "description": "Australian golf fans are set to have more chances to see Cam Smith in action this summer.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Step-by-step guide to picking a gun SuperCoach NBL team",
        "description": "Playing SuperCoach NBL for the first time or need a quick refresher? You’ve come to the right place. See where to start, and the players you need to piece together a winning side.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Another new captain, 15th debutant for Wallabies",
        "description": "After two thrashings by South Africa, Wallabies coach Joe Schmidt has made another five changes as his team seeks redemption in Argentina.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "‘Hurting us’: Wallabies’ ‘narrow’ focus",
        "description": "The Wallabies are still adjusting to the style of rugby coach Joe Schmidt wants them to play.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Sure Thing Captain storms into Eureka with Racenet Discovery romp",
        "description": "The final piece of the TAB Eureka puzzle has been solved with Sure Thing Captain booking a place in the world’s richest harness racing with victory in the Racenet Discovery at Menangle on Saturday night.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-09-01T07:20:15.377221"
    }
]