[
    {
        "title": "Global markets extend losses as Trump says tariffs plan going 'very well'",
        "description": "London's FTSE 100 index falls on opening and follows further declines in the Asian markets.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Trump tariffs trigger steepest US stocks drop since 2020 as China, EU vow to hit back",
        "description": "Nike and Apple were among brands worst hit, but Trump maintained the US economy would ultimately \"boom\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "What is live shopping and will it take off?",
        "description": "Big in Asia, live shopping involves brands putting on live shows to sell direct to shoppers.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Katya Adler: EU talks tough on Trump tariffs in hope of U-turn",
        "description": "The EU has enormous economic clout as the biggest single market in the world, but does not want to risk a backlash.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Trump tariffs trigger steepest US stocks drop since 2020 as China, EU vow to hit back",
        "description": "Nike and Apple were among brands worst hit, but Trump maintained the US economy would ultimately \"boom\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "'Nowhere's safe': How an island of penguins ended up on Trump tariff list",
        "description": "The remote Heard and McDonald Islands haven't been visited by humans in almost a decade.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Canadian workers on edge as car plant hits pause over US tariffs",
        "description": "Stellantis will pause operations at its Ontario plant for two weeks, leaving thousands worried about their jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Who might buy TikTok as ban deadline looms? Amazon joins bidders",
        "description": "Oracle and the founder of OnlyFans are also among names that have cropped up as the president seeks to broker a deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "The Finnish defence firms 'on steroids'",
        "description": "Helsinki has become one of the top five cities in Europe for investment in defence and security technologies.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "The Swedish city fined for missing an environmental target",
        "description": "Gothenburg has to pay a financial penalty if it misses certain annual sustainability goals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "US pharma boss: 'Tariffs are pivotal moment and hard to come back from'",
        "description": "Eli Lilly's boss tells the BBC he is doubtful tariffs will bring jobs to the US or raise billions in taxes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "How will India navigate a world on the brink of a trade war?",
        "description": "India is the world's fastest-growing major economy. How it deals with Trump will define its economic trajectory.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "UK draws up list of US products it could hit with tariffs",
        "description": "The business secretary says he wants to reach an economic deal but would take \"necessary steps' if talks failed.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "How jeans and diamonds pushed Lesotho to the top of Trump's tariffs list",
        "description": "Only Chinese goods are facing higher US tariffs than exports from Lesotho, which will be charged at 50%.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Analysis: Trump's tariffs are the biggest change to global trade in 100 years",
        "description": "The impact of the tariffs will be huge, with significant changes to long-standing global avenues of trade.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Africa can't rely on benevolence of others - Africa bank chief",
        "description": "The African Development Bank president tells the BBC how poverty shaped his world view.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "What next for products like the iPhone made in China? And more of your questions answered",
        "description": "Donald Trump slaps much of the world with a 10% baseline tariff while others face even higher rates. Our correspondents answer your questions.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "See all the Trump tariffs by country",
        "description": "A table showing all the new US tariffs announced by President Trump on Wednesday",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "How Trump's tariffs might affect you and your money",
        "description": "The UK has been hit with 10% tariffs by the US, but there is uncertainty as to the impact of them.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Europe hopes for Trump tariffs deal but prepares for the worst",
        "description": "The EU's message is that it is ready to negotiate with the US but at the same time poised to hit back too.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "The UK and US fallout from Trump's tariffs",
        "description": "The BBC's Henry Zeffman and Anthony Zurcher explain the fallout from Donald Trump's global trade tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Punitive or a gift? How five big economies see new Trump tariffs",
        "description": "BBC reporters look at how the latest US import taxes are seen in the EU, China, India, the UK and South Africa.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Russia not on Trump's tariff list",
        "description": "US media quotes the White House press secretary as saying this is because of sanctions on Moscow.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Vance confident TikTok will be sold in US as deadline looms",
        "description": "Despite the increasing number of potential buyers, neither the app nor its Chinese owner have confirmed they will do a deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Canada will respond to Trump tariffs 'with purpose and with force', Carney says",
        "description": "The PM has vows to hit back at American import taxes, having received no reprieve in the latest announcements.",
        "source": "BBC Business",
        "fetched_date": "2025-04-04T07:25:27.386165"
    },
    {
        "title": "Conan O’Brien Says It Was “Important” to Attend Kennedy Center Mark Twain Event Despite Trump Overhaul",
        "description": "“There was the question of, ‘Should I go, should I not go?’ And I felt like it was important to show up,” the comedian said during an episode of his podcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "MTV Video Music Awards to Air on CBS for First Time Via Simulcast",
        "description": "The 2025 VMAs will air live on Sept. 7 on MTV and CBS and stream on Paramount+.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Kanye West Raps About Split With Wife Bianca Censori on His New Album, ‘WW3’",
        "description": "The troubled rapper-mogul suggests trouble in his marriage on \"BIANCA,\" from his new solo album, which dropped on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Bruce Springsteen to Release Seven ‘Lost’ Albums in June",
        "description": "The albums, recorded from 1983 to 2018, will release as part of an extensive box set called ‘Tracks II: The Lost Albums.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "FIFA President Gianni Infantino Praises Los Angeles First Responders Ahead of Club World Cup",
        "description": "Games for both the 2025 FIFA Club World Cup and the 2026 FIFA World Cup will take place in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Johnny Tillotson, ‘Poetry in Motion’ Singer, Dies at 86",
        "description": "A two-time Grammy nominee, he had another popular track, \"It Keeps Right on A-Hurtin',\" that was covered by Elvis Presley.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "J-Pop Group JO1 on Their First U.S. Tour, Training Like a Superhero and New Album ‘Be Classic’",
        "description": "The 11-piece group, formed through music competition series ‘Produce 101 Japan’ is celebrating its five-year anniversary with a greatest hits compilation: “This album was something that we created with the fans together.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Mark Ronson Hospitalized After Injuring Himself During DJ Set",
        "description": "\"Two popped bicep tendons and one finished gig later, here we are, baby!\" the prolific music producer wrote on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Monument Records to Fold Eight Years After Revival",
        "description": "The record label's artists include Walker Hayes and Tigirlily Gold.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Inside Val Kilmer’s Little-Known Life as a Poet",
        "description": "Hollywood's homegrown star, known for leading man roles throughout his career, published a hard-to-find collection that now goes for $3,500.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Gavin Newsom’s Right Turn: Is Ex-Wife Kimberly Guilfoyle Behind the Wheel?",
        "description": "Plus, why Graydon Carter’s ghost writer should get a raise and Marvel’s extremely weird musical chair stunt breaks livestream records.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Morgan Wallen Selling ‘Get Me to God’s Country’ Merch Following ‘SNL’ Controversy",
        "description": "Days after the viral moment, the singer has listed T-shirts and trucker hats with the phrase for $45 on his website.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-04T07:25:27.615859"
    },
    {
        "title": "Aussie suffers huge crash at Japan F1 GP",
        "description": "Under-pressure Aussie F1 rookie Jack Doohan has been involved in a heavy collision early in practice for the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Never-seen-before act stuns cricket world",
        "description": "Cricket fans couldn’t believe their eyes when a Sri Lankan star did something rarely seen before during his debut IPL match.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Aloisi throws support behind Veart",
        "description": "Carl Veart’s coaching future at Adelaide United is clouded, but a rival who looms as a likely target for the Reds, has lauded the job that the besieged mentor has done at the South Australian club.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Hidden benefit of boom Hawks recruits",
        "description": "Hawthorn captain James Sicily has revealed a hidden benefit the club is getting out of boom off-season recruits Tom Barrass and Josh Battle.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "NRL live: Cowboys star ruled out, Panthers make changes",
        "description": "The Cowboys have suffered a blow ahead of their Panthers clash, with a star forward ruled out, while Penrith have resuffled their pack. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Ryles defends decision to release King Gutho",
        "description": "Parramatta coach Jason Ryles says he has no regrets about his decision to release Clint Gutherson despite the club crying out for his kind of leadership.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "AFL Live: No extra security at GMHBA despite MCG gun scare",
        "description": "GMHBA Stadium is not expected to beef up security for tonight’s clash between Geelong and Melbourne after yesterday’s firearm incident at the MCG. Follow for live updates here.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Hidden benefit of boom Hawks recruits",
        "description": "Hawthorn captain James Sicily has revealed a hidden benefit the club is getting out of boom off-season recruits Tom Barrass and Josh Battle.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Never-seen-before act stuns cricket world",
        "description": "Cricket fans couldn’t believe their eyes when a Sri Lankan star did something rarely seen before during his debut IPL match.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Warne medical report uncovers third drug",
        "description": "The medical report of Shane Warne’s death has come to light for the first time, revealing the truth behind claims made about his final hours.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Sinner’s ex-trainer drops doping bombshell",
        "description": "Jannik Sinner’s former trainer has reignited the doping case that rocked tennis by dropping a bombshell that’s bad news for one person.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Blame games erupt as Sinner’s ex-physical trainer breaks silence",
        "description": "The blame game has erupted as tennis world number one Jannik Sinner’s former physical trainer Umberto Ferrara breaks silence on failed doping tests.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "‘Scary’ star set to tear Australia apart",
        "description": "One player is tipped to make such a difference to Super Netball that “something will have to go horribly wrong” for her team not to win the premiership.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Aussie suffers huge crash at Japan F1 GP",
        "description": "Under-pressure Aussie F1 rookie Jack Doohan has been involved in a heavy collision early in practice for the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "‘What happened?’ Aussie rookie’s huge 300kmh crash stops practice",
        "description": "Australian Formula 1 rookie Jack Doohan has suffered a heavy crash during the second practice session at the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "‘He’ll be disappointed’: Praise for benched half",
        "description": "Queensland captain Tate McDermott is relishing the battle for the Reds’ starting halfback role with Kalani Thomas.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Ex-Wallaby’s massive NFL deal",
        "description": "Former Wallaby Jordan Petaia has been signed by the Los Angeles Chargers as he pursues his NFL dream.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "NBA ‘Bad Boy’ team goes rogue in wild fight",
        "description": "Seven players were ejected after a wild NBA brawl broke out featuring a team that is quickly earning a feisty reputation.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Coach axing leaves NBA world in shock",
        "description": "An NBA championship contender has left fans in disbelief after sacking their head coach only weeks out from the playoffs starting.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Aloisi throws support behind Veart",
        "description": "Carl Veart’s coaching future at Adelaide United is clouded, but a rival who looms as a likely target for the Reds, has lauded the job that the besieged mentor has done at the South Australian club.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Matildas blow: Why Mary Fowler won’t start against Korea",
        "description": "The Matildas have received another blow for their friendly against Korea Republic in Sydney. Live blog from 8.00pm (AEDT).",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "‘Been lied to’: Tszyu tensions explode",
        "description": "Tensions have spilled over between Tim Tszyu and his American opponent as controversy threatened to derail the Aussie’s comeback fight.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "‘Fanboying’: Lee’s friendship with pop icon",
        "description": "Min Woo Lee isn’t short of support from big names in sport and music as he prepares for next week’s Masters at Augusta.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Odd reason star deliberately scored own goal",
        "description": "Basketball star Marie Pardon has incredibly nailed a buzzer beater … only problem was it was for the wrong team.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Hawkesbury tips: She Conquers set for another first-up win",
        "description": "The Gerald Ryan and Sterling Alexiou-trained She Conquers won at Hawkesbury at her only run last campaign and can repeat that when she resumes this weekend. BEST BETS, INSIDE MAIL",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    },
    {
        "title": "Spiranac lifts lid on ‘sexual favour’ rumours",
        "description": "Golfer and social media sensation Paige Spiranac has spoken out over rumours that plagued her in the early stages of her career.",
        "source": "News AU",
        "fetched_date": "2025-04-04T07:25:29.177199"
    }
]