[
    {
        "title": "Boeing to axe 17,000 jobs amid strike and quality concerns",
        "description": "The company says all jobs are at risk as it cuts 10% of its workforce.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Forty new allegations against Al Fayed made to police",
        "description": "The Metropolitan Police had urged people to come forward with allegations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Tesla shares slide after Cybercab robotaxi revealed",
        "description": "Elon Musk revealed a prototype of the long-awaited robotaxi at a Hollywood film studio - but investors aren't wowed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "China detains iPhone maker workers in 'strange' case",
        "description": "The Taiwanese government suggested the detentions may be a case of \"abuse of power\" by Chinese police.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Firms 'pausing' hiring and investing ahead of UK government Budget",
        "description": "A leading business group says firms are delaying decisions, wanting \"more clarity\" over the government's policies.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Forty new allegations against Al Fayed made to police",
        "description": "The Metropolitan Police had urged people to come forward with allegations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Talks over £1bn UK port expansion ongoing after row",
        "description": "Reports have suggested the plan was at risk after Transport Secretary Louise Haigh's comments.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Tata leadership to remain in the family",
        "description": "Ratan Tata's half-brother Noel Tata is the new chairman of the influential Tata Trusts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Canada to cover cost of contraception and diabetes drugs",
        "description": "The government said it is the initial phase of a plan that would expand to become a publicly funded national programme.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Tesla shares slide after Cybercab robotaxi revealed",
        "description": "Elon Musk revealed a prototype of the long-awaited robotaxi at a Hollywood film studio - but investors aren't wowed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Tesla stock sell-off after robotaxi launch - 11 Oct 2024",
        "description": "The chair of the EV committee at Morningstar says it's less about the technology than the timing.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "'We're barely scraping by': Gen Z says money matters in US election",
        "description": "The rising costs of groceries and rent are driving many young voters to the polls.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "How China’s crackdown turned finance high-flyers into ‘rats’",
        "description": "Chinese authorities have been cracking down on businesses from real estate to technology to finance.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "TD Bank fined $3bn in historic money laundering settlement",
        "description": "TD Bank has pleaded guilty to US criminal charges. Prosecutors say one client laundered more than $470m in drug proceeds at the bank.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "UK-linked firms suspected of busting Russia sanctions",
        "description": "The government is investigating 37 companies - but has yet to hand out any fines, the BBC discovers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Student finds scorpion crawling inside Shein parcel",
        "description": "Sofia Alonso-Mossinger found the creature in a bag of boots which she had ordered online.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "EU delays introduction of border check system again",
        "description": "The EU pushes back introducing new biometric border checks that were due on 10 November.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "India holds state funeral for tycoon Ratan Tata",
        "description": "Thousands of people paid their last respects to one of India's most respected business leaders.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Five things we've learned from the Post Office boss",
        "description": "The quizzing of Post Office chief executive Nick Read this week produced some  key revelations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Labour accused of 'riding roughshod' on solar farms",
        "description": "A council leader hits out after a project becomes the third to be unveiled in Norfolk recently.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "How fast is the UK's economy growing?",
        "description": "How the health of the UK economy is measured, and why the GDP calculation matters.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Why even at 20 you should care about pension changes",
        "description": "There could be changes to pensions in the Budget, here's what they could mean for workers of all ages.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "How will the changes to workers' rights  affect you?",
        "description": "A major shake-up of workers' rights is on its way, but what impact will it have?",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "UK government to outline major overhaul of workers' rights",
        "description": "A major overhaul of workers' rights is planned, but the changes will not take place for two years.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Fresh rise in mortgage rates predicted",
        "description": "Recent falls in rates could come to \"an abrupt halt\" in the next few days, according to brokers",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Reeves 'must find billions more' in time for UK Budget",
        "description": "Rachel Reeves needs another £16bn to meet pledges, says influential think tank the Institute for Fiscal Studies.",
        "source": "BBC Business",
        "fetched_date": "2024-10-12T07:20:57.329489"
    },
    {
        "title": "Upgrade Your Cinematic Experience this Festival Season with LG CineBeam Q",
        "description": "This cutting-edge projector brings award-winning films right to your home.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Ryan Reynolds and Blake Lively Donate $1M to Feeding America for Hurricane Relief",
        "description": "The couple's donation for relief efforts comes on the heels of a $5 million gift from one of their closest friends, Taylor Swift.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Sean “Diddy” Combs Sex Trafficking Trial Set to Begin in May",
        "description": "The hip-hop mogul is accused of directing a vast criminal enterprise through which he assaulted and trafficked women with the help of his various businesses from at least 2008.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Ethel Kennedy, Social Activist and Widow of Robert F. Kennedy, Dies at 96",
        "description": "She had been hospitalized after suffering a stroke in her sleep last week, her family said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Rafael Nadal to Retire From Tennis After Davis Cup Finals Next Month",
        "description": "The 22-time Grand Slam champion said in his video announcement that recent years have been \"difficult\" amid injuries, adding \"I don't think I have been able to play without limitations.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Sean “Diddy” Combs Moves to Suppress Evidence of Cassie Assault Video",
        "description": "Lawyers for the hip-hop mogul claim that the government leaked footage of Combs beating the singer to secure a grand jury indictment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Taylor Swift Donates $5M to Feeding America for Hurricane Relief, Org Says",
        "description": "\"Together, we can make a real impact in supporting families as they navigate the challenges ahead,\" the organization said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Garth Brooks Sexual Assault Accuser’s Lawyers Condemn Singer for Naming Rape Victim",
        "description": "“Garth Brooks just revealed his true self,” Jane Roe’s legal team said after the country music icon apparently revealed their client’s real name in a court filing.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Did Zachary Levi Just Commit “Career Suicide”? Or Was Endorsing Trump a Lifeline?",
        "description": "Plus, Charles Manson’s granddaughter crashes a courtroom and the brains behind the futuristic 'Megalopolis' cityscape.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Ethel Kennedy Hospitalized Following Stroke, Daughter Shares: “She Is Surrounded by Family”",
        "description": "Ethel Kennedy, the oldest living member of the Kennedy family, turned 96 in April.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Al B. Sure! Accepts Award at First Major Appearance Following Call for Probe Into Kim Porter’s Death",
        "description": "The de facto head of the new jack swing movement has been quiet since he dropped a four-part Instagram post that linked the death of his ex with the Sean \"Diddy\" Combs scandal-saga.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "Omar Harfouch’s ‘Concerto for Peace’ Launches in Paris, Bridging Divides Through Music",
        "description": "An inside look at the global musical initiative aimed at promoting unity.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-12T07:20:57.568304"
    },
    {
        "title": "‘These comments’: Trolls crush Aussie star",
        "description": "Bulls guard Josh Giddey has had a devastating response to an Instagram post from his new NBA club that quickly blew up.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Wacky scenes at iconic Aussie race",
        "description": "As revheads descend on Bathurst for Australia’s great endurance race, diehard fans have taken advantage of the weather to have a bit of fun. SEE THE PICTURES.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘No chance’: Broncos star slams rumour mill",
        "description": "A Broncos hardman has rubbished suggestions he should replace Brisbane’s incumbent skipper as the Michael Maguire era looms.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "NBA superstar open to shock Boomers switch",
        "description": "Superstar Kyrie Irving, who was born in Australia, has discussed the shock possibility of joining the Boomers for the LA Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Convicted killer spotted on Ch7, drama erupts",
        "description": "A club has been warned by the AFL after a convicted killer was invited into the inner sanctum of the change rooms post game.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Saints star’s awkward coach meeting",
        "description": "An in-form St Kilda defender has confessed to a hilarious first meeting with a club great after arriving at Moorabbin.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘No chance’: Broncos star slams rumour mill",
        "description": "A Broncos hardman has rubbished suggestions he should replace Brisbane’s incumbent skipper as the Michael Maguire era looms.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Matty Johns fuels bombshell Cleary rumour",
        "description": "Talk about a potential major Nathan Cleary move just won’t go away, with Matty Johns expressing his “fear” over the switch.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘Heartbroken’: Aussie Cup campaign derailed",
        "description": "Australia’s T20 World Cup campaign has been derailed despite the team’s comprehensive victory over Pakistan in Dubai.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Redback’s marathon knock sends statement",
        "description": "South Australia’s new captain played a stirring innings to save his side as Test stars flexed their muscles on the final day of Shield action.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘Bloody long journey’: Hewitt’s update on son",
        "description": "Lleyton Hewitt has revealed his excitement at son Cruz’s progress ahead of a potential Australian Open return.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Federer post says it all after sad Nadal reveal",
        "description": "Roger Federer has led the emotional tributes paid to Rafael Nadal as the Spanish tennis icon announced his retirement.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Wacky scenes at iconic Aussie race",
        "description": "As revheads descend on Bathurst for Australia’s great endurance race, diehard fans have taken advantage of the weather to have a bit of fun. SEE THE PICTURES.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘Is he serious’: Ricciardo claim slammed",
        "description": "While the tears flowed amid claims of an injustice, Daniel Ricciardo has copped a vicious spray from a fellow F1 winner.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Aussie star and F1 heiress share baby news",
        "description": "Aussie snowboarder Scotty James and his F1 billionaire heiress wife Chloe Stroll been inundated with messages of congratulations.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Insane amount Michael Jordan spent on plane",
        "description": "NBA legend Michael Jordan just bought a car for $3 million and now he’s dropped a jaw-dropping amount on a private jet that’s one of the fastest in aviation.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘These comments’: Trolls crush Aussie star",
        "description": "Bulls guard Josh Giddey has had a devastating response to an Instagram post from his new NBA club that quickly blew up.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "NBA superstar open to shock Boomers switch",
        "description": "Superstar Kyrie Irving, who was born in Australia, has discussed the shock possibility of joining the Boomers for the LA Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Stalwart eyeing ‘Roos return",
        "description": "He has been missing from the past couple of Socceroos squads, but one of Australia’s best players remains hopeful of being recalled to the national team.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Socceroos skipper axed for a reason",
        "description": "Socceroos captain Mat Ryan is seemingly facing a tough battle to win his spot back in Australia’s best 11.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Aussie boxer receives huge legal win on the eve of world title fight",
        "description": "Jai Opetaia has already secured a knockout win two days out from his IBF cruiserweight world title defence in Saudi Arabia, with a monster $1.6 million court case victory against a former promoter.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Rising star Smylie leads the way in WA PGA",
        "description": "A flying finish has given rising star Elvis Smylie share of the lead at halfway mark of the WA PGA in Kalgoorlie.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘These comments’: Trolls crush Aussie star",
        "description": "Bulls guard Josh Giddey has had a devastating response to an Instagram post from his new NBA club that quickly blew up.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "‘Exposed’: Axed team’s fight for $30m",
        "description": "After being shuttered by Rugby Australia and dumped from Super Rugby, the Melbourne Rebels have taken this action.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Switzerland makes timely run for Everest slot",
        "description": "Boom colt Switzerland bounced back from a first-up flop with a strong win in the Roman Consul Stakes and gave owners Coolmore something to ponder for its Everest slot.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-12T07:20:59.214867"
    }
]