[
    {
        "title": "HBO and CNN owner to split streaming and cable businesses",
        "description": "The media giant will separate its studio and streaming business away from its cable TV networks.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "China's electric cars are becoming slicker and cheaper - but is there a deeper cost?",
        "description": "The future for EVs will inevitably involve China. But where does that leave the UK and Europe markets – and what of the questions around national security?",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "'I burst into tears': How airline carry-on confusion triggered legal row",
        "description": "Budget airlines may be forced to standardise rules on underseat bags, under a proposed change to EU law.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "How India's 'biggest art deal' buried MF Husain masterpieces in a bank vault",
        "description": "The paintings are set to go up for auction for the first time on 12 June in India's financial capital, Mumbai.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "China's electric cars are becoming slicker and cheaper - but is there a deeper cost?",
        "description": "The future for EVs will inevitably involve China. But where does that leave the UK and Europe markets – and what of the questions around national security?",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "US and China meet for trade talks in London",
        "description": "Fresh talks aimed at resolving the trade war between the world's two largest economies are taking place.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Canada pledges to meet Nato's 2% defence spending target within a year",
        "description": "Prime Minister Mark Carney said Canada could no longer be dependent on the US for its security, and must act to secure its own borders.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Trump-Musk row heightens fears over Nasa budget cuts",
        "description": "The space agency has published its budget request to Congress which would see funding for science projects cut by nearly a half.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "How airline fees have turned baggage into billions",
        "description": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "US green energy firms brace for federal funding cuts",
        "description": "Billions of dollars of US federal funding for green energy projects hangs in the balance.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Pressure on as US-China resume trade talks - 9 Jun 2025",
        "description": "Markets react well as negotiators from Washington and Beijing meet in London to find a way forward.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Drone shows are booming. Could this spell the end for fireworks?",
        "description": "Light shows involving hundreds and even thousands of drones are becoming big attractions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Britain's energy bills problem - and why firms are paid huge sums to stop producing power",
        "description": "Could the government's radical plan to change the way the UK distributes electricity really bring down bills - or just lead to a postcode lottery?",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Will Musk's explosive row with Trump help or harm his businesses?",
        "description": "Experts say his tech empire needs more of Musk's attention - but also the continued custom of the government.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Spending Review: Massive cheques from the UK chancellor for some - but what do totals hide?",
        "description": "The total spend may be enormous, writes Laura Kuenssberg, but fears it could be “painful” for some remain.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "How Trump and Musk are still linked - despite falling out",
        "description": "Political contributions, government contracts and staff with divided loyalties mean the fallout may have only just begun.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "On board the driverless lorries hoping to transform China's transport industry",
        "description": "Driverless lorries are now operating across China - but public concern about these vehicles remains.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "The decades-old intrigue over an Indian guest house in Mecca",
        "description": "A now-demolished guest house in Mecca is at the centre of a bitter family tussle in India.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "India central bank delivers sharp rate cut as growth and inflation fall",
        "description": "India's economy grew by 6.5% in the previous financial year ending March, data last week showed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "M&S hackers sent abuse and ransom demand directly to CEO",
        "description": "The criminals told the retailer's boss he could make things \"fast and easy\" if he complied with their demands.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Tesla shares tumble as Trump-Musk feud erupts",
        "description": "Tesla shares plunged 14%, marking one of the steepest declines in months as Musk and Trump battled online.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "India leads in remittances - but Trump's tax could deal a blow",
        "description": "Trump's proposed 3.5% tax on remittances by foreign workers could seriously impact top recipient India.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Lululemon shares plunge as Trump tariffs bite",
        "description": "The athleisure brand joins a growing list of big firms to warn about the impact of Trump's policies.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Dr Martens profits slump by more than 90%",
        "description": "The company says a challenging market and uncertainty about tariffs are having an effect.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Tariffs prompt record plunge in US imports",
        "description": "American purchases of Canadian goods in April fell to the lowest level since 2021.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Trump confirms China trip after 'very good' call with Xi",
        "description": "The leaders of the US and China agree to further talks aimed at reaching a deal amid an ongoing trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "US-Boeing deal over crashes 'repugnant' - lawyer for victims' families",
        "description": "The plane maker has agreed to pay $1.1bn to avoid prosecution over two fatal crashes that killed 346 people.",
        "source": "BBC Business",
        "fetched_date": "2025-06-10T07:27:42.247190"
    },
    {
        "title": "Doechii Calls Out Trump’s “Ruthless Attacks” Amid L.A. Protests in BET Speech: “What Type of Government Is That?”",
        "description": "\"I want y'all to consider what kind of government it appears to be when every time we exercise our democratic right to protest, the military is deployed against us,\" the \"Alter Ego\" rapper said Monday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Thank You, Sly Stone",
        "description": "The journalist who got the late funk legend to break his decades-long silence pays tribute to his indelible message of hope — needed now more than ever.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "BET Awards 2025: Snoop Dogg, Keke Palmer, Tyler Perry and More Stars Walk the Carpet",
        "description": "Host Kevin Hart, Doechii, Machine Gun Kelly, Shaboozey, Jordin Sparks and Andra Day also attended the awards ceremony in Los Angeles on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Vin Diesel and Laverne Cox Among Speakers at 2025 CAA Amplify Summit",
        "description": "ACLU executive director Anthony Romero, former prime minister of New Zealand Dame Jacinda Ardern and CEO of Microsoft AI Mustafa Suleyman will also head to Laguna Beach for the annual summit.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Diddy’s Ex Passed Out After Reading Cassie’s Lawsuit Describing “Freak-Off” Orgies",
        "description": "The rap mogul's girlfriend until his arrest in September continued to testify on Monday about alleged abuse, gaslighting and finding her agency as the relationship declined.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Questlove Remembers Sly Stone: “He Dared to Be Simple in the Most Complex Ways”",
        "description": "The Grammy-winning musician produced and directed a documentary on Stone’s life and legacy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Sly Stone, Funk-Rock Pioneer, Dies at 82",
        "description": "The legendary artist died following a prolonged battle with COPD, his family said Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Frederick Forsyth, Author of ‘The Day of the Jackal,’ Dies at 86",
        "description": "The British journalist turned novelist wrote other thrillers that became movies, too, including 'The Odessa File,' 'The Dogs of War' and 'The Fourth Protocol.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Jared Leto’s Rep Denies Claims of Inappropriate Relationships With Women",
        "description": "The investigation, published Saturday by Air Mail, contains interviews with nine women, the majority of whom are anonymous and allege that Leto behaved inappropriately with them more than a decade ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Justin Baldoni’s $400 Million Defamation Lawsuit Against Blake Lively Tossed Out",
        "description": "In a major victory for Lively and husband Ryan Reynolds, a New York federal judge has sided with the actress in a messy legal battle involving her 'It Ends With Us' director and co-star, whom she accused of alleged sexual harassment and weaponizing social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Taylor Swift’s ’Reputation’ Album Surges Back to Top Five on Charts Following Masters Purchase",
        "description": "Swifties have come in full force streaming Swift's old albums after the superstar announced she'd purchased her old catalog.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    },
    {
        "title": "Jurors Raise Concerns About Harvey Weinstein Deliberations",
        "description": "His attorney Arthur Aidala has repeatedly called for a mistrial, and been denied, as he said jurors are improperly considering Weinstein's past behavior.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-10T07:27:42.552669"
    }
]