[
    {
        "title": "How Jaguar lost its way - long before that controversial advert",
        "description": "What is really happening behind the scenes at the car brand",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "A $6.2m banana, a crypto empire and Trump's potential conflicts",
        "description": "Trump's expanding business ventures have made it easier than ever for those hoping to influence US policy to steer money his way.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "'It's an old person's drink': Is Britain's love for tea cooling off?",
        "description": "Experts say tea has been in decline for years, as younger people in the UK prefer alternatives.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "'Why I spent £85k of my own money to help fix Britain's housing crisis'",
        "description": "Dr Jess Steele put her money into a project providing affordable homes to people in her community.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "A $6.2m banana, a crypto empire and Trump's potential conflicts",
        "description": "Trump's expanding business ventures have made it easier than ever for those hoping to influence US policy to steer money his way.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Dorothy's ruby slippers sell for $28m at auction",
        "description": "The shoes, worn by Judy Garland in the classic 1939 movie, went for $25m more than the auctioneer's estimate.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "How a uranium mine became a pawn in the row between Niger and France",
        "description": "France's nuclear giant has lost control of its uranium mining operations in the West African state.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Killing of insurance CEO reveals simmering anger at US health system",
        "description": "Long-standing frustrations were revealed online after a health insurance executive was shot and killed in New York City.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Why is vintage audio equipment booming?",
        "description": "Music lovers are buying up old cassette, CD and record players and getting them fixed.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Why are doctors wary of wearables?",
        "description": "Wearable tech claims to help monitor our health, but many doctors remain sceptical.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "US Fed uncertain over interest rate cuts - 6 Dec 2024",
        "description": "Could the November rebound in the US jobs figures deter the Federal Reserve from cutting interest rates?",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Nightclub stickers over smartphone rule divides the dancefloor",
        "description": "A new nightclub is opening in Manchester and introducing a strict no phones on the dancefloor policy.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "'I don't know how we'll survive': War-damaged Lebanese businesses face the unknown",
        "description": "Traders and shop-owners lost their livelihoods as a result of destruction from Israeli attacks.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "What happened when India banned TikTok",
        "description": "TikTok was one of India's most popular apps – until it was banned in 2020. It's a lesson for what might unfold if a US ban goes ahead.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "TikTok set to be banned in the US after losing appeal",
        "description": "The app - which faces being banned in a matter of weeks - says it will now take its case to the Supreme Court.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Boohoo bosses stalking allegations investigated by police",
        "description": "The retailer has also told the information watchdog about surveillance equipment outside its head office.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "EU tries to get closer to South America with trade deal",
        "description": "The pact promises lower tariffs but may still meet resistance from European countries.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Online star Hawk Tuah girl faces crypto coin criticism",
        "description": "Haliey Welch's \"Hawk\" digital coin shot up in price then lost 95% of its value just hours after it launched.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Boeing plea deal over fatal Max crashes rejected",
        "description": "The deal undermines the court and involves \"contradictory\" diversity requirements, a judge ruled.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "US jobs bounce back after hurricanes and strikes",
        "description": "Employers added 227,000 jobs in November as markets look ahead to what it means for interest rates.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Trump tariff threat puts a strain on Canada-Mexico ties",
        "description": "Canadian officials have suggested striking their own trade agreements with the US - and Mexico has taken notice.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Observer newspaper sale to Tortoise Media approved",
        "description": "The Scott Trust and Guardian Media Group agreed the sale on Friday, despite pushback from staff.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "What an accountant-turned-mechanic says about Ghana's election",
        "description": "To curb unemployment, Mahamudu Bawumia has promised a \"digital economy\" and John Mahama a \"24-hour economy\".",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "What we know about NYC killing of healthcare executive",
        "description": "Police are still working to determine a motive in the killing as the hunt for the gunman expands beyond New York City.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Who was Brian Thompson, healthcare CEO gunned down in New York?",
        "description": "Police are still searching for the suspect who shot dead the UnitedHealthcare CEO in Manhattan on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "What next for Bitcoin after bursting $100k barrier?",
        "description": "The rapid increase in price has been attributed to Donald Trump's election victory - can it continue?",
        "source": "BBC Business",
        "fetched_date": "2024-12-08T07:24:53.421043"
    },
    {
        "title": "Bowen Yang Wants Fans to Stop Tagging Him in Photos of Other Asian People: “I Hate the Internet Because of It”",
        "description": "\"You guys can stop tagging me in that. No, thank you. It makes me not wanna use the platform,\" the 'Saturday Night Live' star says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Sony Music Publishing Debuts Lavish New Hollywood Offices: “A Disneyland for Songwriters”",
        "description": "The latest arrival to L.A.’s media district is home to songs by Beyonce, The Beatles and Ed Sheeran, among many others.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "‘Alter Ego’ Turns the Making of a Superhero Movie Into a Thriller",
        "description": "Alex Segura is behind the novel, which takes place in the same world as his 2022 book 'Secret Identity.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Laura Benanti Says “F*** You Forever” to Former Broadway Co-Star Zachary Levi",
        "description": "During an interview on 'That's a Gay Ass Podcast,' Benanti says she \"never liked\" Levi while they shared the stage and even less so now after what he shared about Gavin Creel in the wake of his tragic passing.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Mariah Carey Responds to Claims Her Spotify Wrapped Video Was Made With AI",
        "description": "The \"All I Want for Christmas Is You\" singer thanked her fans in a video message released as part of the music streaming service's year-end celebration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Spider-Man Watches, Dungeons & Dragons Stamps and an ‘Alien: Romulus’ VHS: The Heat Vision Holiday Gift Guide",
        "description": "From stocking stuffers to massive Lego sets, we've got you covered if you're buying for loved ones, co-workers, or yourself (yeah, you are).",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Harvey Weinstein’s Lawyer Fears He Will Die in Rikers Island Due to Mistreatment by “Vindictive” Prison Officials",
        "description": "“He had blood spattered on him,\" his attorney Imran H. Ansari says. \"I was shocked to see that any prisoner would be treated that way.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Taylen Biggs, 11-Year-Old Media Personality, Signs With Wasserman Creators for Representation",
        "description": "News of the partnership comes after Biggs made her acting debut in Hallmark’s 'Holiday Touchdown: A Chiefs Love Story,' which premiered just days ago on Nov. 30.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Lance Bass Says CW Pilot Was Halted After He Came Out",
        "description": "While appearing on the 'Politickin' podcast, Bass recalled being told, \"We can’t do the show anymore. Like, they have to believe that you’re straight to play a straight character.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Taylor Swift ‘Eras Tour Book’ Sells Nearly 1M Copies in First Week",
        "description": "The book, which is being exclusively sold in Target stores nationwide, is the highest-selling week one new release print book of 2024 to date and the fastest-selling new release book of the last four years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "‘Baby Reindeer’ Star Jessica Gunning, ‘One Day’ Breakout Ambika Mod Among Women in Film & TV Award Winners",
        "description": "The guests at London's Park Lane Hilton event also included 'Emilia Pérez' leads Zoe Saldaña and Karla Sofía Gascón, 'Rivals' actor Katherine Parkinson, and 'Doctor Who' boss Russell T. Davies",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "Dick Van Dyke Says He’s “Not Afraid” of Dying Ahead of 99th Birthday, Reflects on Life and Career in Coldplay’s New Music Video",
        "description": "The legendary icon features in the \"All My Love\" video, where he gives access to his Malibu home and talks about his Hollywood legacy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-08T07:24:54.271998"
    },
    {
        "title": "‘Worst in history’: Boxing farce explodes",
        "description": "There was only one person in the world who thought Aussie boxing champion Liam Paro wasn’t dethroned in a shock world title loss.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Wanker’ chant erupts at Adelaide Oval",
        "description": "Australia have levelled the Test series against India, but all the attention is on an Indian bowler who has hit back at Aussie Travis Head.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘You’re a disgrace’: Ugly incident rocks Test",
        "description": "Travis Head has had the final word after he was dismissed in fiery scenes as Indian quick Mohammed Siraj became a fully fledged “villain”.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Not a loss, it’s a lesson’: Paro vows to bounce back",
        "description": "Queenslander Liam Paro has promised to rebuild after suffering the first loss of his professional career, falling to Richardson Hitchens in Puerto Rico.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "WATCH: Swans academy stars going viral on TikTok",
        "description": "The Swans Academy has already helped uncover future AFL and AFLW stars — and thanks to a new Tiktok series, the next generation of young talent could become household names even earlier.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "BT’s shock Channel 7 move revealed",
        "description": "He may be one of the most recognisable voices in AFL media but Brian Taylor is set for a massive move ahead of the 2025 season.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Move over Nathan, Mary’: New power couple",
        "description": "Rugby league has a new power couple after two superstar speedsters went public with their relationship, delighting footy fans.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Reece Robson quits, signs with NRL powerhouse",
        "description": "The Cowboys have lost a key player to a rival club, with the representative star joining the Roosters in 2026.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Wanker’ chant erupts at Adelaide Oval",
        "description": "Australia have levelled the Test series against India, but all the attention is on an Indian bowler who has hit back at Aussie Travis Head.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘You’re a disgrace’: Ugly incident rocks Test",
        "description": "Travis Head has had the final word after he was dismissed in fiery scenes as Indian quick Mohammed Siraj became a fully fledged “villain”.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Kyrgios Aus Open mystery finally answered",
        "description": "A key question has been answered over Nick Kyrgios’ Australian Open comeback plans as the tournament released the full list of entrants.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Brisbane options limited for Tomic",
        "description": "If Bernard Tomic wants to try to qualify for the Brisbane International, he will need some help from tournament organisers.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Aussie trio about to shock the fight world",
        "description": "In just a month, three Aussie boxers can call themselves world champion and bring Australia to the top of the sport after Tim Tszyu’s loss.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Idiot’: Lewis Hamilton incident is just sad",
        "description": "Lewis Hamilton has been given a public apology after an “idiotic” incident on a sad day at the Abu Dhabi Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Not good’: Fiery F1 feud twist as Piastri tears up Abu Dhabi track",
        "description": "Oscar Piastri is setting himself for a big finish to the F1 season, clocking the second-fastest time in practice ahead of the Abu Dhabi Grand Prix – but all eyes were on the sport’s feuding stars.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Move over Nathan, Mary’: New power couple",
        "description": "Rugby league has a new power couple after two superstar speedsters went public with their relationship, delighting footy fans.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Comedian’s priceless reply to Raygun lawyers",
        "description": "An Aussie comedian has produced a sensational reply after Olympian Raygun’s lawyers took legal action over a new musical.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Dude is ridiculous’: Aussie wins NBA gong",
        "description": "Aussie guard Dyson Daniels has claimed a huge NBA award and earned massive plaudits from his Atlanta Hawks teammates.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Who’s the new NFL MVP frontrunner with the superstar fiancée?",
        "description": "It was a Thanksgiving Week for the ages for the new MVP frontrunner, and can anyone outside the top 4 contend for the Super Bowl?",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Sad’: Teen’s football dream destroyed",
        "description": "The Sydney teen, 15, saved up to fly across the world to see the historic fixture only for it to be called off due to the weather.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Horror as $50m star airlifted to hospital",
        "description": "Sickening details of a crash and rescue operation have emerged after a star footballer needed to be cut from his car.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "‘Worst in history’: Boxing farce explodes",
        "description": "There was only one person in the world who thought Aussie boxing champion Liam Paro wasn’t dethroned in a shock world title loss.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Quayle on the cusp of greatest comeback in Aussie golf history",
        "description": "Despite a ‘rookie mistake’ that cost him a staggering seven shots in the opening round, Anthony Quayle is closing in on one of greatest comebacks in Australian golf history at the Victorian PGA.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "NBL: Bullets shoot through for shock win over United",
        "description": "Brisbane has pulled one of the biggest upsets of the season over Melbourne United, while two of the Kings’ biggest stars guided them to a huge win despite illness. CATCH ALL THE ROUND 11 NEWS.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Rugby moves to secure Wallabies stars as NRL poachers circle",
        "description": "Rugby Australia has moved to secure the futures of several off-contract Wallabies as the NRL considers salary cap concessions to raid the 15-man code’s biggest stars. Find out more inside.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Wallaby gut punch as star makes NFL move",
        "description": "One of the Wallabies’ most exciting players has announced he is gambling everything to chase his dream in the United States.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Monday Racebook: Aleppo Pine stamps Blue Diamond credentials",
        "description": "Herald Sun racing writer Gilbert Gardiner’s horses to follow and forgive from Ballarat Cup Day.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    },
    {
        "title": "Olympian ‘deathly pale’ after ugly crash",
        "description": "A double Olympic road cycling champ suffered horror injuries after a postal van worker opened their car door in front of him on a ride.",
        "source": "News AU",
        "fetched_date": "2024-12-08T07:24:56.422443"
    }
]