[
    {
        "title": "Roman Abramovich could owe UK £1bn over tax dodge that helped bankroll Chelsea FC",
        "description": "Scheme to avoid tax on offshore billions may have been botched because money was managed from the UK, BBC learns.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Trump offers millions of federal workers eight months' pay to resign",
        "description": "The buyout offer to those who do not want to return to the office is part of the president's plan to shrink the US government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Boeing loses almost $1bn every month in 2024",
        "description": "Boeing reported its second biggest annual loss ever after a tough year following a mid-air accident and worker strikes.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "UK will not be able to resist China's tech dominance",
        "description": "China's AI success has come from policy and Chancellor Rachel Reeves's recent visit to China highlights the importance of a close relationship.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Trump offers millions of federal workers eight months' pay to resign",
        "description": "The buyout offer to those who do not want to return to the office is part of the president's plan to shrink the US government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "China's DeepSeek AI on US national security radar",
        "description": "The White House is looking into whether China's apparent AI breakthrough affects US national security.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "What's the plan for a third runway at Heathrow Airport?",
        "description": "The chancellor says expanding Heathrow would boost growth, but there is a lot of vocal opposition.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "US tech stocks steady after DeepSeek AI app shock",
        "description": "DeepSeek's claim that its model was made at a fraction of the cost of its rivals has rocked the AI industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "DeepSeek shows AI's centre of power could shift away from US",
        "description": "The app's strong debut has shaken beliefs that the US would remain the unchallenged global AI superpower, writes the BBC's Marc Cieslak.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Inside the race for Greenland's mineral wealth",
        "description": "The territory's untapped mineral wealth has caught the eye of both mining firms and Donald Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Women's sport 'becoming a key asset class' - 28 Jan 2025",
        "description": "Basketball boss Nadia Rawlinson on why women's sport is scoring high as an asset class.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "How China's 'AI heroes' overcame US curbs to stun Silicon Valley",
        "description": "How did a little-known Chinese start-up build a powerful new AI model despite restrictions?",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Abramovich dodged millions in tax with superyachts-for-hire scheme",
        "description": "Shell companies were used to charter the sanctioned oligarch’s yachts to himself, evading VAT, BBC reveals.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "China's DeepSeek AI shakes industry and dents America's swagger",
        "description": "The app spooked the markets as well as the bullish sense of American superiority in AI development.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "White House defends freezing funds as 'reasonable' while Democrats express 'extreme alarm'",
        "description": "The order is \"a potential five-alarm fire\" for organizations that serve    communities, nonprofit group executive says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Microsoft in talks to buy TikTok, Trump says",
        "description": "The US President says he would like to see a \"bidding war\" over the sale of the social media app.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Coca-Cola recalls drinks over safety concerns",
        "description": "The company says the drinks contain \"higher levels\" of chlorate, but says the risk is \"very low\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "The Chinese AI app that has the world talking",
        "description": "A Chinese startup has built a low-cost AI model using less technologically advanced chips.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Is China's AI tool DeepSeek as good as it seems?",
        "description": "The artificial intelligence (AI) tool has shocked US markets after bursting onto the scene.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Jaguar Land Rover bets $80m on bespoke paint services",
        "description": "The firm says it will more than double its capacity for bespoke paint orders for wealthy customers.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Colombia yields on US deportation flights to avert trade war",
        "description": "President Gustavo Petro agrees to accept deported migrants after Trump ordered 25% tariffs on all goods.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "New Zealand eases visa rules for 'digital nomads' to boost tourism",
        "description": "Visitors can now carry out remote working for a foreign employer while holidaying in the country for up to 90 days.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Will a third runway at Heathrow help UK growth?",
        "description": "Chancellor Rachel Reeves is set to announce expansion plans but some question the short-term benefits.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "'We are not lazy' - Working from home criticism sparks anger",
        "description": "Hundreds of BBC readers disagreed with former Asda boss Lord Rose's view that working from home is \"not proper work\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Top executives resign over Japanese TV host's sex scandal",
        "description": "Companies have pulled advertisements from Fuji TV, which was criticised for covering up the scandal.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "'I'm slowly paying off £7,000' – Tips from those tackling debt",
        "description": "People who have fought their way out of debt give their best advice on coping in tough financial times.",
        "source": "BBC Business",
        "fetched_date": "2025-01-29T07:22:01.178281"
    },
    {
        "title": "Selena Gomez Told by Border Czar to Cry to Congress as Senate Hopeful Calls for Deportation",
        "description": "The singer-actress had posted and deleted a video of her sobbing over ICE raids.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "White House Says It Is Opening Briefing Room to “Podcasters, Social Media Influencers and Content Creators”",
        "description": "Press Secretary Karoline Leavitt announced the new policy during her first press briefing Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Caroline Kennedy Excoriates RFK Jr. Ahead of Confirmation: “a Predator”",
        "description": "\"He put baby chickens and mice in the blender,\" she says of her cousin, chosen by President Trump to head HHS.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "BFI Raises Alarm Over Trump’s “Protectionist Language Around Hollywood”",
        "description": "British Film Institute Chair Jay Hunt spoke at a U.K. parliamentary inquiry on Tuesday about the \"protectionist language around Hollywood\" since Trump reclaimed the White House.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Google Maps to Alter Names of Denali and Gulf of Mexico After Trump Executive Order",
        "description": "The tech giant revealed the reasons behind the proposed changes on social media after receiving questions from users.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Hayley Williams, Finneas and St. Vincent Among Performers at Latest L.A. Fire Relief Benefit Concert",
        "description": "G*ve A F*ck L.A., a benefit concert and auction for those impacted by the recent wildfires, will be held at the Hollywood Palladium.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Blink-182 Announces L.A. Fire Relief Concert",
        "description": "The rock band is holding a one-night-only performance at the Hollywood Palladium, with 100 percent of ticket proceeds going toward various L.A. wildfire relief efforts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Bill Gates Admonishes Elon Musk Over Meddling in Foreign Politics: “This is Insane S***”",
        "description": "The Microsoft founder and former richest man in the world slammed the current wealthiest CEO as he tries to pull political strings in the U.K. and Germany.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Selena Gomez Sobs Over Trump’s Deportations in Emotional Video",
        "description": "The singer posted — and then deleted — a tear-filled Instagram video about ICE arrests.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Grammys 2025: The Complete Guide to Parties and Events (Updating)",
        "description": "Though many of the celebrations surrounding music's biggest night have been canceled following the L.A. fires, a handful of key events are still on.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Lady Gaga Announces New Album ‘Mayhem’",
        "description": "The third single and music video from the singer’s highly anticipated album will premiere during a Grammy Awards commercial break.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Freed Israeli Hostage Wears Justin Bieber’s Clothing Line Upon Release; Co-Founder Reacts (Exclusive)",
        "description": "Liri Albag, a 19-year-old Israeli hostage released by Hamas this weekend, wore a sweatshirt from Bieber and Ryan Good's clothing label: \"We always envisioned Drew House to be a global symbol of love and joy,\" Good tells THR.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-29T07:22:01.435168"
    },
    {
        "title": "Cricket world says same thing about Smith",
        "description": "It took a little longer than he would have wanted, but Aussie veteran Steve Smith has just joined an exclusive club against Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Aussies make call on Healy’s Test return",
        "description": "Australia captain Alyssa Healy has fronted the media to provide the latest on her injury ahead of Thursday’s Ashes Test match at the MCG.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Socceroo impresses in Portsmouth debut",
        "description": "English Championship club Portsmouth has wasted no time in giving a debut to Socceroos defender Hayden Matthews.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Konstas officially axed as Aussies rolls dice",
        "description": "Australia has officially abandoned the Sam Konstas experiment, with selectors making a series of massive changes for the first Test.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Cricket world says same thing about Smith",
        "description": "It took a little longer than he would have wanted, but Aussie veteran Steve Smith has just joined an exclusive club against Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Smith’s slice of history after Head, Khawaja whack Sri Lanka",
        "description": "Travis Head had the fourth-fastest Test 50 for an Australian before his dismissal, as Steve Smith finally notched up that magical 10,000 run mark. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Davis Cup return hopes dashed for Kyrgios",
        "description": "An Aussie’s dream month has continued with elevation into the Davis Cup squad, but it has come at a cost with a big-name star ruled out due to injury.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Major network disappears from TV screens",
        "description": "A global TV giant is set to be erased from screens with the likes of Jim Courier and John McEnroe caught in the middle.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "‘Shattered’: Kangaroos young gun’s injury blow",
        "description": "A day after a trio of St Kilda stars were put on the sidelines, a North Melbourne youngster has suffered a similar injury fate.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Lions keen on ‘superstar guy’ Allen",
        "description": "Lions star Jarrod Berry likes the thought of Oscar Allen leaving the West Coast Eagles to join Brisbane.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Latrell Mitchell handed huge NRL boost",
        "description": "Latrell Mitchell will be running out for the Rabbitohs earlier than expected after the NRL made a huge call on the All Stars fixture.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Latrell cleared but Souths star sent for scans",
        "description": "There’s mixed news at South Sydney, with Latrell Mitchell’s return date locked in, but one of his teammates is sweating on scan results.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Horror as WWE star rushed to hospital",
        "description": "A WWE star has suffered gruesome injuries after a sickening incident that saw him collapse on live television.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Football fan on life support after horror fall",
        "description": "Philadelphia is always a dangerous place to be after the Eagles win a big game – but it’s potentially turned deadly after a tragic accident.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "History beckons as Swift’s Chiefs book Super Bowl date with Eagles",
        "description": "The Chiefs are one win away from the first three-peat of the NFL era, with a New Orleans showdown booked against a Philadelphia Eagles team hunting revenge.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Aussie hulk stuns America, into Super Bowl",
        "description": "Australia’s Jordan Mailata has made his mark in the NFL playoffs with a steamrolling play to book his shot at Super Bowl redemption.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Socceroo impresses in Portsmouth debut",
        "description": "English Championship club Portsmouth has wasted no time in giving a debut to Socceroos defender Hayden Matthews.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Silver lining in Sydney’s patchy season",
        "description": "Sydney FC captain Rhyan Grant is embracing his leadership role in a Sky Blues team intent on regaining form.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "MMA fighter relearns to walk after crash",
        "description": "An Australian mixed martial arts champion is learning how to walk again after a “brutal” car crash almost claimed his life.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Aussie F1 star ‘on borrowed time already’",
        "description": "Australia’s Jack Doohan is under “massive pressure” to keep his spot in Formula 1 amid mounting speculation he’s on “borrowed time”.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Basketball Australia U20 Nationals Hub: How to watch live, schedules, key info",
        "description": "Hoops stars of the future are set to shine at the Basketball Australia Under-20 & Ivor Burge National Championships in Ballarat. See how to watch every match LIVE from Tuesday.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "‘About right’: Tiger innovation sparks debate",
        "description": "Slow play is becoming a scourge of golf around the world, but an innovation unveiled in Tiger Woods’ indoor league is gathering support.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Stars aligning perfectly for Queensland winter carnival",
        "description": "Several big racing names have already been confirmed for the 2025 Queensland winter carnival which is shaping up as one of the best yet.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Suaalii question finally answered",
        "description": "With a monster year for the Wallabies to come, one big issue surrounding the team’s $8m man has been resolved for now.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Fiji to provide ‘tough’ test for Wallabies",
        "description": "Wallabies coach Joe Schmidt has welcomed a match for Australia against Fiji ahead of the highly anticipated British and Irish Lions Test series.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-01-29T07:22:03.205186"
    }
]