[
    {
        "title": "Trump administration to cut thousands of jobs at Pentagon and IRS",
        "description": "The cuts targeting mostly new and recently promoted workers are part of the administration's push to shrink the federal work force.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Cryptocurrency theft of £1.1bn could be biggest ever",
        "description": "Dubai-based Bybit said it could afford to reimburse customers and that it was working to find the hackers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Coinbase boss claims SEC will drop crypto lawsuit",
        "description": "The SEC's 2023 lawsuit formed part of a crackdown on crypto firms which President Trump pledged to reverse.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Farmers say bird flu a 'crisis' as egg prices soar",
        "description": "Farmers say they are losing the fight against bird flu as Trump officials propose vaccines for birds.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Cryptocurrency theft of £1.1bn could be biggest ever",
        "description": "Dubai-based Bybit said it could afford to reimburse customers and that it was working to find the hackers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Shackled Luigi Mangione in packed court over healthcare CEO Brian Thompson's killing",
        "description": "His lawyer argued during the hearing that her client - wearing a bulletproof vest - was being treated unfairly.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "'I make more in one hour on TikTok than a day in the shop'",
        "description": "Laura Mallows sells most of her products via TikTok but \"dreams\" of opening a physical shop once more.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "What does Jack Ma's return to the spotlight mean?",
        "description": "Analysts say the Alibaba founder's re-emergence could signal a policy change in Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "BBC undercover filming exposes Indian pharma firm fuelling opioid crisis",
        "description": "An Indian drug maker tells a BBC undercover team its addictive cocktail drug is “very harmful” but “this is business”.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Ros Atkins on... the fight for Ukraine's critical minerals",
        "description": "The BBC's Analysis Editor Ros Atkins looks at why the US wants access to Ukraine's minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Scotch makers condemn English single malt whisky proposal",
        "description": "Scottish distilleries and MPs claim England's methods would damage the reputation of single malt.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Apple pulls data protection tool after UK government security row",
        "description": "Customers' photos and documents stored online will no longer be protected by end-to-end encryption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "UK government finances in surplus but pressure builds on Reeves",
        "description": "Chancellor faces a rising challenge to keep her tax and spending plans on track after missing forecasts.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Trump 'very frustrated' and Zelensky must strike minerals deal, says adviser",
        "description": "The comments overshadowed Zelensky's meeting with US envoy Keith Kellogg in Kyiv.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Trump's '$21m for voter turnout' claim triggers political row in India",
        "description": "The governing BJP has accused the opposition Congress of seeking \"external interference\" in elections.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Passengers on crashed Toronto plane offered US$30,000 each",
        "description": "The gesture to the affected travellers - all of whom survived - comes with no strings attached, the airline says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "The tiny Danish town transformed by Ozempic",
        "description": "American demand for weight-loss drugs is supercharging Denmark’s economy and transforming a small Danish community into an unlikely boomtown.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Birkenstock sandals are not art, says German court",
        "description": "The firm wanted to claim protection under copyright law, to stop rivals selling copycat versions of its shoes.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "What will Amazon do with James Bond?",
        "description": "Long-serving masterminds Barbara Broccoli and Michael G Wilson give creative control to Amazon.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Apple gambles on new iPhone with AI features at lower cost",
        "description": "Apple is hoping its latest, lower cost iPhone model will boost sales of its flagship device.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Lloyds sets aside £1.2bn for car loan scandal",
        "description": "The banking group has nearly tripled the amount it has ringfenced for potential compensation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "I'm not happy with Boeing, Trump says over Air Force One",
        "description": "US president says he is looking for alternatives because Boeing is taking too long to build new planes",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "US Fed warns Trump's tariffs may fuel inflation",
        "description": "The minutes from the last meeting of the e Fed's rate setting committee reveal inflation concerns.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Georgia's richest man said to be moving funds to avoid US sanctions",
        "description": "The pro-Russian businessman is reported to be moving overseas assets back to the Caucasus country.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "'I cried for days': Office raids and arrests shock aid workers in Yemen",
        "description": "Humanitarian workers fear the detention of staff and cuts in funding will be a \"death sentence\" for Yemenis.",
        "source": "BBC Business",
        "fetched_date": "2025-02-22T07:20:46.856337"
    },
    {
        "title": "Do Couples That Sing Together Stay Together? Tate McRae and The Kid Laroi, Sonny & Cher and More Star-Studded Duets",
        "description": "From Beyoncé and Jay-Z to Camila Cabello and Shawn Mendes, take a look at the celebrity couples who have recorded songs together.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "New Kennedy Center President Says Trump Wants to “Make Art Great Again”",
        "description": "Ric Grenell says that the performing arts institution is planning a \"huge celebration of the birth of Christ\" for December.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Mayor Karen Bass Fires L.A. Fire Chief Following Deadly Wildfires",
        "description": "Bass said Friday that she \"met with and removed Kristin Crowley as fire chief effective immediately.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Voletta Wallace, Notorious B.I.G.’s Mother, Dies at 78",
        "description": "She was an outspoken advocate for her son and his memory in the wake of his 1997 death.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Tom Hanks and Rita Wilson Donate $1M for L.A. Wildfire Relief Efforts",
        "description": "The beloved couple is spreading funds across the Motion Picture and Television Fund, the Los Angeles Fire Foundation, SAG-AFTRA Foundation Disaster Relief Fund, the American Red Cross and MusiCares.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Grimes Says Elon Musk Is Ignoring “Child’s Medical Crisis”",
        "description": "The musician and producer made a public plea to the the tech mogul on his own social media platform, X, to try to get his attention.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "George Clooney Explains Why He Thinks Trump Won the Election",
        "description": "Clooney breaks down why he thinks Kamala Harris lost in 2024 and talks other political issues.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Hunter Schafer Says She Received a Passport With Male Sex Marker After Trump’s Anti-Trans Executive Orders",
        "description": "The 'Euphoria' star got candid in a revelatory eight-minute clip shared on social media: \"It doesn't change really anything about me or my transness. However, it does make life a little harder.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Lady Gaga to Perform a Free Concert on Rio’s Copacabana Beach in May",
        "description": "In 2017, she canceled a performance at Rock in Rio for medical reasons.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Sean Combs Attorney Steps Down, Says There Are “No Circumstances” in Which He Can Represent Diddy",
        "description": "Anthony Ricco was one of several attorneys for Combs, who is also represented by Marc Agnifilo and Teny Geragos.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Justin Baldoni’s Leap of Faith",
        "description": "What role did the controversial director's Baha'i religion play on the set of 'It Ends With Us'? Did Wayfarer's missionary miscues help set the stage for Hollywood's uncivil war?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "Doechii Says Finding Her Stage Name Helped Her Overcome Suicidal Thoughts: “This Is My Motherf***ing Movie”",
        "description": "The rapper and recent Grammy winner said her musical identity helped give life purpose.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-22T07:20:47.988470"
    },
    {
        "title": "‘Disgrace’: Historic 50-year change torched",
        "description": "One of the biggest sporting franchises in America has changed a rule that has stood for more than half a century in a shock move.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Western United skipper chasing Socceroos berth",
        "description": "One of the A-League’s in-form left-backs isn’t ready to give up on his dream being selected for the Socceroos.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Savage slur sends shockwaves around world",
        "description": "An NBA and Team USA superstar has clapped back at a theory about the American basketball team that will cut rival nations deep.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Storm welcome back key pair",
        "description": "Storm coach Craig Bellamy says Cameron Munster and Nick Meaney are ‘firing and fully fit’ for Sunday’s trial against the Cowboys.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "‘Not second ball’: Konstas backed despite wild SCG moments",
        "description": "A former Australia Test opener has urged patience in teenager Sam Konstas after his divisive Sheffield Shield performance for New South Wales.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Selectors to make shock Labuschagne call for opener",
        "description": "The Australian selectors are poised to spring a few surprises for the Champions Trophy opener against England, including a big call on out-of-form batter Marnus Labuschagne.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Tennis rocked as stars spill horror stories",
        "description": "Alex de Minaur’s fiancee has revealed a terrifying experience as the tennis world reckons with a truly horrific incident this week.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "New footage says it all in Raducanu drama",
        "description": "New footage of the moment that left tennis star Emma Raducanu hiding and in tears after spotting a “fixated” fan has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Top pick’s setback for Opening Round",
        "description": "The top 10 pick who was “100 per cent in the frame” for an Opening Round debut is now racing against the clock to be fit.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Bombers ‘really clear’ on expectations: Merrett",
        "description": "Superstar midfielder Zach Merrett will captain Essendon for a third season and he believes the club is developing a clearer identity.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Storm welcome back key pair",
        "description": "Storm coach Craig Bellamy says Cameron Munster and Nick Meaney are ‘firing and fully fit’ for Sunday’s trial against the Cowboys.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Sam Burgess facing NRL Las Vegas lockout",
        "description": "Sam Burgess is racing the clock to get clearance to travel to America to coach his team in the NRL’s season opener next weekend.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "‘It’s greed’: Footy divided over $1.2m trend",
        "description": "“Exciting” AFL and NRL off-seasons with more player movement than ever has exposed a modern new reality about the footy codes.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Trudeau’s brutal 11-word message to Trump",
        "description": "Canadian PM Justin Trudeau has delivered a blunt message to US President Donald Trump as tension between the nations continues to simmer.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Anthem singer’s middle finger to Trump",
        "description": "The USA-Canada political tensions took another turn on Friday when a national anthem singer delivered a direct shot at Donald Trump.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Western United skipper chasing Socceroos berth",
        "description": "One of the A-League’s in-form left-backs isn’t ready to give up on his dream being selected for the Socceroos.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Fans say same thing about Matildas jersey",
        "description": "The Matildas unveiled their bold new jersey at the SheBelievesCup on Friday, but not everyone was a fan of the new kit.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Blockbuster title fight dealt crushing blow",
        "description": "One of most highly anticipated heavyweight world title boxing fights has been called off at the last minute in a cruel blow for fans.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Team fumes after drivers collide in ‘unacceptable’ crash",
        "description": "Teammates Aaron Love and James Courtney were involved in a bizarre collision at the start of Supercars qualifying which left their team principal fuming.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Bulega proves why he is the man to beat at Phillip Island",
        "description": "It’s one thing to ride fast, it’s another to be consistently fast. Nicolo Bulega showed his clear ability for the latter, recording quick times around Phillip Island with metronomic regularity.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Savage slur sends shockwaves around world",
        "description": "An NBA and Team USA superstar has clapped back at a theory about the American basketball team that will cut rival nations deep.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Outlaw jailed bikie now a rising golf star",
        "description": "He was once jailed for five years for assault but Ryan Peake has put his dark past behind and is now focused on becoming a golf star.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Morgan continues his rise with first Group success",
        "description": "After grafting out the hard yards in the NSW bush, former English jockey Ash Morgan is now right at home in the city as he boots home Our Anchorage to win the Group 3 Parramatta Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Wallabies captain signs new deal",
        "description": "The Wallabies captain wants the `best years’ of his career to be with the Queensland Reds and the Wallabies.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Reds coach silent on Wallabies gig",
        "description": "He is considered among the favourites to coach the Wallabies after Joe Schmidt stands down, but Les Kiss is concentrating on the Queensland Reds.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "Student collapses, dies at rowing training",
        "description": "The 17-year-old Melbourne student collapsed after finishing a training session on a rowing machine.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    },
    {
        "title": "‘Wicked’: AFL WAG compared to conwoman",
        "description": "An AFL player’s beloved wife, who is suffering from terminal cancer, has revealed she’s been compared to conwoman Belle Gibson.",
        "source": "News AU",
        "fetched_date": "2025-02-22T07:20:51.005615"
    }
]