[
    {
        "title": "Star luxury property brokers charged with sex trafficking",
        "description": "Alexander brothers are accused of drugging, assaulting and raping dozens of women over more than a decade",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "'I'm more confident' despite rise in US inflation",
        "description": "Progress stabilising prices in the US may be stalling, just as public opinion brightens.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Anger after Indian start-up pretends to sack stressed staff",
        "description": "A beauty service start-up pretended to have fired dozens of employees after they reported being stressed at work.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Coffee price surges to highest on record",
        "description": "Coffee drinkers are set to feel the pinch from high prices after crops got hit by drought and heavy rainfall.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "'I'm more confident' despite rise in US inflation",
        "description": "Progress stabilising prices in the US may be stalling, just as public opinion brightens.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Elon Musk's Tesla lobbied UK to charge petrol drivers more",
        "description": "Musk's firm backed the government's green stance, despite its maverick chief executive's social media attacks.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Hackers find hole in Krispy Kreme Doughnuts' cyber-security",
        "description": "The hack has left some hungry customers unable to make online orders.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "The Onion's purchase of Alex Jones's Infowars rejected by judge",
        "description": "Judge Christopher Lopez ruled that an auction for Infowars did not result in the best bids possible.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "India: Is the fastest-growing big economy losing steam?",
        "description": "India's economy slumped to 5.4%, below the central bank's 7% forecast. What's going on?",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "What is rage-baiting and why is it profitable?",
        "description": "Called rage-baiting, making people angry with social media posts can be a business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Valuations of AI companies 'incredibly frothy' - 11 Dec 2024",
        "description": "The AI market is experiencing rapid growth but expert says the market valuations of some companies are 'frothy'.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "General Motors pulls plug on robotaxi business",
        "description": "After the announcement, the project's co-founder posted on social media \"GM are a bunch of dummies.\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "More jobs and no 'nuisance taxes' - Ghanaians' great expectations",
        "description": "John Mahama was elected on his pledges to solve the economic crisis but won't find it easy, analysts say.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "UK car loan scandal victims told to complain",
        "description": "Aggrieved car buyers who feel they were mis-sold a loan should complain to their lender, MPs hear.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Amazon and eBay to pay 'fair share' for e-waste recycling",
        "description": "Firms which produce e-cigarettes will also be asked to pay more towards UK recycling.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Blow for UK as equipment giant Ashtead chooses US",
        "description": "The building equipment rental firm joins others who have moved to the US from London.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Luigi Mangione charged with murdering healthcare CEO in New York",
        "description": "The 26-year-old man was taken into custody at a McDonald's in the town of Altoona, Pennsylvania, on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Murdoch loses bid to change trust in real-life 'Succession' battle",
        "description": "The court says Murdoch acted in \"bad faith\" by trying to give control of his empire to his eldest son.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Hershey shares jump on Cadbury owner buyout report",
        "description": "A deal between Mondelez and Hershey could create a food giant with sales of almost $50bn a year.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Will bribery charges against Adani derail India's green goals?",
        "description": "The Adani Group is aiming to contribute to a tenth of India's renewable energy needs by 2032.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "UK sanctions Kenyan businessman over illicit gold trade",
        "description": "Pattni has been accused of smuggling gold and exploiting natural resources in Africa for decades.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Google unveils 'mind-boggling' quantum computing chip",
        "description": "It solves in five minutes a problem computers now would need 10,000,000,000,000,000,000,000,000 years to work out, Google says.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Nvidia targeted by China in new chip war probe",
        "description": "The investigation follows a US decision to further restrict sales to chip equipment makers in China.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Hit by blackouts, Cuba’s tourism industry now braces for Trump",
        "description": "Cuba's hotels, already hit by power cuts, are now worried about Donald Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "TikTok asks for emergency pause to looming US ban",
        "description": "The app says the Supreme Court - and incoming Trump administration - needs more time to consider the case.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Pubs warn Guinness being limited could 'cripple' their business",
        "description": "Pubs say they're trying to find alternative stouts as wholesalers put limits on how much Guinness they can get.",
        "source": "BBC Business",
        "fetched_date": "2024-12-12T07:26:37.533521"
    },
    {
        "title": "Andrew Garfield Praises Chappell Roan’s ‘Rise and Fall of a Midwest Princess’ Album as “Genius”",
        "description": "The actor also celebrated Roan's determination to set boundaries with her fans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Super Bowl Halftime Headache? How Jay-Z in the Headlines Could Impact Roc Nation’s NFL Deal",
        "description": "The freshly accused rapper may see preemptive fallout ahead of 2025’s Big Game, 50 Cent suggests.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Let’s Skip the Luigi Mangione Movie",
        "description": "UnitedHealthcare CEO Brian Thompson’s murder has drawn an online mob of cheering and fan-casting of suspect Luigi Mangione — but let’s think this through.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Cynthia Erivo, Tyler Perry, Regina King, Aunjanue Ellis-Taylor Honored at Critics Choice Celebration of Black Cinema and Television",
        "description": "Malcolm D. Lee, Natasha Rothwell, Wendell Pierce, John David Washington and Steve McQueen were also among the night's awardees.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "‘Dick Clark’s New Year’s Rockin’ Eve’: Alanis Morissette, Reneé Rapp, Ja Rule, Luis Fonsi, TLC Added to Lineup",
        "description": "Fat Joe, Blake Shelton, Dasha, Natasha Bedingfield, Kesha, Laufey, Hardy are also set to join host Ryan Seacrest and headliner Carrie Underwood as part of ABC's New Year's Eve television special.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Freedom for Menendez Brothers Unclear as New D.A. Weighs Resentencing",
        "description": "Incoming Los Angeles District Attorney Nathan Hochman may not feel as strongly about freeing the admitted parent killers as his predecessor.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Cinecitta Financial Crisis: Government Ministries Discuss Possible Bailout of Fabled Studio",
        "description": "During a shareholders meeting Monday in Rome, a discussion of potential legal action against the studio's former CEO, Nicola Maccanico, was postponed until Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Taylor Swift Calls Eras Tour “Most Challenging Thing I’ve Ever Done” at Final Show",
        "description": "Emotions ran high at the last night of the superstar singer-songwriter's Eras jaunt in Vancouver, which made history as the first-ever $2 billion tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Jay-Z Lawyer Says Jane Doe Accusing Rapper of Rape Must Reveal Her Identity or Drop Lawsuit",
        "description": "The accuser alleges that Jay-Z and Sean \"Diddy\" Combs raped her at a house party after the 2000 MTV Video Music Awards.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Taylor Swift’s Eras Tour Makes History After Grossing Record $2 Billion",
        "description": "The singer took her final bow of the tour in Vancouver on Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "“Polarization”: Merriam-Webster Word of the Year Reflects Political Divides",
        "description": "The dictionary publisher said Americans from competing tribes looked up the definition to better understand divided politics at home and worldwide.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Musicians at the Golden Globes: Ariana Grande, Miley Cyrus, Selena Gomez Score Nominations",
        "description": "Maren Morris, Robbie Williams, Cynthia Erivo, Trent Reznor and Atticus Ross are also competing at the show, where music from 'Emilia Pérez' picked up three nominations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-12T07:26:38.405009"
    },
    {
        "title": "Why Jazzy Parr could be the hero ‘teenage girls need’",
        "description": "It’s taken years of hard work behind the scenes, but as Jasmine “Jazzy” Parr prepares to face another storied opponent, one member of her team believes she can be the role model girls need.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Icon’s daughter rocked by one question",
        "description": "As Dawn Fraser was undergoing emergency surgery after a horror fall, one question from medical staff stunned her daughter.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Marsh’s ‘mare’ won’t be repeated",
        "description": "Mitch Marsh isn’t about to repeat his Adelaide Oval brain-fade during Australia’s Gabba Test against India.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Fans all say same thing about PNG deal",
        "description": "The announcement of Papua New Guinea receiving an NRL license has divided fans with some furious over the “historic” move.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "AFL drops first All Stars names",
        "description": "The first players have been confirmed for the Indigenous All Stars squad for a match that could have a far-reaching legacy.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "‘Like that pressure’: Sydney rookie’s bold Buddy request",
        "description": "Famous football numbers can be a blessing or a curse, but a Sydney Swans draftee asked to fill the biggest possible shoes.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Fans all say same thing about PNG deal",
        "description": "The announcement of Papua New Guinea receiving an NRL license has divided fans with some furious over the “historic” move.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Bombshell ‘China clause’ threatens NRL deal",
        "description": "Among all the smiles and handshakes at the landmark PNG deal with the NRL came chilling news of a potential “China clause”.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Marsh’s ‘mare’ won’t be repeated",
        "description": "Mitch Marsh isn’t about to repeat his Adelaide Oval brain-fade during Australia’s Gabba Test against India.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Test support for Maxy after Warner attack",
        "description": "After David Warner delivered some choice words to his World Cup-winning teammate about hopes of a Test recall, Glenn Maxwell has found a strong ally.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Dokic’s spine-tingling speech drops jaws",
        "description": "Jelena Dokic has delivered a raw, passionate speech, showing her transformation from when she “couldn’t string a sentence together”.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Tennis in shock over rocket launcher photo",
        "description": "A top tennis player has stunned fans around the world, sharing gripping photos of herself holding a rocket launcher.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Aussie trio about to shock the fight world",
        "description": "In just a month, three Aussie boxers can call themselves world champion and bring Australia to the top of the sport after Tim Tszyu’s loss.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Oscar Piastri celebrates huge personal news",
        "description": "Oscar Piastri has every reason to smile after some huge news dropped at the end of the Aussie’s successful F1 season with McLaren.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Replacement emerges, axe hovers over F1 star",
        "description": "Red Bull will have to pay a massive amount to get rid of Sergio Perez as speculation mounts that the team has settled on his replacement.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Icon’s daughter rocked by one question",
        "description": "As Dawn Fraser was undergoing emergency surgery after a horror fall, one question from medical staff stunned her daughter.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Dokic’s spine-tingling speech drops jaws",
        "description": "Jelena Dokic has delivered a raw, passionate speech, showing her transformation from when she “couldn’t string a sentence together”.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Contenders and pretenders: the NFL Playoff race surprise leaders",
        "description": "The playoff race is heating up: who are the pretenders and contenders for Super Bowl LIX as we head into Week 15?",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Kelce flips, crashes car in scary video",
        "description": "The NFL has been left stunned as viral video captured the scary moment Jason Kelce’s car went flying off the rails.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "‘Harm’: FIFA must be held ‘accountable’",
        "description": "While Football Australia has backed Saudi Arabia as host of the 2034 Word Cup, the body that represents Australian players has significant concerns.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Controversial $5 trillion bid lands World Cup",
        "description": "The biggest sporting event on the planet is set to come under heavy fire after a controversial country was awarded hosting rights.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Why Jazzy Parr could be the hero ‘teenage girls need’",
        "description": "It’s taken years of hard work behind the scenes, but as Jasmine “Jazzy” Parr prepares to face another storied opponent, one member of her team believes she can be the role model girls need.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Dumped Aussie vying for LIV golden ticket",
        "description": "There aren’t a host of big names looking to secure a LIV Golf spot in 2025, but a dozen Aussies are among the hopefuls chasing their piece of the giant paydays.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 12",
        "description": "After some early doubts it’s time to back in the Bullets – while one player is a must-have regardless of the schedule. Here’s how to get your team set for round 12.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Aussie star’s big World Cup move",
        "description": "After being crowned the best Rugby Sevens player in the world an Australian try-scoring machine is taking a big step towards possibly earning a World Cup spot.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "‘Privilege’: Sonny Bill’s shock career move",
        "description": "A global sports star known for his deep faith and “passion for social equity” has made a surprising career change.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Freedman sprinter faces Magic Millions litmus test",
        "description": "Trainer Michael Freedman is keen to see Moravia bounce back to winning form at Royal Randwick on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-12T07:26:41.261834"
    }
]