[
    {
        "title": "China is trying to fix its economy. Trump could derail those plans",
        "description": "Trump won the election on a platform of steep import taxes, including tariffs as high as 60% on China.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Nissan to lay off thousands of workers as sales drop",
        "description": "The Japanese car making giant has not yet said where in its global operations the job cuts will be made.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Oil firm blames UK windfall tax for North Sea pull-out",
        "description": "Texas-based Apache says the windfall tax on energy profits will make its operations  \"uneconomic\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "AI artwork of Alan Turing sells for record $1.3m",
        "description": "Sotherby's says the Ai-Da Robot work \"marks a moment in the history of modern and contemporary art\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Will Trump's victory spark a global trade war?",
        "description": "Trump has promised tariffs on all foreign goods. If he follows through, many smaller economies may be forced to respond in kind.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Nissan to lay off thousands of workers as sales drop",
        "description": "The Japanese car making giant has not yet said where in its global operations the job cuts will be made.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "US central bank boss says Trump can't fire him",
        "description": "The US central bank cuts interest rates, as its chairman vows to stay on the job.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "Trump claims more taxes on trade wouldn't be a cost to the US - almost all economists dispute this.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Ultra-rich using jets like taxis, climate scientists warn",
        "description": "Researchers worked out the amount of planet-warming gas released by private jets over four years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Oil firm blames UK windfall tax for North Sea pull-out",
        "description": "Texas-based Apache says the windfall tax on energy profits will make its operations  \"uneconomic\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Trump victory 'to bring Fed policy uncertainty' - 7 Nov 2024",
        "description": "Former Federal Reserve economist Claudia Sahm says future policy is uncertain after Donald Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "UK interest rates could take longer to fall, says Bank",
        "description": "Interest rates were cut to 4.75% but the Bank expects inflation to creep higher after last week's Budget.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Australia plans social media ban for under-16s",
        "description": "The government says it wants to mitigate the \"harm\" social media is inflicting on children.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "What Elon Musk could gain from Trump's presidency",
        "description": "One of the president-elect's most visible supporters, Musk could be given a role in Trump's White House.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Small business owner finds card designs on Temu",
        "description": "Anwen Roberts was heartbroken after finding her cards were sold on Temu without her permission.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Moldova cleans up its act to attract foreign businesses",
        "description": "Deputy PM admits former Soviet state was until recently a 'highly corrupt country' - but insists things are changing fast.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "US shares and Bitcoin hit record highs on Trump win",
        "description": "The result could have a far-reaching implications for tax and trade policy, as well as economies around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Mystery fires were Russian 'test runs' to target cargo flights to US",
        "description": "The attacks targeted couriers in Poland, Germany and the UK, Polish prosecutors say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Shopping giant Temu removes copies of tiny firm's cards",
        "description": "A small business owner says identical versions of her products were copied without permission.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Netflix Europe offices raided in tax fraud probe",
        "description": "The raid is part of an investigation in France and the Netherlands that began in November 2022.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Boeing workers end 7-week strike on 38% pay rise deal",
        "description": "The damaging walkout by around 30,000 unionised Boeing workers started on 13 September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Elon Musk can keep giving $1m to voters, judge rules",
        "description": "The giveaway is not a lottery-like contest and the recipients are not chosen randomly, his lawyer said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Jantelagen: Why Swedes won't talk about wealth",
        "description": "In Sweden, a deep-rooted cultural code called Jantelagen stops many from talking about their wealth.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "French families sue TikTok over harmful content",
        "description": "The platform is accused of exposing seven children to videos promoting self-harm, and suicide.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "The environmental campaigners fighting against data centres",
        "description": "A growing global movement is seeing people object to data centres in their locality.",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Hunt for Bitcoin's elusive creator hits another dead end",
        "description": "Why are we still no closer to unmasking the mysterious Satoshi Nakamoto?",
        "source": "BBC Business",
        "fetched_date": "2024-11-08T07:21:52.642363"
    },
    {
        "title": "Need to Recharge After AFM? Discover the Other Las Vegas With These Tips",
        "description": "Journey beyond the Strip and visit these shops, restaurants and hiking spots.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "President Biden Details Call With Donald Trump After Election Win, Promises Peaceful Transfer of Power",
        "description": "He also offered wisdom and comfort for those upset with the election result and reassurance that democracy will remain intact under Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "Concert Film ‘Bilal: Live at Glasshaus,’ Featuring Questlove and Common, to Premiere on Nov. 20 (Exclusive)",
        "description": "The special was filmed last December in front of 100 fans and \"is a tribute to Bilal’s extraordinary vocal and musical range.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "Kelsea Ballerini Cuts Against Country Music’s Grain: “Good Person First, Good Artist Second”",
        "description": "The Hollywood Reporter's newest \"Person of Interest\" is the 31-year-old singer-songwriter who isn't looking to just make music but is hoping to create change in the country music space.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "How Trump Won the First “Influencer Election”",
        "description": "While both campaigns worked overtime to court influencers, Donald Trump invested early and heavily in relationships with podcasters and livestreamers in a strategy that ultimately proved more successful.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "Finding Comfort in Election Chaos: How ‘Sesame Street’ and Steve From ‘Blue’s Clues’ Are Providing That",
        "description": "The children's TV figures took to social media to remind people to \"take a deep breath\" as they process the 2024 election results.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "Kamala Harris in Concession Speech: “I Do Not Concede the Fight That Fueled This Campaign”",
        "description": "Harris gave the speech at Howard University on Wednesday after the election was called for Donald Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "All Those A-List Celebs Couldn’t Save Harris, But Joe Rogan Helped Trump",
        "description": "Big star endorsements didn't rescue Kamala Harris' presidential campaign, yet there's some evidence that Joe Rogan's podcast interview gave Trump a boost with young voters.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "AFM Hidden Gem: ‘Kill the Jockey’ Offers a Surreal Meditation on the Nature of Identity",
        "description": "Argentinian filmmaker Luis Ortega’s latest feature tells the story of a man whose sense of self transforms following a horse racing accident.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "George Gascón Loses Los Angeles District Attorney Race",
        "description": "All eyes are on Nathan Hochman, L.A. County's new top prosecutor who'll decide whether to continue to support resentencing Lyle and Erik Menendez.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "Channel 4 Kicks Ex-U.K. Prime Minister Boris Johnson Out of Election Panel for Plugging Book",
        "description": "The co-host of Channel 4's U.S. election program told Johnson that promoting his book was \"so cheap\", to which the former Tory MP replied: \"There’s absolutely nothing you can do to stop me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "World Leaders, Including Netanyahu, Starmer, Congratulate Trump: “History’s Greatest Comeback”",
        "description": "After the Republican and former reality television star emerged victorious, he was sent a host of congratulations from politicians on X, including the Israeli Prime Minister: \"This is a huge victory!\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-08T07:21:53.414907"
    },
    {
        "title": "Cricket legend reveals terrifying accident",
        "description": "England legend Ian Botham has thankfully lived to tell the tale after a scary ordeal in the Northern Territory with an Aussie cricket great.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Aussie’s F1 career at risk in major twist",
        "description": "Australian Jack Doohan’s Formula 1 debut could be at risk, with reports his Alpine team is pursuing a star rookie for a shock switch for 2025.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "‘In shock’: Test star blasts Cricket Australia",
        "description": "A former Aussie Test player has slammed the response to ball tampering claims, claiming “if it wasn’t India it would be different.”",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "‘Offer a lot’: Bombshell switch confirmed",
        "description": "Clint Gutherson finally has his NRL future sorted, weeks after being informed his position at the Eels was in jeopardy.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Why finals tilt is a ‘bonus’ for Roos star",
        "description": "A key cog in North Melbourne’s AFLW flag tilt is grateful just to be out on the field after a near disaster in pre-season training.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "‘Not sustainable’: Ex-Dogs coach calls for audit of AFLW standards",
        "description": "The ninth AFLW home-and-away season has ended with a two-tiered competition, and in the latest episode of SACKED, former Dogs coach Nathan Burke says it’s time the AFL steps in.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "‘Offer a lot’: Bombshell switch confirmed",
        "description": "Clint Gutherson finally has his NRL future sorted, weeks after being informed his position at the Eels was in jeopardy.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Kangaroos rookie flips the script",
        "description": "Most rookies look up to their experienced teammates when they walk into camp, but this debutant has flipped the script.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Cricket legend reveals terrifying accident",
        "description": "England legend Ian Botham has thankfully lived to tell the tale after a scary ordeal in the Northern Territory with an Aussie cricket great.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Aussie batsmen demolished in ODI bloodbath",
        "description": "Australia scraped home in the first ODI, and their batting lineup copped a spray from legend Ian Healy. In Adelaide, they’ve given him plenty of ammunition for another barrage. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "World laughing at cruel de Minaur photo",
        "description": "The tennis world is losing it over Alex de Minaur’s eye-catching debut as the ATP Tour Finals launch flopped spectacularly.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Jelena Dokic in tears over Australia defection",
        "description": "Jelena Dokic has declared she would accept “100 years of abuse” to take back one decision she regrets most from her tennis career.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "‘Too easy’: Proof stars have hacked basketball",
        "description": "The NBA season is in full swing and there are already calls to change a 44-year rule as a wild trend spells trouble for Australia’s players.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Aussie’s F1 career at risk in major twist",
        "description": "Australian Jack Doohan’s Formula 1 debut could be at risk, with reports his Alpine team is pursuing a star rookie for a shock switch for 2025.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "F1 team sacks both drivers, grid complete",
        "description": "The 2025 F1 grid is all but locked in after confirmation two drivers from the same team would depart, with a young gun joining F1.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Shane Warne’s kid cuddles up with ex’s son",
        "description": "Some lovely photos have emerged from Oak’s Day and reveal just who Shane Warne’s adult children were hanging out with.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "World reacts to Raygun career bombshell",
        "description": "Raygun’s decision to hang up the Aussie tracksuit and retire the “kangaroo” has sparked a huge response around the globe.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "LeBron goes nuclear over Trump victory",
        "description": "LeBron James, who had endorsed Kamala Harris leading up to the election, has erupted over Donald Trump’s landslide win.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Who is the NFL MVP at the season’s halfway mark?",
        "description": "It’s halfway through the NFL season: who’s the midpoint MVP and after a frenzied NFL trade deadline, which contenders have loaded up?",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Teenage sensation’s surprise omission explained as three new faces in Socceroos squad",
        "description": "Socceroos coach Tony Popovic has made a host of changes to the national squad for upcoming games against Saudi Arabia and Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Irankunda dropped from Socceroos squad",
        "description": "Socceroos coach Tony Popovic has made a host of changes to the national squad for upcoming games against Saudi Arabia and Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Social media erupts over Rogan-Harris pic",
        "description": "Podcaster Joe Rogan, one of the most outspoken voices in the lead-up to the election, has gone viral over a Kamala Harris image.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "‘Extra special’: Lee’s bucket-list goal",
        "description": "Having finished second at last year’s Australian Open, Minjee Lee is determined to lift the Patricia Bridges Bowl for the first time.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Lakers send Bronny to G-League",
        "description": "Bronny James, the 20-year-old son of NBA superstar LeBron James, has been assigned by the Los Angeles Lakers to their G-League developmental squad.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Wallabies to unleash prized NRL convert",
        "description": "The most hyped man in rugby will be on show this weekend after Joseph-Aukuso Suaalii was named to make his Wallabies debut against England.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Wallabies roll dice with Suaalii bombshell",
        "description": "The Wallabies have pulled the trigger on a shock plan to throw code-hopping star Joseph Suaalii straight into the deep end.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Laxon’s ‘love’ for mare worth listening to in Queen Elizabeth",
        "description": "Sheila Laxon has revealed that her Melbourne Cup winner Knight’s Choice hadn’t even been her top stable seed in the big race, and it could pay for punters to listen given that Mission Of Love is racing at Flemington on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-08T07:21:55.298228"
    }
]