[
    {
        "title": "Asia is reeling from Trump's tariff salvo – is anyone winning?",
        "description": "The US president has reset the tariffs clock again, leaving Asia's export-driven economies in limbo.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Trump threatens 35% tariffs on Canadian goods",
        "description": "Trump has threatened blanket levies of 15% or 20% on most trade partners, and says he will soon announce new tariffs on the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "US government to invest in rare earths production",
        "description": "The government is to become the biggest shareholder in the US's only operational rare earths mine.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Brazil vows to match US tariffs after Trump threatens 50% levy",
        "description": "Trump's threat is over what he calls the \"mistreatment\" of his ally, ex-President Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Trump threatens 35% tariffs on Canadian goods",
        "description": "Trump has threatened blanket levies of 15% or 20% on most trade partners, and says he will soon announce new tariffs on the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Why is Trump targeting Brazil - and will it backfire for Bolsonaro?",
        "description": "The US president's threatened new tariffs are likely to have major political ramifications in the country.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Original Birkin bag shatters record with £7m sale",
        "description": "The prototype of the most famous bag in fashion, made for Jane Birkin in 1985, smashes auction records.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "When to book and where to stay: Six ways to save money on your summer holiday",
        "description": "Package holidays from the UK to popular destinations are more expensive but there are ways to cut costs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "'I can't drink the water' - life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "How Trump's tariff chaos could reshape Asia's businesses",
        "description": "The US president's tough stance on global trade is shaking up the region's crucial supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Trump's mega-bill provides 'corporate clarity' - 9 Jul 2025",
        "description": "Expert says that the sprawling budget bill provides clarity and incentives for US businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "'Autofocus' spectacles promise sharp vision, near or far",
        "description": "Start-up firms and researchers are working on lenses that can change their focus.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Four arrested in connection with M&S and Co-op cyber-attacks",
        "description": "Three men and one woman - aged between 17 and 20 - have been arrested in London and the Midlands.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Video game actors' strike officially ends after AI deal",
        "description": "Performers agree to a deal with 10 of the biggest companies in the games industry after reaching a deal on AI.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Holidays from UK to Spain, Cyprus and Turkey soar in price",
        "description": "The cost of all-inclusive family package holidays to many popular destinations has risen this year.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Ferrero to take over US breakfast cereal giant Kellogg",
        "description": "The $3.1bn acquisition is part of a broader expansion by the Italian chocolate company.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "India and China strive to reset ties but with caution",
        "description": "Bilateral relations between India and China have improved since the 2020 clash - but larger challenges remain.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Linda Yaccarino departs as boss of Musk's X",
        "description": "Her exit comes at a difficult time for Musk who, in a brief reply, thanked her for her \"contributions.\"",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Trump threatens Brazil with 50% tariff and demands Bolsonaro's trial end",
        "description": "Trump accused Brazil of \"attacks\" on US tech companies and conducting a \"witch hunt\" against its former president Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Why Trump invited five African leaders to the White House",
        "description": "The presidents of Gabon, Guinea-Bissau, Liberia, Mauritania and Senegal hope to be offered \"incredible\" deals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "EU hopes to agree US tariff deal 'in coming days'",
        "description": "The EU remains hopeful it will strike a deal to avoid steep levies Trump has threatened on its exports to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Nvidia becomes world's first $4tn company",
        "description": "Shares in the chip-maker have surged in value as investment in AI continues to gather pace.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Trump delays tariffs as the rest of the world plays hardball",
        "description": "The US president reveals his poker \"tell\" by showing he is open to delays to secure trade deals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Lesotho declares state of disaster amid US tariff uncertainty",
        "description": "Lesotho faces tariffs of 50% - higher than any other country because of its large trade surplus with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Musk says Grok chatbot was 'manipulated' into praising Hitler",
        "description": "Anti-hate campaigners say the posts were \"irresponsible, dangerous and antisemitic\".",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Action urged to halt exodus of firms leaving UK",
        "description": "The boss of the CBI says he would support cutting the allowance on cash ISAs to encourage more people to invest in shares.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "US will hike tariffs on copper to 50%, Trump says",
        "description": "Similar threats are looming over pharmaceuticals, lumber and semiconductors.",
        "source": "BBC Business",
        "fetched_date": "2025-07-11T07:30:04.818473"
    },
    {
        "title": "Doechii on Viral BET Awards Speech Calling Out President Trump: “Wasn’t Sh** They Could Do”",
        "description": "In a new 'British Vogue' cover story, the Grammy-winning performer said she “felt like I needed to use that moment” to respond to the immigration raids happening outside of L.A.’s Peacock Theater.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "OneRepublic Leaves Interscope After 18 Years, Sign New Deal With BMG",
        "description": "BMG will release the band's upcoming seventh album, with lead single \"Beautiful Colors\" set for release on July 25.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Tyler Perry Accuser Derek Dixon Speaks: “I Couldn’t Stay Silent Anymore” (Exclusive)",
        "description": "In his first interview since filing a $260 million sexual assault claim against the Madea creator, actor Derek Dixon says he felt compelled to go public because “everyone deserves to go to work and do their job without their boss trying to have sex with them.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Justin Bieber to Release Seventh Album on Friday (Exclusive)",
        "description": "Surprise! Sources say the long-awaited project includes features from Gunna, Sexyy Red and Cash Cobain.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Rob Thomas Signs With Universal After Two Decades at Atlantic Records",
        "description": "The label switch was a smooth one for the Matchbox Twenty singer, who drops new music on July 11.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Why Wet Leg’s Rhian Teasdale Can’t Stop Writing Silly Love Songs",
        "description": "The sarcasm-loving British post punk band was the surprise sensation at 2023’s Grammys. Now they’re back for more — with a little less sass but a lot more heart.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Yungblud Announces New Documentary ‘Yungblud. Are You Ready, Boy?’ (Exclusive)",
        "description": "The film will follow the British singer in Berlin as he recorded live performances of his latest album 'Idols' at the famed Hansa Studios building.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Poland Slams X’s Grok AI for Antisemitic Outbursts, Urges EU Probe",
        "description": "Poland's Deputy PM Krzysztof Gawkowski calls on the European Commission to investigate Elon Musk’s chatbot over hate speech violations and threats to public safety.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Paul McCartney Announces First North America Tour in Three Years",
        "description": "McCartney's Got Back Tour will return to the U.S. this fall, starting with a date at Acrisure Arena in Palm Desert September 29.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Meet the Trump-Loving Union Boss Who Thinks He Can Save Hollywood",
        "description": "Sean O'Brien, the colorful and combative leader of the International Brotherhood of Teamsters, is providing an unexpected line to the White House. But does Hollywood want him as its diplomat?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Kevin Jonas Recalls Losing “Almost All” of His Money Due to Bad Business Deals After the Jonas Brothers Split",
        "description": "The band's lead guitarist said he lost his fortune \"down to the one 10 percent left.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    },
    {
        "title": "Oak View Group CEO Tim Leiweke Steps Down Following Bid-Rigging Allegations From DOJ",
        "description": "\"Mr. Leiweke has done nothing wrong and will vigorously defend himself and his well-deserved reputation for fairness and integrity,\" a spokesperson for the executive said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-11T07:30:05.736840"
    }
]