[
    {
        "title": "US 'click to cancel' rule to ban subscription traps",
        "description": "New rule requires businesses to make subscribing and cancelling subscriptions equally simple.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as Whatsapp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Surprise fall in UK inflation paves way for interest rate cuts",
        "description": "The drop to 1.7% paves the way for the Bank of England to cut interest rates again next month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Inside the £70k ‘mafia-style’ champagne shoplifting gang",
        "description": "A crime gang has stolen more than £70,000 of goods from UK supermarkets in 18 months, the BBC hears.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Boeing seeks up to $35bn as costly strike drags on",
        "description": "The firm aims to secure the new funding as a walkout by more than 30,000 workers enters its second month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as Whatsapp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Hoax bomb threats spark panic for Indian airlines",
        "description": "At least 10 Indian flights got hoax bomb threats over the past 48 hours, causing long delays and diversions.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Firm hacked after accidentally hiring North Korean cyber criminal",
        "description": "The hacker downloaded sensitive data from the company and used it to send a ransom demand.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Samsung India workers end strike after more than a month",
        "description": "Samsung has not agreed to recognise the workers' new labour union yet but will engage with other demands.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Surprise fall in UK inflation paves way for interest rate cuts",
        "description": "The drop to 1.7% paves the way for the Bank of England to cut interest rates again next month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Pound falls as UK inflation declines - 16 Oct 2024",
        "description": "The British currency fell greater than expected and came up against a very strong dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "What could happen if Donald Trump drastically increases tariffs as he has promised to do?",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "UK chancellor eyeing £40bn in tax rises and spending cuts",
        "description": "Filling the £22bn financial \"black hole\" would only be enough “to keep public services\" still, Rachel Reeves told a meeting.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Fake vintage wine gang busted in France and Italy, police say",
        "description": "The group is alleged to have made fake labels from famous French vineyards, using them to sell cheap wine.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Lufthansa hit with record penalty after barring Jewish passengers",
        "description": "The German airline has agreed to pay $4m to resolve claims it discriminated against Jewish passengers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Google turns to nuclear to power AI data centres",
        "description": "The tech giant says it will use energy from small reactors to power its use of artificial intelligence.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "UK interest rate cut hopes raised as wage growth slows",
        "description": "Expectations of a rate cut next month increase as pay growth slows to its lowest rate for more than two years.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Boba tea company apologises over Canada Dragons' Den row",
        "description": "Marvel actor Simu Liu accused Canadian entrepreneurs of culturally appropriating the Taiwanese drink.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Ministers complain to Treasury over spending cuts",
        "description": "Some Cabinet members are alarmed at the scale of cuts being sought to plug a rumoured £40bn gap.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Inquiry announced after carers forced to repay benefits",
        "description": "Some carers had to pay back thousands of pounds to the government, pushing them into financial distress.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Why this month's inflation figure matters for you",
        "description": "The cost of living is always important but this month's has a particular extra impact for millions of people.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "Mental health patients could get job coach visits",
        "description": "Pensions Secretary Liz Kendall says trials of the idea have produced \"dramatic results\".",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "When will interest rates go down again?",
        "description": "Bank of England interest rates affect the mortgage, loan and savings rates for millions of people.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "How quickly are prices rising in the UK?",
        "description": "The rate at which prices are rising has dropped below the Bank of England's target of 2%.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "National Insurance fears spark business backlash",
        "description": "The government is facing criticism by businesses over a potential tax rise that would fall on employers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "What is NI and how much do workers and employers pay?",
        "description": "Two National Insurance cuts came info effect in 2024, but many people are still paying more in tax.",
        "source": "BBC Business",
        "fetched_date": "2024-10-17T07:23:29.243310"
    },
    {
        "title": "TMZ Posts, Then Removes, Liam Payne Death Photos After Backlash",
        "description": "Though the site is known to push ethical boundaries in obtaining its traffic-friendly scoops, it's a line that even it does not typically cross.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Liam Payne, Former One Direction Member, Dies at 31",
        "description": "The singer reportedly fell from a hotel balcony in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Megan Thee Stallion Reveals Struggles After Mom’s Death in Documentary Trailer: “I Forgot Who I Was”",
        "description": "The rapper is the subject of the 'In Her Words' film streaming on Amazon's Prime Video on Oct. 31.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Tommy Richman’s “Million Dollar Baby” Will Compete for Rap Grammys (Exclusive)",
        "description": "The TikTok hit spent 22 weeks on top of Billboard's R&B chart and the news comes two weeks after Richman claimed he is “not a hip hop artist.” He later clarified his words.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Francesca Eastwood, Daughter of Hollywood Legend Clint Eastwood, Arrested on Domestic Abuse Charge",
        "description": "The actor and former reality TV star was jailed in Beverly Hills after reportedly getting into a tussle with her boyfriend over the weekend.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Details of Barry Diller’s “Remarkably Honest” Memoir Revealed",
        "description": "The book, which Simon & Schuster will release in May, is said to be an \"entertaining account of his personal journey, an unconventional love story and a fascinating tour through show business and digital media.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Former Ozzy Osbourne Guitarist Jake E. Lee Shot Multiple Times in Las Vegas",
        "description": "A representative for Lee said he was conscious and “is expected to fully recover.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Itzy Goes for ‘Gold:’ The K-Pop Stars Talk New EP, How Happy They Are to Perform as a Full Group",
        "description": "The five-piece girl group is back with a new album: \"Since we're all coming back, all five [of us] together, we're be able to show a much better side [of ourselves] in this new comeback.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Jerry Seinfeld Regrets His Comments About the “Extreme Left” Ruining Comedy: “It’s Not True”",
        "description": "Seinfeld had previously made waves by saying that politically correct culture would be the end of comedy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "A Timeline of Sean “Diddy” Combs’ Recent Legal Troubles, From Cassie’s Lawsuit to His Arrest",
        "description": "A complaint from the rap and fashion mogul's ex-girlfriend began the slow unraveling of the high-flying life of the iconic figure of the 1990s and beyond.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Kamala Harris Might Be Going on Joe Rogan’s Podcast",
        "description": "The vice president's team has been talking to the Austin-based podcaster about a potential sitdown in an effort to court male voters.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Jay Park on Why He Was Determined to Finish His R&B Album and Producing New K-Pop Groups",
        "description": "The Seattle-born rapper, singer and CEO opens up about his creative process and his plans to debut idol groups through his label, More Vision: \"I am very confident in the group of kids that we have.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-17T07:23:30.153205"
    },
    {
        "title": "Absent stars pave way for ODI bat-off",
        "description": "A rising star of Australian cricket has openly declared he’ll be in competition with a teammate to secure a coveted ODI role.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Wigan boss’ jaw-dropping Cleary claim",
        "description": "A Super League boss has made a staggering call about four-time premiership winner Nathan Cleary amid his UK links.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Dees star out again as fixture fury rages",
        "description": "Melbourne will again have to navigate an injury to a key player as its coach called for a review into the AFLW’s condensed fixture.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "‘Selfish’: AFL star’s wild baby rant",
        "description": "An AFL legend and local radio star has let loose on “selfish” young Aussies who don’t have babies, claiming they want to spend their time on holidays.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Dees star out again as fixture fury rages",
        "description": "Melbourne will again have to navigate an injury to a key player as its coach called for a review into the AFLW’s condensed fixture.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "‘Selfish’: AFL star’s wild baby rant",
        "description": "An AFL legend and local radio star has let loose on “selfish” young Aussies who don’t have babies, claiming they want to spend their time on holidays.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Wigan boss’ jaw-dropping Cleary claim",
        "description": "A Super League boss has made a staggering call about four-time premiership winner Nathan Cleary amid his UK links.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Test your knowledge with our ultimate NRL 2024 quiz",
        "description": "Think you know your rugby league? Were you paying attention throughout the 2024 NRL season? Take our quiz and put your knowledge to the test.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Absent stars pave way for ODI bat-off",
        "description": "A rising star of Australian cricket has openly declared he’ll be in competition with a teammate to secure a coveted ODI role.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Test stars set for MCG showdown",
        "description": "More than a quarter of the Australian Test team, and a few hopefuls, will be in action at the MCG this weekend in a blockbuster domestic clash.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Kyrgios reveals only motivation for comeback",
        "description": "Australian tennis star Nick Kyrgios has revealed when he will be returning to the court this summer in news that will delight tennis fans.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "‘One more shot’: Kyrgios locks in comeback",
        "description": "Polarising tennis star Nick Kyrgios has revealed what is driving a return to the sport this summer after almost two years on the sidelines.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Bizarre twist after Bathurst 1000 ‘assault’",
        "description": "New footage has emerged after claims a motorsport engineer was assaulted following the Bathurst 1000.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Bathurst crew winner ‘attacked’, hospitalised",
        "description": "Bathurst champion Brodie Kostecki has dropped shock news a member of his team has been “attacked”. Police are investigating.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Banished Olympian cashes in on OnlyFans",
        "description": "An Olympic swimmer who was kicked out of the athlete’s village has announced her next career move following the Paris Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Surprising side of WAG’s cancer diagnosis",
        "description": "An AFL WAG battling a horrific bowel cancer diagnosis has shared some of the unexpected side effects of her illness.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Aussie star’s sad reaction to brutal trolls",
        "description": "Bulls guard Josh Giddey has had a devastating response to an Instagram post from his new NBA club that quickly blew up.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "NBA superstar open to shock Boomers switch",
        "description": "Superstar Kyrie Irving, who was born in Australia, has discussed the shock possibility of joining the Boomers for the LA Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "‘Freak’ blow for A-League champs",
        "description": "Central Coast’s A-League title defence has already hit a major hurdle with an untimely injury to one of the club’s most important players.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Slater: Why this A-League reboot feels different",
        "description": "Ahead of the most important season in its 20-year history, the A-League has had more than just a face lift. It’s a whole new era, and this time it feels real, writes ROBBIE SLATER.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Tim Tszyu drops massive family news",
        "description": "One of boxing’s most famous families will be reunited this weekend when Tim Tszyu fights to get back on his path to world domination.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Greg Norman set to lose his job",
        "description": "After three years of disrupting golf and bringing LIV to the world, there could be change coming for an Australian legend.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "NBL late mail: SuperCoach drama as host of stars in doubt",
        "description": "A host of significant SuperCoach NBL players are either out or in doubt for the upcoming round. Get the full lowdown here.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "US Jockey Club backs Everest’s Group 1 status",
        "description": "Racing NSW and the Australian Turf Club given welcome news from the US as controversy swirls over the legitimacy of The Everest’s Group 1 status.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-17T07:23:32.427664"
    }
]