[
    {
        "title": "Members only: India's rich and famous ditch old-school clubs for exclusive hangouts",
        "description": "A new generation of wealth creators has fuelled demand for private members-only clubs in Asia's third largest economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "How the rise of green tech is feeding another environmental crisis",
        "description": "The world's race to decarbonise has led to the rise of electric cars - and with it, soaring demand for lithium, which is required for the batteries.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Trump sues Murdoch and Wall Street Journal for $10bn over Epstein article",
        "description": "The lawsuit is over a story claiming the president wrote a \"bawdy\" personal note to Jeffrey Epstein in 2003.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Sylvanian Families' legal battle over TikTok sex, drugs and murder videos",
        "description": "The toys' owner is suing a TikTok creator who makes videos of them in adult storylines.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "How the rise of green tech is feeding another environmental crisis",
        "description": "The world's race to decarbonise has led to the rise of electric cars - and with it, soaring demand for lithium, which is required for the batteries.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "'Great British Energy solar panels' were made in China",
        "description": "A Labour MP says GB Energy should buy British to avoid the risk of forced labour in supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "US tech CEO resigns after Coldplay concert embrace goes viral",
        "description": "The company said its leader had not met the expected standard of conduct and accountability.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Why Prada - and other luxury brands - keep getting India wrong",
        "description": "A controversy involving Prada has put the spotlight on how global fashion giants engage with India.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "The deepening water shortage row between the US and Mexico",
        "description": "The US is accusing its southern neighbour of breaking a long-held water sharing agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "US economy showing signs of tariff stress - 18 Jul 2025",
        "description": "Expert says the US is going through unusual economic uncertainty as a result of Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Spud-tacular: How India became a french fry superpower",
        "description": "India's position as a leading exporter of french fries has spurred innovation on potato farms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "US passes first major national crypto legislation",
        "description": "It marks a milestone for the once fringe industry, as it expands its power in Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Meta investors settle $8bn lawsuit with Zuckerberg over Facebook privacy",
        "description": "Shareholders accused Meta leaders of damaging the company by allowing repeat violations of Facebook users' privacy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Netflix uses AI effects for first time to cut costs",
        "description": "The streaming firm says AI allowed The Eternaut to complete a sequence faster and cheaper.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Meta apologises after auto-translated post declares India minister 'dead'",
        "description": "Karnataka CM Siddaramaiah's Kannada post paying tributes to an actress who died was wrongly translated into English.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Why is Donald Trump asking Coca-Cola to change its recipe?",
        "description": "The US president says it's better to make the fizzy drink with cane sugar, but why might that be?",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Former HSBC trader has fraud conviction overturned",
        "description": "Mark Johnson, 59, has fought to establish his innocence ever since he was convicted of fraud in 2017.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Plans for direct train to Berlin in new UK-Germany treaty",
        "description": "It comes as Friedrich Merz makes his first official visit to the UK as German chancellor.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Samsung boss cleared of fraud by South Korea's top court",
        "description": "The ruling comes after Lee Jae-yong was acquitted of all charges in two earlier trials.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Jaguar Land Rover to cut up to 500 UK jobs",
        "description": "The carmaker says the cuts are part of \"normal business practice\", but one expert blames US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Why film-makers can't get enough of Ireland",
        "description": "Helped by generous tax breaks, Ireland's film and TV production sector has never been stronger.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Busiest UK airports raise kiss-and-fly fees, says RAC",
        "description": "Britain's airports are charging up to £7 to briefly drop off passengers close to terminals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Is buying with friends the answer to a tough UK housing market?",
        "description": "Two couples unable to afford London prices bought a home together. Add two babies, and how is it going?",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Why Jane Street, a US trading giant, is in trouble in India",
        "description": "The firm has been banned from India's securities market for alleged manipulation\nthat led to small investors trading at unfavourable prices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Trump discussed firing Fed boss but 'highly unlikely' he will",
        "description": "The US president admitted he broached sacking Jerome Powell, in what would be an unprecedented move.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "Canada curbs steel imports to shield domestic industry from Trump tariffs",
        "description": "PM Mark Carney has pledged to diversify the country's trading partners away from the US and prioritise the use of Canadian steel.",
        "source": "BBC Business",
        "fetched_date": "2025-07-20T07:27:23.512120"
    },
    {
        "title": "How Hollywood Is Feeding the Frenzy Around the Epstein Files",
        "description": "Decades of conspiracy movies and TV shows may now be coming home to roost.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Girl Group XG on Their Dynamite Coachella Debut and Sharing Their Love for Fans on “Million Places”",
        "description": "The seven-member global group made their Coachella debut this April, showcasing their dynamic performance skills to a new audience: “We poured our hearts into it.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Billy Joel Sits Down With Bill Maher for Post-Brain Disorder Diagnosis Interview",
        "description": "The \"Piano Man\" singer is set to appear on the 'Club Random' podcast next week, with a video clip from the interview released on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "K-pop Stars BTS Release First Live Album ‘Permission To Dance On Stage – Live’ (Exclusive Photo)",
        "description": "All seven members of the supergroup recently completed their mandatory military service and the band is expected to release a new album and tour next year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Billy Joel ‘And So It Goes’ Directors on “Vienna,” Nas and the One Legendary Artist Who Turned Down an Interview for the Doc",
        "description": "“At one point, [Billy] said to me, 'You going deep?' And I said, ‘Yeah, and you know you’re going to go deep too,'\" the film’s co-director Susan Lacy says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Epstein, Diddy Prosecutor Maurene Comey Speaks Out After Firing: “Fear Is The Tool of a Tyrant”",
        "description": "The daughter of James Comey worries the Justice Department giving her the boot “without reason” will thwart independent prosecutions.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Tina Fey, Marc Platt Team for ‘John Proctor Is the Villain’ Movie at Universal (Exclusive)",
        "description": "Kimberly Belflower will adapt her Tony-nominated Broadway play, while stage star Sadie Sink will executive produce.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Alan Bergman, Oscar-Winning Lyricist, Dies at 99",
        "description": "He wrote songs with his late wife, Marilyn Bergman, for more than 50 years, collaborating with the likes of Astaire, Sinatra, Streisand, Hamlisch and Legrand.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "With His New Album, Alex Warren Isn’t Broken Anymore",
        "description": "The singer-songwriter behind the No. 1 hit \"Ordinary\" is excited to show listeners \"how I've been able to heal\" in the second chapter of his album, 'You’ll Be Alright, Kid.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "PBS and NPR Funding Face “Devastating” Cut as Rescission Package Heads to Trump’s Desk",
        "description": "The package will cut $1.1B in federal funding for the public radio and TV broadcasters, hitting local stations across the country.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Suspect in ‘American Idol’ Music Supervisor’s Killing in L.A. Home Charged With Murder",
        "description": "Raymond Boodarian, 22, was charged and held without bail in Los Angeles today.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    },
    {
        "title": "Denise Richards Alleges Estranged Husband “Threatened to Kill” Her, Granted Temporary Restraining Order",
        "description": "Aaron Phypers also responded to his actress/reality star wife’s accusations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-20T07:27:24.787659"
    }
]