[
    {
        "title": "US House passes Trump's 'big, beautiful' tax and spending bill",
        "description": "The bill's passage is a victory for the White House, which warned that failure would be a \"betrayal\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which must still pass in the Senate, includes sweeping changes to the tax code, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Trump administration ends Harvard's ability to enrol international students",
        "description": "The move escalates the administration's row with America's oldest university over hiring, admissions and teaching practices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "US Treasury confirms the end of the penny",
        "description": "There has been a long debate over the cost and usefulness of one cent coins in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which must still pass in the Senate, includes sweeping changes to the tax code, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "The town divided by Bitcoin",
        "description": "Trump has said he wants to turn the US into the crypto-mining capital of the world - but that has real-world implications for many of his core voters",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "In South Korea, even your cup of Starbucks could be too political",
        "description": "All six presidential candidates' names are banned in Starbucks stores to \"maintain neutrality\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Labubu fan fury after dolls pulled from stores",
        "description": "The popular toys have been removed from UK shelves until June, following reports of customers fighting over them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Did Trump really strike Gulf deals worth $2tn?",
        "description": "Some analysts question whether the amount of investment will ultimately be that high.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "The world's most dangerous country for trade unionists",
        "description": "More trade union members are murdered in the South American nation than anywhere else.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Why so many military veterans move into cybersecurity",
        "description": "The vigilance needed in the military can be an asset in the cybersecurity industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "US Congress moves to block California ban on petrol-only cars",
        "description": "California's plan was expected to have significant influence over the wider car industry in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Nike to raise US prices as firms face tariffs uncertainty",
        "description": "The US sportswear giant says its price increases are part of \"seasonal planning\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "How a joke about rice cost a Japan cabinet minister his job",
        "description": "Soaring rice prices are a powerful trigger in Japan, where shortages have caused political upsets before.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "M&S website back online, allowing users to browse",
        "description": "After going down overnight, the website is open for browsing again, but online orders remain suspended after the recent cyber attack.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Trump meets Republican hard-liners in hopes of moving tax bill forward",
        "description": "The House may vote on his \"big beautiful bill\" soon, and Trump needs the support of almost all Republicans for it to pass.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Four obstacles for Republican rebels in Trump's tax bill",
        "description": "Republicans, who hold thin majorities in Congress, are fighting over cutting Medicaid and other government programmes.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Target sales hit as Trump tariffs take effect",
        "description": "The US chain reports a sharp fall in sales which it blames on a \"highly challenging environment\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "'World's greatest designer' Jony Ive joins OpenAI to 'reimagine' computers",
        "description": "The man who designed the iPad, iMac and iPhone will try to come up with a new generation of products for the AI era.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "No money left at the end of the month and smaller food shops: How inflation rise affects you",
        "description": "Inflation has risen by more than expected as water, energy and food bills grew - how are ordinary people making their income stretch?",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Nvidia boss calls US chip policy a 'failure'",
        "description": "His comments come as the White House says it will overhaul rules restricting sales of advanced chips.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Elon Musk plans to cut back political spending",
        "description": "Asked if he had any regrets about his political activities, Musk said: \"I did what needed to be done.\"",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "X restricted in Tanzania after police targeted by hackers",
        "description": "After being compromised, explicit images and misinformation were shared on the police's account.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Fortnite back on US Apple app store after ban lifted",
        "description": "It was removed in 2020 for violating Apple's policies by launching its own in-app payment system.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Trump pressures Republicans to back his 'big beautiful' tax bill",
        "description": "The fate of Trump's tax plan remains mired in uncertainty despite a last minute, in-person pitch to Republicans.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Millions of consumers in UK could get £70 after Mastercard ruling",
        "description": "It is not necessary to have held a Mastercard to make a claim following a tribunal ruling.",
        "source": "BBC Business",
        "fetched_date": "2025-05-23T07:27:24.329969"
    },
    {
        "title": "Kendrick Lamar Commands Home Crowd as SZA Brings Out Lizzo for Surprise Duet During the First Night of L.A. Tour Stop",
        "description": "Lebron James and Winnie Harlow were spotted among the concert-goers at the first of three sold-out Los Angeles shows on the Grand National Tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Kid Cudi Testifies in Diddy Trial That His Car Was Set on Fire Weeks After Sean Combs Broke Into His Home",
        "description": "Cudi, whose real name is Scott Mescudi, took the witness stand in the disgraced mogul's sex trafficking trial and said he and Cassie briefly dated in 2011.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Kneecap Member Charged With Terror Offense, Band Vows to “Vehemently Defend Ourselves”",
        "description": "\"We are on the right side of history,\" the Irish rap trio said in a statement after Liam Óg Ó Hannaidh was charged with displaying a Hezbollah flag.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Reneé Rapp Seemingly Disses ‘The Sex Lives of College Girls’ in New Single “Leave Me Alone”",
        "description": "The singer played Leighton Murray on the HBO series before departing in season three.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Hollywood Gets a Major Boost From a Republican Senator in the Fight Over AI Copyright",
        "description": "Josh Hawley goes after a YouTube executive: “A huge, huge problem to me.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Roman Holiday — The Hollywood Insider’s Guide to the Eternal City in the Age of Pope-Mania",
        "description": "Between the excitement over Pope Leo XIV and the Jubilee celebrations, Rome is the place to be this summer. The travel consultants to the A-list share their secrets to soaking in the dolce vita in style.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "“Diddy” Defense Team Minimizes Guns Found on His Property, Says Expert Witnesses Are “Dangerous”",
        "description": "Attorneys for the rap mogul spent the day minimizing the testimony of two of the three witnesses — a Homeland Security agent who raided his Miami home and the other, a clinical and forensic psychologist.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Miley Cyrus Gives Chappell Roan and Sabrina Carpenter Their “Flowers”: I “Support Those Girls All the Way”",
        "description": "The \"Mother's Daughter\" singer also opened up about her sobriety journey in an interview on ‘The Zane Lowe Show.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Warner Records’ Tom Corson to Be Honored at 2025 City of Hope Spirit of Life Gala; Michael Bublé to Headline",
        "description": "The industry will gather on October 15 at L.A.’s Pacific Design Center for an evening of music and meaning.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "Lady Gaga Inches Closer to EGOT Status After Sports Emmy Win",
        "description": "The “Bad Romance” singer is one award away from joining the esteemed group of stars who have won an Emmy, Grammy, Oscar and Tony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "West Hollywood Pot Shop Owned by Bill Maher, Woody Harrelson Ransacked",
        "description": "The Woods on Santa Monica Blvd. was robbed of weed products on Saturday morning by five thieves, with the LA County Sheriff's Department and the LAPD conducting an investigation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "“Free Puff” T-Shirts Outside of Sean “Diddy” Combs Trial May Be Part of a Paid Protest",
        "description": "The oddly quiet demonstration, which could be tied to Combs' sons' $DIDDY memecoin, took place outside of the Manhattan federal courthouse since jury selection began this week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-23T07:27:24.703637"
    },
    {
        "title": "‘No excuses’ for Western United",
        "description": "Off-field turmoil won’t be used as an excuse by Western United players if they fail to reach the A-League grand final.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Fans lose it as Aussiest quote goes viral",
        "description": "Ange Postecoglou is already on top of the world, but his use of a classic Aussie quote has taken the Spurs boss to an even higher level.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "$2m reason NRL coach is dead man walking",
        "description": "Newcastle Knights coach Adam O’Brien has been urged to listen to Andrew Johns as an uncomfortable cloud bears down on him.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Star’s wife calls out disgusting abuse",
        "description": "An NRLW veteran has been subjected to horrific social media abuse with her partner pleading for it to come to an end.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "$2m reason NRL coach is dead man walking",
        "description": "Newcastle Knights coach Adam O’Brien has been urged to listen to Andrew Johns as an uncomfortable cloud bears down on him.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Star’s wife calls out disgusting abuse",
        "description": "An NRLW veteran has been subjected to horrific social media abuse with her partner pleading for it to come to an end.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Goodwin sounds Warner, Heeney alarm",
        "description": "Sydney stars Chad Warner and Isaac Heeney won’t run around unmarked – not against Simon Goodwin’s Melbourne at the MCG on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Tigers, Dons push for Dreamtime change",
        "description": "Essendon and Richmond are thrilled with the Friday night timeslot for tonight’s Dreamtime at the ‘G clash – but both clubs agree the game is still not ‘the pinnacle’ it deserves to be.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "‘He’s the future’: Former Aussie star backs batting prodigy",
        "description": "A former Australian star is urging selectors to back in “the future” in next month’s World Test Championship final at Lord’s.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "14-year-old sensation signs off from IPL season in style",
        "description": "Teen freak Vaibhav Suryavanshi ended his IPL season with a bang as his side bowed out of this year’s competition.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "‘Wildly inappropriate’ camera act slammed",
        "description": "Just months after becoming enemy No. 1 in Australia – Danielle Collins was at her fiery best again with a wild cameraman clash.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Damir Dokic, Jelena’s abusive dad, dies",
        "description": "Damir Dokic, the abusive, estranged father of former Aussie tennis star and current commentator Jelena Dokic, has died.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "F1 star completely spoils new Brad Pitt movie",
        "description": "F1 fans might not be too happy with one driver after he accidentally spoiled the ending to Brad Pitt’s new movie about the sport.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Nation turns on Aussie family, lie goes too far",
        "description": "The Formula 1 world has been left devastated for Aussie driver Jack Doohan with disgusting messages causing outrage.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Sliding Reds ‘need to be better’",
        "description": "The Queensland Reds are searching for some answers to their dip in form ahead of the Super Rugby Pacific finals series.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Wallabies captain returns for Reds",
        "description": "The Queensland Reds will receive a much-needed boost on Friday night with the return from injury of Wallabies skipper Harry Wilson.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Baseball world rocked by Aussie icon’s death",
        "description": "A massive ‘outpouring of shock and loss’ has swept through the Australian sporting world after the unexpected death of an Aussie Olympian.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "‘No excuses’ for Western United",
        "description": "Off-field turmoil won’t be used as an excuse by Western United players if they fail to reach the A-League grand final.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Fans lose it as Aussiest quote goes viral",
        "description": "Ange Postecoglou is already on top of the world, but his use of a classic Aussie quote has taken the Spurs boss to an even higher level.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "25yo star dies weeks after getting married",
        "description": "Tributes are flowing around the boxing world after a talented fighter died at the age of 25 in a heartbreaking tragedy.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Scheffler outlasts Rahm to claim third major at PGA Championship",
        "description": "World number one Scottie Scheffler has captured his third major title, seeing off Spain’s Jon Rahm down the back nine in the final round to win the PGA Championship.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Unthinkable ‘choke’ turns NBA on its head",
        "description": "Tyrese Haliburton knocked down a ridiculous game-tying shot, sparking a truly extraordinary Indiana Pacers comeback win.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "The day Gollan realised Antino would be a future star",
        "description": "Antino hasn’t raced at Doomben since 2022 but Tony Gollan says it was that day in a lowly benchmark race that he realised he had a potential Group 1 star on his hands.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-23T07:27:25.656613"
    }
]