[
    {
        "title": "Warren Buffett, 94, stepping down as Berkshire Hathaway CEO",
        "description": "The veteran investor known as the Sage of Omaha told his company's annual meeting that he would hand over the reins to Vice-Chairman Greg Abel.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "How Carney's election win will change direction of trade war",
        "description": "In his exclusive BBC interview, the Canadian Prime Minister indicates how he plans to tackle Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Elon Musk's Starbase city in Texas on brink of becoming official",
        "description": "Local residents are voting on incorporating a patch of land as a new municipality, with a SpaceX employee tipped to become mayor.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Wall Street stocks bounce back from Trump tariff losses",
        "description": "Investors were buoyed by a better-than-expected jobs report and rising hope of US-China trade talks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "How Carney's election win will change direction of trade war",
        "description": "In his exclusive BBC interview, the Canadian Prime Minister indicates how he plans to tackle Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "London's 'spiralling' housing crisis in numbers",
        "description": "Research sets out the challenges and solutions to tackle the growing housing need in the capital.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Are alcohol-free drinks worth the price in 2025?",
        "description": "It can cost the same as traditional drinks but making a zero alcohol beverage is a complex process.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Digital powerhouse Uber now accepts cash for fares",
        "description": "Taxi app giant Uber said trials showed some people preferred paying in cash or did not have a bank card.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Deported gang members get second chance at call centre",
        "description": "In the Mexican city of Tijuana a number of firms are employing people who were removed from the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "'We don't care': A defiant China looks beyond Trump's America",
        "description": "Chinese exporters tell the BBC if the US doesn't want their goods, \"other countries have money\" to buy them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Tariffs on car parts entering the US come into force",
        "description": "Import taxes were eased after carmaker outcry,  but it's \"still a big tariff\", analysts say.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "US court rules ex-Abercrombie CEO unfit for trial",
        "description": "Mike Jeffries is \"mentally incompetent\" and will spend time in hospital to see if his condition improves, a judge rules.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "US jobs grow by more than expected despite tariff turmoil",
        "description": "Employers added 177,000 roles in April as the jobs market continues to prove resilient.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Temu to stop selling goods from China directly to US customers",
        "description": "The online marketplace says it will move to a \"local fulfillment model\" in the US, with sales handled by locally based sellers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "M&S supplier resorts to pen and paper after cyber attack",
        "description": "What's going on behind the scenes in the aftermath of the cyber attack on M&S.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Co-op cyber attack affects customer data, firm admits, after hackers contact BBC",
        "description": "The firm previously said there was \"no evidence that customer data was compromised\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Trump signs order to block funding to public radio",
        "description": "Trump alleged that both organisations have produced \"biased and partisan news coverage\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Meta threatens to cut off Facebook in Nigeria over huge fines",
        "description": "The social media giant has challenged demands to pay $290m over regulatory violations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Talks or no talks: Who blinks first in US-China trade war?",
        "description": "Donald Trump and Xi Jinping are locked in a game of chicken - despite wanting the same outcome.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Apple says most US-bound iPhones no longer made in China",
        "description": "The technology giant says US tariffs will add around $900m to its costs this quarter.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "M&S working 'day and night' over cyber attack",
        "description": "The boss of the retailer says he is \"really sorry\" for the disruption which caused it to pause its online operations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Businesses count costs as India and Bangladesh impose trade restrictions",
        "description": "Relations between the countries have been sour for months but differences were mostly expressed verbally until now.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "What's in the US-Ukraine resources deal?",
        "description": "The BBC's analysis editor looks at what has been agreed in the much-anticipated agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "McDonald's sales drop as diners face 'uncertainty'",
        "description": "The burger chain says its US customers are \"grappling with uncertainty\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Xbox prices hiked worldwide amid tariff uncertainty",
        "description": "The company has pointed to increasing game development costs and \"market conditions\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-04T07:24:02.723606"
    },
    {
        "title": "Dual Lawsuits Accuse and Deny José Menendez’s Alleged Sexual Assaults of Menudo Members",
        "description": "Roy Rosselló has filed a sweeping complaint against his former manager, and the man holding some rights to the Latin group's songs is suing NBC over a 2023 docuseries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "The Stars of ‘White Lotus,’ ‘Yellowjackets’ and ‘Star Trek: Discovery’ Just Barnstormed Congress in the Name of Arts Funding",
        "description": "Trump wants the NEA gone. So some of your favorite Hollywood actors were let loose on the Capitol to stop him (think karaoke, gauntlets to Republican staffers and Jason Isaacs getting teary).",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Girl Group KATSEYE Returns With ‘Gnarly’ Hyperpop Single",
        "description": "The Hybe-Geffen Records group, whose formation through the competition series ‘Dream Academy’ was documented in a Netflix documentary last year, is back with a new, experimental song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Beyoncé Teaches Us to Expect the Unexpected During Cowboy Carter Tour Opening Week in Los Angeles",
        "description": "For night two, the superstar added classics to her setlist including 'Single Ladies' and 'Love on Top.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "PR Machine Expands With Launch of Influence Public Relations for Digital Talent, Staff Promotions",
        "description": "Influence is co-founded by PR Machine’s Mike Liotta and Emily Baird, the latter of whom will step down to become CEO at Influence while Rachel Hosseini and Grace Topalian are being upped at PR Machine.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "PBS President Says Trump’s Executive Order to End Funding Is “Blatantly Unlawful”",
        "description": "The Corporation for Public Broadcasting’s leadership doesn’t get it either.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Fashion Designer Riccardo Tisci Accused of Drugging, Sexually Assaulting New York Man in Legal Complaint",
        "description": "Tisci's rep said the \"allegations are categorically untrue\" in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Prince Harry Loses Appeal Over U.K. Security Detail After Barristers Argued His Life Was “At Stake”",
        "description": "The ruling means that the Duke and Duchess of Sussex will receive a \"bespoke\", taxpayer-funded security service while in the U.K.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Russell Brand Granted Bail at First London Court Hearing on Rape, Sexual Assault Charges",
        "description": "The disgraced presenter, charged with one count of rape, one count of indecent assault, one count of oral rape and two counts of sexual assault, will have his next court appearance on May 30.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Ed Sheeran Sets ‘Play’ Release Date, Drops Second Single “Old Phone”",
        "description": "“I made this record all over the world, finished it in Goa, India, and had some of the most fun, explorative creative days of my life,” the singer wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Trump Signs Executive Order Directing Federal Funding Cuts to PBS and NPR",
        "description": "It's the latest move by the Trump administration to utilize federal powers to control or hamstring institutions whose actions or viewpoints he disagrees with.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Jack Antonoff Named ASCAP’s Songwriter of the Year at 2025 Pop Awards",
        "description": "Teddy Swims' \"Lose Control,\"  co-written by ASCAP songwriter Joshua \"Ammo\" Coleman, won pop song of the year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-04T07:24:03.490529"
    },
    {
        "title": "Star knocked out cold in terrifying scenes",
        "description": "A Gold Coast Titans star was left in all sorts of trouble after being KO’d in scary scenes after a tackle went wrong on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Pure trash’: Fans savage world title fight",
        "description": "Boxing fans have been left seeing red after a world title fight turned into a joke of a contest as both men failed to fire a shot.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Salty dog’: War of words goes nuclear",
        "description": "Former teammates Bailey Smith and Marcus Bontempelli have traded verbal jabs as a fiery war explodes between the two stars.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Police issue summons for disgraced AFL star",
        "description": "Disgraced footballer Tarryn Thomas is reportedly set to be charged by police after he was allegedly found in possession of an illegal substance.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Triggering’: Shades of grand final loss as Broncos dominated",
        "description": "The Penrith Panthers have found their four-time premiership mojo, while the Brisbane Broncos have blown plenty of chances in shades of their grand final loss.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Star knocked out cold in terrifying scenes",
        "description": "A Gold Coast Titans star was left in all sorts of trouble after being KO’d in scary scenes after a tackle went wrong on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Tensions rise on the MCG as Hawks celebrate centenary",
        "description": "There’s plenty of feeling between Richmond and Hawthorn at the MCG, with a big brawl eating up time in the second quarter – but the Hawks are well and truly on top where it counts. Follow live.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Salty dog’: War of words goes nuclear",
        "description": "Former teammates Bailey Smith and Marcus Bontempelli have traded verbal jabs as a fiery war explodes between the two stars.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Huge drugs bombshell rocks cricket",
        "description": "The World Test Championship final has been thrown into chaos with a star bowler confessing to a secret doping ban he is serving.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Harris century tops the charts in County Championship",
        "description": "A second century in four matches for former Test opener Marcus Harris has him averaging more than 100 in English County cricket.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Legend’s verdict on brutal Billy Slater call",
        "description": "A Queensland legend has given his verdict on a big headache facing Maroons coach Billy Slater ahead of the State of Origin opener.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Star threatens Piastri as feud erupts",
        "description": "Oscar Piastri has had his worst qualifying result of the year after a controversial incident that left a rival driver furious with the Australian.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Race result overturned as chaos rocks F1",
        "description": "Oscar Piastri’s radio message said it all as the Miami Grand Prix sprint race descended into chaos with late penalties changing the final standings.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Reds remain winless in Fijian capital due to last-minute try",
        "description": "A final minute try has denied Queensland Reds a drought-breaking win in Fiji and puts their chances of hosting a Super Rugby finals match in doubt.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Olympian returns to rugby as a man",
        "description": "Ellia Green, an Olympic gold medallist and former NRLW competitor, has made a comeback in a men’s rugby competition.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Stadium left in shock after horror fall",
        "description": "A fan attending a Major League Baseball game was rushed to hospital after falling onto the playing field in a shocking scene.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Aussie makes history, wins major NBA award",
        "description": "He may have missed out on Defensive Player of the Year, but Dyson Daniels could not be denied for his all-round improvement in his first season at the Atlanta Hawks.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Frustration, rage, anger’ set in for Gunners after latest PL loss",
        "description": "Chasing momentum ahead of their Champions League semi-final, Arsenal’s latest Premier League defeat left a sour taste in their manager’s mouth. PREMIER LEAGUE WRAP.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "City keen to exploit ‘weak’ Sydney defence",
        "description": "Melbourne City has the chance to not only end Sydney FC’s season on Saturday but also secure an AFC Champions League Elite spot.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Pure trash’: Fans savage world title fight",
        "description": "Boxing fans have been left seeing red after a world title fight turned into a joke of a contest as both men failed to fire a shot.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Aussie ‘aura’ could end winning drought",
        "description": "The new Australian captain of the International Team for the Presidents Cup brings something special to the table.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘End of an era’: NBA coaching great steps away",
        "description": "Stars of the NBA have paid tribute to Gregg Popovich after he brought one of ‘the greatest’ NBA coaching careers in history to a close.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Doomben 10,000 and Queensland Derby favourites trial on Monday at Randwick",
        "description": "Trainers John O’Shea and Tom Charlton will tune up some of their Queensland Winter Carnival big guns at Monday’s set of Royal Randwick barrier trials.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "‘Insane’: Dress steals show at Grand Prix",
        "description": "The model wife of a $300m star has stolen the spot light away from the celebrities that have flocked to the Miami Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    },
    {
        "title": "All hell breaks loose after car crash interview",
        "description": "NFL icon Bill Belichick has come out in defence of his 24-year-old girlfriend after she intervened in a controversial TV interview.",
        "source": "News AU",
        "fetched_date": "2025-05-04T07:24:04.960000"
    }
]