[
    {
        "title": "Bitcoin crosses $100k - and seven other wild moments in its history",
        "description": "Its record price is making headlines - but that's just one part of the cryptocurrency's tumultuous story.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "India's 'blockbuster' drugs to take on  deadly superbugs",
        "description": "A number of promising new drugs from India show potential to fight antibiotic-resistant bacteria.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Why are people in UK pouring milk down the drain over a cow feed additive?",
        "description": "The new additive aims to cut down on methane emissions from cows, but some have raised safety concerns.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Airbus cuts nearly 500 UK jobs to reduce costs",
        "description": "It has made the cuts mostly to its space division and says there are no \"compulsory\" losses planned.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "India's 'blockbuster' drugs to take on  deadly superbugs",
        "description": "A number of promising new drugs from India show potential to fight antibiotic-resistant bacteria.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "NYPD hunts gun-wielding assailant who killed UnitedHealthcare CEO outside hotel",
        "description": "Brian Thompson was \"targeted\" by a masked suspect who fled first on foot before grabbing an e-bike and heading towards Central Park.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Who was Brian Thompson, healthcare CEO gunned down in New York?",
        "description": "Police are still searching for the suspect who shot dead the UnitedHealth CEO in Manhattan on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Selling sex for gold in the Amazon's illegal mines",
        "description": "Life for women among the Amazon’s illegal gold miners is harsh, violent, and can be deadly.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Why are doctors wary of wearables?",
        "description": "Wearable tech claims to help monitor our health, but many doctors remain sceptical.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Why is vintage audio equipment booming?",
        "description": "Music lovers are buying up old cassette, CD and record players and getting them fixed.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "South Korea crisis 'to disrupt production' - 4 Dec 2024",
        "description": "Expert says a nationwide strike following the political crisis in South Korea could disrupt the production chain.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Why Swedish women are quitting work",
        "description": "Sweden has a reputation for strong gender equality, but some young women are giving up their jobs.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Niger junta takes control of French uranium mine",
        "description": "Since the coup last year, the junta has been trying to reduce French influence in the country.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "India police seek Starlink help over $4.25bn drug haul",
        "description": "Police say this is the first known case of the device's use to navigate and reach Indian waters.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Telegram U-turns and joins child safety scheme",
        "description": "It is the latest in a series of changes announced by the platform since its founder Pavel Durov was arrested.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Guinness supplies in UK being limited after demand soars",
        "description": "Guinness-maker Diageo has placed limits on wholesale distribution of the stout to pubs in Great Britain after \"exceptional demand\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Guardian and Observer journalists go on strike",
        "description": "Their first strike in more than 50 years concerns the proposed sale of the Sunday title to Tortoise.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "India taxi service sorry for driver's gunpoint robbery",
        "description": "A 30-year-old woman said she was travelling with her six-year-old son when the driver pulled out a gun.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Bank boss takes pay cut after employee 'tried to kill clients'",
        "description": "The bank apologised after the former worker was charged with robbery of clients, attempted murder and arson.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Bitcoin miner sues over £600m 'lost in tip'",
        "description": "James Howells believes the hard drive is now worth about £600m since the recent Bitcoin surge.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Musk's record $56bn pay deal rejected for second time",
        "description": "The judge upheld her previous decision, saying board members who set the pay were too heavily influenced by Mr Musk.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Stunning or rubbish? Jaguar's new concept car divides opinion",
        "description": "The carmaker's new look is praised as \"exciting\" but others say it should \"go back to the drawing board\".",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Microsoft faces £1bn class action case in UK over software prices",
        "description": "It is alleged the tech giant overcharged companies for its Window Server software, used in cloud computing.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Can you spot the blunder on this hat?",
        "description": "Retail giant Sports Direct has been called out for misspelling the Welsh word for Wales on its hats.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Vietnamese tycoon loses death row appeal over world's biggest bank fraud",
        "description": "She is now in a race for her life - if she can pay back 75% of what she took, she could be spared.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "How Jaguar's shifted gears with its concept car",
        "description": "The company has been at the centre of a media storm as a result of its radical revamp.",
        "source": "BBC Business",
        "fetched_date": "2024-12-05T07:27:12.313379"
    },
    {
        "title": "Nicole Kidman Honors Her Mother, Daughters and Female Mentors Who Have “Shown Up” at THR’s Women in Entertainment Gala",
        "description": "“Even though I don't have my mom anymore, I have my daughters. Faith was my mentor, my guide,” said the Oscar-winning actress while accepting the Sherry Lansing Leadership Award at The Hollywood Reporter's annual event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Shareholders at Rome’s Cinecittà Studios to Approve Restated Financial Records",
        "description": "The move comes following the discovery of errors in the iconic studio's 2023 accounts under former CEO Nicola Maccanico.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Jennifer Lawrence, Kerry Washington, Amanda Zurawski Present $1M in College Scholarships to High School Seniors at THR Women in Entertainment Gala",
        "description": "Scholarships were presented to mentees in the WIE Mentorship Program during Wednesday's star-studded event at the Beverly Hills Hotel.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Nikki Glaser Skewers Hollywood Beauty Standards, Jokes About Focus on Colin Farrell’s ‘Penguin’ Transformation at THR Women in Entertainment Gala",
        "description": "\"That’s how long it takes me every day to make sure I don't look like The Penguin,\" the comedian said of the actor's reported three hours in the makeup chair for his role as the Batman villain, now the subject of an HBO series.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Nicole Kidman, Selena Gomez Celebrate Mentorship and Unity at THR Women in Entertainment Event: “Together, We Can Break Down Barriers”",
        "description": "Jennifer Lawrence, Laura Dern, Kerry Washington, Nikki Glaser and Molly Shannon also took part in the star-studded breakfast gala, presented by Lifetime.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Selena Gomez Calls for More Representation in Emotional Speech at THR’s Women in Entertainment Gala: “It Reshapes the Way We Understand Each Other”",
        "description": "\"It’s not just about seeing more faces onscreen, it’s about creating opportunities for people to see themselves reflected in ways that acknowledge their value and all their complexities,\" Gomez said while receiving the Equity in Entertainment Award at The Hollywood Reporter's annual gala.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Hollywood’s Trump Resistance: The Sequel",
        "description": "Leave your pussy hats at home. This time around, industry activists may be shifting focus to local progressive causes and downballot races.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "How to Get the Head of Amazon to Officiate Your Wedding",
        "description": "Jen Salke might have presided over Paolo Franco’s marriage vows, but the real prize is their relationship, which grew out of THR’s Women in Entertainment mentorship program in 2013, and guided Franco from high-school senior to Netflix executive.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Cara Donatto Named EVP of Media Strategy for Atlantic Music Group",
        "description": "The veteran publicist, who helped launch the careers of Bruno Mars and Janelle Monáe, is returning to Atlantic after serving as EVP, Head of Media Strategy & Communications for Interscope Geffen A&M.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Eva Longoria Talks “Disrupting the Industry” by Co-Founding Hyphenate Media: “Hollywood Makes You Stay in Your Lane”",
        "description": "The 'Desperate Housewives' star told Content London: \"It really is an industry that makes you stay in your lane — 'you're an actress, not a producer, just keep doing that.'\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Ghislaine Maxwell Prosecutor Joins Sean “Diddy” Combs Sex Trafficking Case",
        "description": "The rap mogul's defense team has aggressively challenged the prosecution at every turn.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Eminem’s Mother Debbie Nelson, Whose Rocky Relationship Fueled the Rapper’s Lyrics, Dies at 69",
        "description": "Nelson’s fraught relationship with her son has been no secret since the Detroit rapper became a star.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-05T07:27:13.233149"
    },
    {
        "title": "Reece Walsh a target of new ‘six-pack ban’",
        "description": "A sight that was commonplace at Broncos training under former coach Kevin Walters has now been outlawed under the club’s new mentor.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "WAG’s ‘sad’ admission about AFL star",
        "description": "The partner of Collingwood superstar Jordan de Goey has hit out over the bad boy characterisation that is often associated with him.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘Can’t move him’: New Pie’s strength test",
        "description": "A Collingwood draftee has caught the eye for his impressive physique but says he’s met his match early in pre-season training.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘It’s crazy’: Aussie legend keeps going viral",
        "description": "Aussie cricket great Brett Lee has had a busy week, sending his colleague to hospital and going seriously viral on social media.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "WAG’s ‘sad’ admission about AFL star",
        "description": "The partner of Collingwood superstar Jordan de Goey has hit out over the bad boy characterisation that is often associated with him.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘Can’t move him’: New Pie’s strength test",
        "description": "A Collingwood draftee has caught the eye for his impressive physique but says he’s met his match early in pre-season training.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Reece Walsh a target of new ‘six-pack ban’",
        "description": "A sight that was commonplace at Broncos training under former coach Kevin Walters has now been outlawed under the club’s new mentor.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Why sevens star chose to join the Storm",
        "description": "The Storm helped turn Will Warbrick into an NRL star, and they’ll be hoping for more of the same with their latest sevens recruit.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Australia’s unexpected new voice of cricket",
        "description": "If you think you’ve heard it all, you haven’t until you listen to the new voice of the summer of cricket. Welcome to Crash AI, Robert Craddock as you’ve never heard him before.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘It’s crazy’: Aussie legend keeps going viral",
        "description": "Aussie cricket great Brett Lee has had a busy week, sending his colleague to hospital and going seriously viral on social media.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Brisbane options limited for Tomic",
        "description": "If Bernard Tomic wants to try to qualify for the Brisbane International, he will need some help from tournament organisers.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Brisbane event a ‘showcase’ for Krygios",
        "description": "With Nick Kyrgios having been sidelined a long time, Pat Rafter is not sure how the returning star will fare at the Brisbane International.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "F1 photo goes viral for worst reason possible",
        "description": "A photo featuring Aussie Oscar Piastri has gone viral in F1 circles this week as a team’s brutal transformation stunned commentators.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Shock F1 announcement fuels Max rumours",
        "description": "A surprise announcement has taken the F1 world by surprise and fuelled speculation about Max Verstappen’s future in the sport.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Raygun turns heads among celebrities",
        "description": "Rachael ‘Raygun’ Gunn has turned heads as she stepped out like fans have never seen before and strolled down the red carpet.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Internet sensation lifts lid on break up",
        "description": "Boxing’s internet sensation has spilled the beans on a big change to her personal life while revealing the one thing she doesn’t want.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Who’s the new NFL MVP frontrunner with the superstar fiancée?",
        "description": "It was a Thanksgiving Week for the ages for the new MVP frontrunner, and can anyone outside the top 4 contend for the Super Bowl?",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "OJ Simpson ‘confessed’ in shock recording",
        "description": "There has been a stunning twist to the infamous OJ Simpson murder trial, with a thumb drive reportedly containing his “confession”.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Coach’s plea to A-League clubs",
        "description": "An international coach has urged A-League Women clubs to back in talented Taiwanese players who briefly threatened a boilover in Melbourne.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Chaos erupts as star refuses rainbow jersey",
        "description": "Manchester United are at the centre of a major Premier League drama after plans to support the LGBTQ+ community were canned.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘Heartbroken’: Boxing legend dead at 46",
        "description": "The boxing world has been rocked by the death of a hall of fame legend with tributes coming from around the world.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "‘I can’t’: Tiger talks on LIV deal, future",
        "description": "Tiger Woods has opened up on why he can’t play his own event, when he’ll be back and why the PGA Tour deal with LIV Golf isn’t done.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "SuperCoach NBL Late Mail: Kings imports race clock",
        "description": "Kings stars Jaylen Adams and Cam Oliver are racing the clock to be fit for Saturday’s clash against New Zealand, leaving Sydney in a delicate position.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Rugby moves to secure Wallabies stars as NRL poachers circle",
        "description": "Rugby Australia has moved to secure the futures of several off-contract Wallabies as the NRL considers salary cap concessions to raid the 15-man code’s biggest stars. Find out more inside.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Wallaby gut punch as star makes NFL move",
        "description": "One of the Wallabies’ most exciting players has announced he is gambling everything to chase his dream in the United States.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Irish-born whiz kid poised for Australian debut",
        "description": "Teen riding sensation Billy Loughnane will have two rides for training partnership John O’Shea and Tom Charlton at Rosehill Gardens on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    },
    {
        "title": "Olympian ‘deathly pale’ after ugly crash",
        "description": "A double Olympic road cycling champ suffered horror injuries after a postal van worker opened their car door in front of him on a ride.",
        "source": "News AU",
        "fetched_date": "2024-12-05T07:27:15.841027"
    }
]