[
    {
        "title": "Trump urges US to 'hang tough' as 10% tariffs come into effect",
        "description": "It comes on the largest day of protests against Trump's administration since he returned to office.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Trump has turned his back on the foundation of US economic might - the fallout will be messy",
        "description": "What made the US step back from the system that it profited handsomely from for decades?",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "How worried should we be about tumbling stock markets?",
        "description": "Workers are right to fear for their pensions, but the greater worry is the here and now - the economy they live in.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "EU firms will try for lower tariffs via NI, says Nobel economist",
        "description": "US President Donald Trump has imposed a 10% tariff on UK goods, but a 20% tariff on EU goods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Trump has turned his back on the foundation of US economic might - the fallout will be messy",
        "description": "What made the US step back from the system that it profited handsomely from for decades?",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Starmer vows to protect UK businesses from tariff 'storm'",
        "description": "Starmer says he will take a \"cool-headed\" approach on tariffs but all options remain on the table.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Why shoppers are snapping up 'stripes' products for eye-popping prices",
        "description": "As Canada's Hudson's Bay Company faces an end to its 355-year legacy, shoppers are scrambling for anything with its iconic \"stripes\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Jaguar Land Rover to pause US shipments over tariffs",
        "description": "The British firm say no vehicles will be shipped in April as it processes the impact of Donald Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Spain tackles housing 'social emergency' as rents double in a decade",
        "description": "The Spanish government is moving to make renting more affordable and boost the supply of homes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Week in Markets - 4 Apr 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Starmer's response to Trump tariffs is both to slow down and go faster",
        "description": "What's happening in Whitehall to try to limit the harm to the UK, perhaps by making a deal with the US, and make the most of any opportunities?",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Trump's agenda grapples with political and economic reality",
        "description": "Trump says it’s all going to plan but stock market turmoil plus struggles at home and abroad show how hard it is to deliver as president.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "'Sometimes you have to walk through fire': Tariffs get backing in Trump heartland",
        "description": "As economic uncertainty swirls and the markets take a hit, many in this deeply Republican area back the president's plan.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "How might tariffs change the price of Nike's iconic trainers?",
        "description": "What impact will the introduction of hefty tariffs on countries in Asia have on Nike's iconic US trainer?",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Trump extends deadline to keep TikTok running in US",
        "description": "The president has granted the app a second 75-day extension to comply with a law that requires it to either sell its US assets or face a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Who's trying to buy TikTok?",
        "description": "Oracle, Microsoft and the founder of OnlyFans are also among names that have cropped up as the president seeks to broker a deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Sam Altman's AI-generated cricket jersey image gets Indians talking",
        "description": "Some found the image delightful, but others wondered about OpenAI founder's motives for wooing India.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Will £75 be the new normal for video games after Switch 2's Mario Kart?",
        "description": "There's a lot of excitement about the new console - but also concern about the high price of its games.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Trump's tariffs could be death knell for  US-Africa trade pact",
        "description": "Some African countries got privileged access to US markets, but the future of that deal is uncertain.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Americans could pay more for these everyday basics under Trump's new tariffs",
        "description": "The next cup of coffee, Shein shopping haul and more may soon cost more as tariffs take effect",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "China and US are at each other's throats on tariffs, and neither is backing down",
        "description": "China's new 34% tax on US imports shows it is ready to tussle with Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Nintendo pulls Switch 2 pre-orders in US over Trump tariffs",
        "description": "It unveiled the console on Wednesday just hours before the president announced a wave of global tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "US envoy says he's working on DR Congo minerals deal",
        "description": "DR Congo hopes that US involvement in its minerals sector would help deter Rwandan-backed rebels.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "Analysis: EU talks tough on Trump tariffs in hope of U-turn",
        "description": "The EU has enormous economic clout as the biggest single market in the world, but does not want to risk a backlash.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "How will India navigate a world on the brink of a trade war?",
        "description": "India is the world's fastest-growing major economy. How it deals with Trump will define its economic trajectory.",
        "source": "BBC Business",
        "fetched_date": "2025-04-06T07:22:50.999329"
    },
    {
        "title": "OK Go’s Damian Kulash On Two Decades of Making “Ridiculous” Viral Music Videos",
        "description": "Kulash and the band's bass player Tim Nordwind sat down for a panel earlier this week with music video director Aaron Duffy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Prosecutors Bring Third Superseding Indictment Against Sean “Diddy” Combs",
        "description": "In total, the mogul faces five counts on three charges of racketeering, sex trafficking and transportation to engage in prostitution. He awaits trial in a Brooklyn jail.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Drake Bell Talks Using Music to Heal From Child Acting Trauma: “I Tell My Story Through My Art",
        "description": "The ‘Drake and Josh’ star tells THR he's “exhausted” answering the same questions about working with sex abuser Brian Peck on a Nickelodeon kids TV series as he touts his latest album, 'Non-Stop Flight.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "How the Coastal Record Labels Crashed Nashville: “Artists Don’t Have to Follow Those Old Rules”",
        "description": "Country is one of the hottest genres in music, and now labels outside of the old Nashville system have come to town to cash in.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Coldplay Featured on New Version of League of Legends ‘Arcane’ Song “Ma Meilleure Ennemie” (Exclusive)",
        "description": "Coldplay's feature comes as Riot Games and Virgin Music released an extended version of 'Arcane's season two soundtrack.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Elton John and Brandi Carlile Release Collaborative Album ’Who Believes in Angels?’",
        "description": "The duo recently played a one-night only engagement in London that will air as a concert special on CBS this Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Mel Gibson’s Gun Rights Restored by Justice Department (Report)",
        "description": "The decision comes after former U.S. Pardon Attorney Elizabeth G. Oyer claimed she was fired from the DOJ for refusing to recommend the actor be allowed to carry a handgun again.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Ed Sheeran Drops First Single “Azizam” From Eighth Studio Album",
        "description": "The new song is the first from Sheeran’s forthcoming album ‘Play.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Miley Cyrus Drops Single “End of the World” From Upcoming ‘Something Beautiful’ Album",
        "description": "The new song comes days after the singer dropped the first two tracks, \"Prelude\" and \"Something Beautiful.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Conan O’Brien Says It Was “Important” to Attend Kennedy Center Mark Twain Event Despite Trump Overhaul",
        "description": "“There was the question of, ‘Should I go, should I not go?’ And I felt like it was important to show up,” the comedian said during an episode of his podcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "MTV Video Music Awards to Air on CBS for First Time Via Simulcast",
        "description": "The 2025 VMAs will air live on Sept. 7 on MTV and CBS and stream on Paramount+.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "Kanye West Raps About Split With Wife Bianca Censori on His New Album, ‘WW3’",
        "description": "The troubled rapper-mogul suggests trouble in his marriage on \"BIANCA,\" from his new solo album, which dropped on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-06T07:22:51.823725"
    },
    {
        "title": "‘He forced me off’: Ugly drama rocks F1",
        "description": "Two Formula 1 stars almost came to blows as the championship battle went up a notch during the Japanese Grand Prix on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘Madness’: Aussie MMA legend detained in US",
        "description": "As fury grows over Donald Trump’s immigration crackdown, the head coach of the MMA Australian team has found himself behind bars.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Tim Tszyu stuns with nasty TKO finish",
        "description": "Tim Tszyu has delivered a devastating finish to put his name back on the boxing map in a statement victory in front of a raucous home crowd.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Boxing world reacts to Tszyu masterclass",
        "description": "Tim Tszyu has put on a performance that has made the boxing world stand up and take notice, brutally dispatching American Joey Spencer",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Munster’s magic shocks Sea Eagles",
        "description": "Melbourne Storm superstar Cameron Munster is on fire at 4 Pines Park against a shellshocked Manly Sea Eagles. Follow the action live here",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Boxing world reacts to Tszyu masterclass",
        "description": "Tim Tszyu has put on a performance that has made the boxing world stand up and take notice, brutally dispatching American Joey Spencer",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Horne-Francis heroics not enough as Saints leave Power stunned",
        "description": "Jason Horne-Francis was kicked to the curb by many SuperCoaches this week, but he’s making them pay. However, it’s all the Saints at Adelaide Oval. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘Arrogant’: Star’s post-match act called out",
        "description": "AFL star Mac Andrew has never been one to worry about ruffling feathers but he has come under fire for overstepping the mark on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Never-seen-before act stuns cricket world",
        "description": "Cricket fans couldn’t believe their eyes when a Sri Lankan star did something rarely seen before during his debut IPL match.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Warne medical report uncovers third drug",
        "description": "The medical report of Shane Warne’s death has come to light for the first time, revealing the truth behind claims made about his final hours.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Aussie tennis star fumes at influencer reality",
        "description": "Aussie star Daria Saville has called out ‘marketing teams’ behind the rise of tennis influencers, something she said is costing players dearly.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Sinner’s ex-trainer drops doping bombshell",
        "description": "Jannik Sinner’s former trainer has reignited the doping case that rocked tennis by dropping a bombshell that’s bad news for one person.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘Scary’ star set to tear Australia apart",
        "description": "One player is tipped to make such a difference to Super Netball that “something will have to go horribly wrong” for her team not to win the premiership.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Questions asked at McLaren as Verstappen wins fourth Japan title",
        "description": "Max Verstappen has taken out his fourth consecutive Japanese F1 title, with both McLarens rounding out the podium in a smooth sailing race. But questions will be asked of the McLaren strategy.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Schumacher announcement delights F1 world",
        "description": "Michael Schumacher’s family are celebrating some happy news after the F1 legend’s child made a heartwarming announcement.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘F**ck that was pretty cool’: Norths explode to 52-point win over Uni",
        "description": "The Norths Eagles scaled to heights not seen in more than 30 years when trumping traditional powerhouses University in the most remarkable fashion imaginable at Hugh Courtney Oval on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Poll: 1st Colts comp offering rising rugby talent a second chance",
        "description": "It’s a comp helping launch young talent and identifying others who may have slipped under the radar and Waratah selectors will be monitoring every game of Colts in 2025 for future stars",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Shaq: ‘Ben Simmons needs to be arrested’",
        "description": "NBA icon Shaquille O’Neal has taken a flamethrower to Ben Simmons in a stunning take-down, declaring he “needs to be arrested”.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "NBA ‘Bad Boy’ team goes rogue in wild fight",
        "description": "Seven players were ejected after a wild NBA brawl broke out featuring a team that is quickly earning a feisty reputation.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Sermanni left in dark over Matildas interim coaching future",
        "description": "With speculation rife that a permanent Matildas coaching appointment is imminent, interim coach Tom Sermanni remains in the dark about whether his side’s upcoming clash with Korea will be his final act in charge.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Arsenal fume as penalty blow leaves title hopes in tatters",
        "description": "EPL Wrap: Arsenal’s faint hopes of catching league leaders Liverpool are almost over after a contentious penalty cost them dearly against Everton.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘Madness’: Aussie MMA legend detained in US",
        "description": "As fury grows over Donald Trump’s immigration crackdown, the head coach of the MMA Australian team has found himself behind bars.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘Fanboying’: Lee’s friendship with pop icon",
        "description": "Min Woo Lee isn’t short of support from big names in sport and music as he prepares for next week’s Masters at Augusta.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Shaq: ‘Ben Simmons needs to be arrested’",
        "description": "NBA icon Shaquille O’Neal has taken a flamethrower to Ben Simmons in a stunning take-down, declaring he “needs to be arrested”.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "‘He ran his heart out’: J-Mac, Romantic Warrior fall agonisingly short",
        "description": "Star jockey James McDonald and Hong Kong idol Romantic Warrior have fallen agonisingly short in a second successive Middle Eastern Group 1, beaten a nose by Soul Rush in a thrilling Group 1 Dubai Turf (1800m) at Meydan overnight.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Schumacher announcement delights F1 world",
        "description": "Michael Schumacher’s family are celebrating some happy news after the F1 legend’s child made a heartwarming announcement.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-06T07:22:54.349558"
    }
]