[
    {
        "title": "Trump vows day-one tariffs on Mexico, Canada and China",
        "description": "The president-elect said he plans to impose 25% tariffs on Mexico and Canada and an additional 10% on China on his first day in office.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "General Motors agrees deal to enter F1 in 2026",
        "description": "US car giant General Motors reaches an agreement in principle to enter Formula 1 in 2026 with its Cadillac brand.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Nominee for agriculture secretary completes Trump cabinet",
        "description": "Brooke Rollins - head of a pro-Trump right-wing think tank - is his pick for agriculture secretary.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Can RFK Jr make America's diet healthy again?",
        "description": "Kennedy's plans to ban dyes in cereals and fluoride in water could get major pushback from the food industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "General Motors agrees deal to enter F1 in 2026",
        "description": "US car giant General Motors reaches an agreement in principle to enter Formula 1 in 2026 with its Cadillac brand.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Macy's employee hid more than $130m in delivery expenses",
        "description": "An employee \"intentionally\" concealed expenses related to package deliveries, the retailer says.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "From eyesore to asset: How a smelly seaweed could fuel cars",
        "description": "Scientists in the Caribbean are turning algae that have been choking beaches into biofuel.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Wicked proves popular as opening set to be biggest for Broadway film",
        "description": "Wicked is also expected to have the top-grossing opening weekend in UK and Ireland of 2024.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Inside South Africa's 'ruthless' gang-controlled gold mines",
        "description": "Illegal miners live dangerously, but make roaring profits selling gold on the black market.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Is nuclear power gaining new energy?",
        "description": "Countries around the world are building new nuclear power stations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Investors 'wary of incoming administration' - 22 Nov 2024",
        "description": "As US shares lock in a week of gains, investors are keeping an eye out for the new administration's policies.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "UK perfume boss admitted he ignored Russia sanctions",
        "description": "David Crisp told undercover agent he had ignored \"government edicts\" to sell £1.7m of his luxury Boadicea the Victorious product.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "'We had to break rules', says Jaguar as radical rebrand stirs debate",
        "description": "The iconic carmaker's rebrand has certainly caught people's attention, but will it pay off?",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "'I was scammed out of £75k by Martin Lewis deepfake advert'",
        "description": "Des Healey lost £76,000 in a scam using a deepfake of Martin Lewis and Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "UK wants to hire EU negotiator to 'reset' relations",
        "description": "The role will “prepare and lead negotiations with the EU on key UK interests”, the job posting said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Spain fines budget airlines including Ryanair €179m",
        "description": "The government says charging for hand luggage and printing boarding passes at the airport are \"abusive practices\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Trump nominates Bessent to lead US Treasury in flurry of announcements",
        "description": "He also announces nominees for labour secretary, housing secretary and surgeon general.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "How could the Apple tax windfall be spent in Ireland?",
        "description": "The EU’s highest court ruled that Apple had to pay more than €14bn to the Republic of Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Analysis: Will UK chancellor's difficult week cause her lasting damage?",
        "description": "BBC's Ben Wright looks at the impact of a tricky week of scrutiny for the chancellor.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Satellite images show Russia giving N Korea oil, breaking sanctions",
        "description": "Satellite image analysis shows several North Korean tankers visiting Russia dozens of times since March.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "The mighty material that supercharges jet engines",
        "description": "Hi-tech coatings make all sorts of high performance engineering, like jet engines, possible.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Gary Gensler to leave role as SEC chairman",
        "description": "Donald Trump revealed plans to sack Mr Gensler on \"day one\" of his new administration.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Temu owner's shares slump as China slowdown hits sales",
        "description": "US-listed shares of the e-commerce giant fell nearly 11% on Thursday following the announcement.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "How Adani's US fraud charges impact India's economy and politics",
        "description": "The charges could jeopardise the ambitions of one of the world’s richest men, both at home and abroad.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Fraud probe launched into defence firm Thales",
        "description": "Thales UK, which has its headquarters in Berkshire, employs more than 7,000 staff across the country.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "Trudeau plays Santa with seasonal tax break",
        "description": "The opposition calls Trudeau's tax measures \"a trick\" aimed at deflecting attention from rising costs.",
        "source": "BBC Business",
        "fetched_date": "2024-11-26T07:26:38.221660"
    },
    {
        "title": "2024 Billboard Awards: Zach Bryan Leads With 21 Nominations, Taylor Swift Follows With 17",
        "description": "See the full list of nominations as Morgan Wallen and Sabrina Carpenter also scored multiple nods ahead of the Dec. 12 event, airing live on FOX, Paramount+ and Amazon’s Fire TV Channels.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Alec Baldwin Says Americans “Know Little or Nothing About the World” at Turin Film Festival",
        "description": "The actor was the festival's guest of honor and appeared at a press conference on the condition that the 'Rust' shooting, where cinematographer Halyna Hutchins was killed with a prop gun, was not to be brought up at any point.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Barbara Taylor Bradford, Author of Best-Selling Novel ‘A Woman of Substance’, Dies at 91",
        "description": "The book sold more than 30 million copies worldwide and was adapted into an Emmy-nominated Channel 4 miniseries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Alice Brock, Who Helped Inspire Arlo Guthrie’s Classic Song “Alice’s Restaurant,” Dies at 83",
        "description": "'Alice’s Restaurant' also was the title of his million-selling debut album and the basis of a movie and cookbook of the same name.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Adele Doesn’t “Have Any F***ing Plans” Upon Vegas Residency Finish, but Says She’ll Be Back Eventually",
        "description": "The singer took a moment during her final show to thank her son, her partner and Celine Dion.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Larry Auerbach, Longtime William Morris Agent and USC Cinematic Arts Industry Relations Head, Dies at 95",
        "description": "Known as \"the man with the golden Rolodex,\" the agent, who got his start working part time at WMA while he was still in high school, booked Elvis Presley's first TV performance and worked with Aretha Franklin, Sam Cooke and Sammy Davis Jr.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Conor McGregor Must Pay $250,000 to Woman Who Says He Raped Her, Civil Jury Rules",
        "description": "The woman claims the 2018 assault after a night of partying left her heavily bruised and suffering from post-traumatic stress disorder.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Casa Bonita Cast and Crew Members Unanimously Vote to Unionize With Actors’ Equity, IATSE",
        "description": "“Today, we are proud that we stood as a group and said clearly: We want to make Casa Bonita better,” the workers leading the unionization effort said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Miley Cyrus Reveals Godmother Dolly Parton’s Response to “Used to Be Young”: “I’m Like 80. That Should Have Been My Song”",
        "description": "The \"Jolene\" singer said that the track didn’t apply to Cyrus, who is still \"young and beautiful.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Sean “Diddy” Combs Bail Decision Delayed as Rapper Seeks Home Confinement for Third Time",
        "description": "The beleaguered rapper-mogul will remain incarcerated for the weekend in Brooklyn as he awaits his trial on sex trafficking and racketeering charges, which is set for May.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Kendrick Lamar Releases Surprise Album ‘GNX’",
        "description": "The album comes after his successful chart run with the anthem \"Not Like Us\" and months before he headlines the Super Bowl halftime show, which he references on one song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Power Lawyers: THR’s Top Music Attorneys of 2024",
        "description": "Recording stars hungry for films, tours and huge catalog payoffs turn to these 16 chart-topping attorneys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-26T07:26:38.515737"
    },
    {
        "title": "Brutal reason star forced into retirement",
        "description": "AFL star Brad Crouch has been forced to hang up the boots on his illustrious career after being plagued by chronic injuries.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Broncos’ brutal demand for Ezra Mam",
        "description": "Broncos five-eighth Ezra Mam has been handed a brutal reality check by new Brisbane coach Michael Maguire with his career in limbo.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Champ’s chill celebration after Smith’s viral turn",
        "description": "There was no way Elvis Smylie’s PGA Championship win celebrations would go viral like a former champ because his victory was just the beginning.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Ed Sheeran apologises for crashing interview",
        "description": "Music sensation Ed Sheeran has taken the internet by storm after producing an awkward interview moment with a football coach.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "AFL star forced to call time on career",
        "description": "AFL star Brad Crouch has been forced to hang up the boots on his illustrious career after being plagued by chronic injuries.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Saddest detail of Swans coach bombshell",
        "description": "The Sydney Swans have confirmed John Longmire has quit as coach with sad details emerging about the shock news.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Broncos’ brutal demand for Ezra Mam",
        "description": "Broncos five-eighth Ezra Mam has been handed a brutal reality check by new Brisbane coach Michael Maguire with his career in limbo.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is already in overdrive with a host of big names led by Ben Hunt and Josh Addo-Carr on the move. Keep up to date with all the player movement in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "WBBL team of the tournament revealed",
        "description": "Some of the greatest names in women’s cricket have been named in the WBBL team of the year ahead of the finals that start in Sydney on Wednesday night.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Aussie coach’s Marnus call after Perth disaster",
        "description": "Calls for change to the Australian team for the second Test against India have been loud and are growing and the coach has had his say.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Tennis world stunned by Djokovic ‘bombshell’",
        "description": "The tennis world has been left stunned by Novak Djokovic’s shock announcement that he’s acquiring the services of one of his greatest rivals.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Lleyton Hewitt drops bomb on tennis world",
        "description": "Lleyton Hewitt has not held back as he dropped a bomb on the tennis world following Australia’s Davis Cup elimination.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Truth about Schumacher wedding rumour",
        "description": "A former F1 driver and one of Michael Schumacher’s friends has debunked a rumour that surfaced about the seven-time world champion.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Chaos erupts as F1 announces new team",
        "description": "Formula One has finally announced an 11th team will join the grid, sparking speculation over which drivers will suit up for the new outfit.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "‘Humiliation’: McGregor’s fiancée pic horrifies",
        "description": "There’s a photo circulating online of Conor McGregor exiting the courthouse but all anyone can look at is his long-suffering girlfriend, Dee Devlin.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Ring girl reveals ‘big names’ in her DMs",
        "description": "Viral ring girl Sydney Thomas has revealed her new-found fame has seen her inbox become overran with big names hitting her up.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "166kg Aussie ragdolled in viral NFL scenes",
        "description": "Aussie Jordan Mailata has come a long way in his NFL development but the hulking star has gone viral after he was monstered.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "‘Not an NBA player’: Simmons torn to shreds",
        "description": "Aussie NBA star Ben Simmons has hit rock bottom after a disastrous moment saw him go viral for all the wrong reasons.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Ed Sheeran apologises for crashing interview",
        "description": "Music sensation Ed Sheeran has taken the internet by storm after producing an awkward interview moment with a football coach.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "‘All we’ve ever wanted’: Matildas star on scheduling",
        "description": "The Matildas will play four games in 10 days to finish 2024 and while it’s too much for some, one star says it’s where every player wanted the women’s game to be.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Star’s cancellation begins after jury finding",
        "description": "Conor McGregor’s fall from grace has commenced in the wake of his civil trial in which he was found liable for assaulting a woman in 2018.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Champ’s chill celebration after Smith’s viral turn",
        "description": "There was no way Elvis Smylie’s PGA Championship win celebrations would go viral like a former champ because his victory was just the beginning.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "LIfe ban for NBL fan after ugly scenes",
        "description": "The NBL has sent a clear message to courtside fans after one spectator received a lifetime ban for an ugly altercation involving 36ers star Montrezl Harrell.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Huge news drops after Suaalii injury",
        "description": "After sending a massive scare through the Wallabies camp, their $5 million cross-code star has received positive injury news.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Haka drama erupts, divides New Zealand",
        "description": "All Blacks star TJ Perenara’s final haka for New Zealand has made waves after he weighed in on a hot-button issue.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Newcastle preview: Distance key to Vaguer victory",
        "description": "Co-trainer Rob Archibald is quietly confident two key elements can help imported gelding Vaguer bounce back to winning form at Newcastle.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    },
    {
        "title": "Australia bans Olympic medallist for life",
        "description": "Australian cycling has thrown the book at Olympic medallist Matthew Richardson, slamming the door shut after his shock defection.",
        "source": "News AU",
        "fetched_date": "2024-11-26T07:26:39.809819"
    }
]