[
    {
        "title": "Fed holds interest rates for fourth time despite tariff turmoil",
        "description": "The US central bank leaves its key interest rate unchanged at 4.3%, as its view of the economy darkens.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Devastating crash threatens Air India's ambitious turnaround",
        "description": "The tragedy happened as Air India was on the \"final climb phrase\" of its brand transformation after the Tata buyout.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Interest rates expected to be held at 4.25%",
        "description": "Analysts predict cuts to come later in the year, but say the Bank rate is likely to remain at 4.25% for now.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "OpenAI boss: Meta offering $100m plus to poach my staff",
        "description": "Sam Altman said so far none of his \"best people\" had jumped ship to his big tech rival.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Devastating crash threatens Air India's ambitious turnaround",
        "description": "The tragedy happened as Air India was on the \"final climb phrase\" of its brand transformation after the Tata buyout.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Texas Instruments pledges 'historic' $60bn US chip investment",
        "description": "The announcement comes as Trump pressures big technology firms to increase manufacturing in America.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Japan's Nippon seals controversial US Steel deal after Trump pact",
        "description": "Nippon agreed to give a \"golden share\" to the US government to win approval of the takeover.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Los Angeles Lakers to sell majority ownership in historic deal",
        "description": "The deal would mark the most expensive sale of a US sports team in history.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Can shoes be made in the US without cheap labour?",
        "description": "American production is possible, but it often needs to be automated to be cost effective.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Indian scientists search for the perfect apple",
        "description": "India can't grow enough apples to meet demand but farmers are struggling to raise production.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Markets muted amid Middle East conflict - 18 Jun 2025",
        "description": "Global investment expert says markets are in a 'wait and see mode' amid escalating tensions in the Middle East.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Why Ukraine is one of the world's most digital countries",
        "description": "Despite the war, Ukraine has developed of the most advanced systems for digital government services.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Trump to extend US TikTok ban deadline, White House says",
        "description": "The app was supposed to be banned in the US after its Chinese owner refused to sell it by a January deadline.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Amazon boss says AI will replace jobs at tech giant",
        "description": "Andy Jassy tells staff to embrace artificial intelligence (AI) as he warns the workforce will get smaller.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Chocolate price rises hit UK record as food costs grow",
        "description": "Food prices grew for a third month in May, as the overall rate of inflation remained at 3.4%.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "HS2 line to be delayed again with no new date given",
        "description": "Transport Secretary Heidi Alexander said the HS2 project was an \"appalling mess\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Musk's X sues New York state over social media hate speech law",
        "description": "The New York law requires social media companies to disclose how they monitor hate speech, extremism, and other contentious content.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which must still pass in the Senate, includes sweeping changes to the tax code, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Venice activists plan to disrupt Jeff Bezos's wedding",
        "description": "The Amazon founder and Lauren Sánchez are due to tie the knot next week - as activists say Venice is being turned into an \"asset\" for the rich and famous.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Trump signs order confirming parts of UK-US tariff deal",
        "description": "The pact between the US and UK means tariffs will be reduced on certain goods such as cars entering the US.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Experts question whether $499 gold Trump phone can be US-made",
        "description": "It is the latest plan by US President Donald Trump's family that looks to cash in on his name.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Starmer to announce new sanctions targeting Russia",
        "description": "No 10 says G7 allies back the measures - but Donald Trump indicates the US will not impose more sanctions now.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "UK watchdog fines 23andMe for 'profoundly damaging' data breach",
        "description": "The fine comes as the DNA testing firm, which filed for bankruptcy in March, is set to be sold to a new owner.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Mali begins building Russian-backed gold refinery",
        "description": "Mali will have a majority stake in the plant asserting its \"economic sovereignty\", the military leader says.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Social media now main source of news in US, research suggests",
        "description": "A report also finds right-leaning audiences on X have almost doubled in the UK since Elon Musk's takeover.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "British Steel secures £500m contract to supply UK train tracks",
        "description": "The company will forge more than 337,000 tonnes of track in a deal safeguarding its future for the next five years.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "MyPillow boss Mike Lindell loses $2.3m defamation case",
        "description": "The verdict comes after the election conspiracy theorist accused a voting equipment employee of treason.",
        "source": "BBC Business",
        "fetched_date": "2025-06-19T07:27:56.189588"
    },
    {
        "title": "Justin Baldoni Allowed to Seek Messages Between Blake Lively and Taylor Swift, Court Rules",
        "description": "The ruling comes after sparring over whether the communications are relevant to the case.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "BTS Is Back: K-pop Supergroup’s Anniversary Ushers in Long-Awaited Reunion",
        "description": "With six of seven members discharged from military service, and the last returning member expected in the coming days, the K-pop superstars are (finally) back.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "The Oscars Finally Fell in Love With Tom Cruise. It’s About Time",
        "description": "After decades of snubs, the Academy is at long last giving the world's biggest movie star a statuette. An honorary one — but still.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "Lou Christie, “Lightnin’ Strikes” and “Rhapsody in the Rain” Singer, Dies at 82",
        "description": "The Pittsburgh native, famed for his distinctive falsetto, also had hits with “The Gypsy Cried,” “Two Faces Have I,” “I’m Gonna Make You Mine” and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "Karen Read Found Not Guilty of Second-Degree Murder, Guilty of Drunken Driving",
        "description": "The case sparked a five-part Investigation Discovery true crime series.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "Ben Shapiro Meets With Pope Leo at Vatican, Gifts Him With Memento From Home",
        "description": "The popular conservative host had requested an audience with the pope and “was granted a spot quickly.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "Supreme Court Upholds Ban on Transgender Youth Care, Concerning Hollywood Activists",
        "description": "In a political climate in which stars are shying away from the spotlight on divisive issues, Elliot Page, Nicole Maines and Lilly Wachowski urged the justices to affirm \"live-saving\" healthcare for transgender youth.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "The Outrageous 20-Year-Old Movie That Predicted Trump’s America",
        "description": "In 2004 ‘A Day Without a Mexican’ was intended to be a political satire. In 2025 it seems all too real. Plus, Joel Grey auctions off his old lederhosen (and some nudes!) TikTok star Khaby Lame demands $1.2 million to talk, and Chet Hanks is a no-show at his book reading.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "“I Was Diddy’s Publicist. I Didn’t See a Monster — or Chose Not To”",
        "description": "The former PR guru for Sean Combs on what he saw, what he missed, and how his proximity to fame and power kept him looking away.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "Meet the Michael Moore of the MAGA-verse",
        "description": "Banished from Fox News with his boss Tucker Carlson, Justin Wells is back with a buzzy Trump documentary and a button-pushing new production company that wants to create “quality content for conservatives.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "BBC Names Kate Phillips Chief Content Officer, Succeeding Charlotte Moore",
        "description": "Phillips has worked at the BBC for over 12 years — most recently as director of unscripted, where she commissioned some of the channel's top shows, including 'Strictly Come Dancing' and 'The Traitors.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    },
    {
        "title": "Chappell Roan Admits She Does “Give a F***” About the Backlash She Receives",
        "description": "\"I don’t know if it will ever feel okay to hear someone say something really hateful about me,\" the Grammy winner admits.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-19T07:27:56.457017"
    }
]