[
    {
        "title": "Nominee for agriculture secretary completes Trump cabinet",
        "description": "Brooke Rollins - head of a pro-Trump right-wing think tank - is his pick for agriculture secretary.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Can RFK Jr make America's diet healthy again?",
        "description": "Kennedy's plans to ban dyes in cereals and fluoride in water could get major pushback from the food industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "UK wants to hire EU negotiator to 'reset' relations",
        "description": "The role will “prepare and lead negotiations with the EU on key UK interests”, the job posting said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Trump nominates Bessent to lead US Treasury in flurry of announcements",
        "description": "He also announces nominees for labour secretary, housing secretary and surgeon general.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Can RFK Jr make America's diet healthy again?",
        "description": "Kennedy's plans to ban dyes in cereals and fluoride in water could get major pushback from the food industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "UK perfume boss admitted he ignored Russia sanctions",
        "description": "David Crisp told undercover agent he had ignored \"government edicts\" to sell £1.7m of his luxury product.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "'I was scammed out of £75k by Martin Lewis deepfake advert'",
        "description": "Des Healey lost £76,000 in a scam using a deepfake of Martin Lewis and Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "'We had to break rules', says Jaguar as radical rebrand stirs debate",
        "description": "The iconic carmaker's rebrand has certainly caught people's attention, but will it pay off?",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Inside South Africa's 'ruthless' gang-controlled gold mines",
        "description": "Illegal miners live dangerously, but make roaring profits selling gold on the black market.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Is nuclear power gaining new energy?",
        "description": "Countries around the world are building new nuclear power stations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Investors 'wary of incoming administration' - 22 Nov 2024",
        "description": "As US shares lock in a week of gains, investors are keeping an eye out for the new administration's policies.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "How could the Apple tax windfall be spent in Ireland?",
        "description": "The EU’s highest court ruled that Apple had to pay more than €14bn to the Republic of Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Analysis: Will UK chancellor's difficult week cause her lasting damage?",
        "description": "BBC's Ben Wright looks at the impact of a tricky week of scrutiny for the chancellor.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Spain fines budget airlines including Ryanair €179m",
        "description": "The government says charging for hand luggage and printing boarding passes at the airport are \"abusive practices\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Satellite images show Russia giving N Korea oil, breaking sanctions",
        "description": "Satellite image analysis shows several North Korean tankers visiting Russia dozens of times since March.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "The mighty material that supercharges jet engines",
        "description": "Hi-tech coatings make all sorts of high performance engineering, like jet engines, possible.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Gary Gensler to leave role as SEC chairman",
        "description": "Donald Trump revealed plans to sack Mr Gensler on \"day one\" of his new administration.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Temu owner's shares slump as China slowdown hits sales",
        "description": "US-listed shares of the e-commerce giant fell nearly 11% on Thursday following the announcement.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "How Adani's US fraud charges impact India's economy and politics",
        "description": "The charges could jeopardise the ambitions of one of the world’s richest men, both at home and abroad.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Fraud probe launched into defence firm Thales",
        "description": "Thales UK, which has its headquarters in Berkshire, employs more than 7,000 staff across the country.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Trudeau plays Santa with seasonal tax break",
        "description": "The opposition calls Trudeau's tax measures \"a trick\" aimed at deflecting attention from rising costs.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Sell Chrome to end search monopoly, Google told",
        "description": "The tech giant is resisting fiercely, calling the proposal \"wildly overbroad\" and claiming it will hurt consumers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Thousands of PayPal customers report brief outage",
        "description": "The online payment company says a brief technical issue has now been resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "US charges Indian billionaire Gautam Adani with fraud",
        "description": "The Adani Group has denied the allegations of bribery and fraud, calling them \"baseless\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Bluesky chief doesn't know age limit for platform",
        "description": "Jay Graber wrongly said you needed to be 18 to use Bluesky, when the actual age limit is 13.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Archegos boss sentenced to prison over massive fraud",
        "description": "Hwang was found guilty of fraud in a case that cost Wall Street banks billions of dollars in losses.",
        "source": "BBC Business",
        "fetched_date": "2024-11-24T07:23:56.956226"
    },
    {
        "title": "Sean “Diddy” Combs Bail Decision Delayed as Rapper Seeks Home Confinement for Third Time",
        "description": "The beleaguered rapper-mogul will remain incarcerated for the weekend in Brooklyn as he awaits his trial on sex trafficking and racketeering charges, which is set for May.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Kendrick Lamar Releases Surprise Album ‘GNX’",
        "description": "The album comes after his successful chart run with the anthem \"Not Like Us\" and months before he headlines the Super Bowl halftime show, which he references on one song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Power Lawyers: THR’s Top Music Attorneys of 2024",
        "description": "Recording stars hungry for films, tours and huge catalog payoffs turn to these 16 chart-topping attorneys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "The 20 Best Music Schools in the World",
        "description": "From New York to Northridge, our annual list of the institutions preparing the next generation of composers across all media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Lando Norris Is “Just a Normal Guy” … Who Also Drives Really Cool Race Cars",
        "description": "The Hollywood Reporter's newest \"Person of Interest,\" the 25-year-old British driver for McLaren's Formula 1 team, is always finding joy in the exhilarating race-winning moments but also the quiet, everyday ones.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Patton Oswalt Comic ‘Minor Threats’ Launches Anthology Spinoff With Matt Fraction, Brian Michael Bendis (Exclusive)",
        "description": "Writers Gail Simone and Gerry Duggan and artists Michael Allred and Gene Ha are also among those working in the universe of the cult hit comic published by Dark Horse Entertainment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Jussie Smollett’s Conviction in Alleged Hoax Street Attack Overturned by Illinois Supreme Court",
        "description": "The former 'Empire' actor has been on a legal roller coaster after he claimed in 2019 that he was attacked in Chicago by two Black men who hurled homophobic slurs at him and yelled, “This is MAGA country.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Matt Gaetz Withdraws as Trump’s Pick for Attorney General",
        "description": "“While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,” Gaetz said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Muni Long Explains How She “Made” It",
        "description": "The singer opens up about her TikTok hit \"Made for Me,\" working with Mariah Carey and the perils of being a songwriter: \"Not getting credit, not getting paid, the producer running off with the money — it happened to me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "FCC Chair Jessica Rosenworcel to Step Down Next Year",
        "description": "Rosenworcel will be succeeded atop the Commission by Brendan Carr.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "BAFTA Breakthrough 2024: Mawaan Rizwan, Nava Mau Among 43 “Must-Watch” Young Creatives",
        "description": "The latest cohort of up-and-coming talent also includes an editor on BAFTA-winning 'Top Boy' and a costume designer on the Glen Powell-led Netflix movie 'Hit Man.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "Meet the New Trump Resistance: Europe’s Filmmakers",
        "description": "Progressive continental auteurs aren’t ready to give up on America just yet. But their governments are less inclined to pick a fight with the President-elect.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-24T07:23:57.394316"
    },
    {
        "title": "‘Hilarious’: Brundle’s ice cold celeb snub",
        "description": "Martin Brundle’s F1 grid walk never fails to deliver after the veteran broadcaster gave a celeb couple a brutal cold shoulder.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Kohli takes out security guard in wild scenes",
        "description": "As India heads towards victory in the first Test, Virat Kohli has taken out a security guard in a dangerous incident in Perth.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Red alert for Australia as wickets tumble and pitch comes to life",
        "description": "Australia is on a roll against India, but a pitch that looked docile all day is suddenly playing all sorts of tricks. FOLLOW OUR LIVE COVERAGE.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Aussie’s race ruined in nightmare scenes",
        "description": "Australian F1 driver Oscar Piastri has had his hopes of securing a win in Las Vegas dealt a devastating blow on the opening lap.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Ugly scene as Crows run out to hated song",
        "description": "The Adelaide Crows were stung even before the ball bounced in their AFLW preliminary final as an act of “s***housery” unfolded.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Giants star blows internet sensation away",
        "description": "One of the biggest YouTubers on the planet has gatecrashed GWS Giants training, challenging players to foot races which ended in wild scenes.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Joey Johns married in secret ceremony",
        "description": "NRL legend Andrew Johns and partner Kate Kendall’s big secret is out with the pair reportedly getting hitched overseas.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Gould performs sudden Ben Hunt backflip",
        "description": "Bulldogs football boss Phil Gould has aborted the club’s plot to snare Ben Hunt as the twists keep coming in the saga.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Kohli takes out security guard in wild scenes",
        "description": "As India heads towards victory in the first Test, Virat Kohli has taken out a security guard in a dangerous incident in Perth.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Red alert for Australia as wickets tumble and pitch comes to life",
        "description": "Australia is on a roll against India, but a pitch that looked docile all day is suddenly playing all sorts of tricks. FOLLOW OUR LIVE COVERAGE.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Tennis world stunned by Djokovic ‘bombshell’",
        "description": "The tennis world has been left stunned by Novak Djokovic’s shock announcement that he’s acquiring the services of one of his greatest rivals.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Lleyton Hewitt drops bomb on tennis world",
        "description": "Lleyton Hewitt has not held back as he dropped a bomb on the tennis world following Australia’s Davis Cup elimination.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Aussie champs broken up as star defects",
        "description": "Australia’s dominant SailGP team is being broken up, with two members of their championship three-peat leaving on the eve of the new season.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "‘Hilarious’: Brundle’s ice cold celeb snub",
        "description": "Martin Brundle’s F1 grid walk never fails to deliver after the veteran broadcaster gave a celeb couple a brutal cold shoulder.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Aussie’s F1 future decided amid ugly rumour",
        "description": "Aussie rookie Jack Doohan’s future has been decided after he was dragged into one of the most brutal rumours of the F1 silly season.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Ring girl reveals ‘big names’ in her DMs",
        "description": "Viral ring girl Sydney Thomas has revealed her new-found fame has seen her inbox become overran with big names hitting her up.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Surprising twist in violent pickleball scandal",
        "description": "The man who got kicked in the face in a moment of unthinkable violence has had a stunning response to his opponent’s behaviour.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "‘Not an NBA player’: Simmons torn to shreds",
        "description": "Aussie NBA star Ben Simmons has hit rock bottom after a disastrous moment saw him go viral for all the wrong reasons.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Giddey gets Aussie NBA bragging rights",
        "description": "Josh Giddey got the last laugh in his clash against Dyson Daniels, the man who has leapfrogged him in the Aussie NBA pecking order.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "‘Unbelievable’: Ange does the unthinkable",
        "description": "Ange Postecoglou has pulled off one of his biggest ever results as his Tottenham team set a record not seen in 69 years.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Ange stunner as Spurs smack City in record-breaking statement",
        "description": "Manchester City’s losing skid in all competitions has extended to five games after Ange Postecoglou’s Tottenham stunned the reigning champions 4-0 at Etihad Stadium.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Rogan: Exact moment McGregor self-destructed",
        "description": "UFC commentator Joe Rogan has pinpointed where it went wrong for Conor McGregor as the former champ’s downward spiral continues.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Smith upstaged by young Aussie at PGA",
        "description": "Cam Smith has fallen short in his bid to win a fourth Australian PGA Championship, with another Queenslander prevailing.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Giddey gets Aussie NBA bragging rights",
        "description": "Josh Giddey got the last laugh in his clash against Dyson Daniels, the man who has leapfrogged him in the Aussie NBA pecking order.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Wallabies make mass changes for crunch game",
        "description": "Joseph Suaalii has been named in the Wallabies’ starting line-up as one of several changes for Monday morning’s clash with Scotland.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "‘One that got away’ Wallabies stumbling block",
        "description": "The Wallabies are a man down in their quest to create a 40-year first with a former Junior Wallabies star now standing in their way.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Brown continues golden run with Cranbourne feature double",
        "description": "Ethan Brown completed a feature double after a brilliant ride on Globe, who scored his first win since his comeback from a heart scare in the Cranbourne Cup.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-24T07:23:59.136691"
    }
]