[
    {
        "title": "Facebook owner bans Russian state media networks",
        "description": "Russian state media outlets have come under increased scrutiny in Western countries.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Secret Service 'aware' of Elon Musk post about Harris, Biden",
        "description": "The tech tycoon has deleted the post about assassination attempts on the president and vice-president, saying it was a joke.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Boeing warns of job losses and cuts spending after strike",
        "description": "The strike at Boeing has sent the company scrambling to save cash.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Women in tech groups 'can’t run on inspiration alone'",
        "description": "Groups supporting women in science, technology, engineering and maths are struggling for funds.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "When and why could the US ban TikTok?",
        "description": "The video app TikTok could be banned in the US unless it is sold by its Chinese parent company ByteDance.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Secret Service 'aware' of Elon Musk post about Harris, Biden",
        "description": "The tech tycoon has deleted the post about assassination attempts on the president and vice-president, saying it was a joke.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Amazon tells staff to get back to office five days a week",
        "description": "The ecommerce giant is ending hybrid working and will stop people hotdesking in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "TikTok says US ban would have ‘staggering’ impact on free speech",
        "description": "The US government wants TikTok sold or divested because it says it is a threat to national security.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Rupert Murdoch's 'Succession' court battle begins",
        "description": "The court battle will determine the future of the billionaire's media empire.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Boeing warns of job losses and cuts spending after strike",
        "description": "The strike at Boeing has sent the company scrambling to save cash.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "How will the Irish government spend Apple’s €14bn?",
        "description": "Apple has been ordered to pay Ireland €14bn in unpaid taxes by Europe's top court.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "'I tried to say no repeatedly': More men accuse ex-Abercrombie boss over sex events",
        "description": "New witnesses tell the BBC fresh details about the sophisticated operation they say exploited them for sex.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Billionaire investor warns of threat to US democracy",
        "description": "Ray Dalio says he thinks the probability of civil war in the US is \"low but cannot be dismissed\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "New beanless 'coffee' emerges but does it taste any good?",
        "description": "Start-ups launch drinks that look and taste like coffee but they say are better for the environment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "New US shipping rules target China's Shein and Temu",
        "description": "Shein and Temu have been able to ship packages under $800 to the US without facing tariffs.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Germany to welcome Kenyans in labour deal",
        "description": "Germany agrees to ease some of its immigration laws to enable Kenyans find employment in the European's biggest economy.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Brexit deal impact in UK is worsening, warn economists",
        "description": "The findings come from a report covering the three-year period after the Brexit deal was signed.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "How much is the winter fuel payment and how can I still claim it?",
        "description": "Plans to change winter fuel payments have highlighted the problem of unclaimed pensioner benefits.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "'I got a £44,000 student loan - now I owe £54,000’",
        "description": "The new repayment rate for student loans started this month but for some graduates the debt pile keeps growing.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "780,000 eligible pensioners to lose out on fuel payment - DWP",
        "description": "Pensioners aged 80 and over would take the biggest financial hit, a government analysis found",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "'Our winter fuel payment goes into the holiday kitty'",
        "description": "Some pensioners say they don't need the extra cash of up to £300 - and want better means testing.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Dangers for FOMO mortgage hunters as rates fall",
        "description": "Competition between lenders is intense ahead of the next interest rates decision from the Bank of England.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Boeing workers strike as they reject 25% pay rise",
        "description": "More than 30,000 workers down tools after union members voted overwhelmingly to back the strike.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "Titanic shipyard may run out of cash within weeks",
        "description": "Trade unions are calling for help to save hundreds of jobs at the historic shipbuilder Harland and & Wolff.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "UK accounting giant PwC faces six-month China ban",
        "description": "The firm is being penalised for its role in the failure of property giant Evergrande.",
        "source": "BBC Business",
        "fetched_date": "2024-09-17T07:21:23.739813"
    },
    {
        "title": "How climate change is super-charging storms",
        "description": "The behaviour of the world's most powerful storms is evolving. To adapt to more destructive hurricanes, typhoons and tropical cyclones, we need to know how they're changing.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The fisher folk reviving Finland's 'moonscape'",
        "description": "Finland's Linnunsuo wetland used to be a barren \"moonscape\". A local fishing community has transformed it into a biodiverse haven and an important carbon sink.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The town that should have burned, but didn't",
        "description": "In 2017, one of California's largest ever wildfires was steadily approaching Montecito. But it had long been preparing for just such an event.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Mystery tremors were from massive nine-day tsunami",
        "description": "Scientists launched an investigation after being baffled by seismic signals picked up across the world",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "'I wouldn't wish it on my worst enemy': The people who work inside the eye of a hurricane",
        "description": "As climate change makes hurricane systems more dangerous, the need to understand their inner workings is greater than ever.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "UK farming's 'net zero' climate target in doubt",
        "description": "Doubts are raised over UK farming's ability to reach \"net zero\" greenhouse gas emissions by 2040.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-17T07:21:23.830549"
    },
    {
        "title": "Disgraced Ex-BBC Anchor Huw Edwards Handed 6-Month Suspended Prison Sentence Over Child Sex Abuse Images",
        "description": "Former BBC News presenter Huw Edwards has been handed a six-month prison sentence suspended for two years after pleading guilty to making indecent images of children. The 63-year-old said he was “profoundly sorry” for the “repugnant” images before he was sentenced Monday at London’s Westminster Magistrates’ Court in a case that has shocked the U.K. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Emmys: Shelley Duvall Omitted From In Memoriam Segment",
        "description": "The “In Memoriam” segment of the 75th Primetime Emmy Awards on Sunday paid tribute to a host of small-screen stars who have died in the past year, but users on social media were quick to point out the notable names that did not make the montage. The poignant segment saw rapper Jelly Roll say a […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Tito Jackson, Original Member of the Jackson 5, Dies at 70",
        "description": "Tito Jackson, the brother of Michael and Janet Jackson and a singer and guitarist who was part of the highly influential pop bands The Jackson 5 and later The Jacksons, has died. He was 70. Longtime Jackson family friend and manager Steve Manning told Entertainment Tonight that Tito Jackson died Sunday while driving from New […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Jon Stewart Calls for a “No Shooting” Policy Following Second Assassination Attempt on Trump",
        "description": "While being interviewed backstage at the 2024 Emmys in Los Angeles, Jon Stewart commented on the assassination attempt reportedly made on former President Donald Trump on Sunday, suggesting a “no shooting” policy be agreed upon by all.   In Florida on Sunday, a man with a rifle was spotted by Secret Service agents as Trump played […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Stars Wear Red Pin in Support of Israel-Hamas Ceasefire at 2024 Emmys",
        "description": "Several stars brought Israel-Hamas ceasefire advocacy to the 2024 Emmys on Sunday. Nicola Coughlan (Bridgerton), Dallas Goldtooth (Reservation Dogs), Devery Jacobs (Reservation Dogs), Brittani Nichols (Abbott Elementary writer) and Caroline Joyner were among those seen on the red carpet wearing a pin that featured a red background, orange hand and black heart. The pin symbolizes […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "‘Reservation Dogs’ Star D’Pharaoh Woon-A-Tai Brings Symbolic Message to Emmys With Red Hand Painted on Face",
        "description": "D’Pharaoh Woon-A-Tai took to the 2024 Emmys red carpet on Sunday with a powerful symbolic message. The Reservation Dogs star painted a red handprint over his mouth to stand in solidarity with missing and murdered Indigenous women. According to the organization Native Hope, it’s a symbol of the Missing and Murdered Indigenous Women (MMIW) movement and […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Trump’s Campaign Says He Is Safe After Apparent Assassination Attempt at His Florida Golf Club",
        "description": "Donald Trump’s campaign said the Republican presidential candidate was safe after gunshots were first reported in his vicinity Sunday afternoon in Florida, his campaign and the Secret Service said on Sunday. The U.S. Secret Service said it was investigating and that the incident occurred shortly before 2 p.m. “The former president is safe,” according to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Harris-Walz Campaign Responds to Trump’s “I Hate Taylor Swift” Comments With Singer’s Song Lyrics",
        "description": "The Harris-Walz campaign referenced 28 different Taylor Swift songs in a statement Sunday morning responding to Donald Trump’s “I Hate Taylor Swift” comments issued that same day. The statement, titled “Trump’s Bad Week (Taylor’s Version),” came in response to the former president’s Sunday morning Truth Social post, in which he wrote without context, “I HATE […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "How an Oscar Winner Made a Top-Secret Benjamin Netanyahu Movie Without Anyone Finding Out",
        "description": "From investigations into Wikileaks and Scientology, Elizabeth Holmes and the war in Afghanistan, Alex Gibney has made some of the defining documentaries of our time. So it makes sense he’d now turn his attention as a producer to one of the defining political figures of our time: long-serving Israel prime minister Benjamin Netanyahu. In The […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "John Legend Praises Taylor Swift for Being “Willing to Take That Risk” With Kamala Harris Endorsement",
        "description": "John Legend said he’s “always respected” Taylor Swift for being “willing to take that risk” in openly sharing her political views. The EGOT winner, who has been vocal about his support for Kamala Harris in the upcoming presidential election, recently told The Independent that he understands it’s more difficult for the pop superstar to speak out […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "‘Barbie’ Producer, ‘Supacell,’ ‘Wonka’ Among Production Guild of Great Britain Awards Winners",
        "description": "The Production Guild of Great Britain (PGGB) celebrated the likes of Warner Bros. film Wonka, Netflix series Supacell, and Barbie, Paddington and Harry Potter franchise producer David Heyman at its awards ceremony on Saturday night. Hosted by comedian, presenter and actor Patrick Kielty from Northern Ireland at The Grove Hotel in Watford, near London, Heyman […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Tommy Cash, Country Singer and Johnny Cash’s Brother, Dies at 84",
        "description": "Tommy Cash, a country singer and the younger brother of Johnny Cash, has died. He was 84. The news of Cash’s passing was confirmed on Saturday in a social media post by the Johnny Cash Museum in Nashville. “We are saddened to announce that the world lost a bright light last evening with the passing […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-17T07:21:24.115625"
    },
    {
        "title": "Flink, the quick commerce startup, raises another $150M at a valuation of just under $1B",
        "description": "Flink, the quick commerce startup out of Berlin that was an acquisition target first of Gorillas, then Getir, and then Amazon, and then Gopuff, today made a move that spells…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Amazon will host its Prime Big Deals Day sales event on October 8 and 9",
        "description": "Amazon said today that it will host its Prime Day-like sales event, “Prime Big Deals Day,” on October 8-9. For the last two years, the ecommerce company has scheduled its…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Bluesky now has more than 10M users",
        "description": "Social network Bluesky said Monday that it now has more than 10 million users. This is largely thanks to the rapid growth of the network in the past few weeks…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Slack is turning into an AI agent hub. Should it?",
        "description": "The head of Slack, Denise Dresser, tells TechCrunch she is shifting the business chat platform into a “work operating system,” specifically by making Slack a hub for AI applications from…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Intel moves to spin out foundry business, inks AI chip deal with AWS",
        "description": "Intel has announced a key customer win and changes to its foundry business as the beleaguered chipmaker looks to execute a turnaround. Intel is taking steps to transition its chip…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Tech’s emissions may be way higher than disclosed due to ‘creative accounting’ of carbon",
        "description": "Accounting for the emissions of a global tech empire is not a simple task, and what industry standards we do have for disclosure may allow tech companies to systematically understate…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "UK’s privacy watchdog takes credit for rise of ‘consent or pay’",
        "description": "The U.K.’s data protection watchdog claims a crackdown on websites that don’t ask for consent from visitors to track and profile their activity for ad targeting is bearing fruit. However…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Sam Altman departs OpenAI’s safety committee",
        "description": "OpenAI CEO Sam Altman is leaving the internal commission OpenAI created in May to oversee “critical” safety decisions related to the company’s projects and operations. In a blog post today,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "TechCrunch Space: The dawn of Polaris",
        "description": "A SpaceX Falcon 9 lifted off in the early hours last Tuesday morning carrying a private astronaut crew led by a billionaire entrepreneur.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Mammoth’s founder returns with new iOS app for Mastodon, Saturn",
        "description": "After founding and selling the popular Mastodon client Mammoth, developer Shihab Mehboob is returning to compete with it with the launch of his new app, Saturn. Not to be confused…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "New sensors co-developed by Google aim to detect wildfires everywhere much faster",
        "description": "The company is working with Muon Space, the Earth Fire Alliance, and others to launch FireSat.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Microsoft Copilot: Everything you need to know about Microsoft’s AI",
        "description": "In this post, we explain the many Microsoft Copilots available and what they do, and highlight the key differences between each.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Fisker Ocean owners stuck paying for recall repairs",
        "description": "As EV startup Fisker prepares to enter the fourth month of its Chapter 11 bankruptcy process, existing owners have received some bad news: they will have to pay labor costs…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Salesforce Ventures ups its AI fund to $1B, doubling it again",
        "description": "Salesforce Ventures just doubled its AI fund with another $500 million, and is helping San Francisco grow its attraction as the city for AI startups.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Amazon mandates full 5-day return to office",
        "description": "Amazon CEO Andy Jassy sent a memo to the company’s employees Monday morning, calling for a full return to office at the start of 2025. For the last 15 months,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Runway announces an API for its video-generating AI models",
        "description": "Runway, one of several AI startups developing video-generating tech, today announced an API to allow devs and organizations to build the company’s generative AI models into third-party platforms, apps, and…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Gogoro CEO resigns as subsidy fraud investigation continues",
        "description": "Gogoro, the Taiwanese electric scooter manufacturer and battery-swapping giant, said its CEO and chairman Horace Luke has stepped down amid subsidy fraud allegations, according to a regulatory filing. Gogoro allegedly…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "iOS 18 is out: Here’s what’s new",
        "description": "Apple’s newest software update, iOS 18, is rolling out today to all iPhone users. While AI technology was heavily hyped as a key part of this upgrade, Apple Intelligence features…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Apple’s iOS 18 is now available to download",
        "description": "On Monday Apple released the new version of iOS, the company’s operating system for the iPhone — iOS 18 is a free download, and it works with the iPhone XR…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Oracle’s Larry Ellison says that AI will someday track your every move",
        "description": "Speaking at an Oracle financial analysts meeting, Oracle founder Larry Ellison said he expects AI to one day power massive law enforcement surveillance networks. “We’re going to have supervision,” he…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-17T07:21:24.355848"
    },
    {
        "title": "Wallabies keen to silence ‘external noise’",
        "description": "The soul searching continues for the Wallabies ahead of their Bledisloe Cup clash against New Zealand on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Wrong message’: Premiership winner’s dire Dusty warning",
        "description": "A premiership winning former AFL coach fears Gold Coast’s interest in Dustin Martin could backfire for the club with its current players.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Finals miracle as Roosters name injured star",
        "description": "The Roosters have dropped a finals bombshell with one of their injured stars named on the extended bench for their do-or-die NRL semi-final against Manly.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Hynes’ frank admission after finals failure",
        "description": "With calls for him to be dropped despite being Cronulla’s $1m man Nicho Hynes opted off social media to prepare himself for a second chance against the Cowboys.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Wrong message’: Premiership winner’s dire Dusty warning",
        "description": "A premiership winning former AFL coach fears Gold Coast’s interest in Dustin Martin could backfire for the club with its current players.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "AFL Grand Final 2024: Every key question answered",
        "description": "The AFL Grand Final is drawing closer for another season. We answer all the key questions you need to know to be ready for this year’s decider.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Finals miracle as Roosters name injured star",
        "description": "The Roosters have dropped a finals bombshell with one of their injured stars named on the extended bench for their do-or-die NRL semi-final against Manly.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Hynes’ frank admission after finals failure",
        "description": "With calls for him to be dropped despite being Cronulla’s $1m man Nicho Hynes opted off social media to prepare himself for a second chance against the Cowboys.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Lehmann’s next big career move",
        "description": "Darren Lehmann has undertaken a new venture after leaving his coaching roles with the Queensland Bulls and Brisbane Heat.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Hits different’: World Cup debut excites star",
        "description": "An Australian young gun has weighed in on her team’s tilt for a World Cup four-peat as a trans-Tasman series offers early clues.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "New top Aussie out to ‘do damage’",
        "description": "Team captain Sam Stosur has made two big selection calls as Australia prepares for the Billie Jean King Cup finals in Spain.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "New high for Aussie rising star",
        "description": "The first Australian to make a WTA 500 singles final since Ash Barty fell just short of victory but will walk away from Mexico with a special new title.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Swirling Ricciardo rumour is worst one yet",
        "description": "Daniel Ricciardo is at the centre of the Formula 1 rumour mill again with the Australian reportedly set to be told some crushing news.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Japanese giant linked to Supercars entry",
        "description": "A major Japanese car brand could be set to join the Supercars paddock for the 2026 season with an announcement expected to be made this week.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Actor ‘killing’ himself over transformation",
        "description": "A hulking Hollywood actor has spoken out about the lengths he’s been going to in order to keep his new toned down look going.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Actor breaks silence on body transformation",
        "description": "A WWE legend turned Hollywood star has opened up on his transformation that left fans seriously concerned for his health.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Taylor Swift stuns at latest NFL game",
        "description": "Taylor Swift made another stunning entrance and showed off her support for boyfriend Travis Kelce at his latest NFL game.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Alleged double-killer breaks down in court",
        "description": "The man charged over the deaths of ice hockey star Johnny Gaudreau and his brother has burst into tears as a judge handed down a decision.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Matildas call on familiar name as new coach",
        "description": "As a global search continues for the next full-time coach of the Matildas, Football Australia has turned to a familiar face to take charge for the immediate future.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Key pair closing in on Socceroos recall",
        "description": "Socceroos coach Graham Arnold is likely to have more selection options for next month’s games against China and Japan.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Champion stunned in one-sided UFC bout",
        "description": "“Suga” Sean O’Malley has suffered a devastating loss to Georgian Merab Dvalishvili in a one-sided contest at the Sphere in Las Vegas.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Identify as female’: Golf controversy erupts",
        "description": "Three members of an elite Australian golf club have been suspended over a sexism row related to membership fees.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Top scorer, biggest smokie: Inside word from SuperCoach NBL experts",
        "description": "Our SuperCoach NBL experts answer the burning questions heading into the season start – from the season’s top scorers, to biggest smokies, to the players to avoid.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Wallabies keen to silence ‘external noise’",
        "description": "The soul searching continues for the Wallabies ahead of their Bledisloe Cup clash against New Zealand on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "Injured Wallabies skipper targeting November return",
        "description": "Having tried to rush back from a shoulder injury without success, one-time Wallabies captain Liam Wright is now taking a steady approach to his recovery.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Devastating news’: Triple Group 1 winner Riff Rocket euthanised",
        "description": "Three-time Group 1 winner Riff Rocket has been euthanised following complications from colic surgery.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-17T07:21:26.002698"
    }
]