[
    {
        "title": "Turmoil and trade wars dominate China's 'summer Davos'",
        "description": "The conflict between Iran and Israel adds further uncertainty to an already strained global outlook.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "This burger was made in a lab from cow cells… Should it be served in UK restaurants?",
        "description": "Lab-grown beef, chicken and even quail are served in restaurants in several countries around the world - and soon some cultivated meats could be sold in the UK too.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "'Best place to have herpes': New Zealand advert wins top prize",
        "description": "The charity was awarded a Cannes Lions award for its campaign to destigmatise the infection.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Google may be forced to link to rival search platforms in the UK",
        "description": "The Competition and Markets Authority says it wants to open up the UK search market.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "This burger was made in a lab from cow cells… Should it be served in UK restaurants?",
        "description": "Lab-grown beef, chicken and even quail are served in restaurants in several countries around the world - and soon some cultivated meats could be sold in the UK too.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Oil prices tumble after Israel agrees to Iran ceasefire",
        "description": "Crude has dropped by more than 5% with prices now below the level when Israel first launched its attack.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "US safety regulators contact Tesla over erratic robotaxis",
        "description": "Videos posted online appear to show the newly launched self-driving cars speeding and driving in the wrong lane.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Israel-Iran conflict disrupts Middle East flights",
        "description": "Airlines scramble to cancel and reroute flights after Doha and Dubai airports shut briefly.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Russia's economy is down but not out",
        "description": "The country's economy has been surprisingly resilient but there are underlying problems.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "How China made electric vehicles mainstream",
        "description": "The world's second largest economy is both the biggest producer and buyer of EVs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Markets muted amid Middle East conflict - 18 Jun 2025",
        "description": "Global investment expert says markets are in a 'wait and see mode' amid escalating tensions in the Middle East.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Supercell boss: 'We need to take bigger risks'",
        "description": "The boss of mobile gaming giant Supercell says the industry needs to take bigger risks to compete.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "How the attacks on Iran could affect oil prices and energy bills",
        "description": "Conflict in the Middle East often leads to higher energy prices, which can feed through to inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "US asks China to stop Iran from closing Strait of Hormuz",
        "description": "Iran's Press TV had earlier reported that parliament had approved a plan to close the Strait.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "What is the Strait of Hormuz and why does it matter?",
        "description": "Iran's threat to block the world's most vital oil transit point has raised fears of major global economic consequences.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Tesla robotaxi 'low-key' launch in Texas",
        "description": "Tesla hopes to rival firms already offering driverless ride-hailing in the US and around the world, such as Waymo, Zoox and Baidu.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Cheaper energy part of 10-year plan for industry",
        "description": "Plans to cut energy bills by up to 25% for more than 7,000 UK businesses is announced alongside other plans to boost growth.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "FedEx founder and former boss Fred Smith dies aged 80",
        "description": "The Vietnam War veteran started the firm in 1973 with 14 planes before it became a global brand.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Hundreds of Voice of America reporters fired as Trump guts outlet",
        "description": "The majority of VOA - some 85% of its workforce - has been laid off since Trump ordered it dismantled.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Cars, cash and a tycoon stirring debate in Zimbabwe",
        "description": "Some are beguiled by the Zimbabwean tycoon's generosity, others alarmed about the source of his wealth.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Analysis: Russian government clearly nervous as country faces economic challenges",
        "description": "Russian minister Maxim Reshetnikov has warned that the country's economy was teetering \"on the brink of recession\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Telegram boss to leave fortune to over 100 children he has fathered",
        "description": "The technology tycoon said his children would not have access to their inheritance for 30 years.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Shorts at work: Can men now get their legs out in the office?",
        "description": "Whether shorts are ever appropriate for the office remains a contentious topic, so what should you do?",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "'Not just smut': Why it's happily ever after for romance books",
        "description": "Despite being mocked by book critics for years, the romantasy genre is booming - and that means big business for publishers and bookshops.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "BBC threatens AI firm with legal action over unauthorised content use",
        "description": "It is first time that the BBC has taken such action regarding alleged scraping of its content for AI.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Adorable or just weird? How Labubu dolls conquered the world",
        "description": "The dolls have almost tripled their maker's profits - and according to some, energised Chinese soft power.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Trump confirms further delay to TikTok ban or sale deadline",
        "description": "It's the third time the date has been moved back by Trump since he took office in January.",
        "source": "BBC Business",
        "fetched_date": "2025-06-25T07:28:55.320770"
    },
    {
        "title": "Pedro Pascal Looks Back on Calling J.K. Rowling a “Heinous Loser” for Anti-Trans Comments: “Bullies Make Me F***ing Sick”",
        "description": "“The one thing that I would say I agonized over a little bit was just, ‘Am I helping?’” the actor said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Brandy and Monica Announce First-Ever Co-Headlining Tour",
        "description": "The duo will embark on The Boy Is Mine Tour starting in October, with Kelly Rowland, Muni Long and Jamal Roberts tapped as supporting acts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Diego Luna Slams Trump’s Immigration Policies, Says Immigrants “Are the Ones Who Build This Country”",
        "description": "\"The multiple times that this country has had to rebuild itself, immigrants were always there to pick up the slack,\" the Mexican actor-director said on 'Jimmy Kimmel Live!.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Baby DONT Cry, First Girl Group Hailing From K-pop Icon Psy’s Label, Steps Into the Spotlight (Exclusive)",
        "description": "The four-member group, produced and creatively directed by Idle leader Soyeon, speak with THR in their first international interview about their trainee days, debuting and learning from Psy and Soyeon.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Mick Ralphs, Founding Guitarist of Bad Company and Mott The Hoople, Dies at 81",
        "description": "Ralphs wrote hits including \"Can't Get Enough\" and \"Good Lovin' Gone Bad.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "145 People Say They Were Stabbed With Syringes at French Music Festival",
        "description": "Twelve people were arrested for the alleged incidents, the French Interior Ministry told several outlets, including CNN.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Actors Steven Weber, Lori Petty, Cynda Williams, Mitchell Anderson Join Lineup for Pride LIVE! Hollywood Festival",
        "description": "The inaugural pop culture festival continues through June 29 at venues across Hollywood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Cardi B Finally Announces New Album ‘Am I the Drama?’",
        "description": "Cardi's long anticipated follow-up to 2018's 'Invasion of Privacy' will release on Sept. 19.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "The Hollywood Reporter Nabs 10 SoCal Journalism Awards",
        "description": "The entertainment news outlet took home two wins for best magazine feature, one for best entertainment commentary and a first-ever nod in the best headline category.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "The Eternal Power of the Grateful Dead’s Wall of Sound Explored in New Book",
        "description": "Brian Anderson’s ‘Loud and Clear’ captures the strenuous work, psychedelic vision and lasting influence of the band’s most audacious sound-system experiment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Inside Opening Night of the New Kids on the Block Residency: “Vegas Was Ready for Us”",
        "description": "\"If you're playing in Vegas, you're playing for the world, so it's to show not just our fans, but also the rest of the world, who we are and what we do — and also surprise our fans,\" Donnie Wahlberg told The Hollywood Reporter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    },
    {
        "title": "Maroon 5 Set to Return With New Album, Arena Tour",
        "description": "The pop band will release 'Love is Like,' their first album in over four years, on Aug. 15.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-25T07:28:56.195644"
    }
]