[
    {
        "title": "US tariffs on India will be a bitter pill to swallow",
        "description": "Nearly half of all medicines consumed in the US come from India. Tariffs will make them expensive.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Keep kids off Roblox if you're worried, its CEO tells parents",
        "description": "The gaming platform is wildly popular, but has been rocked by allegations it exposes children to harmful content.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Trade war escalates as Trump pledges more tariffs",
        "description": "Trump repeated trade threats after the European Union and Canada retaliated to US steel and aluminium tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Carney ready to talk trade with Trump if 'there's respect for sovereignty'",
        "description": "Prime minister-designate's comments follow Canada's reciprocal tariffs on US imports after Trump slapped taxes on steel and aluminium.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Keep kids off Roblox if you're worried, its CEO tells parents",
        "description": "The gaming platform is wildly popular, but has been rocked by allegations it exposes children to harmful content.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Man Utd co-owner's firm recalls SUVs over risk of doors flying open",
        "description": "Sir Jim Ratcliffe's Ineos Automotive will replace the door latch mechanisms in more than 7,000 SUVs.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "US tech firms feel pinch from China tariffs",
        "description": "The price of China-made smartphones, TVs and laptops could rise in the US and elsewhere, experts warn.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "US tariffs could deepen Germany's recession, says bank",
        "description": "Germany's central bank president says US tariffs and retaliation to them could tip Europe's largest economy into recession again.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Is the US really heading into a recession?",
        "description": "Stock market falls, tariffs and other changes are reigniting fear of economic downturn in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "How will the latest Trump tariffs affect the UK?",
        "description": "How much will the UK be hit by US tariffs and what happens next?",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "EU braces for higher prices as US trade war ramps up",
        "description": "For consumers, higher prices loom on supermarket shelves, but for businesses and industry the risks are higher.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Ireland 'ready to work' with US to bring peace, says Martin",
        "description": "Taoiseach Micheál Martin has presented US President Donald Trump with a bowl of shamrocks in the White House as part of St Patrick's Day celebrations.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Trump says anti-Tesla protesters will face 'hell'",
        "description": "The US president says protesters against Elon Musk's electric car firm should be labelled \"domestic terrorists\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Saudi Investment Fund pays $3.5bn to capture Pokémon Go",
        "description": "It is amongst the highest-grossing mobile games in the world, with 30 million monthly players.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Starmer says 'all options on table' on US tariffs",
        "description": "Canada and the EU have announced retaliatory tariffs but UK will take a \"pragmatic\" approach, the prime minister said.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "US education department plans to cut half its workforce",
        "description": "The mass layoffs will impact nearly 2,100 people who are set to be placed on leave from 21 March.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Spotify paid out a record £7.7bn in royalties in 2024",
        "description": "The figures come as debate continues about how much money artists and songwriters receive in royalties.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Three American goods that could rise in price due to metal tariffs",
        "description": "Donald Trump's plans for tariffs risk raising prices for items from cars to canned food.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Is Trump mulling a minerals deal with conflict-hit DR Congo?",
        "description": "Endowed with minerals but losing ground to rebels, the Congolese government wants to boost security.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Trump halts plan for 50% steel and aluminium tariffs on Canada",
        "description": "It comes after the Canadian province of Ontario said it would suspend a 25% surcharge on US-bound electricity.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Trump is no longer swayed by the stock markets",
        "description": "The assumption that the US president would row back on policies if shares fell no longer holds true.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Global smartwatch sales fall for first time",
        "description": "Market researchers say the slumping popularity of the market-leading Apple Watch was to blame",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Google Chromecast users' fury at second day of TV streaming issue",
        "description": "Google says it is aware of an issue impacting some Chromecast devices and is working to fix.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Why people are cutting back their online profile",
        "description": "A new wave of AI has spurred some to think more carefully about their online presence.",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "European stocks steady after US markets plunge",
        "description": "The global sell-off eases in Europe after US shares are hit by President Trump saying the economy is in \"transition\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-13T07:23:57.030578"
    },
    {
        "title": "Pro-Independence, Anti-Trump Party Wins Greenland Elections",
        "description": "Greenland's center-right Demokraatit Party won the most votes in a surprise victory, but the Naleraq party, which is more open to negotiations with the U.S. president, also saw a surge in support.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Expect a Long Trial for Harvey Weinstein’s Next Court Battle",
        "description": "The trial is scheduled to start in April and prosecutors said they expected testimony to take about a month, with a planned 25 witnesses.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Erik and Lyle Menendez to Appear Before Parole Board in June",
        "description": "As legal avenues for the incarcerated brothers have gotten thinner, Gov. Gavin Newsom sets a date for an investigation into their eligibility for parole.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Half of Spotify’s Royalties Are Going to Indie Artists",
        "description": "The company confirmed in a new report that it paid $5 billion to the independent music sector in 2024.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Concord In Talks With Digital Music Platform Stem for Possible Acquisition",
        "description": "Negotiations are ongoing for what may turn out to be a partial sale.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Rosie O’Donnell Has Moved to Ireland After Trump Election: “It Has Been Heartbreaking”",
        "description": "“When you know it is safe for all citizens to have equal rights there in America, that’s when we will consider coming back,” the Emmy-winning star said on a TikTok video about a possible return.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Wendy Williams Explains Removal From Assisted Living Facility for Hospital Evaluation, Insists She’s “Not Incapacitated”",
        "description": "The former daytime host, who was diagnosed with dementia in 2023 and is battling her court-appointed guardianship, called in to 'The Breakfast Club' on Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "How to Watch ‘Tom Petty: Heartbreakers Beach Party’ Online",
        "description": "Over 40 years after being pulled from MTV for being \"too experimental,\" Cameron Crowe has released an extended version of his documentary with new 16mm film footage of the late musician.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "With ‘Deli Boys,’ Jenni Konner Is Hoping to Strike a Chord",
        "description": "The 'Girls' and 'Single Drunk Female' executive producer talks about launching her fresh, inclusive new Hulu comedy during a tumultuous time: \"This is the first noisy show I've been on since 'Girls.' People are talking about it.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Billy Joel Postpones Tour Dates Due to Medical Condition: “My Health Must Come First”",
        "description": "Joel rescheduled eight concerts, with his tour pushed back four months.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "DOJ Attorney Claims She Was Fired for Refusing to Approve Mel Gibson’s Gun Rights",
        "description": "Gibson, a high-profile supporter of Donald Trump and one of his \"special ambassadors\" to Hollywood, lost his right to purchase or own a handgun after a 2011 domestic violence misdemeanor conviction.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "Wheesung, Veteran Korean Singer, Dies at 43",
        "description": "The k-pop star, who suffered a precipitous decline in his career after being caught illegally using anesthetics in 2021, was discovered unresponsive in his Seoul apartment Monday evening.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-13T07:23:57.804922"
    },
    {
        "title": "F1 star reveals incredible family sacrifice",
        "description": "Liam Lawson has opened up about the incredible sacrifice his family made so he could become a Formula 1 driver.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "F1 fan’s wild Aussie Grand Prix request",
        "description": "With crowds becoming increasingly hectic at the Aussie F1 Grand Prix, a local fan has used Airtasker to make a unique request.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Reds on ‘same page’ despite form slump",
        "description": "‘Healthy disagreements’ are ‘fine’ with Adelaide United coach Carl Veart, who is intent on finding a solution to the Reds’ form woes.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "How emerging Lion has improved",
        "description": "Having worked hard on his fitness and strength in the off-season, Brisbane Lions forward Logan Morris is intent on building on a memorable debut AFL campaign.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Surprise supporter of NRL crackdown",
        "description": "Trent Robinson has received the odd fine for questioning referees in the past, and he’s now weighed in on an NRL’s directive.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Ripped star reveals sweet treat he ditched",
        "description": "South Sydney Rabbitohs star Keaon Koloamatangi has revealed the one change he made over summer which helped transform his body.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "How emerging Lion has improved",
        "description": "Having worked hard on his fitness and strength in the off-season, Brisbane Lions forward Logan Morris is intent on building on a memorable debut AFL campaign.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Collingwood star involved in car crash",
        "description": "A Collingwood premiership player and All-Australian has been involved in a scary morning crash with another vehicle.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Warner’s shock career move made official",
        "description": "Nearly two years after clashing with members at Lord’s in unforgettable scenes, David Warner is headed back to the iconic venue to play.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Bold call for must-win Shield clash",
        "description": "Victoria has elevated an uncontracted quick, who recently hit speeds as high as 145km/h, to its squad for the final round of the Sheffield Shield season.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Star’s Wimbledon attire sparks backlash",
        "description": "One of tennis’ biggest stars has left members of the prestigious All England Club fuming after blatantly breaking a longstanding rule.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Kyrgios’ cryptic message ignites rumour mill",
        "description": "Nick Kyrgios’ tennis career has been up in the air since retiring hurt at Indian Wells on Friday and he has now seemingly made up his mind.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Storm legend goes rogue, exposes Bellamy",
        "description": "Melbourne Storm players have revealed the nightmare door knock they received from “crazy lunatic” coach Craig Bellamy.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "F1 fan’s wild Aussie Grand Prix request",
        "description": "With crowds becoming increasingly hectic at the Aussie F1 Grand Prix, a local fan has used Airtasker to make a unique request.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "‘Abuse’ slammed as F1 showdown turns ugly",
        "description": "Aussie Jack Doohan is under huge pressure before the F1 season has even begun, and the showdown with the man tipped to replace him has turned nasty.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Squad named: The Waratahs U18s out to impress in battle of rugby’s rising stars",
        "description": "They have had the mail over their Queensland rivals for years but now the Waratahs U18s have enlisted some usually help to keep their winning run intact this weekend – women. SQUAD named",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Reds star to miss battle with NSW",
        "description": "Queensland co-captain Liam Wright has again been sidelined ahead of the Reds’ weekend battle with the Waratahs.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Australia’s highest paid athletes revealed",
        "description": "Some of Australia’s brighest young stars are set for some truly eyewatering paydays as the sporting rich list gets a whole new look.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Reds on ‘same page’ despite form slump",
        "description": "‘Healthy disagreements’ are ‘fine’ with Adelaide United coach Carl Veart, who is intent on finding a solution to the Reds’ form woes.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "EPL club owner buys slice of Aussie team",
        "description": "Melbourne Victory is the latest A-League club to be funded by the owner of an English Premier League outfit.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Aussie superfight agreed, $1m detail emerges",
        "description": "A fight between former footy players and Sonny Bill Williams appears to be on the cards this year, with a contract put to both superstars.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "What Tiger told Aussie after breakthrough win",
        "description": "Tiger Woods picked Karl Vilips as the first player to wear his clothing brand and left a stirring message when the Aussie rookie won his first PGA Tour title.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Star guard issue raises questions",
        "description": "Losing on home court was bad enough for Melbourne United but now a star guard with a history of concussions is under a cloud for game three.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Kembla, Muswellbrook previews: Classic path for Portelli’s Oaks Rose",
        "description": "Gary Portelli will be one step closer to realising his long term plans of securing classically-bred filly Verona Rose an Oaks start is she is successful in the Kembla Grange Classic.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Chalmers having baby with Norwegian swimmer",
        "description": "Aussie swim star Kyle Chalmers has announced some exciting news in a picture alongside his fiancee Ingeborg Løyning.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    },
    {
        "title": "Woman’s X-rated photo act caught on TV",
        "description": "Two unsuspecting women have been caught out on live TV with video of a private photo pose spreading across cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-03-13T07:24:00.276756"
    }
]