[
    {
        "title": "Samsung boss cleared of fraud by South Korea's top court",
        "description": "The ruling comes after Lee Jae-yong was acquitted of all charges in two earlier trials.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Why Jane Street, a US trading giant, is in trouble in India",
        "description": "The firm has been banned from India's securities market for alleged manipulation\nthat led to small investors trading at unfavourable prices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Is buying with friends the answer to a tough UK housing market?",
        "description": "Two couples unable to afford London prices bought a home together. Add two babies, and how is it going?",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Largest Mars rock ever found on Earth sells for $4.3m at auction",
        "description": "The meteorite was discovered in Niger in November 2023 and is 70% larger than the next biggest piece of Mars recovered on Earth.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Why Jane Street, a US trading giant, is in trouble in India",
        "description": "The firm has been banned from India's securities market for alleged manipulation\nthat led to small investors trading at unfavourable prices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Trump discussed firing Fed boss but 'highly unlikely' he will",
        "description": "The US president admitted he broached sacking Jerome Powell, in what would be an unprecedented move.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Canada curbs steel imports to shield domestic industry from Trump tariffs",
        "description": "PM Mark Carney has pledged to diversify the country's trading partners away from the US and prioritise the use of Canadian steel.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "'It's just better!': Trump says Coca-Cola to change key US ingredient",
        "description": "Coca-Cola said they \"appreciate President Trump's enthusiasm\", without confirming they plan to make the tweak.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "The deepening water shortage row between the US and Mexico",
        "description": "The US is accusing its southern neighbour of breaking a long-held water sharing agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Markets 'betting' tariffs resolve by fall - 11 Jul 2025",
        "description": "Expert says markets are betting that Trump will not want to cause a recession before the US midterms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Heat pump makers are ready for a rush: Will customers come?",
        "description": "Heat pump makers are ready to raise output, but demand is still sluggish.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "German defence tech firm to make drones in UK",
        "description": "STARK, which makes weapon systems for NATO, says its new facility in Swindon will support 100 jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Could axing two national holidays save France from its mountain of debt?",
        "description": "Prime Minister François Bayrou has angered MPs with a bid to cut two public holidays to rescue the country's finances.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Does the UK video games industry have a class problem?",
        "description": "A non-profit organisation is trying to create more pathways into the sector for working-class people.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Canada's PM wants to fast-track 'nation building' - but can he?",
        "description": "Indigenous communities have launched a legal challenge against a federal law that would fast-track resource development projects.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "US and Indonesia reach tariff deal",
        "description": "The US will lower its tariffs threatened on goods from Indonesia to 19% from a planned 32%.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Boss of Guinness-owner Diageo suddenly steps down",
        "description": "Diageo boss Debra Crew steps down after board decision for her to go.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Trump launches probe into Brazil's 'unfair' trade practices",
        "description": "Last week, the US president urged Brazilian authorities to end their prosecution of the country's former President Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Barclays fined millions over financial crime risk lapses",
        "description": "The UK's financial watchdog says the bank had failed to properly check two of its clients.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "UK inflation at highest for almost a year and a half",
        "description": "Food and clothing prices rose more quickly while fuel fell only slightly, boosting the overall rate of inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Analysis: UK inflation complicates next month's interest rate decision",
        "description": "Higher inflation could give the Bank of England pause for thought over cutting interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Labubu firm sees profit soaring by at least 350%",
        "description": "Sales, branding and tight cost controls have helped Pop Mart's profits balloon in the first half of 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Carney says US-Canada trade deal likely to include some tariffs",
        "description": "The two countries are aiming for a 1 August deal even after Trump announced a new 35% tariff on imports from Canada last week.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "US inflation rises as tariffs drive up prices",
        "description": "Energy and housing costs were the major drivers of inflation, but consumers are starting to feel the impact of tariffs on basic goods.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "French PM looks to scrap two public holidays in bold bid to cut national debt",
        "description": "MPs will vote on François Bayrou's budget plan in the autumn, in a moment of high risk for the government.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Trump imposes 17% tariff on Mexican tomatoes",
        "description": "It comes after US tomato growers accused their Mexican counterparts of dumping their produce.",
        "source": "BBC Business",
        "fetched_date": "2025-07-17T07:30:48.793194"
    },
    {
        "title": "Tomorrowland Main Stage “Severely Damaged” After Catching Fire, Festival Set to Continue",
        "description": "The Belgium-based electronic music event is slated to kick off its first weekend on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Jane’s Addiction Members File $10 Million Lawsuit Against Perry Farrell Over 2024 Stage Altercation",
        "description": "\"History will remember the band as suffering a swift and painful death at the hands of Farrell’s unprovoked anger and complete lack of self-control,\" the suit said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Official Tina Turner Wig Recalled Amid Fan Backlash: “Is That Little Orphan Annie?”",
        "description": "Made of human hair and priced at $1,000, it features blond, curly locks that fans say are way off the mark.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "DC’s Next Big Publishing Event Revealed as Superhero Slugfest ‘DC K.O’ (Exclusive)",
        "description": "Scott Snyder and Joshua Williamson are co-architecting the publishing initiative that will launch this fall.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Jeff Buckley Wants To Be Remembered for “Just The Music” in Late Singer’s ‘It’s Never Over’ Doc Trailer",
        "description": "The film, directed by Amy Berg, will hit theaters Aug. 8.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Morgan Wallen, Kendrick Lamar Top Midyear Album, Song Sales",
        "description": "Wallen's 'I'm The Problem\" was the most-streamed album in the U.S. through the first half of the year, Luminate said, while Lamar's \"Luther\" with SZA is the biggest song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "For Songwriters to Earn a Living Wage, Spotify Must Step In",
        "description": "The same old rules that helped build Spotify's empire are the ones still starving songwriters. But now Spotify can do something about it.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "‘American Idol’ Family Mourns Death of Show’s Music Supervisor, Robin Kaye",
        "description": "Finalists from multiple seasons remember the beloved production staffer found murdered in her home on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Former Avex USA CEO Naoki Osada Launches Global Venture Nebula17",
        "description": "The Los Angeles-based company aims to bring Japanese artists into the global spotlight.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Beyoncé and Jay-Z to Compete Against Each Other for an Emmy This Year",
        "description": "The husband and wife superstars were both nominees in the outstanding variety special (live) category, while other high profile artists getting nominations Tuesday included Kendrick Lamar and Questlove.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Iggy Pop on Closing Out ‘Superman’ Soundtrack: Hero is “the Best Friend You Could Have”",
        "description": "\"Punkrocker,\" Iggy Pop's collaboration with Teddybears, underscores the blockbuster's emotional final scene — and has seen streaming gains as a result.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    },
    {
        "title": "Camila Cabello Signs With Full Stop, Management Home For Harry Styles, John Mayer, Tate McRae",
        "description": "The switch-up comes months after the pop star left her longtime manager Roger Gold earlier this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-17T07:30:49.518022"
    }
]