[
    {
        "title": "Indian tycoon Ratan Tata dies aged 86",
        "description": "His death was announced by the Tata Group, the multi-billion-dollar conglomerate he led for more than two decades.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "UK firm GSK to pay $2.2bn over Zantac cancer claims",
        "description": "The UK-based firm has reached agreements with law firms representing about 80,000, or 93%, of claimants.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "UK government to outline major overhaul of workers' rights",
        "description": "A major overhaul of workers' rights is planned, but the changes will not take place for two years.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Google threatened with being broken up by US",
        "description": "The US Government considers whether Google should spin off the Android operating system and Chrome browser.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Man denies being mysterious inventor of Bitcoin",
        "description": "Attempting to identify the inventor, known only as Satoshi Nakamoto, has captivated the internet.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "UK firm GSK to pay $2.2bn over Zantac cancer claims",
        "description": "The UK-based firm has reached agreements with law firms representing about 80,000, or 93%, of claimants.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Spain looks to immigrants to drive economy",
        "description": "Spain has seen a big rise in illegal immigration, but some say that the extra workers are needed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Tesla to unveil Cybercab, its big bet on self-driving cars",
        "description": "Elon Musk will unveil a prototype for the long awaited robotaxi at a film studio in Hollywood.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Reeves 'must find billions more' in time for UK Budget",
        "description": "Rachel Reeves needs another £16bn to meet pledges, says influential think tank the Institute for Fiscal Studies.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "UK government to outline major overhaul of workers' rights",
        "description": "A major overhaul of workers' rights is planned, but the changes will not take place for two years.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Renewable energy is growing due to low prices - 9 Oct 2024",
        "description": "IEA head says world is adding as much renewable energy by 2030 as current capacity of China, India, EU and US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Supreme Court signals openness to Biden's 'ghost gun' crackdown",
        "description": "The Biden administration has tried to crack down on the untraceable guns, linked to criminal activity.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "'We're barely scraping by': Gen Z says money matters in US election",
        "description": "The rising costs of groceries and rent are driving many young voters to the polls.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Pilot dies flying Turkish Airlines plane from US to Turkey",
        "description": "The captain collapsed during his flight from Seattle and the plane made an emergency landing in New York.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "7-Eleven shares jump as rival makes new buyout offer",
        "description": "Alimentation Couche-Tard reportedly offered to pay over $47bn for the Japanese-owned retail giant.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Boeing withdraws 30% pay rise offer to striking staff",
        "description": "The aviation giant accused the union of not giving its proposals serious consideration.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Obituary: Ratan Tata, the 'modest' Indian tycoon",
        "description": "The businessman led a conglomerate of more than 100 companies, employing some 660,000 people.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Women say they were ordered off flight for crop tops",
        "description": "The TikTok user, whose videos of the incident have gone viral, claims she and her friend were discriminated against.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Amount UK's richest pay in income tax revealed",
        "description": "There is some concern tax rises in the Budget could prompt an exit of the super-rich, hurting UK finances.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Dead postmistress' plea to end compensation delay",
        "description": "Bosses did not appreciate the effects of the Horizon scandal on the business in 2019, chief executive Nick Read has conceded.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Budget plan to spend billions more won’t stop tax rises",
        "description": "Reeves is planning to change borrowing rules to free up billions more in spending for big projects in the upcoming Budget.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Firms promised millions from UK's new gigafactory",
        "description": "An open day has been held for companies wanting to supply a huge electric car battery factory, being built in Somerset.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Brazil lifts ban on Musk's X after it pays $5m fine",
        "description": "The country's Supreme Court made the order after the platform also blocked certain accounts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "HS2 may now run to central London, minister says",
        "description": "The Transport Secretary says it would make \"no sense\" to have the line terminate in west London.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "China hits back at EU with brandy tax",
        "description": "The tax on brandy imports is being seen by critics as a retaliatory move for recent EU tariffs on Chinese-made electric cars.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Wait a few more minutes for an electric Uber, says boss",
        "description": "The platform wants customers to go 'green' as it tries to boost the take-up of electric cars.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "China stock rally fizzles as stimulus news disappoints",
        "description": "Shares fell back after a news conference by economic planners gave little in the way of details.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "TGI Fridays: 1,000 UK jobs to go despite rescue deal",
        "description": "The deal to save the chain will see more than 30 of its restaurants close.",
        "source": "BBC Business",
        "fetched_date": "2024-10-10T07:22:58.876528"
    },
    {
        "title": "Ethel Kennedy Hospitalized Following Stroke, Daughter Shares: “She Is Surrounded by Family”",
        "description": "Ethel Kennedy, the oldest living member of the Kennedy family, turned 96 in April.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Al B. Sure! Accepts Award at First Major Appearance Following Call for Probe Into Kim Porter’s Death",
        "description": "The de facto head of the new jack swing movement has been quiet since he dropped a four-part Instagram post that linked the death of his ex with the Sean \"Diddy\" Combs scandal-saga.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Omar Harfouch’s ‘Concerto for Peace’ Launches in Paris, Bridging Divides Through Music",
        "description": "An inside look at the global musical initiative aimed at promoting unity.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Sega Movie ‘Shinobi’ in the Works From Universal, ‘Extraction’ Director Sam Hargrave",
        "description": "The game dates back to 1987, with the ninja series launching 14 installments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Kamala Harris Wins Howard Stern’s Vote, Calls Out Donald Trump’s Lack of Empathy in Live Interviews",
        "description": "The VP visited Stern's SiriusXM show and 'The View' on Tuesday, and will later be interviewed by Stephen Colbert.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Nell Smith, Flaming Lips Collaborator, Dies at 17",
        "description": "\"We are reminded once again of the power of music and how encouraging it can be to be around people that you love,\" said The Flaming Lips' frontman Wayne Coyne.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Sydney Sweeney, Scarlett Johansson Among Top 10 Celebrities Used for Online Scams",
        "description": "McAfee's 2024 U.S. Celebrity Hacker Hotlist runs down the actors whose identities are the most often exploited by cybercriminals for online scams.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Jon Stewart Slams “Dark MAGA” Elon Musk’s Dangerous Trump Rally Comments: “Guns Don’t Protect Our Free Speech”",
        "description": "'The Daily Show' host excoriated the errant Tesla billionaire for his speech at Donald Trump's rally in Butler, Pennsylvania.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Sally Field Shares “Horrific” Story of Illegal Abortion as Reason to Support Kamala Harris: “We Can’t Go Back”",
        "description": "The two-time Oscar winner recalled having a family friend take her to Tijuana for the procedure when she found herself pregnant at the age of 17 roughly 60 years ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Cissy Houston, Whitney Houston’s Mother and Grammy-winning Singer, Dies at 91",
        "description": "The two-time Grammy winner was in the well-known vocal group, the Sweet Inspirations, with Doris Troy and her niece Dee Dee Warrick.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Luke Bryan Clarifies Comments About Beyoncé’s CMA Awards Snub, Says “Tone and Intentions” Were “Not Negative”",
        "description": "Bryan addressed the \"false narrative\" of him sharing his thoughts on Beyoncé's lack of CMA Awards nominations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "Binge-Worthy True Crime: Wondery’s Most Thrilling Podcasts for October",
        "description": "The listeners are screaming their praises for the company’s award-winning true crime podcasts",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-10T07:22:59.194595"
    },
    {
        "title": "‘Loyal person’: Tigers star defies mass exodus",
        "description": "With several of his star teammates heading for the exit door a Richmond big man has done the opposite and signed a mammoth new contract.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Teen star joins legend with staggering 30-year first",
        "description": "It took some early luck, but a teenage opener has matched a feat achieved by one of the legends of Australian cricket.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Supercars legend picks who will win Bathurst",
        "description": "The Bathurst 1000 is upon us and six-time winner Mark Skaife has given his predictions for which driver will win the Great Race.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "A-League Women stars call for ‘relaunch’",
        "description": "As a longtime teammate announced her retirement, a Melbourne Victory star has called for an “extremely important” change.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘Loyal person’: Tigers star defies mass exodus",
        "description": "With several of his star teammates heading for the exit door a Richmond big man has done the opposite and signed a mammoth new contract.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘Didn’t happen’: Bulldog clear on trade calls",
        "description": "After being linked to a trade in the middle of the season, a Western Bulldogs gun has cleared up what really happened.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Eels skipper given his marching orders",
        "description": "The Eels have given their captain and star fullback permission to meet with other clubs following a meeting with their new coach.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Fowler’s perfect response to Panthers quip",
        "description": "Mary Fowler has responded in the perfect fashion following comments from the Panthers about bringing her back to Australia.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Teen star joins legend with staggering 30-year first",
        "description": "It took some early luck, but a teenage opener has matched a feat achieved by one of the legends of Australian cricket.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Smith issue emerges, team rocked by rumour",
        "description": "With the final verdict on Cameron Green’s injury set to impact Test selection, a former opener is adamant where Steve Smith should bat.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Major Kyrgios news in Aussie Open statement",
        "description": "While Nick Kyrgios has been busy commentating and promoting his new beer, he’s also been getting ready for a comeback to the tennis court.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘Very frustrating’: Demon’s injury cloud lingers",
        "description": "Slow progress recovering from a hip injury is threatening to derail Alex de Minaur’s aspirations ahead of the Australian Open next year.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘It’s a joke’: F1 fans’ fury over Aussie event",
        "description": "Formula 1 fans hoping to get their hands on tickets to the 2025 Australian Grand Prix have been left disappointed and angry after a change to the ticket purchasing process.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Neurosurgeon dashes Schumacher hopes",
        "description": "A sad update on Michael Schumacher’s condition has dropped just days after wedding rumours that gave the world hope.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Football star’s love triangle takes ugly turn",
        "description": "An English football star’s relationships have exploded with text messages from his wife towards his mistress being revealed.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Star breaks silence after fleeing country",
        "description": "A former tennis star has spoken out as rumours continue to swirl over why she fled to America after announcing her shock retirement.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘Coach Killer’: Aaron Rodgers’ desperate Week 6 bid",
        "description": "With Robert Saleh out in NY, is Aaron Rodgers a ‘coach killer’, plus a huge week of divisional games ahead in a massive Week 6 preview.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Coach sacked, security called in wild scene",
        "description": "An NFL coach has been marched out by security in extraordinary scenes with details of the cruel termination leaking out.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "A-League Women stars call for ‘relaunch’",
        "description": "As a longtime teammate announced her retirement, a Melbourne Victory star has called for an “extremely important” change.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Fowler’s perfect response to Panthers quip",
        "description": "Mary Fowler has responded in the perfect fashion following comments from the Panthers about bringing her back to Australia.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Hurricane chaos to trigger late Tszyu change",
        "description": "Tim Tszyu’s fight team have joined the millions of Americans paying close attention to the impending devastation of Hurricane Milton.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Aussie LIV guns heading for home reunion",
        "description": "After a Mad Monday for Cameron Smith’s LIV team toasting their $20m success in the US, a reunion is set for Australia.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "SuperCoach NBL experts reveal revised trades for round 4",
        "description": "An injury to Taran Armstrong has forced a rethink of this week’s trades. Who are our experts getting instead? See all their moves here.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘Exposed’: Axed team’s fight for $30m",
        "description": "After being shuttered by Rugby Australia and dumped from Super Rugby, the Melbourne Rebels have taken this action.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "‘Gutted’: Aussie legend brutally sacked",
        "description": "Wallabies legend Matt Burke has been handed a brutal blow after making a successful career after his playing days.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Zahra facing tough task in Caulfield Guineas",
        "description": "Jockey Mark Zahra will need to be at his brilliant best if he is to win a second Caulfield Guineas on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-10T07:23:01.300648"
    }
]