[
    {
        "title": "US says tech giant Tencent works with Chinese military",
        "description": "The Chinese embassy in Washington called the decision \"unreasonable suppression of Chinese companies\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Nvidia boss unveils next-generation gaming chips",
        "description": "The announcement was part of Mr Huang's address at CES, an annual technology show in Las Vegas.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Apple says it will update AI feature after BBC complaint",
        "description": "One of Apple's new artificial intelligence features is facing criticism for generating inaccurate news alerts.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Nippon and US Steel sue government over blocked deal",
        "description": "The companies allege President Biden \"ignored the rule of law to gain favor\" with trade unions.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Nvidia boss unveils next-generation gaming chips",
        "description": "The announcement was part of Mr Huang's address at CES, an annual technology show in Las Vegas.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "UFC boss to join board of Facebook owner Meta",
        "description": "It comes days after former UK deputy PM Sir Nick Clegg left his top job at the social media giant.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Managers 'touch up' staff: McDonald's faces fresh abuse claims",
        "description": "Workers at the fast-food chain tell the BBC they still face sexual abuse despite pledges to improve safeguarding.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Bank regulator resigns before Trump term citing 'risk of dispute'",
        "description": "Michael Barr had been a target of Republicans for his call for stricter oversight of banks.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "China's overqualified youth taking jobs as drivers, labourers and film extras",
        "description": "With high youth unemployment rates, Chinese graduates are resorting to working as waiters, cleaners and movie extras.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Why does Britain face flight chaos during bad weather?",
        "description": "Delays and cancellations related to British weather may become more common.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Report says Trump plans less aggressive tariffs - 6 Jan 2025",
        "description": "President-elect Donald Trump has called reports that he could adopt pared-back tariffs as 'fake news'.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Trump's eyeing Greenland - but other Arctic investment is frozen",
        "description": "While Trump eyes Greenland, Norway and Russia have put the brakes on their polar region investments.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Musk says Farage 'doesn't have what it takes' to be Reform UK leader",
        "description": "Nigel Farage claims Musk's call is due to a disagreement over support for far-right activist Tommy Robinson.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Motorbike-sized tuna sold to Tokyo sushi restaurateurs for $1.3m",
        "description": "The huge bluefin, which was auctioned in Tokyo, will be served at restaurants across Japan.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Firms to raise prices due to tax and wage increases",
        "description": "Consumers could face higher costs in the coming months amid falling confidence among UK businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "New York first US city to have congestion charge",
        "description": "The scheme has faced resistance, including from President-elect Donald Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Washington Post cartoonist quits after Bezos satire is rejected",
        "description": "The newspaper decided not to run Ann Telnaes' cartoon of tycoons kneeling before Donald Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Tanzania's fuel revolution slowed down by lack of filling stations",
        "description": "The authorities want vehicles to switch to gas but the transition has been hampered by a lack of filling stations.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Biden blocks Japan's Nippon Steel from buying US Steel",
        "description": "An executive order says the deal could have posed a risk to US national security.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "What are cold weather payments and who can get them?",
        "description": "Cold weather payments are available to some people after seven days of below-zero temperatures.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "How to keep warm when budgets are squeezed",
        "description": "A cold snap across the UK comes just as energy prices have risen, so here are a few tips to help you keep warm.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Apple to pay $95m to settle Siri 'listening' lawsuit",
        "description": "The tech giant denies wrongdoing after being accused of eavesdropping on customers.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Musk 'misinformed' on grooming gangs, says UK minister",
        "description": "The Conservatives have also criticised the billionaire for \"sharing things that are factually inaccurate\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Fire devastates one of Africa's largest clothes markets",
        "description": "Ghana's Kantamanto market has been devastated by fire with traders urging the government to help.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Apple AI alert falsely claimed Luke Littler had already won darts final",
        "description": "An AI-generated notification says the teen has won the tournament before the final is even played.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Nick Clegg leaves Meta ahead of Trump's return as US president",
        "description": "He will be replaced by Republican Joel Kaplan, a former White House deputy chief of staff under President Bush.",
        "source": "BBC Business",
        "fetched_date": "2025-01-07T07:23:44.527692"
    },
    {
        "title": "Carol Burnett Shouts “I Love You” to Ted Danson as He Receives Golden Globes Award in Her Honor",
        "description": "Viola Davis was also presented with the Cecil B. DeMille Award by Meryl Streep at the inaugural Golden Gala on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Biden to Award Medal of Freedom to Denzel Washington, Michael J. Fox, Anna Wintour and Bono",
        "description": "Hillary Clinton, Ralph Lauren, Magic Johnson, Bill Nye and José Andrés will also be awarded the nation's highest civilian honor Saturday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Nicki Minaj Sued for Assault by Former Tour Employee",
        "description": "Brandon Garrett claims the rapper physically attacked him during an altercation in her dressing room following a concert in Detroit last year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Judge Sets Trump’s Sentencing in Hush Money Case But Signals No Jail Time",
        "description": "The sentencing will take place on Jan. 10.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "The Norwegian Journalist Caught in the Crossfire of the Blake Lively-Justin Baldoni Battle Takes on Her Critics",
        "description": "A New York Times story, now the source of a $250 million defamation lawsuit, insinuated that Kjersti Flaa collaborated with Baldoni's PR team to smear Lively. Flaa says she's the one being smeared.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Lucky No. 5: Larry Ellison’s New Mystery Bride Unveiled",
        "description": "Plus: How the gross-out film became high art, and the continued struggles of video game voice actors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Neil Young Retracts Glastonbury Boycott, Will Now Play Fest Following “Error in Information Received”",
        "description": "The rock star will now perform at the U.K. music festival after saying Tuesday he wouldn't be playing because Glastonbury was under the BBC's \"corporate control.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Selena’s Killer Files for Parole 30 Years After Tejano Singer’s Death",
        "description": "In 1995, Yolanda Saldívar gunned down the singer after it was discovered she'd been embezzling money from her boutiques.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Wayne Osmond, Original Member of the Singing Osmonds, Dies at 73",
        "description": "He started out in Utah as a youngster in a family barbershop quartet, and he and his siblings would become regulars on ‘The Andy Williams Show’ and score a big hit with \"One Bad Apple.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Jeremy Renner Reflects on Second Anniversary of Snowplow Accident: “My Gratitude List Is Very Long”",
        "description": "“Ringing in my second 'ReBirthday' today. I send out my love, respect and gratitude for the army of people that it took to put me back together again,\" the actor wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Katy Perry, Shakira and Ed Sheeran are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Billie Eilish’s ‘Birds of a Feather’ Is Spotify’s Most Streamed Song of 2024",
        "description": "The breezy pop song is nominated for three Grammys including record and song of the year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-07T07:23:44.734043"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Tennis world says same thing about Hewitts",
        "description": "Aussie legend Lleyton Hewitt had a front-row seat at the Australian Open as 16-year-old son Cruz made an eye-catching debut.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Tomic rinsed in Open qualifying crash",
        "description": "Bernard Tomic’s hopes of returning to the Australian Open main draw have been swiftly dashed once again.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Mentor goes scorched earth on Konstas act",
        "description": "One of Australia’s leading coaches has ripped into India’s treatment of Sam Konstas as he prepares for his BBL return.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Mentor goes scorched earth on Konstas act",
        "description": "One of Australia’s leading coaches has ripped into India’s treatment of Sam Konstas as he prepares for his BBL return.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "‘Disgraceful’: Mentor rips Konstas treatment",
        "description": "One of Australia’s leading coaches has ripped into India’s treatment of Sam Konstas as the young gun prepares to make his BBL return for the Thunder.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Tennis world says same thing about Hewitts",
        "description": "Aussie legend Lleyton Hewitt had a front-row seat at the Australian Open as 16-year-old son Cruz made an eye-catching debut.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Tomic rinsed in Open qualifying crash",
        "description": "Bernard Tomic’s hopes of returning to the Australian Open main draw have been swiftly dashed once again.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "AFL star’s alleged gross public act",
        "description": "A young West Coast Eagles star has been charged by WA Police after being caught allegedly committing a gross act in public.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "AFL player charged with public urination",
        "description": "A 20-year-old elite sportsman will face court for allegedly urinating in public and not giving police his name.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Four NRL stars you may have forgotten about",
        "description": "There are plenty of NRL stars who are counting down the days for the new season to begin as they prepare to return from serious injuries that ruined their 2024 campaign.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Cleary’s three-word post to terrify NRL",
        "description": "Nathan Cleary’s latest loved up snaps with Mary Fowler came with a message that should terrify the Panthers star’s NRL rivals.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Olympic sprint star goes postal in wild act",
        "description": "US Olympic sprinter Fred Kerley was tasered and later hit with a number of charges after a wild incident caught on video.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "10-minute blitz: Adelaide super subs bury Macarthur Bulls",
        "description": "Two young Adelaide substitutes changed the shape of the clash against Macarthur in a remarkable 10-minute spell where Adelaide recovered to beat the Bulls in a drama-filled round 12. All the latest here.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Messi snubs Biden in embarrassing scene",
        "description": "Football legend Lionel Messi has left Joe Biden red faced with the US President’s star-studded ceremony turning suddenly awkward.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Opetaia warns rival for ‘world of hurt’ in pursuit of greatness",
        "description": "Jai Opetaia has warned his dangerous rival David Nyika to brace for a world of hurt and declared there will be no complacency in his relentless quest for boxing “greatness”.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Aussie’s record beaten amid Scott feat",
        "description": "As one Aussie’s PGA Tour scoring record was beaten amid a birdie blitz in Hawaii, a star veteran showed no signs of slowing down.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Warwick Farm preview: Pride’s gelding to Storm back to winners’ circle",
        "description": "Ideal barrier draws for his capable quartet has trainer Joe Pride well placed for a big day on his home track.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Reds star aiming for stellar Super season",
        "description": "Queensland Reds star Tom Lynagh knows his best chance of regaining a Wallabies jersey is to shine for the Queensland Reds this year.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "David Pocock reveals major life update",
        "description": "It’s the first glimpse fans have been given of the Pocock family’s newest member since their pregnancy announcement earlier this year.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-07T07:23:46.133441"
    }
]