[
    {
        "title": "Boeing boss in last-ditch plea as strike vote looms",
        "description": "New chief executive tells staff that a strike would put the embattled firm's \"recovery in jeopardy\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "US inflation falls to lowest in over three years",
        "description": "Consumer prices in the US rose 2.5% over the 12 months to August, the slowest pace since February 2021.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Iconic firm Campbell Soup set to drop soup from name",
        "description": "Executives at the 155-year old firm plan to change its name to reflect its growing line of products.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "UK chancellor warns hard decisions ahead in Budget",
        "description": "Rachel Reeves says tough choices will have to be made over tax, spending and welfare.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Passengers stranded after strike at main Kenya airport",
        "description": "A protest against plans to lease JKIA - Kenya's main airport - to an Indian company sparks disruption.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "US inflation falls to lowest in over three years",
        "description": "Consumer prices in the US rose 2.5% over the 12 months to August, the slowest pace since February 2021.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Firm wins trademark case against easyJet owner",
        "description": "The airline's owner says he will appeal against the ruling, which found there was no infringement",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Rightmove rejects £5.6bn offer from Murdoch's firm",
        "description": "The property listing website said the offer from its Australian rival was 'wholly opportunistic'.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Chelsea ownership rift exposed and explained",
        "description": "BBC Sport explores the split between Chelsea's co-owners, Todd Boehly and Clearlake Capital, led by Behdad Eghbali.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Iconic firm Campbell Soup set to drop soup from name",
        "description": "Executives at the 155-year old firm plan to change its name to reflect its growing line of products.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Sony reveals much more expensive and powerful PlayStation 5 Pro",
        "description": "UK gamers will have to shell out £699.99 when the upgraded console launches on 7 November.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "UK sells peaches from Fukushima nuclear disaster region",
        "description": "Harrods' sale of the fruit is part of efforts to restore trust after the 2011 radiation leak.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Apple told to pay Ireland €13bn in tax by EU",
        "description": "The European Court of Justice upheld a 2016 decision that said Apple received unlawful aid from Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "EU court rules Google must pay €2.4bn fine",
        "description": "Google loses its appeal against the fine, handed down for its shopping comparison service.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "GB News owner buys Spectator magazine for £100m",
        "description": "The right-leaning political magazine has been sold to the hedge fund tycoon Sir Paul Marshall.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Billionaire takes off for first ever private spacewalk",
        "description": "The mission is the first of three funded by payments processing business founder Jared Isaacman.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "John Lewis says recovery on track as losses narrow",
        "description": "Sales at its department stores fell in what it calls a \"challenging market\", but revenues at Waitrose grew.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Bank and chemist closures leave High Streets with holes",
        "description": "Chemists, pubs and banks made up half of High Street closures in the first six months of 2024, data suggests.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "How quickly are prices rising in the UK?",
        "description": "The rate at which prices are rising has nudged back above the Bank of England's target of 2%.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "How much is the winter fuel payment and how can I still claim it?",
        "description": "Plans to change winter fuel payments have highlighted the problem of unclaimed pensioner benefits.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "UK state pension set to rise by £460 next year",
        "description": "The latest figure comes as the government faces a backlash over cutting winter fuel payments for most pensioners.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "'Grim' September ahead with 6,000 steel and oil jobs to go in UK",
        "description": "The BBC understands the government is bracing itself for a tough month as workers face losing their jobs",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "New oil and gas ban threatens jobs, unions warn",
        "description": "Unite and the GMB say fossil fuels should not be abandoned until workers know how their jobs will be protected.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "More bus services could come under control of councils",
        "description": "Transport Secretary Louise Haigh promises to deliver a \"bus revolution\" that will save vital routes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Asos shoppers hit out at new £3.95 returns charge",
        "description": "The company said it was introducing a charge for customers with a \"frequently high return rate\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-12T07:22:07.750825"
    },
    {
        "title": "Louisiana streets flooded as Hurricane Francine hits Gulf Coast",
        "description": "The Category 2 storm is producing \"life-threatening\" flooding, according to the National Hurricane Service.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The town that should have burned, but didn't",
        "description": "In 2017, one of California's largest ever wildfires was steadily approaching Montecito. But it had long been preparing for just such an event.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Sea ice melt impacts birds' feeding trips - study",
        "description": "Albatrosses and petrels are being forced to fly further to find food, a study claims.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-12T07:22:07.837017"
    },
    {
        "title": "Camila Cabello Gives Angsty “June Gloom” Performance at the 2024 MTV Music Video Awards",
        "description": "Camila Cabello performed “June Gloom” off her new LP C,XOXO at the 2024 MTV Video Music Awards, airing live from the UBS Arena on Long Island. The pop star’s performance started with a video clip featuring her blonde look from this album cycle, playing from a laptop. The camera then zoomed out to show a […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "LL Cool J Brings Energy to VMAs Stage With Medley of His Classic Hits and New Songs",
        "description": "LL Cool J hit the MTV VMAs stage on Wednesday night with a medley of his classic hits and new tunes to celebrate the 40th anniversary of Def Jam Records. The rapper — whose performance featured an appearance by Public Enemy’s Flavor Flav and Chuck D, who are two of LL’s original Def Jam labelmates […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Taylor Swift Wins Video of the Year at 2024 MTV VMAs, Breaking Multiple Records",
        "description": "Taylor Swift took home the most coveted award of the night at the MTV Video Music Awards on Wednesday, breaking several records with the win. The superstar won video of the year for her song “Fortnight,” featuring Post Malone. Swift won seven VMAs this year, bringing her all-time total to 30, tying her with Beyoncé for most […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Eminem Calls Back to Platinum-Blond Slim Shady Era With “Houdini” VMAs Performance",
        "description": "Eminem’s latest album may be called The Death of Slim Shady, but for his first TV performances from the album, the rapper brought back his platinum-haired alter ego, along with a horde of look-alikes. In an opening reminiscent of his 2000 VMAs performance of “Real Slim Shady” and “The Way I Am,” in which Eminem […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Katy Perry Urges Young Artists to “Stay True to Yourself” After She Performs Medley of Greatest Hits, Accepts Video Vanguard Honor",
        "description": "Katy Perry was honored with the Michael Jackson Video Vanguard Award at the 2024 MTV Video Music Awards. Before introducing Perry to the stage for her video vanguard performance, Orlando Bloom shared a kind message about his longtime partner’s accomplishments. “You fell in love with her as Katy Perry; I fell in love with her […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Halsey Rocks Out in a Garage for Performance of “Ego” at 2024 MTV VMAs",
        "description": "Halsey returned to the MTV Video Music Awards stage Wednesday night with a performance of her new song “Ego.” After riding up to a house on the stage on a bicycle, the singer pulled up a garage door to reveal her band waiting inside. Halsey quickly grabbed her guitar and proceeded to rock out in the garage, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "MTV VMAs: Winners List",
        "description": "Taylor Swift topped the 2024 MTV Video Music Awards, winning seven awards, including video of the year for “Fortnight” featuring Post Malone. Sabrina Carpenter took home the Moon Person for song of the year, and Chappell Roan was named best new artist the 2024 show. SZA, Eminem, Lenny Kravitz, Blackpink’s Lisa and Tyla were among […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "‘SNL’ Actor Chloe Troast Says Season 50 Exit “Was Not My Choice”",
        "description": "Chloe Troast’s exit from Saturday Night Live was “not my choice,” the comedian told fans on social media Wednesday. “Hey everyone! I wanted to let you know that I will not be on SNL next season,” she wrote on TikTok. “This was not my choice, I wish I was there getting to be with my friends. It […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Chappell Roan Offers Fierce Performance of “Good Luck, Babe” at 2024 MTV VMAs",
        "description": "Chappell Roan took to the MTV Video Music Awards stage Wednesday night to perform her hit song “Good Luck, Babe.” After being introduced by Sasha Colby as “your favorite drag queen’s favorite artist,” the singer appeared in a medieval armor-inspired costume as a castle erupted in flames behind her. Throughout the fierce performance, Roan didn’t hold back […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Robbie Williams Asks If We’re All Watching the Oasis Reunion Hoping for a Crash (Exclusive Video)",
        "description": "Let’s talk about the monkey in the room.  Like, literally. “Better Man,” Paramount’s new Robbie Williams biopic that premiered at TIFF 2024 this week, had a surprise in store for filmgoers: Williams is portrayed by… a monkey. Not a metaphoric monkey. Not an occasional dream-sequence monkey. An actual CG monkey. For the entire movie. For […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Blackpink’s Lisa Is a Red-Hot “Rockstar” in Fiery Solo VMA Debut",
        "description": "Blackpink’s Lisa can add an electric 2024 MTV VMAs performance and a best K-Pop VMA to her ever-growing list of accolades this year. The 27-year-old Thai singer and rapper, whose real name is Lalisa Manobal, took to the stage early in the night for her first solo performance at MTV’s Video Music Awards. Decked out […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Sabrina Carpenter Gives Out of This World Performance at 2024 MTV VMAs",
        "description": "Sabrina Carpenter gave a performance at the MTV Video Music Awards that was quite literally out of this world Wednesday night. After being introduced by legendary singer Cyndi Lauper, Carpenter performed some of her biggest hits from this summer, including “Please Please Please,” “Taste” and “Espresso.” Sporting a silver, sparkly outfit, the artist kicked off her […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-12T07:22:08.090558"
    },
    {
        "title": "Drama at OpenWeb, as a new CEO is announced – and the founding CEO says he’s staying",
        "description": "OpenWeb, a New York startup whose tools help publishers engage users, has a unique problem. Its co-founding CEO reportedly won’t leave, even though it announced a new CEO. According to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Adam Neumann’s crypto comeback company is reportedly refunding investors",
        "description": "In a development that will surprise few, former WeWork CEO Adam Neumann’s climate/crypto/carbon-credit startup Flowcarbon appears to be in the process of curling up to die, Forbes reported today. Buyers…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Amazon starts testing ads in its Rufus chatbot",
        "description": "Rufus, Amazon’s recently launched, shopping-focused chatbot, is getting ads soon. That’s according to a changelog published by Amazon this week (first spotted by AdWeek), which states that sponsored ads could…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "LineLeap lets users pay to skip the line at bars",
        "description": "No one likes standing in line. I was reminded of just how awful the experience can be last Saturday, while being herded like cattle through a two-hour queue for a…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "A comprehensive list of 2024 tech layoffs",
        "description": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "OpenAI reportedly in talks to raise at $150B valuation",
        "description": "OpenAI is reportedly in talks with investors to raise $6.5 billion at a $150 billion pre-money valuation, according to Bloomberg. The new valuation is significantly higher than OpenAI’s previously reported…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "AI illusions and navigating ‘The Money Trap’ with Alok Sama",
        "description": "On today’s episode of Equity, Rebecca Bellan sat down with Alok Sama, a Morgan Stanley veteran and former president and CFO of SoftBank Group International.…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "These sub-1mm robots morph and crawl with an electric zap",
        "description": "Along with biological organisms, the robots were inspired kirigami, a variation of origami wherein objects are cut in addition to folded.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "YouTube Shorts’ collaborative Add Yours sticker is now available to all users",
        "description": "YouTube confirmed on Wednesday that its collaborative “Add Yours” sticker for YouTube Shorts is now fully rolled out. The Google-owned company first announced the feature back in July. The sticker…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Bluesky catches up to X with native support for video",
        "description": "With native video support, Bluesky will be able to better compete with other X rivals, including Instagram Threads and the decentralized service Mastodon, among others.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Taylor Swift cites ‘fears around AI’ as she endorses the Democratic ticket",
        "description": "After a historic presidential debate replete with discourse about eating pets, Taylor Swift ended the evening with a bang. Arguably the most powerful figure in American pop culture, the singer-songwriter…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Mark Zuckerberg says he’s done apologizing",
        "description": "The home of the Golden State Warriors was packed on Tuesday evening this week, but it wasn’t to watch Steph Curry. Thousands of fans gathered at the Chase Center in…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "This Week in AI: OpenAI’s new Strawberry model may be smart, yet sluggish",
        "description": "Hiya, folks, welcome to TechCrunch’s regular AI newsletter. If you want this in your inbox every Wednesday, sign up here. This week in AI, OpenAI’s next major product announcement is imminent,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Media talent app HUSSLUP shuts down as workers in Hollywood continue to face job slowdown",
        "description": "HUSSLUP, the job search and networking app for the entertainment industry, goes on an indefinite hiatus starting Friday.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Google’s AI note-taking app NotebookLM can now explain complex topics to you out loud",
        "description": "Google announced on Wednesday that its AI note-taking and research app, NotebookLM, is adding an “Audio Overview” feature. Audio Overview will give users another way to digest and comprehend the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "TechCrunch Minute: Why this entrepreneur is running the Oakland Ballers like a startup",
        "description": "The coolest startup in the Bay Area isn’t making AI robots or self-driving taxis. It’s actually a baseball team. As his beloved Oakland A’s plan…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Apple’s newly available ‘win-back’ offers let developers reach lapsed subscribers",
        "description": "Apple explains that these offers are designed to reach an app or game’s previous subscribers and encourage them to return.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Oura has acquired metabolic health startup Veri",
        "description": "Blood sugar levels are foundational to the Veri platform.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Fearless Fund is shutting down its contested Strivers Grant program",
        "description": "Fearless Fund has settled its case with the American Alliance for Equal Rights (AAER), agreeing to shut down its Strivers Grant program.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "Meet Verse, an AI-powered creative app that helps Gen Z design and publish expressive content",
        "description": "Verse, a new AI-powered creative app, is aiming to help Gen Z users create hyper-visual and expressive content. The iOS app allows users to design and publish multimedia content on…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-12T07:22:08.386430"
    },
    {
        "title": "The torture behind Blues turnaround",
        "description": "A novel approach tested Carlton’s AFLW players but paid off during a round 2 thriller in Mackay.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "AFL great hails ‘selfless’ Lions superstar",
        "description": "AFL great Luke Hodge has been impressed with the way a two-time Brownlow medallist has taken his game to new levels this season.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "New Raygun photos we can’t ignore",
        "description": "After a very controversial performance at the Paris Olympics, Raygun has returned home, and we’ve got the pictures to prove it.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Genie smashes fans as tennis drama erupts",
        "description": "The Canadian was forced to defend a tweet she wrote about Pegula after it was misinterpreted by fans.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "The torture behind Blues turnaround",
        "description": "A novel approach tested Carlton’s AFLW players but paid off during a round 2 thriller in Mackay.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "AFL great hails ‘selfless’ Lions superstar",
        "description": "AFL great Luke Hodge has been impressed with the way a two-time Brownlow medallist has taken his game to new levels this season.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Timely reality check fires up Bulldogs",
        "description": "Canterbury’s forwards walked off Accor Stadium feeling like they were responsible for the loss to Manly. Now they have the chance for revenge.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Secret helping Luai prepare for last ride",
        "description": "As the enormity of his move to the Wests Tigers sinks in, Jarome Luai has revealed the secret tool that has helped him stay grounded.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘I’d love to’: Rebuilt bowler’s high-speed goal",
        "description": "An Australian fast bowler is still determined to break speed records as she prepares to break a six-year World Cup drought.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Aussie star makes history in nuclear blitz",
        "description": "Australian cricketer Travis Head delivered a nuclear blitz as he pummelled England during the opening of three T20 matches.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Genie smashes fans as tennis drama erupts",
        "description": "The Canadian was forced to defend a tweet she wrote about Pegula after it was misinterpreted by fans.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘Did it again’: Hewitt’s bold plan pays off",
        "description": "With no Alex de Minaur at the Davis Cup, Australia needed others to step up, and three of them did.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Whispers over billionaire’s bombshell F1 powerplay",
        "description": "A bombshell report has claimed a billionaire team owner is scrambling to secure one of the most seismic deals in F1 history.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Clarkson ‘exclusive’ leaked $295m bombshell",
        "description": "Former Top Gear host Jeremy Clarkson broke massive news back at the British Grand Prix in July with the F1 world finally giving him props.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "New Raygun photos we can’t ignore",
        "description": "After a very controversial performance at the Paris Olympics, Raygun has returned home, and we’ve got the pictures to prove it.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "$150 for six chicken nuggets at US Open",
        "description": "Tennis fans have lashed out at the “ridiculous” price of a chic new spin on chicken nuggets at the US Open.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Coach breaks down over NFL star’s arrest",
        "description": "Footage of an NFL superstar’s police confrontation has been released, with his coach getting emotional addressing the incident.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Star’s wife’s heartbreaking eulogy reveal",
        "description": "There have been distressing scenes as the wives of killed brothers revealed devastating pregnancy news as the duo were laid to rest.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘Dominating’: Socceroos whiz-kid’s ultimate aim",
        "description": "It was only the woodwork that denied teenage sensation Nestory Irankunda a memorable goal for the Socceroos against Indonesia.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘Common theme’ haunting Socceroos",
        "description": "Matches next month against China and Japan have taken on extra importance for the Socceroos after their disappointing start to the latest round of World Cup qualifiers.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘Doesn’t have the chin’: Tszyu’s brutal Canelo warning",
        "description": "Tim Tszyu didn’t mince his words predicting the outcome of Canelo Alvarez’s world title showdown with Edgar Berlanga. Plus, a look behind the scenes at his Las Vegas training camp.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Rory’s ‘message’ as merger stalls",
        "description": "As the golf world sits in limbo waiting for a new deal between the PGA Tour and LIV’s Saudi backers, Rory McIlroy has a message for officials.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "SuperCoach NBL dictionary: Easy guide to fantasy jargon",
        "description": "With terms like Cheapies, Guns, PODS, Floors and Ceilings it’s no wonder some people get confused by terms used in SuperCoach NBL. But don’t be discouraged.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Former Wallabies gun quits Australia",
        "description": "He was the second youngest player ever to earn a cap for the Wallabies, and now the former wunderkind is leaving to play overseas.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Body found in search for rugby legend’s wife",
        "description": "Police have made a tragic discovery in the search for a rugby legend’s wife after she vanished going for a group swim.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "Romantic Warrior success inspires Japanese star’s Cox Plate bid",
        "description": "Romantic Warrior’s win in the Cox Plate encouraged the connections of Japanese star Prognosis to take up the challenge this year.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-12T07:22:10.068994"
    }
]