[
    {
        "title": "EU calls for 'respect' after Trump threatens 50% tariffs",
        "description": "Trade chief Maros Sefcovic said the EU is \"ready to defend\" its interests after Trump threatened 50% tariffs on the bloc.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Analysis: Trump's tariff plans could spark global economic shock",
        "description": "The move threatens significant volatility in the coming weeks, ahead of a crucial G7 summit in Canada next month.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Protestors accuse Trump of corruption as he hosts crypto gala dinner",
        "description": "Trump hosted the biggest investors in his own cryptocurrency, but insisted he put the country ahead of his  businesses interests.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Amazon tribe sues New York Times over story it says led to porn addict claims",
        "description": "The lawsuit claims a report portrayed the Marubo people as \"unable to handle\" basic internet exposure.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Analysis: Trump's tariff plans could spark global economic shock",
        "description": "The move threatens significant volatility in the coming weeks, ahead of a crucial G7 summit in Canada next month.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Boeing to avoid prosecution in US Justice Department deal over crashes",
        "description": "The two crashes happened in 2018 and 2019 and left 346 people dead.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "The Bitcoin hum that is unsettling Trump's Maga heartlands",
        "description": "Trump has said he wants to turn the US into the crypto-mining capital of the world - but that has real-world implications for many of his core voters",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Harvard foreign students face uncertainty as Trump plan to block enrolment is halted - for now",
        "description": "It comes a day after the administration said it had revoked Harvard's access to student visa programmes.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Cyber criminals contact BBC to claim hack on Co-op, M&S",
        "description": "Hackers reached out to the BBC's Joe Tidy on Telegram, frustrated that their ransom demands weren't being met.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Chip maker TSMC expands US reach with new Arizona factory",
        "description": "The BBC gets exclusive access to the Taiwanese company's new factory in the Arizona desert, just outside Phoenix.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Why so many military veterans move into cybersecurity",
        "description": "The vigilance needed in the military can be an asset in the cybersecurity industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Trump reignites tensions with EU tariff threats",
        "description": "EU says threats should not guide trade talks as Trump says he wants tariffs of 50% on European goods as soon as 1 June.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "What tariffs has Trump announced and why?",
        "description": "Tariffs are a key part of the US president's political vision but economists fear a global trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Daily Telegraph to be sold to US firm RedBird",
        "description": "The American company agrees to buy the Daily and Sunday Telegraph after a two-year ownership vacuum.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Labubu fan fury after dolls pulled from stores",
        "description": "The popular toys have been removed from UK shelves until June, following reports of customers fighting over them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which must still pass in the Senate, includes sweeping changes to the tax code, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Denmark to raise retirement age to highest in Europe",
        "description": "From 2040, Danish people born after 31 December 1970 will be eligible to retire at 70 years old.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "In South Korea, even your cup of Starbucks could be too political",
        "description": "All six presidential candidates' names are banned in Starbucks stores to \"maintain neutrality\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "US House passes Trump's 'big, beautiful' tax and spending bill",
        "description": "The bill's passage is a victory for the White House, which warned that failure would be a \"betrayal\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Trump administration ends Harvard's ability to enrol international students",
        "description": "The move escalates the administration's row with America's oldest university over hiring, admissions and teaching practices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "US Treasury confirms the end of the penny",
        "description": "There has been a long debate over the cost and usefulness of one cent coins in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "US Congress moves to block California ban on petrol-only cars",
        "description": "California's plan was expected to have significant influence over the wider car industry in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Nike to raise US prices as firms face tariffs uncertainty",
        "description": "The US sportswear giant says its price increases are part of \"seasonal planning\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "How a joke about rice cost a Japan cabinet minister his job",
        "description": "Soaring rice prices are a powerful trigger in Japan, where shortages have caused political upsets before.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "M&S website back online, allowing users to browse",
        "description": "After going down overnight, the website is open for browsing again, but online orders remain suspended after the recent cyber attack.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "Trump meets Republican hard-liners in hopes of moving tax bill forward",
        "description": "The House may vote on his \"big beautiful bill\" soon, and Trump needs the support of almost all Republicans for it to pass.",
        "source": "BBC Business",
        "fetched_date": "2025-05-25T07:24:25.253680"
    },
    {
        "title": "The Nine-Minute Bromance Video That Launched a $6 Billion AI Mystery",
        "description": "They stroll, they sip, they gaze meaningfully. The one thing Open AI CEO Sam Altman and former Apple designer Jony Ive don't do? Explain what their new device actually is.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Different President, Same Song: Trump Pulls a Nixon in His Battle Against The Boss",
        "description": "Bruce Springsteen isn’t the first rock star to face the ire of a pushy POTUS. Fifty years ago, Richard Nixon went to war against John Lennon over the former Beatle’s peacenik politics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Who Really Took the Iconic “Napalm Girl” Photo? Director of New Doc Addresses the Controversy (Exclusive)",
        "description": "Since its premiere at Sundance, 'The Stringer' has led to a divisive re-examination of the credit for the Pulitzer Prize–winning 1972 photograph that captured the horrors of the Vietnam War.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Paris Court Finds Ringleader, Seven Others Guilty in 2016 Robbery of Kim Kardashian",
        "description": "None of the eight people convicted will face additional time behind bars as two of the 10 defendants were acquitted.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Billy Joel Shares Brain Disorder Diagnosis",
        "description": "The iconic singer has canceled all concerts amid the news: \"I’m sincerely sorry to disappoint our audience.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "PragerU’s Plan to Red Pill Our Kids",
        "description": "Dennis Prager’s right-leaning media platform has built an audience of millions by marrying slick Hollywood production values with MAGA stars and conservative ideology. Now it’s setting its sights on a new market: America’s schoolchildren.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Drummer and Music Talent Agency Owner Killed in San Diego Plane Crash",
        "description": "Daniel Williams, the former drummer of the rock band The Devil Wears Prada, and Dave Shapiro, the owner of Sound Talent Group, were killed in the early morning crash.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Kid Cudi Testifies About Porsche Bombing, L.A. Home Break-In He Says Sean “Diddy” Combs Was Behind",
        "description": "The Grammy-winning rapper was dating Cassie Ventura at the same time as the disgraced mogul, who is on trial for sex trafficking and racketeering in New York.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Inside the Sean “Diddy” Combs Courtroom: Angry Stares, Zero Fashion Flair and Who Sits Where",
        "description": "YouTube personality Tisa Tells gives her unfiltered take on the trial so far, including who’s really running the defense’s strategy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Harvey Weinstein Survivors Speak Out to Support Three Women Testifying Against Him In New Trial",
        "description": "The statement comes amid  \"a climate of cynicism\" about the #MeToo movement, the women say, and less outside support for the accusers on the stand.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Kendrick Lamar Commands Home Crowd as SZA Brings Out Lizzo for Surprise Duet During the First Night of L.A. Tour Stop",
        "description": "Lebron James and Winnie Harlow were spotted among the concert-goers at the first of three sold-out Los Angeles shows on the Grand National Tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Kid Cudi Testifies in Diddy Trial That His Car Was Set on Fire Weeks After Sean Combs Broke Into His Home",
        "description": "Cudi, whose real name is Scott Mescudi, took the witness stand in the disgraced mogul's sex trafficking trial and said he and Cassie briefly dated in 2011.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-25T07:24:25.685652"
    },
    {
        "title": "Footy star’s bedroom confession revealed",
        "description": "An NRL superstar has revealed the make or break moment with her now husband when the couple were just two weeks into dating.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Tigers star joins rival effective immediately",
        "description": "Lachlan Galvin is set to leave the Wests Tigers and join a rival club effective immediately as NRL supremo Phil Gould gets his way.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Debate erupts over sickening AFL collision",
        "description": "Fremantle Dockers captain Alex Pearce is set to be suspended for an ugly hit on an opposition player, sparking heated debate in AFL circles.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "‘F*** Lewis’: F1 stars in huge Monaco drama",
        "description": "Lewis Hamilton and Max Verstappen have clashed in tense scenes following a frenetic qualifying for the F1 Monaco Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Horsburgh loses the plot in fiery clash",
        "description": "Two of Canberra’s top forwards are on report, and one binned, in a fiery clash between the Raiders and Warriors. Follow live here",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Footy star’s bedroom confession revealed",
        "description": "An NRL superstar has revealed the make or break moment with her now husband when the couple were just two weeks into dating.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "‘What just happened’: Will Gawn brain fade cost Demons?",
        "description": "Max Gawn is putting in another SuperCoach masterclass against Sydney, but a bizarre blunder could come back to bite Melbourne. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Debate erupts over sickening AFL collision",
        "description": "Fremantle Dockers captain Alex Pearce is set to be suspended for an ugly hit on an opposition player, sparking heated debate in AFL circles.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Axe looms for teen as shock act comes to light",
        "description": "Sam Konstas is expected to miss out on the WTC final, but it hasn’t stopped the Aussie youngster from trying to change selectors’ minds.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "‘He’s the future’: Former Aussie star backs batting prodigy",
        "description": "A former Australian star is urging selectors to back in “the future” in next month’s World Test Championship final at Lord’s.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "‘Wildly inappropriate’ camera act slammed",
        "description": "Just months after becoming enemy No. 1 in Australia – Danielle Collins was at her fiery best again with a wild cameraman clash.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Damir Dokic, Jelena’s abusive dad, dies",
        "description": "Damir Dokic, the abusive, estranged father of former Aussie tennis star and current commentator Jelena Dokic, has died.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "‘F*** Lewis’: F1 stars in huge Monaco drama",
        "description": "Lewis Hamilton and Max Verstappen have clashed in tense scenes following a frenetic qualifying for the F1 Monaco Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Piastri escapes catastrophe but suffers Monaco blow",
        "description": "Oscar Piastri has his work cut out for him if he’s going to win the Monaco Grand Prix, with an eventful qualifying session opening the door for his main title rival.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Reds their own worst enemy after falling short in nailbiter",
        "description": "Queensland Reds were shooting for a guaranteed spot in the Super Rugby playoffs and its first win over the Hurricanes since 2013, but were their own worst enemy in a nailbiting loss.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Sliding Reds ‘need to be better’",
        "description": "The Queensland Reds are searching for some answers to their dip in form ahead of the Super Rugby Pacific finals series.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Baseball world rocked by Aussie icon’s death",
        "description": "A massive ‘outpouring of shock and loss’ has swept through the Australian sporting world after the unexpected death of an Aussie Olympian.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "‘Kill off the main character’: Ominous Ange joke amid unclear future",
        "description": "Ange Postecoglou has sheepishly walked back comments made at Tottenham’s Europa League trophy parade, with the Australian manager making it clear his future at the club remains uncertain.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Ange’s hilarious reaction to sack question",
        "description": "Ange Postecoglou has delivered a hilarious response to a question about his Tottenham future as he rethought his iconic parade declaration.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "25yo star dies weeks after getting married",
        "description": "Tributes are flowing around the boxing world after a talented fighter died at the age of 25 in a heartbreaking tragedy.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Scheffler outlasts Rahm to claim third major at PGA Championship",
        "description": "World number one Scottie Scheffler has captured his third major title, seeing off Spain’s Jon Rahm down the back nine in the final round to win the PGA Championship.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Unthinkable ‘choke’ turns NBA on its head",
        "description": "Tyrese Haliburton knocked down a ridiculous game-tying shot, sparking a truly extraordinary Indiana Pacers comeback win.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "On The Punt: Sun to rise at Mornington on Monday",
        "description": "Herald Sun tipster Gilbert Gardiner’s selections for Mornington on Monday.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-25T07:24:26.786423"
    }
]