[
    {
        "title": "Former TV host gets almost 10 years in prison for fraud",
        "description": "Ozy Media founder Carlos Watson was sentenced to 116 months in prison by a judge in New York.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Trump meeting TikTok CEO as ban deadline looms",
        "description": "The social media giant is currently seeking to delay a law that would see it banned or sold in early 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Amazon aware of warehouse injury risk, report finds",
        "description": "The e-commerce giant is accused of trying to misrepresent its safety record, but says a report \"isn't grounded in reality\".",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Bitcoin hits new record high of more than $106,000",
        "description": "The world's largest cryptocurrency has risen by more than 50% since Donald Trump's election victory.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Trump meeting TikTok CEO as ban deadline looms",
        "description": "The social media giant is currently seeking to delay a law that would see it banned or sold in early 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Trump buoyant as big business and former foes fall in line",
        "description": "Many of the president-elect's former critics and adversaries have made overtures since his election victory.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Canada's finance minister quits over Trump tariff dispute with Trudeau",
        "description": "Chrystia Freeland says Canada faces a \"grave challenge\" from incoming US President Donald Trump's tariff threats.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Standing beside Trump, Japanese billionaire pledges major US investment",
        "description": "Masayoshi Son said he would invest $100bn in the US, and others could follow during Trump's second term.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "West African bloc pins hopes on ambitious superhighway from Ivory Coast to Nigeria",
        "description": "The road could breathe new life into West Africa's regional bloc, Ecowas.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Trump rings bell on record stock market - but will it last?",
        "description": "The US president-elect comes into office with a strong economy, but investors hope for more and current highs may be difficult to sustain.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "All eyes on the Fed's interest rate decision - 16 Dec 2024",
        "description": "Market expert says a quarter of a percent interest rate cut expected but that might be it for some time.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "In from the cold: Scandi wines hope to win over drinkers",
        "description": "Thanks to climate change and tougher vines, Denmark and Sweden have a growing number of wineries.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Christmas dinner in the UK set to cost less this year",
        "description": "The BBC digs into which bits of the festive feast have gone up and down in price.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Royal Mail takeover by Czech billionaire approved",
        "description": "The £3.6bn deal by Daniel Kretinsky is cleared after agreeing \"legally binding\" undertakings.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Trump gets $15m in ABC News defamation case",
        "description": "The network also publishes a statement expressing \"regret\" for statements by George Stephanopoulos.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Founder of fashion chain Mango dies in cave accident",
        "description": "The 71-year-old is remembered for his fashion leadership after the accident in caves near Barcelona.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "OpenAI whistleblower found dead in San Francisco apartment",
        "description": "The San Francisco medical examiner's office determined Suchir Balaji's death to be suicide and police found no evidence of foul play.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Tracing the powerful family roots of suspected killer Luigi Mangione",
        "description": "In his home city, the accused shooter's family name has meant wealth, power, prominence and philanthropy for decades.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Canadian government moves to end weeks-long postal strike",
        "description": "Around 55,000 postal workers began striking on 15 November over pay and working conditions.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "UK 'doesn't have enough builders' for Labour's 1.5m homes",
        "description": "Builders and developers say reforms are needed to recruit more tradespeople to build the homes being promised.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Milei, Musk and Maga: Is Argentina influencing the US?",
        "description": "As Argentina's libertarian President Javier Milei marks one year in office, his policies are keenly observed in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "BBC complains to Apple over misleading shooting headline",
        "description": "Apple's new artificial intelligence features falsely made it seem the BBC reported Luigi Mangione had shot himself.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Influencer's brand faces backlash over bullying claims",
        "description": "Fans are outraged by allegations of body-shaming and a toxic workplace at fashion company Djerf Avenue.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "N Korea made millions from remote work scheme, US says",
        "description": "Fourteen North Koreans have been charged with fraud in the US over an alleged long-running conspiracy.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "UK economy shrinks for second month in a row",
        "description": "The economy had been expected to return to growth but it contracted by 0.1%.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "Why 'digital twins' could speed up drug discovery",
        "description": "AI can create digital humans and digital organs that can be used in clinical trials.",
        "source": "BBC Business",
        "fetched_date": "2024-12-17T07:25:53.362517"
    },
    {
        "title": "John C. Reilly to Be Honored at the Oscar Wilde Awards (Exclusive)",
        "description": "The 19th annual event returns to its original home, the historic Ebell theater in Los Angeles, three days before the Academy Awards.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Owen Wilson Joins Travis Scott Onstage During Rolling Loud Festival Performance",
        "description": "“I’m feining for more!” the actor shouted into the crowd ahead of Scott's performance of \"Fein.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Clay Aiken Says He Lost “50 Percent” of His Fans After Coming Out as Gay in 2008",
        "description": "\"Back then it was a big deal,\" he says, noting that ticket sales for Broadway's 'Spamalot' — which he was starring in at the time — dropped, and the show closed a few months later.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Michael Moore Says He Will Not “Tamp Down” or Condemn Anger Stirred by Luigi Mangione",
        "description": "The man accused of shooting UnitedHealthcare CEO Brian Thompson named Moore — who directed 2007's 'Sicko' — in his alleged manifesto.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Conan O’Brien’s Parents Die Three Days Apart From One Another",
        "description": "Dr. Thomas O’Brien was 95 and Ruth Reardon O’Brien was 92.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "ABC News to Apologize and Pay $15M to Settle Defamation Suit Brought By Trump",
        "description": "The money will be donated to \"a Presidential foundation and museum\" established by Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Will Smith Shuts Down Rumored Connection to Sean “Diddy” Combs: “I Ain’t Been Nowhere Near That Man”",
        "description": "The rapper said he doesn't typically address rumors or memes, but he felt the need to clarify this particular one.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Jay-Z Attorney Seeks to Dismiss Rape Accuser’s Suit After Jane Doe Admits to Inconsistencies in Her Recollection",
        "description": "The Alabama woman sat for an interview with NBC News prompting the rapper to respond.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Pete Davidson Doesn’t Want to Be Known in Hollywood as the “F***ing Loser Who Just Dates People”",
        "description": "The 'Saturday Night Live' alum says he's also realized over time that \"people have to miss you\" to be successful in the film and TV business.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Paula Abdul Settles Sexual Assault Lawsuit Against ‘American Idol’ Producer Nigel Lythgoe",
        "description": "The lawsuit accused Lythgoe of assaulting Abdul during one of the early seasons of 'American Idol' and years later, when she was a judge on 'So You Think You Can Dance.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Dear Elton John: Lighten Up, and Maybe Light One Up (Guest Column)",
        "description": "The EGOT once sang a different tune about cannabis.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "Sabrina Carpenter Compares Meeting Paul McCartney to the Upside Down “But a Lot Happier Than ‘Stranger Things'”",
        "description": "The singer-songwriter had been a fan of the Beatle since she was a child.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-17T07:25:53.681287"
    },
    {
        "title": "‘Devastated’: Huge injury rocks Australia",
        "description": "Australia has suffered a major blow as it strives to regain the Border-Gavaskar trophy, with injury news denting their hopes for the series.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Starc’s priceless reaction to farcical Gabba rain delay",
        "description": "The rain-affected Gabba Test hit a new low late on Day 4, when play was halted for a sprinkle that left Test great Adam Gilchrist fuming – and Mitchell Starc rolling his eyes. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "‘Big outs’: BBL champions lose Aussie stars",
        "description": "Reigning Big Bash champions the Brisbane Heat are confident they can go back-to-back despite being without two Aussie stars.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Maxy still no good for BBL",
        "description": "A nasty hamstring injury suffered playing for Australia is continuing to impact Glenn Maxwell’s Big Bash campaign.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "‘Devastated’: Huge injury rocks Australia",
        "description": "Australia has suffered a major blow as it strives to regain the Border-Gavaskar trophy, with injury news denting their hopes for the series.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Starc’s priceless reaction to farcical Gabba rain delay",
        "description": "The rain-affected Gabba Test hit a new low late on Day 4, when play was halted for a sprinkle that left Test great Adam Gilchrist fuming – and Mitchell Starc rolling his eyes. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Kyrgios drops shock Djokovic announcement",
        "description": "The Aussie tennis star made the surprising announcement just days after making a call on teaming up with Thanasi Kokkinakis.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Nick and Novak? Kyrgios hints at dream doubles team",
        "description": "Nick Kyrgios has taken to social media to hint at an incoming doubles partnership with champion Novak Djokovic, in another step towards his long awaited return to the tennis circuit.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "‘Very rare’: AFL star’s call on loyalty",
        "description": "The business of success in the AFL could lead to the end of the game’s romantic traditions according to a star veteran who was forced to move clubs.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Fans all say same about Welcome to Country",
        "description": "An NRL powerhouse’s massive call surrounding the Welcome to Country ceremony has sparked a storm on social media.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "‘Disgrace’: Outrage over NRL punishment",
        "description": "Broncos star Ezra Mam’s punishment for pleading guilty to driving charges has left NRL commentators staggered.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "NRL captain responds to alarming survey",
        "description": "Alarming results of a survey of NRL and NRLW players when it comes to concussion didn’t surprise one club captain despite a wealth of player education.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "‘Kick in the guts’: Barty, Ricciardo lose jobs",
        "description": "A simple social media update has exposed the truth as Daniel Ricciardo and Ash Barty were quietly released.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Dawn Fraser’s family shocked by question",
        "description": "As Dawn Fraser was undergoing emergency surgery after her horror fall, one question from medical staff stunned her daughter.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "$63m Ben Simmons question in NBA tank job",
        "description": "The Brooklyn Nets are in a race to the bottom in the 2024/25 NBA season but will Ben Simmons be part of a mass exodus?",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "US city’s $828m move puts Aus to shame",
        "description": "The bumbling organisation of the Brisbane 2032 Olympics so far has shown Australia has plenty to learn about hosting a worldwide event.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "A-League shock as coach quits powerhouse",
        "description": "With his team sitting in third less than half way through the A-League season, the Melbourne Victory coach has quit for a new job overseas",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Where Socceroos will play Japan revealed",
        "description": "A venue has been chosen for what looms as a crucial FIFA World Cup qualifier for the Socceroos against Japan.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Bitter family feud on agenda as Tszyu eyes March blockbuster",
        "description": "Nikita Tszyu will be back in the ring early next year – with a domestic pay per view blockbuster on the cards. And it could be a chance to settle a bitter family feud.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Ricciardo’s three word reply to F1 rumours",
        "description": "Australian Formula 1 star Daniel Ricciardo has delivered an emphatic response after he was thrust into the rumour mill.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Ricciardo comes clean on bombshell rumour",
        "description": "Daniel Ricciardo has finally responded to a bombshell rumour regarding his next move that’s sending the Formula One world wild.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Comeback keeps Sydney’s top-two NBL hopes alive",
        "description": "Sydney has launched an incredible fourth quarter comeback to knock off Brisbane and keep its top-two hopes alive in a Sunday afternoon NBL thriller. Get the latest news and results from NBL round 12 here.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "US Masters boost for Aussie gun",
        "description": "Finishing inside the top 50 in the world at the end of the year might not mean much to some but will secure a special bonus for one lucky Aussie.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "‘Fast learner’: Bruce eyes Magic Millions Earn with $7000 yearling",
        "description": "Trainer Jack Bruce is hoping his unraced colt can earn a start in next month’s $3 million Magic Millions 2YO Classic.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "NRL star’s heartwarming baby joy",
        "description": "An NRL star has stunned with a huge announcement – revealing a new addition to his family in a heartwarming Instagram post.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Aussie star’s big World Cup move",
        "description": "After being crowned the best Rugby Sevens player in the world an Australian try-scoring machine is taking a big step towards possibly earning a World Cup spot.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-17T07:25:55.533713"
    }
]