[
    {
        "title": "India disputes Trump claim it is ready to charge US 'no tariffs'",
        "description": "India's foreign minister countered Trump saying \"nothing is decided till everything is\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Nissan says it could share global plants with Chinese state firm",
        "description": "Nissan announced this week that it would lay off another 11,000 workers and shut seven factories.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Seventeen arrest warrants issued over Bangkok skyscraper collapse",
        "description": "The State Audit Office tower collapsed when Bangkok felt tremors of a massive earthquake in Myanmar.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Leading crypto firm Coinbase faces up to $400m hit from cyber attack",
        "description": "The firm says hackers have obtained customer information by paying off employees.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Nissan says it could share global plants with Chinese state firm",
        "description": "Nissan announced this week that it would lay off another 11,000 workers and shut seven factories.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "UK needs more nuclear to power AI, says Amazon boss",
        "description": "The world's largest cloud computing company plans to spend £8bn on new data centres in the UK over the next four years.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Is Britain really inching back towards the EU?",
        "description": "The summit between the UK and EU on 19 May will be the first since Brexit - the very idea of it has polarised opinions",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Walmart says higher prices could hit this month due to tariffs",
        "description": "The retailer says it isn't able to absorb all the pressure from tariffs, even at the reduced levels announced.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Letting off steam: How Dominica's volcanoes will boost its green energy",
        "description": "The Caribbean island is building a power station that will use steam naturally heated by volcanic rock.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Is the US finally on track to build a high-speed rail network?",
        "description": "The US currently has no high-speed rail services, but two are under construction, and more planned.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Analysis: The UK's surprise resilience may not be temporary",
        "description": "These figures provide an opportune moment for some optimism and a hard sell of the UK to the rest of the world.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Reeves says UK 'beginning to turn corner' as growth beats forecasts",
        "description": "The economy grew faster than expected between January and March, before UK and US tax rises were brought in during April.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Ben & Jerry's co-founder arrested after Senate Gaza protest",
        "description": "Ben Cohen and six others were arrested during the protest in the US Senate, Capitol Police tells BBC News.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Jaguar says it has no plans to build cars in the US",
        "description": "The comment came after the company's boss refused to rule out opening production plants in America.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Trump's critics and supporters unite against Qatar plane deal",
        "description": "The White House has doubled down on the proposed deal which has been criticised by some of the president's top supporters.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "UK to allow foreign states 15% stake in newspapers",
        "description": "A ban was introduced last year - but the law has now been changed to help cash-strapped publishers raise funding.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Relief on China's factory floors as US tariffs put on hold",
        "description": "A surprise deal in the trade war gives businesses breathing room - but many now want to find new markets.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Why India could not stop IMF bailout to Pakistan",
        "description": "As one of 25 member groups on the IMF board, India's influence at the fund is limited, say experts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Bayesian crew unaware wind speeds of over 73mph could topple yacht, report finds",
        "description": "Investigators say 80mph winds \"violently\" knocked over the vessel, causing it to flood within seconds.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Trump touts 'record' Boeing-Qatar Airways deal",
        "description": "The commitment from the state-owned airline comes as Boeing pushes to rebuild its business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "'They yanked their own plug': How Co-op averted an even worse cyber attack",
        "description": "The revelation - from the criminals responsible - explains why the Co-op is getting back to business faster than M&S.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "UK hits back at claims US tariff deal bad for China",
        "description": "The UK government said there was \"no such thing as a veto on Chinese investment\" in its tariff deal with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Burberry to cut 1,700 jobs as designer suffers heavy losses",
        "description": "The British designer brand - famed for its distinctive check pattern - has proposed cutting its global workforce by a fifth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Airbnb offers private chefs and massages as it revamps app",
        "description": "The short rental firm says it is aiming to offer a wider range of experiences for travellers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Plane crash victims' families file complaint against Jeju Air CEO",
        "description": "A criminal complaint was filed against 15 people, including the transport minister, for negligence.",
        "source": "BBC Business",
        "fetched_date": "2025-05-16T07:26:57.355752"
    },
    {
        "title": "Court Throws Out “Potentially Libelous” Taylor Swift Extortion Claims From Justin Baldoni’s Team",
        "description": "The judge overseeing the 'It Ends With Us' legal battle removed filings in the case relating to allegations that Lively's legal team threatened to release private text messages involving Swift.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Chris Brown Arrested in England Over 2023 Nightclub Incident (Reports)",
        "description": "Brown was previously sued for allegedly beating a producer over the head with a tequila bottle.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Cassie Reads Messages With Diddy During Cross-Examination That Show Her Expressing Interest in “Freak-Offs”",
        "description": "Thursday's testimony and evidence was in contrast to the violence and shame Cassie said accompanied \"hundreds\" of her encounters with male sex workers that Sean \"Diddy\" Combs watched and controlled during their relationship.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Inaugural Pride LIVE! Hollywood Event Set for June With Film Screenings, Premieres, Tributes to Norman Lear, ‘Golden Girls,’ ‘Queer as Folk’ and More",
        "description": "The monthlong celebration of \"LGBTQ+ creativity in media and entertainment\" will take place at various locations in and around Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Springstreen Slams “Corrupt, Incompetent, and Treasonous” Trump Administration",
        "description": "On the latest leg of his The Land of Hope and Dreams Tour, the rock icon didn't hold back on how he felt about the U.S. president.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "SoundCloud Updates Terms of Service Following Backlash to AI Policy",
        "description": "\"Our position is simple: AI should support artists, not replace them,\" SoundCloud CEO Eliah Seton said in a letter published Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Kate Hudson Stars as An Intergalactic Director in Finneas’ ‘2001’ Music Video",
        "description": "The Oscar nominee joined the 10-time Grammy winner in the new video that was inspired by '2001: A Space Odyssey.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "At Diddy Trial, Ex Cassie Reveals $20M Settlement While Detailing Decade of His Alleged Violence",
        "description": "The second day of testimony from the singer and former partner of the rap mogul included further details of her recollections of \"freak-offs\" and multiple accounts of physical and psychological abuse.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Tory Lanez Legal Team Calls for Pardon After Prison Stabbing, Claims New Evidence in Shooting Case",
        "description": "Lanez was stabbed in prison this week as he serves a 10-year sentence after he was convicted on firearm charges for shooting Megan Thee Stallion.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "After Tuesday’s Resentencing, What’s Next for the Menendez Brothers?",
        "description": "The pair, who have been imprisoned for more than 30 years for the murder of their parents, are now eligible for parole, but their freedom is not guaranteed.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Blake Lively’s Lawyers Are Extorting Taylor Swift, Justin Baldoni Claims",
        "description": "In a Wednesday letter to the court, lawyers for the 'It Ends With Us' director say that Lively's legal team threatened to release private text messages involving Swift. A lawyer for the actress denied the accusations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Jennifer Lopez Suffers Facial Injury While Rehearsing for 2025 American Music Awards",
        "description": "\"So this happened,” Lopez shared on her Instagram stories as she prepares to host and perform during the May 26 show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-16T07:26:57.777851"
    },
    {
        "title": "Aussie’s fate sealed, dark F1 truth laid bare",
        "description": "A photo of Jack Doohan’s replacement arriving to take his place is hiding a dark reality about the Aussie’s “harsh” F1 sacking.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "NRL trainers banned over ball fiasco",
        "description": "The NRL has come down hard on two clubs and their trainers for trying to gain an unfair advantage after they were caught on camera.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "NRL trainers banned over watergate",
        "description": "The NRL has come down hard on two clubs and their trainers for trying to gain an unfair advantage after their actions were caught on camera.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Where’s dad?’: Politician’s vile Kerr comment",
        "description": "Sam Kerr and her fiancee Kristie Mewis have come under fire from conservative politicians after welcoming a baby boy into the world.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "NRL trainers banned over ball fiasco",
        "description": "The NRL has come down hard on two clubs and their trainers for trying to gain an unfair advantage after they were caught on camera.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "NRL trainers banned over watergate",
        "description": "The NRL has come down hard on two clubs and their trainers for trying to gain an unfair advantage after their actions were caught on camera.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "AFL icon’s staggering act in final moments",
        "description": "Footy legend Robert Walls’ final moments have been revealed with his family sharing the Carlton great’s incredible final act.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘We love Jacko’: Goodwin addresses trade buzz",
        "description": "Melbourne coach Simon Goodwin has unquestionable interest in a star’s return but has firmly ruled out a contracted gun of his own being the key to unlocking the trade.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "5.6 million reasons for Aussies to win WTC final",
        "description": "Taking the mantle as the world’s best Test team is motivation for Australia to win the World Test Championship final, but a massive new carrot has been dangled.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "South Africans make WTC final demand",
        "description": "As players weigh up whether to return to India for the delayed IPL, South African cricket bosses lost their bid to make a demand on their Test players that Cricket Australia didn’t.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Call Roger’: Djoker’s shock coaching move",
        "description": "Just weeks out from the French Open and Wimbledon, Novak Djokovic has announced a shock moving in his coaching ranks.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Jelena Dokic’s heartbreaking confession",
        "description": "Australian tennis great turned commentator Jelena Dokic has lifted the lid on her feelings towards her estranged father in a raw interview.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Real reason behind Broncos demise revealed",
        "description": "A handful of Broncos players who have gone “missing” have been urged to lift, as Brisbane look to turn their stuttering NRL season around.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Aussie’s fate sealed, dark F1 truth laid bare",
        "description": "A photo of Jack Doohan’s replacement arriving to take his place is hiding a dark reality about the Aussie’s “harsh” F1 sacking.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Piastri learns fate after ugly accusation",
        "description": "Oscar Piastri has learned his fate after an investigation into his McLaren team was launched following ugly accusations.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Do-or-die’ for Reds against Brumbies",
        "description": "If the Queensland Reds want to host a match in this year’s Super Rugby Pacific finals series, a win over the ACT Brumbies on Saturday night looms as a must.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Better news for Wallabies $5m man’s injury",
        "description": "The most expensive signing in Rugby Australia history could yet play for the Wallabies against the British and Irish Lions  after a serious injury revelation.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Baseball world rocked by Aussie icon’s death",
        "description": "A massive ‘outpouring of shock and loss’ has swept through the Australian sporting world after the unexpected death of an Aussie Olympian.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Oh good lord’: Giddey twist has NBA reeling",
        "description": "The NBA is still coming to terms with the shocking result of the draft lottery, and how Josh Giddey inadvertently cost his team the No. 1 pick.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Where’s dad?’: Politician’s vile Kerr comment",
        "description": "Sam Kerr and her fiancee Kristie Mewis have come under fire from conservative politicians after welcoming a baby boy into the world.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Attacker closer to Socceroos debut",
        "description": "A mix of young and experienced players will gather in the UAE next week for a training camp under Socceroos coach Tony Popovic.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘No! What the f***’: Garside fight called off",
        "description": "Harry Garside’s comeback boxing fight has ended in hugely controversial circumstances that left his opponent and Tim Tszyu stunned.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Encouraging’: Unheralded Aussie’s flying start",
        "description": "Cam Davis flies under the radar but the Australian is a two-time winner on the PGA Tour and made a great start at the year’s second major.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Oh good lord’: Giddey twist has NBA reeling",
        "description": "The NBA is still coming to terms with the shocking result of the draft lottery, and how Josh Giddey inadvertently cost his team the No. 1 pick.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Kembla preview: Ryan optimistic Explicit can beat older rivals",
        "description": "Co-trainers Gerald Ryan and Sterling Alexiou are looking for an early race-to-race double at Kembla starting with well-bred colt Explicit.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Divorced’: Dennis’ battle with mental health",
        "description": "Rohan Dennis seemed to have everything going for him, but an ominous interview before his wife’s death revealed what was happening behind the scenes.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "‘Heart broken’: WWE legend dead at age 60",
        "description": "An icon of the wrestling world has died just weeks after his final match with stars of the industry left “heartbroken”.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    },
    {
        "title": "Brutal truth about Candice, David’s marriage",
        "description": "Candice Warner has opened up about her decade-long marriage to cricketer David Warner, saying the couple have faced their challenges.",
        "source": "News AU",
        "fetched_date": "2025-05-16T07:26:59.558827"
    }
]