[
    {
        "title": "Investigation ordered into power outage that closed Heathrow",
        "description": "Energy Secretary Ed Miliband says there are lessons to be learned after substation fire led to major flight disruption on Friday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Civil Service told to slash running costs by 15%",
        "description": "The target is said to be administrative costs - but unions have challenged ministers to be upfront about what areas of work they are prepared to sacrifice as a result.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "UK TV industry in crisis, says Wolf Hall director",
        "description": "Peter Kosminsky says they had to cut most of the outdoor scenes to make the historical drama.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Columbia University agrees to Trump administration's demand for mask ban",
        "description": "The Trump administration has warned 60 universities funding may be cut if they do not address allegations of antisemitism on campuses.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Civil Service told to slash running costs by 15%",
        "description": "The target is said to be administrative costs - but unions have challenged ministers to be upfront about what areas of work they are prepared to sacrifice as a result.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "End of hedonism? Why Britain turned its back on clubbing",
        "description": "In the last five years, around 400 clubs have closed in Britain – could the lasting impact of the pandemic play a part?",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "The open secret about rare earth minerals",
        "description": "They are the focus of many diplomatic skirmishes, but how are rare earth minerals used and where are they found?",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Canada can win trade war with US, foreign affairs minister Mélanie Joly says",
        "description": "Canada is among the countries waiting to see what Trump's 2 April reciprocal tariffs look like.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Week in Markets - 21 Mar 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "The slow but steady advance of driverless vehicles",
        "description": "Robo-taxi services and driverless trucks are gaining ground but progress is painstaking.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "In some parts of US, the typewriter still lives on",
        "description": "Computers and smartphones might be where most writing is done these days, but typewriters still have work to do in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Facebook to stop targeting ads at UK woman after legal fight",
        "description": "Tanya O'Carroll says her case opens a \"gateway\" for others wanting to stop personalised adverts.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "'No comment': Heathrow boss asked if he should stay in job",
        "description": "Today programme presenter Emma Barnett asks Thomas Woldbye if people should be fired after Friday's disruption.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Trump rescinds order targeting law firm after it makes $40m promise",
        "description": "Paul, Weiss promised $40 million of free legal work to the White House and to change its diversity policies.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "UK chancellor: I will not 'tax and spend'",
        "description": "In an interview with the BBC's Laura Kuenssberg, Rachel Reeves opened up on the public finances and how she's finding the job.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "How did a single fire bring down Europe's busiest airport?",
        "description": "Questions have been raised over what caused the outage and why back-up systems failed?",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Honest or unrealistic? Roblox boss' online safety advice sparks debate",
        "description": "Hundreds of people contacted the BBC after Dave Baszucki spoke about safety on the hugely popular gaming platform.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "US to import millions of eggs from Turkey and South Korea to ease prices",
        "description": "A bird flu epidemic has caused egg prices to soar, and projections show they could rise by 41 percent this year.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Uber offers 20 hours of free childcare in bid to lure female drivers",
        "description": "A union says it should instead pay drivers more so they can take time off with their families.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Trump awards Boeing major contract to build 'most lethal' fighter jets",
        "description": "The F-47 fighter jet contract is a boost for Boeing, which has faced slumps in both military and civilian sales.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Ex-Abercrombie boss now facing abuse claims from 40 men",
        "description": "The new claims stretch back to the 1990s and alleged victims now include former A&F employees, lawyers say.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Trump uses emergency powers to boost mineral production",
        "description": "The executive order comes as the US president tries to reduce America's reliance on imports of the vital materials.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "UK government borrowing higher than expected in February",
        "description": "The latest figures for the UK economy add pressure on Chancellor Rachel Reeves ahead of her Spring Statement next week.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Court rules against K-pop group NewJeans in record label dispute",
        "description": "New Jeans and their record company, Ador, have been embroiled in a dramatic dispute for months.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Carney to call snap election as Canada faces trade war with US - reports",
        "description": "The former two-time central banker is expected to pitch himself as the candidate best equipped for a trade battle with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-23T07:23:23.142463"
    },
    {
        "title": "Selena Gomez and Benny Blanco Release New Album ‘I Said I Love You First’",
        "description": "To accompany the 15-track album, which is centered around the couple’s relationship, the pair have released a new music video for “Young and Hotter Than Me,” which also has Gomez reflecting on her life of child stardom.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Jack Harlow and Doja Cat Drop New Single “Just Us”",
        "description": "The two rappers also released a music video, which features cameos from John Mayer, Matt Damon and Nicholas Braun.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Japanese Breakfast Release New Album ‘For Melancholy Brunettes (& Sad Women)’",
        "description": "The album comes four years after the indie pop group's critically acclaimed 'Jubilee.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Reggae and Remembrance Take the Stage at New York’s City Winery",
        "description": "The organization If You Heard What I Heard presented a “Night of Resilience” with headliner Matisyahu.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "A Whitesell Brother’s Ex Is Pitching a TV Show",
        "description": "But it's not about the Whitesell Brothers. Instead, Ladan Rafii is taking meetings around town about a series based on her globe-trotting life as a UN officer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "How The Creative Coalition Will Converge on Capitol Hill",
        "description": "On April 25, TCC president Tim Daly and a horde of celebrity delegates will make their case to the White House and Congress for continued federal funding of the arts: \"Supporting the arts isn’t charity — it’s sound economic policy.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Primary Wave Finalizes Deal For Biggie Smalls Catalog",
        "description": "Sources previously told The Hollywood Reporter the rapper’s estate was seeking at least $100 million in the deal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Courtney Love is Making Her U.K. Move Permanent, Calls Trump 2.0 “Emperor-core”",
        "description": "\"Can’t get rid of me!\" the undisputed queen of grunge rock told the London crowd then slammed the Trump administration at a Royal Geographical Society event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Graydon Carter Has “Never Been Happier”",
        "description": "The storied onetime steward of Vanity Fair — and, at 75, a newly minted memoirist — sits with a former intern for a probing interview about guiding the influential magazine through a cultural minefield that included Harvey Weinstein, Jeffrey Epstein and Gwyneth Paltrow.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Rio Ferdinand, TV Pundit and Retired English Soccer Star, Signs With WME (Exclusive)",
        "description": "With the FIFA World Cup coming to North America next year, the agency will be focusing on securing broadcast, digital and commercial opportunities in the U.S.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Eminem’s Former Employee Charged With Leaking Rapper’s Music",
        "description": "Joseph Strange has been charged with criminal infringement of a copyright and interstate transportation of stolen goods.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "On ‘Hot,’ K-Pop Stars Le Sserafim Explore Love and Perseverance: “We Are Going to Give Our All”",
        "description": "The girl group discusses their favorite songs on their new EP and how their bond with one another has only grown since their debut: “We always say that we need all five of us together to be complete.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-23T07:23:23.900969"
    },
    {
        "title": "Aussie stuns NBA with absurd display",
        "description": "Australian star Josh Giddey has left jaws on the floor as he delivered an absurd stat line that simply has to be seen to be believed.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "9yo footy fan ‘in shock’ after mascot push",
        "description": "A nine-year-old boy’s mum has contacted police and the NRL after the South Sydney mascot didn’t take kindly to his high-five request.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Piastri’s ‘critical’ issue ahead of Chinese GP",
        "description": "Australia’s Oscar Piastri has one key focus if he wants to jump-start his 2025 F1 season when he starts from pole in China.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Star’s questionable act caught on camera",
        "description": "A West Coast Eagles star could find himself in hot water with the AFL after he was caught delivering a one-finger salute to rival fans.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Scrappy Bulldogs steal win from tough Eels",
        "description": "The Eels certainly aimed up against the Bulldogs but it wasn’t enough to get their first win of the season. Elsewhere, the Raiders and Sea Eagles face-off in front of a raucous crowd. Follow our coverage from Sunday’s NRL action.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "9yo footy fan ‘in shock’ after mascot push",
        "description": "A nine-year-old boy’s mum has contacted police and the NRL after the South Sydney mascot didn’t take kindly to his high-five request.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Star’s questionable act caught on camera",
        "description": "A West Coast Eagles star could find himself in hot water with the AFL after he was caught delivering a one-finger salute to rival fans.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Northball: Dees have no answers to thrillseeking Kangas",
        "description": "North Melbourne is putting Melbourne to the sword in a remarkable rout at Marvel Stadium. But a SuperCoach star has surprisingly missed the party. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Gardner ruled out of T20 series",
        "description": "A Queensland all-rounder has been rewarded for her good form by being named as the replacement for the injured Ashleigh Gardner in Australia’s T20 squad.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "England women’s Ashes drubbing claims big scalp",
        "description": "Following a humiliating Ashes result in Australia, the England women’s coach who cited ‘cultural’ differences as a factor in defeat, has been moved on.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "From world number one to rock bottom",
        "description": "At just 12, Todd Ley was the best juniors tennis player in the world and Australia’s next Lleyton Hewitt, until his world fell apart.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Star pushes back on Kyrgios’ shock lawsuit",
        "description": "Nick Kyrgios thought he was changing tennis for everyone when he put his name to a bombshell lawsuit, but not all of his fellow players are on-board.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "‘Brutal’: Season derailed by ‘devastating’ blow",
        "description": "Racing in SailGP is getting more fierce with every event but one team’s season is in trouble after an unlucky crash derailed their season.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Piastri eyes Chinese GP success after stunning drive to claim pole",
        "description": "Oscar Piastri will be out to capitalise on his stunning form in Shanghai when he starts from pole in the Chinese Grand Prix. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Piastri’s ‘critical’ issue ahead of Chinese GP",
        "description": "Australia’s Oscar Piastri has one key focus if he wants to jump-start his 2025 F1 season when he starts from pole in China.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Thomas, Daugunu, star as Reds end Highlanders drought",
        "description": "Queensland Reds have stormed to second on the Super Rugby ladder after a remarkable comeback to break a 12-year hoodoo against the Highlanders.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Rugby, cricket stars share captaincy tips",
        "description": "A bond forged on the junior sport ovals in Brisbane has improved the captaincy skills of rugby union’s Harry Wilson and cricket’s Nathan McSweeney.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Aussie star, family leave America ‘speechless’",
        "description": "A gesture of pure class has made Aussie NBA star Joe Ingles and his family the most heart-melting story of the season.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Absurd price of pop star’s proposal",
        "description": "The NFL quarterback signed to an eye-watering $350 million contract has dropped an absolute fortune for his pop singer partner.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Sam Kerr’s Matildas fate sealed",
        "description": "The Matildas will be back on home soil next month for a two-match series with South Korea, but Sam Kerr won’t be featuring.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Duke called into Socceroos squad",
        "description": "The Socceroos can take another important step towards FIFA World Cup qualification with a win over China in Hangzhou.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Boxing icon died with obscene secret fortune",
        "description": "George Foreman’s absurd wealth has come to light after his death on Saturday with the boxing legend earning a fortune with four simple words.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "The unlikely, but most fascinating, man in Heritage Classic chase",
        "description": "Jay Mackenzie may just be the most fascinating man on the tour. But this week, he’s bounced back to be among those putting pressure on the Heritage Classic leaders.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Coach fired after ‘thug’ act with 17yo’s hair",
        "description": "There has been widespread outrage after a veteran basketball coach was caught committing an ugly act in vision that has gone viral.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Million-dollar Hong Kong offers roll in for Qld star",
        "description": "Young Sunshine Coast trainer Billy Healey has revealed offers around the $1m mark have rolled in to buy new Queensland star Benzou after he blasted to an imposing win at Eagle Farm on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "From world number one to rock bottom",
        "description": "At just 12, Todd Ley was the best juniors tennis player in the world and Australia’s next Lleyton Hewitt, until his world fell apart.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    },
    {
        "title": "Iconic sports brand in big trouble",
        "description": "It wasn’t long ago everyone wore Nike or Adidas, now some of the world’s most iconic sportswear companies are in big trouble.",
        "source": "News AU",
        "fetched_date": "2025-03-23T07:23:26.386658"
    }
]