[
    {
        "title": "Sri Lanka eases vehicle import ban, but can people afford a new car?",
        "description": "A scarcity of vehicles to buy, the country's weak currency and high taxes have forced up prices of cars.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Canada and Mexico face 25% tariffs on Saturday, Trump says",
        "description": "The president also suggested he still plans to impose new tariffs on China but did not give any details.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Farmers in bird flu 'panic' call for UK vaccine plan",
        "description": "Vaccinating poultry against bird flu is still not allowed in the UK despite a rise in farm outbreaks.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "US economic growth slows despite consumers spending more",
        "description": "The world's largest economy missed forecasts after expanding at 2.3% between October and December.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Canada and Mexico face 25% tariffs on Saturday, Trump says",
        "description": "The president also suggested he still plans to impose new tariffs on China but did not give any details.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Five key impacts of Brexit five years on",
        "description": "The UK left the European Union on 31 January 2020.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "New non-opioid painkiller approved by US health agency",
        "description": "New drug suzetrigine, known by its brand name Journavx, has been approved to treat moderate to severe pain.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Apple iPhone sales dip despite AI rollout",
        "description": "The company's signature phone has been updated with artificial intelligence, but sales are down.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "How a US freeze upended global aid in a matter of days",
        "description": "The State Department says the freeze was the only way to evaluate aid programs and defended the pause.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Leaving X can be a tricky decision for brands",
        "description": "Many companies have left X but it's not always a simple decision.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Expert predicts no Fed rate cut before June - 29 Jan 2025",
        "description": "Mohamed El-Erian, chief economic adviser at Allianz, says we will have to wait quite a bit for another rate cut.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Meta to pay $25m to settle Trump lawsuit over ban",
        "description": "The president sued the firm in 2021 over the suspension of his accounts after the 6 January Capitol riots.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Trump attacks Fed after no change in interest rates",
        "description": "The US central bank keeps its key interest rate unchanged as it faces significant economic uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "'We were blindsided': Federal workers react to buy-out offer",
        "description": "Federal workers were told they could take part in a \"deferred resignation program\" in exchange for eight-months of pay.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Coca-Cola recalls drinks in UK due to chemical levels",
        "description": "The firm is recalling Coca-Cola products from shops, but says the risk of illness is \"very low\"",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "OpenAI says Chinese rivals using its work for their AI apps",
        "description": "ChatGPT maker says it will need extra protection from US government, following emergence of Chinese rival, DeepSeek.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Roman Abramovich could owe UK £1bn over tax dodge that helped bankroll Chelsea FC",
        "description": "Scheme to avoid tax on offshore billions may have been botched because money was managed from the UK, BBC learns.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Trump offers millions of federal workers eight months' pay to resign",
        "description": "The offer is part of the president's plan to shrink and reform the US government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Chancellor backs Heathrow expansion to boost UK growth",
        "description": "Rachel Reeves announces wide-ranging plans to get the UK's sluggish economy moving.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Garmin users say smartwatches have stopped working",
        "description": "Its Fenix 8 smartwatches, which retail for just under £1,000, are some of the devices to have issues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "US tech stocks steady after DeepSeek AI app shock",
        "description": "DeepSeek's claim that its model was made at a fraction of the cost of its rivals has rocked the AI industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Boeing loses almost $1bn every month in 2024",
        "description": "Boeing reported its second biggest annual loss ever after a tough year following a mid-air accident and worker strikes.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "UK will not be able to resist China's tech dominance",
        "description": "China's AI success has come from policy and Chancellor Rachel Reeves's recent visit to China highlights the importance of a close relationship.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "How China's 'AI heroes' overcame US curbs to stun Silicon Valley",
        "description": "How did a little-known Chinese start-up build a powerful new AI model despite restrictions?",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Abramovich dodged millions in tax with superyachts-for-hire scheme",
        "description": "Shell companies were used to charter the sanctioned oligarch’s yachts to himself, evading VAT, BBC reveals.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "China's DeepSeek AI shakes industry and dents America's swagger",
        "description": "The app spooked the markets as well as the bullish sense of American superiority in AI development.",
        "source": "BBC Business",
        "fetched_date": "2025-01-31T07:21:59.362622"
    },
    {
        "title": "Sean ‘Diddy’ Combs Hit With Revised Sex Trafficking Indictment",
        "description": "The superseding indictment doesn't contain any new charges. If convicted, the rap mogul faces a maximum sentence of life in prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Celebrities Fuel Super Bowl 2025’s Ad Lineup: Watch Ads With Chris Pratt, Eugene Levy, Meg Ryan, Billy Crystal and More",
        "description": "The biggest names for the big game.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Ben Vaughn, Nashville Music Publishing Veteran, Dies at 49",
        "description": "A beloved figure in the country music world, he served as President/CEO of Warner Chappell.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Marianne Faithfull, ‘As Tears Go By’ Singer, Dies at 78",
        "description": "The actress and Swinging London \"It\" girl of the 1960s was the subject of Rolling Stones songs including “Wild Horses” and “Sister Morphine.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Final Grammy Predictions: Beyoncé, Billie Eilish, Chappell Roan Poised to Rule Ladies Night",
        "description": "Top female talents will take on the Beatles at Sunday’s show, where THR expects they’ll prevail in the big four categories: album, record and song of the year and best new artist.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Matthew Perry Foundation and Massachusetts General Hospital Officially Launch Fellowship in Addiction Medicine",
        "description": "The Matthew Perry Foundation Fellowship in Addiction Medicine — the first official program to bear the late actor's name outside of the nonprofit — has selected Dr. Sarah \"SK Kler for its inaugural fellowship.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Where to Stream ‘Sonic the Hedgehog 3’ Online",
        "description": "Keanu Reeves joins the voice cast as Shadow in the third Sega video game-inspired film that features Ben Schwartz, Idris Elba, Colleen O'Shaughnessey and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "German Actors Protest Far-Right Vote in Parliament",
        "description": "A who's who of German talent signed an open letter calling for political leaders to \"uphold democratic values\" after a historic vote in the Bundestag that saw anti-immigration proposal pass with the support of the far-right.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Everyone Aboard American Airlines Jet That Collided With Army Helicopter Feared Dead",
        "description": "U.S. Figure Skating confirms \"several members of our skating community\" were on the flight: \"We are devastated by this unspeakable tragedy.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Mercenaries for Millionaires: Inside the Private Army That Protects L.A.’s Rich and Famous",
        "description": "THR spends a night battling looters and wildfires with Covered 6, the most successful — and, until now, secretive — private security force in Los Angeles. Is this the future of public safety? Or the end of equal protection?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Bill Burr Calls Howie Mandel a “Hollywood Whore” After Billy Corgan Ambush During Podcast Appearance",
        "description": "Mandel recently staged a surprise \"family reunion\" after Corgan revealed that he and Burr might be related.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Meryl Streep’s Escape From L.A. Fires Reportedly Involved Cutting Open a Fence to Drive to Safety",
        "description": "The three-time Oscar winner had to act quickly after a tree had blocked her car's path out of harm's way, according to an account from her nephew in New York Magazine.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-31T07:21:59.575586"
    },
    {
        "title": "Masrh injury blow adds to summer of woe",
        "description": "Australia is in search for a replacement to its Champions Trophy side after losing one of its more important players to injury.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Wallabies grudge match secured with Jones’ Japan",
        "description": "He left the Wallabies after a horror World Cup campaign to take a job in Japan some say he’d already lined up and now Eddie Jones will have to coach against his former players.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Ange keen to build on ‘great night’",
        "description": "Ange Postecoglou enjoyed Tottenham’s Europa League win over Elfsborg but wasn’t getting carried away, knowing Spurs must find some English Premier League form.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Richmond’s message to Balta after assault charge",
        "description": "Noah Balta has been asked to earn back trust after his assault charge as a concussion blow sent a star forward to the sidelines.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "‘There’s a deviation’: Healy fumes after DRS drama",
        "description": "Australia has taken the initiative in the women’s Ashes Test — but only after a DRS drama which had captain Alyssa Healy fuming. FOLLOW DAY 2 LIVE",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Masrh injury blow adds to summer of woe",
        "description": "Australia is in search for a replacement to its Champions Trophy side after losing one of its more important players to injury.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "‘Not ashamed’: Tennis stars get divorced",
        "description": "A star tennis couple have opened up about their secret divorce in a “shockingly big decision” that took fans and players by surprise.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Australia left reeling by ‘horrific’ Dokic reveal",
        "description": "Aussies are praising Jelena Dokic for her bravery after the tennis great recalled horrifying details of an incident with her abusive father.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Richmond’s message to Balta after assault charge",
        "description": "Noah Balta has been asked to earn back trust after his assault charge as a concussion blow sent a star forward to the sidelines.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Update on AFL great accused of sex with 9yo",
        "description": "The prosecution has revealed how many witnesses it is considering in the trial of a former AFL legend accused of historical sexual abuse.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Star’s massive first task as Eels skipper",
        "description": "Mitch Moses has only been captain for a couple of days, but he faces his first major test and it’s all to do with his powers of persuasion.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "‘It’s just a number’: Rep star set for switch",
        "description": "Patrick Carrigan may be one of the best locks in the world, but he’s willing to play a new role in 2025 if it helps the Broncos.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Heartbreak as US icon’s worst fears realised",
        "description": "An American legend has been brought to tears when revealing her devastating personal connection to the Washington plane crash tragedy.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Horror as WWE star rushed to hospital",
        "description": "A WWE star has suffered gruesome injuries after a sickening incident that saw him collapse on live television.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Tragedy as teen gymnast falls from pole, dies",
        "description": "A rising gymnast was killed in tragic circumstances after falling from a pole during chaotic scenes in Philadelphia.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Fans brawl in the stands at basketball game",
        "description": "A college basketball game had to be stopped as a wild brawl broke out in the stands, leaving the commentators stunned.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Ange keen to build on ‘great night’",
        "description": "Ange Postecoglou enjoyed Tottenham’s Europa League win over Elfsborg but wasn’t getting carried away, knowing Spurs must find some English Premier League form.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Another ‘Roos keeper on the move",
        "description": "Socceroo Joe Gauci’s quest for game time has taken him from the Premier League to the third tier of English football.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "UFC 312: Volk teammate promises to get revenge on Topuria",
        "description": "Colby Thicknesse was listening to Triple J’s Hottest 100 countdown when he received a message that changed his life. Now the Wollongong fighter has vowed to get revenge.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Aussie F1 star ‘on borrowed time already’",
        "description": "Australia’s Jack Doohan is under “massive pressure” to keep his spot in Formula 1 amid mounting speculation he’s on “borrowed time”.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Basketball Australia U20 Nationals Hub: How to watch live, schedules, key info",
        "description": "Finals have arrived at the Basketball Australia Under-20 & Ivor Burge National Championships and every match will be live. See how to watch and find the LIVE STREAMS here.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Aussie champ unveils major change",
        "description": "Adam Scott won the Masters after turning to a long putter and another Australian superstar has wheeled out the long stick for the first time.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "$1.25m filly ready for debut in Chairman’s Stakes",
        "description": "A $1.25m filly will debut in the Group 3 Chairman’s Stakes at Sandown but bookmakers are lukewarm about her chances.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Wallabies grudge match secured with Jones’ Japan",
        "description": "He left the Wallabies after a horror World Cup campaign to take a job in Japan some say he’d already lined up and now Eddie Jones will have to coach against his former players.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Waugh: Home World Cup is the Wallabies’ chance for redemption",
        "description": "Rugby Australia chief Phil Waugh declares the 2027 Rugby World Cup at home the Wallabies’ chance for redemption, as Melbourne misses out on blockbuster games.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-01-31T07:22:00.799556"
    }
]