[
    {
        "title": "Trump launches plan to target countries with new tariffs",
        "description": "The US president ordered his staff to develop a response to countries with trade policies he says are unfair.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "TikTok returns to Apple and Google app stores in the US",
        "description": "TikTok is again available on app stores in the US after President Donald Trump delayed a ban on the app.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "UK signals it will seek US steel tariff exemption",
        "description": "Business secretary Jonathan Reynolds says the government has a strong case to avoid tariffs on UK-made steel entering the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Jeff Bezos space firm Blue Origin to cut a tenth of jobs",
        "description": "The company is looking to trim manager ranks and focus on ramping up rocket launches.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "TikTok returns to Apple and Google app stores in the US",
        "description": "TikTok is again available on app stores in the US after President Donald Trump delayed a ban on the app.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Modi hails US-India 'mega partnership' in Trump meeting",
        "description": "Trump and Modi, who share warm personal ties, met in the shadow of trade tensions complicating US-India relations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "More migrant workers claim UK farm exploitation",
        "description": "The UK government says it always takes \"decisive action\" where abusive practices are found on farms.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Beyoncé fans braced for ticket rush - and high prices",
        "description": "Tickets for Beyoncé's latest UK dates go on general sale on Friday, with prices reaching up to £950.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "The chancellor of the UK and her expenses before she became an MP",
        "description": "BBC News has learnt that there was an expenses investigation into Rachel Reeves, and two other senior managers, when she worked at HBOS.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "'On a power trip' or 'obviously brilliant'? Americans weigh Musk's influence",
        "description": "The world's richest man is leading a sweeping cost-cutting drive. What do voters in a key swing state make of his role?",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Honda-Nissan multi-billion dollar merger collapses",
        "description": "The Japanese car making giants aimed to combine their businesses to compete against Chinese rivals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Trump moves to close entries to government worker buyout programme",
        "description": "About 75,000 government employees have reportedly opted into the programme, which is designed to shrink the workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Igloo recalls coolers over finger amputations and injuries",
        "description": "People have reported other injuries including finger lacerations and bone fractures from using the product.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Unofficial TikTok downloads surge in the US",
        "description": "Many people are turning to so-called \"sideloading\" because the app is unavailable on official stores.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "UK chancellor's CV exaggerated time at Bank of England",
        "description": "The BBC has established that Rachel Reeves left the financial institution nine months earlier than she states in her LinkedIn profile.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Hundreds of foreigners freed from Myanmar's scam centres",
        "description": "Thai Prime Minister Paetongtarn Shinawatra has pledged to close scam centres along the Thai-Myanmar border.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Erasing Escobar: Will Colombia ban the sale of memorabilia of the drug lord?",
        "description": "Politicians in the country want to prohibit the sale of such items, but they face opposition.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "US inflation unexpectedly increases",
        "description": "US inflation increased by more than expected last month, pushing up the cost of living for Americans.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Sicily's gangsters complain they can't get the staff",
        "description": "An investigation reveals a crime group having to adapt to modernity and displaying a nostalgia for past ambitions.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Is it checkmate for South Africa after Trump threats?",
        "description": "The US president is ratcheting up pressure on South Africa over its domestic and foreign policy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Canada leaders take push against tariffs to White House",
        "description": "All 13 of Canada's provincial and territorial leaders were in the US capital as the country seeks to avoid punitive trade tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Ex-Google boss fears for AI 'Bin Laden scenario'",
        "description": "Eric Schmidt says AI technology could \"harm innocent people\" if it ends up in the wrong hands.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Why India fails to protect its domestic workers despite decades of abuse",
        "description": "Despite the high demand for domestic workers, they remain India's most vulnerable and exploited people.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Santorini fears for summer tourist season as earthquakes hit island",
        "description": "The Greek island's most important industry will bounce back, but staffing is a worry say hoteliers",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "Chevron to cut as much as 20% of workforce",
        "description": "Chevron said the move was part of a wider cost-cutting effort, which will see it expand automation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-14T07:22:09.061782"
    },
    {
        "title": "White House Kerfuffle Erupts Over Use of ‘Gulf of Mexico’ Amid Trump’s New ‘Gulf of America’",
        "description": "The Associated Press is in the crosshairs of the Trump administration after refusing the change the name of the body of water in its journalism after 400 years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Robert F. Kennedy Jr. Is Confirmed as Trump’s Health Secretary After Close Senate Vote",
        "description": "The GOP fell in line behind the president despite hesitancy over Kennedy's views on vaccines, voting 52-48, with Kentucky Sen. Mitch McConnell, who had polio as a child, the only \"no\" vote among Republicans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Universal Music Group and Music Health Alliance Launch Music Industry Mental Health Fund",
        "description": "The new initiative expands upon the company’s four-year partnership with one another.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "‘The Brutalist’ and ‘Challengers’ Among Society of Composers and Lyricists Award Winners",
        "description": "Diane Warren also earned an award for her Oscar-nominated song “The Journey” from ‘The Six Triple Eight.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "‘It Ends With Us’: Blake Lively Subpoenas Phone Records and More to Debunk Justin Baldoni’s Claims",
        "description": "Lively's legal team is subpoenaing crisis PR firm consultant Jed Wallace, as well as AT&T, Verizon, T-Mobile, Cloudflare, Inc. and AOL.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Stephen A. Smith Doubles Down on Criticism of Serena Williams’ Super Bowl Halftime Cameo",
        "description": "“If I’m married and my wife is going to join trolling her ex, go back to his ass, ’cause clearly you don’t belong with me,” the ESPN commentator said about the tennis star, who previously dated Drake.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Matthew Koma Sells “F*** Ye” T-Shirt in Response to Kanye West’s Antisemitic Tirades",
        "description": "The singer-songwriter says all proceeds from T-shirt sales will benefit Holocaust survivors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Shonda Rhimes Resigns From Kennedy Center Board as Trump Installs Himself as Leader",
        "description": "Ben Folds, Renée Fleming and Kennedy Center president Deborah F. Rutter also left the institution Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Ben Folds Resigns as Artistic Director of NSO After Trump Move to Replace Leadership",
        "description": "On Wednesday, Trump posted on Truth Social that he had been elected chair of the Kennedy Center. President Deborah F. Rutter has also departed the institution, as has Renée Fleming and Shonda Rhimes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Grimes Speaks Out After Ex-Partner Elon Musk Brings Their Son to Oval Office Press Conference",
        "description": "The 4-year-old made for an adorable distraction as the DOGE hatchet man spoke of deep cuts across the government.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Naya Rivera’s Ex Shares Her Final Moments Recalled by Their Son",
        "description": "\"It just rocks my world that he had to witness her last moments,\" Ryan Dorsey said of their son, who was with Rivera before she drowned while swimming in Lake Piru.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "The Social Stars Who Broke Out During Trump’s First Term Return for an Encore None of Them Wanted",
        "description": "Sarah Cooper, Randy Rainbow and other jesters who came to fame during Trump 1.0 explain why they can’t quit him, even if they desperately want to: “It’s hard to take our nation as seriously after re-electing him.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-14T07:22:09.924146"
    },
    {
        "title": "Young Swan caught buying illicit substance",
        "description": "The Swans youngster, who played five matches in 2024, has been suspended for the first two rounds of the upcoming AFL season.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Young Swan banned for illicit drugs",
        "description": "A young Sydney Swan has been banned for breaching the AFL’s illicit drug policy.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "AFL star’s heartbreaking apology at funeral",
        "description": "Friends and family of AFL star Troy Selwood have gathered to pay tribute to the beloved player and dad at an emotional service.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Footy greats stitch up AFL fans in epic prank",
        "description": "The Kayo Call Up top ten were told they would partake in a serious interview with Fox Footy talent. They weren’t told one detail.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Twin fifties steer Sri Lanka to dominant start in ODI",
        "description": "Australia’s batters have a last chance to press their claims for the opening game of the Champions Trophy, but it’s Sri Lanka’s top order starring in Colombo.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "‘System has failed’ Kuhnemann: O’Keefe",
        "description": "Former Test bowler Steven O’Keefe says Cricket Australia failed Matt Kuhnemann after the off-spinner was cited for a suspect action in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Shock career move after star flees country",
        "description": "Italian tennis star Camila Giorgi has changed her career again after sensationally quitting tennis to become a lingerie model last year.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Tennis world loses it over de Minaur speech",
        "description": "Alex de Minaur lost the final, but won the crowd with a classy speech before he let slip a secret he had carried all week.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Young Swan caught buying illicit substance",
        "description": "The Swans youngster, who played five matches in 2024, has been suspended for the first two rounds of the upcoming AFL season.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Young Swan banned for illicit drugs",
        "description": "A young Sydney Swan has been banned for breaching the AFL’s illicit drug policy.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "NRLW Market Watch: Chase for game’s leading tryscorer heats up",
        "description": "The leading tryscorer in NRLW history, Teagan Berry, will make a decision on her future within the next fortnight amid a hot chase from several heavyweight NRLW clubs – and she’s not the only sought-after star.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "‘Love to’: All Stars coach’s big plans",
        "description": "Jess Skinner will lead the Jillaroos against England next month, but she wants to go from an interim to the full-time coach leading into next year’s World Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "$178m NFL trainwreck ends, reason revealed",
        "description": "Aaron Rodgers’ divorce from the New York Jets has gotten messier with the team explaining why the quarterback was cut.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "‘Expect greatness’: Simmons fired up for new start",
        "description": "After getting to work at his new NBA team, the Australian star says he’s ready to put years of frustration and disappointment behind him.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Kerr photos say it all as next move revealed",
        "description": "Sam Kerr has shared photos for the first time since she was acquitted at her racial harassment trial and the images say it all.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "‘Enough’: Chelsea’s call after Sam Kerr verdict",
        "description": "The fallout from Sam Kerr’s London court hearing continues, this time with her club side deciding its next step.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Olympics chaos as bombshell lawsuit drops",
        "description": "Imane Khelif has hit out after a bombshell lawsuit dropped regarding her controversial gold medal win at the Paris Games.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Schumacher wife upset over prison sentence",
        "description": "Sentences have been handed down and new details have emerged about the plot to blackmail the family of Formula 1 legend Michael Schumacher.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Star trio fires as 36ers conquer the Kings",
        "description": "A spirited Sydney fightback was ultimately no match for the star-studded Adelaide 36ers who will live to fight another day in the NBL playoffs.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Adelaide erupts at miracle LIV ace",
        "description": "A party hole hole-in-one is the most hoped for shot at a golf tournament and it took just two holes to happen in Adelaide.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "J-Mac: Why Switzerland has big edge on rival colts in Lightning",
        "description": "James McDonald is expecting a great clash between the three-year-olds in the Group 1 Lightning Stakes but says Switzerland has a crucial advantage among the colts.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Brumbies don’t mind playing the dark horse role",
        "description": "Nobody is picking the Brumbies to win the Super Rugby title this year, and that’s just how the team like it according to playmaker Noah Lolesio.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Suaalii’s new position revealed ahead of Super Rugby opener",
        "description": "After missing NSW’s final trial match against the Brumbies a fortnight ago, Super Rugby’s highest-profile recruit has been given a positional switch for his Waratahs debut.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-14T07:22:11.938752"
    }
]