[
    {
        "title": "Will Trump's victory spark a global trade war?",
        "description": "Trump has promised tariffs on all foreign goods. If he follows through, many smaller economies may be forced to respond in kind.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Bank of England expected to cut interest rates",
        "description": "Most analysts predict the rate will fall from 5% to 4.75% when the decision is announced at 12:00 GMT.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "US shares and Bitcoin hit record highs on Trump win",
        "description": "The result could have a far-reaching implications for tax and trade policy, as well as economies around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Shopping giant Temu removes copies of tiny firm's cards",
        "description": "A small business owner says identical versions of her products were copied without permission.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Mystery fires were Russian 'test runs' to target cargo flights to US",
        "description": "The attacks targeted couriers in Poland, Germany and the UK, Polish prosecutors say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Bank of England expected to cut interest rates",
        "description": "Most analysts predict the rate will fall from 5% to 4.75% when the decision is announced at 12:00 GMT.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "What Musk could gain from a Trump presidency",
        "description": "One of the president-elect's most visible supporters, Musk could be given a role in Trump's White House.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Australia plans social media ban for under-16s",
        "description": "The government says it wants to mitigate the \"harm\" social media is inflicting on children.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Moldova cleans up its act to attract foreign businesses",
        "description": "Deputy PM admits former Soviet state was until recently a 'highly corrupt country' - but insists things are changing fast.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "US shares and Bitcoin hit record highs on Trump win",
        "description": "The result could have a far-reaching implications for tax and trade policy, as well as economies around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Disinformation poses 'biggest risk in the US' - 5 Nov 2024",
        "description": "Global political risk expert says disinformation paired with a close outcome poses the biggest risk in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Trade, aid, security: What does Trump's win mean for Africa?",
        "description": "During his first stint critics accused him of dismissing Africa, so what will happen under Trump 2.0?",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "'It's simple, really' - why Latinos flocked to Trump's working-class coalition",
        "description": "As well as winning over Hispanic voters, Trump improved his position in some surprising corners.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Netflix Europe offices raided in tax fraud probe",
        "description": "The raid is part of an investigation in France and the Netherlands that began in November 2022.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Boeing workers end 7-week strike on 38% pay rise deal",
        "description": "The damaging walkout by around 30,000 unionised Boeing workers started on 13 September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Elon Musk can keep giving $1m to voters, judge rules",
        "description": "The giveaway is not a lottery-like contest and the recipients are not chosen randomly, his lawyer said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Jantelagen: Why Swedes won't talk about wealth",
        "description": "In Sweden, a deep-rooted cultural code called Jantelagen stops many from talking about their wealth.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "French families sue TikTok over harmful content",
        "description": "The platform is accused of exposing seven children to videos promoting self-harm, and suicide.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "The environmental campaigners fighting against data centres",
        "description": "A growing global movement is seeing people object to data centres in their locality.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Hunt for Bitcoin's elusive creator hits another dead end",
        "description": "Why are we still no closer to unmasking the mysterious Satoshi Nakamoto?",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "'Lying talent agent left us in lurch without cash and hope'",
        "description": "A talent agent who supplied actors to shows on the BBC and Netflix withheld cash due to them, former clients claim.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "DNA-testing site 23andMe fights for survival",
        "description": "Once used by millions to discover their family histories, this week 23andMe was almost delisted. What went wrong?",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Weight-loss drug firm Wegovy invested £6bn in this town. So why is it not booming?",
        "description": "Europe's most valuable company has invested billions in Kalundborg on Denmark's coast - but it has many problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Living with Nigeria's blackouts - six weeks, no power",
        "description": "Large parts of Nigeria are experiencing power outages due to problems with the country's grid.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "US jobs growth slows sharply as election looms",
        "description": "Employers added 12,000 jobs in October, much lower than the 223,000 created in September, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-07T07:22:23.952544"
    },
    {
        "title": "George Gascón Loses Los Angeles District Attorney Race",
        "description": "All eyes are on Nathan Hochman, L.A. County's new top prosecutor who'll decide whether to continue to support resentencing Lyle and Erik Menendez.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Channel 4 Kicks Ex-U.K. Prime Minister Boris Johnson Out of Election Panel for Plugging Book",
        "description": "The co-host of Channel 4's U.S. election program told Johnson that promoting his book was \"so cheap\", to which the former Tory MP replied: \"There’s absolutely nothing you can do to stop me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "World Leaders, Including Netanyahu, Starmer, Congratulate Trump: “History’s Greatest Comeback”",
        "description": "After the Republican and former reality television star emerged victorious, he was sent a host of congratulations from politicians on X, including the Israeli Prime Minister: \"This is a huge victory!\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "It’s Official: Donald Trump Elected 47th President of the United States",
        "description": "Trump was declared winner in Wisconsin, which took him over the 270 electoral votes he needed to return to the Oval Office.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Police Ask U.K. Prosecutors to Consider Charging Russell Brand Over Sexual Assault Allegations",
        "description": "The Metropolitan Police confirmed in a statement to THR that their file, which includes allegations of sexual assault against the former comedian, has been passed on to prosecutors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Hollywood Reacts to Second Trump Presidency Win: “A Sign of Deep Nihilism”",
        "description": "The likes of Adam McKay, Bette Midler, Sophia Bush, Stephen King, John Cusack, Christina Applegate reacted to Donald Trump's inevitable win with a mixture of shock, anger, confusion and mainly sadness.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Donald Trump Wins Pennsylvania, Claims Victory as He Nears Taking Presidency for Second Time",
        "description": "The mogul-turned-politician looks likely to defeat Vice President Kamala Harris, winning a second, non-consecutive term after reviving his populist movement and parlaying his following into a GOP takeover.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Hollywood Anxiously Awaits Election Results",
        "description": "Bette Midler, Katie Couric, Yvette Nicole Brown and John Cusack are among Hollywood celebrities sharing their anxieties over the results of the 2024 election.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "2024 Election Senate Race: Republicans Take Majority as Sherrod Brown and Jon Tester Lose, Adam Schiff Wins",
        "description": "Democratic efforts to oust firebrand Republicans Ted Cruz of Texas and Rick Scott of Florida collapsed.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Chris Pratt Says Americans Need to Support Each Other Despite the Presidential Election Result",
        "description": "\"How do we become a nation of honorable winners and graceful losers?\" he wrote. \"It starts with remembering no matter who wins or loses, there are still going to be people who need help in this country.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Filmmakers Who Landed Julia Roberts, George Clooney to Narrate Ads Speak Out on Provocative Spots That Riled Conservatives",
        "description": "Colin Keith Gray and Megan Raney Aarons reveal how a \"small, sort of scrappy outsider team\" turned out viral ads that have \"ruffled feathers for factions of the right\" and incited a response from Donald Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "Anne Hathaway Invokes Sabrina Carpenter, Asks Students to “Please Please Please” Stay in Line to Vote",
        "description": "\"Please, please, please stay on the line,\" sings to the tune of Carpenter's hit song. \"Voting is magic but also annoying.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-07T07:22:24.171119"
    },
    {
        "title": "AFL great fails in bid Lord Mayor tilt",
        "description": "An AFL legend who played nearly 300 games with Carlton has just failed in his bid to be Lord Mayor of one of Australia’s biggest cities.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "‘Absolute legend’: World reacts to Raygun news",
        "description": "Raygun’s decision to hang up the Aussie tracksuit and retire the “kangaroo” has sparked a huge response around the globe.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Injury blow for quick after new-ball masterclass",
        "description": "A veteran fast bowler gave the Australian selectors a timely reminder of his quality but then suffered an awful setback.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "AFL great fails in bid Lord Mayor tilt",
        "description": "An AFL legend who played nearly 300 games with Carlton has just failed in his bid to be Lord Mayor of one of Australia’s biggest cities.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "AFL great fails in bid Lord Mayor tilt",
        "description": "An AFL legend who played nearly 300 games with Carlton has just failed in his bid to be Lord Mayor of one of Australia’s biggest cities.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "AFL great fails in bid Lord Mayor tilt",
        "description": "An AFL legend who played nearly 300 games with Carlton has just failed in his bid to be Lord Mayor of one of Australia’s biggest cities.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Iron man Edwards is a rugby league marvel",
        "description": "He’s already won the NRL title and his maiden State of Origin series, and Dylan Edwards is now just 80 minutes away from capping off a dream year where he put his body through hell.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Four words ended star’s Roosters career",
        "description": "A stunning interview where Roosters star Terrell May made a big admission has been revealed as the catalyst for his looming exit from the club.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Injury blow for quick after new-ball masterclass",
        "description": "A veteran fast bowler gave the Australian selectors a timely reminder of his quality but then suffered an awful setback.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "‘In shock’: Test star blasts Cricket Australia",
        "description": "A former Aussie Test player has slammed the response to ball tampering claims, claiming “if it wasn’t India it would be different.”",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Jelena Dokic in tears over Australia defection",
        "description": "Jelena Dokic has declared she would accept “100 years of abuse” to take back one decision she regrets most from her tennis career.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Demon ends 20-year drought with ‘incredible’ feat",
        "description": "Alex de Minaur has pulled out of an ATP Tour event after learning he will end an Australian drought that has stood since Lleyton Hewitt.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "F1 team sacks both drivers, grid complete",
        "description": "The 2025 F1 grid is all but locked in after confirmation two drivers from the same team would depart, with a young gun joining F1.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Hamilton’s three-word response says it all",
        "description": "A wide range of F1 drivers responded to Max Verstappen’s latest Grand Prix win that virtually sewed up this year’s world title.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "‘Absolute legend’: World reacts to Raygun news",
        "description": "Raygun’s decision to hang up the Aussie tracksuit and retire the “kangaroo” has sparked a huge response around the globe.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "MJ responds as US election claim goes viral",
        "description": "Basketball icon Michael Jordan has been forced to shut down a wild rumour ahead of the US election on Wednesday.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Who is the NFL MVP at the season’s halfway mark?",
        "description": "It’s halfway through the NFL season: who’s the midpoint MVP and after a frenzied NFL trade deadline, which contenders have loaded up?",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Superstar goes nuclear on NBA reporter",
        "description": "An NBA superstar has been handed a three-game ban after a “physical” change room altercation over a reporter’s column.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Jets owner’s plea to A-League clubs",
        "description": "Jets co-owner Justin Pascoe has high hopes for the future of Newcastle and the A-League but only if all clubs are on the same page.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Fans rage over famous singer’s new gig",
        "description": "The decision to use a globally recognised singer in commentary for a Champions League game has not gone down well.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "‘Going to die’: Harrowing account in rape case",
        "description": "A woman broke down as she told court she thought she was going to die and would never see her daughter again during an alleged rape by Conor McGregor.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Smith in ‘good spot’ after Qld PGA",
        "description": "Despite a frustrating final round at the Queensland PGA, Cam Smith is pleased with the way his golf is trending.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Early NBA calls: Giddey $45m reality, Aussie key to trade win",
        "description": "The NBA season is back in full swing and FOXSPORTS dived into some bold predictions, hot takes and general overreactions for the marathon season ahead.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Wallabies shock: Suaalii to start, five years after last rugby game",
        "description": "Joseph-Aukuso Suaalii’s rapid ascension to the top of Australian rugby will take another giant leap this weekend – with the NRL convert handed a shock debut against powerhouse England.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Skelton seeks World Cup redemption",
        "description": "Will Skelton still feels the pain of the Wallabies’ poor 2023 Rugby World Cup campaign.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Exceptional Explicit to launch farewell tour in Topgun",
        "description": "Australia’s number 1 sprinter Explicit launches his Dream Chasers Festival campaign in Saturday night’s Topgun at The Meadows.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-07T07:22:26.414793"
    }
]