[
    {
        "title": "Boeing seeks up to $35bn as costly strike drags on",
        "description": "The firm aims to secure the new funding as a walkout by more than 30,000 workers enters its second month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Lufthansa hit with record penalty after barring Jewish passengers",
        "description": "The German airline has agreed to pay $4m to resolve claims it discriminated against Jewish passengers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Boba tea company apologises over Canada Dragons' Den row",
        "description": "Marvel actor Simu Liu accused Canadian entrepreneurs of culturally appropriating the Taiwanese drink.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "What could happen if Donald Trump drastically increases tariffs as he has promised to do?",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Prague to ban organised night-time pub crawls",
        "description": "Travel agency-organised pub crawls will be banned in the Czech capital at night, the council says.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Lufthansa hit with record penalty after barring Jewish passengers",
        "description": "The German airline has agreed to pay $4m to resolve claims it discriminated against Jewish passengers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Fake vintage wine gang busted in France and Italy, police say",
        "description": "The group is alleged to have made fake labels from famous French vineyards, using them to sell cheap wine.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Google turns to nuclear to power AI data centres",
        "description": "The tech giant says it will use energy from small reactors to power its use of artificial intelligence.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "UK interest rate cut hopes raised as wage growth slows",
        "description": "Expectations of a rate cut next month increase as pay growth slows to its lowest rate for more than two years.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Boba tea company apologises over Canada Dragons' Den row",
        "description": "Marvel actor Simu Liu accused Canadian entrepreneurs of culturally appropriating the Taiwanese drink.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Expert says good US corporate earnings likely - 14 Oct 2024",
        "description": "Market Strategist Matt Orton says he is optimistic about corporate earnings expected this week.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Trump electric vehicle attacks hit home for Michigan voters",
        "description": "Trump’s EV criticism is part of his broader economic message as he tries to appeal to voters in the key swing state.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Unemployed in UK could get weight loss jabs to return to work",
        "description": "The health secretary announces trials to explore the effect of weight loss drugs on worklessness.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "American equal pay icon Lilly Ledbetter dies aged 86",
        "description": "Alabama woman's case led to law, signed by Barack Obama, that gave Americans more rights to sue for pay discrimination.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "‘I lost £165k to fraud in an hour’ - customers say they were let down by Revolut",
        "description": "Revolut was named in more complaints about fraud last year than any of the UK’s biggest banks or e-money services.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Thousands of cars that crash in US are ending up in Russia",
        "description": "The South Caucasus nation of Georgia has a huge used car market, with many vehicles finding their way over the border.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Reeves signals hike in National Insurance for firms",
        "description": "The chancellor was speaking at the government's International Investment Summit, where deals worth £63bn were hailed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Why is the latest SpaceX rocket test a big deal?",
        "description": "The BBC's Pallab Ghosh explores why this world first test is a big deal for space exploration.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "UK inflation in surprise fall to lowest in three years",
        "description": "The drop to 1.7% paves the way for the Bank of England to cut interest rates again next month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Mental health patients to get job coach visits",
        "description": "Pensions Secretary Liz Kendall says trials of the idea have produced \"dramatic results\".",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Housing charity to close due to funding problems",
        "description": "Rural Housing Scotland was set up in 2001 to help tackle homelessness and affordable home shortages.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Inside the £70K ‘mafia-style’ champagne shoplifting gang",
        "description": "A crime gang has stolen more than £70,000 of goods from UK supermarkets in 18 months, the BBC hears.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "National Insurance fears spark business backlash",
        "description": "The government is facing criticism by businesses over a potential tax rise that would fall on employers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "What is NI and how much do workers and employers pay?",
        "description": "Two National Insurance cuts came info effect in 2024, but many people are still paying more in tax.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "How quickly are prices rising in the UK?",
        "description": "The rate at which prices are rising has nudged back above the Bank of England's target of 2%.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Was Keir Starmer's investment summit a success?",
        "description": "2 days agoBusiness",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-16T07:23:35.414126"
    },
    {
        "title": "Kamala Harris Might Be Going on Joe Rogan’s Podcast",
        "description": "The vice president's team has been talking to the Austin-based podcaster about a potential sitdown in an effort to court male voters.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Jay Park on Why He Was Determined to Finish His R&B Album and Producing New K-Pop Groups",
        "description": "The Seattle-born rapper, singer and CEO opens up about his creative process and his plans to debut idol groups through his label, More Vision: \"I am very confident in the group of kids that we have.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "ILLIT, KATSEYE and RIIZE to Perform at First-Ever L.A. Ceremony of K-Pop-Centric MAMA Awards",
        "description": "The CJ Entertainment-produced award show, touted as the \"No. 1 K-Pop awards,\" will hold the first night of the two-day long ceremony at the Dolby Theatre, marking the show's first expansion into the U.S.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Doug Emhoff Reviews His ‘SNL’ Impersonators: “The Group Chats Blow Up”",
        "description": "Martin Short or Andy Samberg — who did it better?",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "“Dear Remy”: Hollywood Career Coach Gives Advice on Box Office Blues and Mid-Life Glow-Ups",
        "description": "This week, Remy Blumenfeld, our resident expert on everything, helps an under-appreciated cinematic genius, an actress whose husband has glown up and a writer wondering if he should reconnect with an old partner.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Hollywood’s Highest-Profile Harris Endorsements: Taylor Swift, George Clooney, Bruce Springsteen and More",
        "description": "Celebrities have expressed their support for the Democratic ticket this November. Here's 11 of the biggest names.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Riize’s Management Says Seunghan Is Leaving the K-Pop Group Days After Announcing His Return",
        "description": "Official social media accounts had initially announced the 21-year-old would be returning to the group after nearly a yearlong hiatus.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "‘I, Robot’ Director Mocks Elon Musk for Tesla Ripping Off Film for Optimus, Robotaxi: “Can I Have My Designs Back Please?”",
        "description": "After Tesla's planned robot products were presented, social media called out the company for aping the 2004 film, with even director Alex Proyas weighing in.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Arlene Winnick, Veteran Entertainment Publicist, Dies at 77",
        "description": "Winnick worked in Hollywood for more than 30 years, most recently at Digney & Co. Public Relations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Kanye “Ye” West Sued by Ex-Assistant for Allegedly Drugging, Sexually Assaulting Her During a Diddy Studio Session",
        "description": "Lauren Pisciotta previously sued her former employer for sexual harassment, breach of contract and wrongful termination.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "The Blacklisting of a Great Artist: Paul Robeson’s Exile From Hollywood",
        "description": "A preeminent artist-activist of the mid-twentieth century, his banishment by the studios lasted longer than any other performer of the blacklist era — twenty-five years, ending only with his death.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Channing Dungey Praises Debra Lee for Shattering Barriers, Paving the Way for Women of Color in Media",
        "description": "The former BET CEO and Warner Bros. Motion Picture Group co-CEO Pamela Abdy were both honored at Big Brothers Big Sisters Los Angeles gala.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-16T07:23:35.652041"
    },
    {
        "title": "Deadline day live: Late twist in Stringer’s Giants trade",
        "description": "Trade deadline day is officially underway, with several clubs racing the clock to seal important deals. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Players revealed as Hayne detail emerges",
        "description": "GWS players have been named and now details of the “offensive” dress-up skits involving high-profile figures are also coming to light.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Giants drop a bomb on wantaway star",
        "description": "Jake Stringer was seeking a longer term move away from the Bombers, but his hopes were dashed as a potential trade fell apart.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "‘Hard to say’: Lions uncertain on draft bids",
        "description": "Brisbane will continue to seek pick swaps with other clubs as it prepares for “any scenario” trying to match bids for two gun prospects.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Deadline day live: Late twist in Stringer’s Giants trade",
        "description": "Trade deadline day is officially underway, with several clubs racing the clock to seal important deals. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "‘Best player in it’: Pies claim trade victory",
        "description": "Collingwood says it has struck the right balance with its trade period mentality as a key decision looms between two Saints.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Test your knowledge with our ultimate NRL 2024 quiz",
        "description": "Think you know your rugby league? Were you paying attention throughout the 2024 NRL season? Take our quiz and put your knowledge to the test.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "NRL star’s $130k Bali baby nightmare",
        "description": "Sharks star Jesse Ramien is fighting to get his newborn son home to Australia after his premature birth in Bali, with costs to do so now exceeding $130,000.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "‘Heartbroken’ Aussie gun heads for surgery",
        "description": "As Cameron Green flew to Christchurch for crucial back surgery the man who could be asked to shoulder more Test bowling said he was ready to stand up",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "40-year Ashes first confirmed",
        "description": "For the first time in more than four decades, an Ashes series in Australia won’t start at the Gabba.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Kyrgios invite as tennis firebrand heads to Brisbane",
        "description": "American firebrand Frances Tiafoe is headed to Brisbane and could be joined by former champion Nick Kyrgios with the invitation laid out.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Kyrgios roasts Tomic over 39-min bloodbath",
        "description": "Nick Kyrgios couldn’t resist sledging Bernard Tomic after the forgotten Aussie tennis star made history in the worst way possible.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Bizarre twist after Bathurst 1000 ‘assault’",
        "description": "New footage has emerged after claims a motorsport engineer was assaulted following the Bathurst 1000.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Bathurst crew winner ‘attacked’, hospitalised",
        "description": "Bathurst champion Brodie Kostecki has dropped shock news a member of his team has been “attacked”. Police are investigating.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Banished Olympian cashes in on OnlyFans",
        "description": "An Olympic swimmer who was kicked out of the athlete’s village has announced her next career move following the Paris Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Surprising side of WAG’s cancer diagnosis",
        "description": "An AFL WAG battling a horrific bowel cancer diagnosis has shared some of the unexpected side effects of her illness.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Aussie star’s sad reaction to brutal trolls",
        "description": "Bulls guard Josh Giddey has had a devastating response to an Instagram post from his new NBA club that quickly blew up.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "NBA superstar open to shock Boomers switch",
        "description": "Superstar Kyrie Irving, who was born in Australia, has discussed the shock possibility of joining the Boomers for the LA Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "‘Roos keeper spot now Gauci’s to lose",
        "description": "There has been a changing of the guard in Australia’s goalkeeping ranks under new Socceroos coach Tony Popovic.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "‘Fantastic’ Socceroos display hailed by coach",
        "description": "It wasn’t pretty, and there is plenty to improve on, but the Socceroos defied the odds to deny Japan a win in Saitama.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Tszyu turns to famous family as emergency surgery rocks camp",
        "description": "A key member of Tim Tszyu’s camp won’t be in his corner for the biggest fight of his life this weekend, yet his famous family will step-up to provide extra support.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Greg Norman set to lose his job",
        "description": "After three years of disrupting golf and bringing LIV to the world, there could be change coming for an Australian legend.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "NBL late mail: SuperCoach drama as host of stars in doubt",
        "description": "A host of significant SuperCoach NBL players are either out or in doubt for the upcoming round. Get the full lowdown here.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "What J-Mac must do to beat Jenni in King Charles III Stakes",
        "description": "Saturday’s King Charles III Stakes looms as a gripping tactical clash between mighty mares Pride Of Jenni and Fangirl. Champion jockey Glen Boss reveals the race plan that James McDonald must employ for Fangirl to emerge victorious.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-16T07:23:37.419978"
    }
]