[
    {
        "title": "What does Jack Ma's return to the spotlight mean?",
        "description": "Analysts say the Alibaba founder's re-emergence could signal a policy change in Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Exposing an Indian pharma firm fuelling West Africa's opioid crisis",
        "description": "An Indian drug maker tells a BBC undercover team its addictive cocktail drug is “very harmful” but “this is business”.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "How an American takeover could change James Bond forever",
        "description": "Long-serving masterminds Barbara Broccoli and Michael G Wilson give creative control to Amazon.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Apple gambles on new iPhone with AI features at lower cost",
        "description": "Apple is hoping its latest, lower cost iPhone model will boost sales of its flagship device.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Exposing an Indian pharma firm fuelling West Africa's opioid crisis",
        "description": "An Indian drug maker tells a BBC undercover team its addictive cocktail drug is “very harmful” but “this is business”.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Passengers on crashed Toronto plane offered US$30,000 each",
        "description": "The gesture to the affected travellers - all of whom survived - comes with no strings attached, the airline says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "The tiny Danish town transformed by Ozempic",
        "description": "American demand for weight-loss drugs is supercharging Denmark’s economy and transforming a small Danish community into an unlikely boomtown.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Birkenstock sandals are not art, says German court",
        "description": "The firm wanted to claim protection under copyright law, to stop rivals selling copycat versions of its shoes.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Ros Atkins on... the fight for Ukraine's critical minerals",
        "description": "The BBC's Analysis Editor Ros Atkins looks at why the US wants access to Ukraine's minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "'I cried for days': Office raids and arrests shock aid workers in Yemen",
        "description": "Humanitarian workers fear the detention of staff and cuts in funding will be a \"death sentence\" for Yemenis.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Lloyds sets aside £1.2bn for car loan scandal",
        "description": "The banking group has nearly tripled the amount it has ringfenced for potential compensation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "I'm not happy with Boeing, Trump says over Air Force One",
        "description": "US president says he is looking for alternatives because Boeing is taking too long to build new planes",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "US Fed warns Trump's tariffs may fuel inflation",
        "description": "The minutes from the last meeting of the e Fed's rate setting committee reveal inflation concerns.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Georgia's richest man said to be moving funds to avoid US sanctions",
        "description": "The pro-Russian businessman is reported to be moving overseas assets back to the Caucasus country.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Powerful quantum computers in years not decades, says Microsoft",
        "description": "It says a new chip it has created could end up being as important a breakthrough as the semiconductor.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Trump administration trying to rehire  USDA bird flu officials it fired",
        "description": "The cuts come as the virus is wreaking havoc on poultry farms and raising egg prices in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Fast-food giant KFC leaves Kentucky home for Texas",
        "description": "Move away from its ancestral home is part of a wider shakeup at its parent company Yum Brands.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "UK inflation jumps on food, air fares and school fees",
        "description": "The government admits that stemming price rises will be 'bumpy' as inflation hit 3% in January.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "UK MPs criticise 'wealth-hoarding' boomers stereotype",
        "description": "A report from the Commons' women and equalities committee says age discrimination is widespread.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "DeepSeek 'shared user data' with TikTok owner ByteDance",
        "description": "South Korea's data protection regulator says user data was sent to the Chinese owner of TikTok.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Argentina's President Milei denies crypto fraud allegations",
        "description": "Javier Milei says he was acting in \"good faith\" when he posted about a crypto currency which collapsed.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "'Everyone must go': New Zealand's tourism drive draws ire",
        "description": "What was meant as a catchy tagline has been dubbed tone-deaf amid high emigration and unemployment.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Too many video games, too little time - but could that be changing?",
        "description": "Bigger, longer, better? Why the race to pack more hours into video games might be slowing.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "US government tries to rehire nuclear staff it fired days ago",
        "description": "It is having problems contacting people who were fired in Trump's blitz to shrink the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Meghan puts new label on jams and lifestyle range",
        "description": "The Duchess of Sussex reveals \"As Ever\" will be the new name for her home and cooking range.",
        "source": "BBC Business",
        "fetched_date": "2025-02-21T07:23:18.506444"
    },
    {
        "title": "Folk, Pop and Agit-Prop: Joan Baez, Bob Dylan and Pete Seeger After ‘A Complete Unknown’",
        "description": "Seeger was shaped by the 1930s, Baez by the 1960s, and both, like Dylan, had a moment of decision that defined their allegiances.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Nicole Kidman and Keith Urban’s L.A. Home Burglarized",
        "description": "The couple and their kids were not home when the break-in occurred.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Blackpink Announces 10-City Stadium World Tour",
        "description": "The “Pink Venom” singers are currently in the midst of a banner year as solo artists.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "‘Doctor Who’ Theme and More: The Legendary BBC Radiophonic Workshop’s Archive Is Now Available",
        "description": "\"As a kid born in the 1960s, I realized there was a department at the BBC that was purely for making bonkers noises,\" says Radiophonic Workshop archivist Mark Ayres as the Spitfire Audio suite launches.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Octavia Spencer Offers Elon Musk’s DOGE Employees Poop Pie From ‘The Help’",
        "description": "\"Bake sale for Washington to ALL DOGE employees and supporters,\" the Oscar winner wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "A$AP Rocky Found Not Guilty of Firing Handgun at Former Friend and Avoids Years in Prison",
        "description": "The rapper risked more than 24 years in prison if he had been convicted.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "FireAid Distributes $50M for Wildfire Relief Aid in First Set of Grants",
        "description": "The January concert, which took over the Intuit Dome and Kia Forum, raised an estimated $100 million.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Pharrell Williams Gives Advice About the Pitfalls of the Music Industry at His Adidas Film Premiere: “It’s Crazy”",
        "description": "At a post-screening Q&A in Atlanta attended by Morehouse and Spelman students, Williams laid down lessons about being a new artist: “The first 10 years is just you getting run over, over and over again, and thinking there aren’t good people in the world.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Trump’s National Endowment for the Arts Grant Restrictions Spur Backlash",
        "description": "Hundreds of artists wrote an open letter to the NEA expressing \"tremendous disappointment\" over grant restrictions to institutions that have DEI programs.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Justin Baldoni’s Lawyer Criticizes Ryan Reynolds’ ‘SNL’ Joke Mocking Blake Lively Feud",
        "description": "Baldoni's attorney, Bryan Freedman, commented on the Reynolds and Lively's 'SNL 50' gag.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "With This White House, Can Arts Funding Be Saved? The Creative Coalition Has a Plan",
        "description": "The first National Arts Advocacy Summit in Summerlin outside Vegas included exec, actors, musicians and CEOs, who all worked toward creating an economic blueprint to present in April to Congress and the White House.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Lady Gaga Announces New Album ‘Mayhem’",
        "description": "The third single and music video from the singer’s highly anticipated album premiered during a Grammy Awards commercial break.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-21T07:23:19.323647"
    },
    {
        "title": "Blockbuster title fight dealt crushing blow",
        "description": "One of most highly anticipated heavyweight world title boxing fights has been called off at the last minute in a cruel blow for fans.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Supercars champion’s title defence suffers early setback",
        "description": "Defending Supercars champion Will Brown will start his title defence from outside the top-10 on the grid after a qualifying error pushed him back in the field for the season opener.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "‘Un-Australian’: Matildas coach unleashes",
        "description": "Interim Matildas boss Tom Sermanni hasn’t held back his criticism in the wake of Australia’s horror outing against Japan.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Young ‘Roos ready for World Cup shot",
        "description": "The Young Socceroos have a golden opportunity to qualify for the FIFA Under-20 World Cup for the first time in 12 years.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "‘Not second ball’: Konstas backed despite wild SCG moments",
        "description": "A former Australia Test opener has urged patience in teenager Sam Konstas after his divisive Sheffield Shield performance for New South Wales.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Selectors to make shock Labuschagne call for opener",
        "description": "The Australian selectors are poised to spring a few surprises for the Champions Trophy opener against England, including a big call on out-of-form batter Marnus Labuschagne.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "New footage says it all in Raducanu drama",
        "description": "New footage of the moment that left tennis star Emma Raducanu hiding and in tears after spotting a “fixated” fan has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Tennis star hides from stalker, breaks down",
        "description": "The tennis world has condemned a “fixated” fan who caused British star Emma Raducanu to hide mid-match and break down in tears.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Top pick’s setback for Opening Round",
        "description": "The top 10 pick who was “100 per cent in the frame” for an Opening Round debut is now racing against the clock to be fit.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Bombers ‘really clear’ on expectations: Merrett",
        "description": "Superstar midfielder Zach Merrett will captain Essendon for a third season and he believes the club is developing a clearer identity.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Star on the outer after bombshell deals",
        "description": "The Broncos appear set to lose a star player in the wake of several blockbusters deals which have left little space in the cap.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Bennett’s incredible move amid Souths disaster",
        "description": "As the Rabbitohs lick their wounds from a shock double injury blow, Wayne Bennett’s incredible act came to light showing why the club will be just fine.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "‘It’s greed’: Footy divided over $1.2m trend",
        "description": "“Exciting” AFL and NRL off-seasons with more player movement than ever has exposed a modern new reality about the footy codes.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Anthem singer’s middle finger to Trump",
        "description": "The USA-Canada political tensions took another turn on Friday when a national anthem singer delivered a direct shot at Donald Trump.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Basketball world stunned by amputation",
        "description": "LaVar Ball, the outspoken father of NBA stars LaMelo and Lonzo Ball, has been rocked by a “serious medical issue”.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "‘Un-Australian’: Matildas coach unleashes",
        "description": "Interim Matildas boss Tom Sermanni hasn’t held back his criticism in the wake of Australia’s horror outing against Japan.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Young ‘Roos ready for World Cup shot",
        "description": "The Young Socceroos have a golden opportunity to qualify for the FIFA Under-20 World Cup for the first time in 12 years.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Blockbuster title fight dealt crushing blow",
        "description": "One of most highly anticipated heavyweight world title boxing fights has been called off at the last minute in a cruel blow for fans.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Supercars champion’s title defence suffers early setback",
        "description": "Defending Supercars champion Will Brown will start his title defence from outside the top-10 on the grid after a qualifying error pushed him back in the field for the season opener.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Why this Italian is the man to beat at Phillip Island",
        "description": "Nicolo Bulega will likely be the frontrunner for the opening round of the 2025 World Superbikes series but the Ducati rider will be well aware of the unpredictability of the Phillip Island circuit.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "‘Not even trying to hide’: Phoenix star poised for shock finals return",
        "description": "South East Melbourne Phoenix’s hopes of an NBL finals boilover are set to receive a significant boost with star guard Derrick Walton Jr on the cusp of a surprise return from injury.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Outlaw jailed bikie now a rising golf star",
        "description": "He was once jailed for five years for assault but Ryan Peake has put his dark past behind and is now focused on becoming a golf star.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Hong Kong sale on hold for Doomben favourite",
        "description": "Stalled negotiations to sell colt Penrod to Hong Kong could be a blessing in disguise ahead of his debut in the QTIS Jewel Prelude 2YO at Doomben on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Wallabies captain signs new deal",
        "description": "The Wallabies captain wants the `best years’ of his career to be with the Queensland Reds and the Wallabies.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Reds coach silent on Wallabies gig",
        "description": "He is considered among the favourites to coach the Wallabies after Joe Schmidt stands down, but Les Kiss is concentrating on the Queensland Reds.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "Student collapses, dies at rowing training",
        "description": "The 17-year-old Melbourne student collapsed after finishing a training session on a rowing machine.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    },
    {
        "title": "‘Wicked’: AFL WAG compared to conwoman",
        "description": "An AFL player’s beloved wife, who is suffering from terminal cancer, has revealed she’s been compared to conwoman Belle Gibson.",
        "source": "News AU",
        "fetched_date": "2025-02-21T07:23:21.019413"
    }
]