[
    {
        "title": "'It's going to get worse': American car buyers brace for sweeping auto tariffs",
        "description": "\"The prices in the wholesale market have skyrocketed already and it's going to get worse,\" one car seller told the BBC.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Musk says Tesla not immune from tariffs as car firms hit",
        "description": "Investors sold off shares of carmakers in Japan, Germany and the UK, but US brands are also set to be hit.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Defiance or diplomacy - how Canadians want to deal with Trump",
        "description": "The BBC asked voters in Toronto how they would approach Donald Trump if they were PM - would it be through defiance or diplomacy?",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "UK car firms urge help as Trump tariffs loom",
        "description": "Manufacturers are expected to ask for state support ahead of next week's 25% tax on exports.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Musk says Tesla not immune from tariffs as car firms hit",
        "description": "Investors sold off shares of carmakers in Japan, Germany and the UK, but US brands are also set to be hit.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Musk's xAI buys his social media platform X",
        "description": "The move could be aimed at protecting investors, who helped him buy purchase X, from losing money.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Trump 'respected Canada's sovereignty' in call, says Carney",
        "description": "The US president described the talks as \"extremely productive\" and said the two leaders would meet after Canada holds elections.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Can Vietnam golf its way out of new Trump tariffs?",
        "description": "Vietnam's Prime Minister has said he would \"golf all day long\" with the US president if it benefits his country.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Week in Markets - 28 Mar 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Bringing ‘Japanese efficiency’ to London’s tube system",
        "description": "The Tokyo Metro will begin operating the Elizabeth Line in London later this year.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "David Dimbleby: I thought the free market was with us forever - then Trump came along",
        "description": "Why the reign of the free market is facing its biggest ever challenge",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Irish finance minister delivers warning over US tariffs",
        "description": "Ireland's minister for finance warns that proposed US tariffs on pharmaceutical exports could deliver a major blow to the economy.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Adani restores power supply to Bangladesh after four months",
        "description": "The Indian conglomerate had halved the supply to the country's eastern neighbour over unpaid dues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Assassin's Creed maker gets $1.25bn Chinese investment",
        "description": "Shenzhen-based Tencent, which owns the popular messaging app WeChat, will hold about a quarter of a new subsidiary.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "What's next for social media?",
        "description": "Start-up social media firms are looking to capitalise on dissatisfaction with the social media giants.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Affluent India's love for 'fur babies' fuels pet care industry boom",
        "description": "Affluent, urban Indians indulging their dogs and cats have led to the growth of India's pet care sector.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Canada PM Mark Carney says old relationship with US 'is over'",
        "description": "The Canadian leader said his country's relationship with the US had changed due to Trump's tariffs, jeopardising future cooperation.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "UK not entering trade war with US, says Starmer",
        "description": "The UK is in \"intense negotiations\" with the US over tariff plans, the prime minister says.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Car company faces 'significant shift' with US tariff",
        "description": "Morgan Motor Company exports 200 sports cars to the US a year, which is a third of overall revenue, says managing director",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Germany leads defiance of Trump car tariffs, saying it 'will not give in'",
        "description": "Major economies vow to retaliate, with China accusing Washington of violating international trade rules.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Thousands of jobs at risk as British Steel threatens closure",
        "description": "The company announces a consultation that could see the closure of two blast furnaces at Scunthorpe.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "H&M to use digital clones of models in ads and social media",
        "description": "Some fear the move could mean less work for models, photographers and make-up artists.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "China tariffs may be cut to seal TikTok sale, Trump says",
        "description": "Trump also said he is willing to extend a 5 April deadline for a non-Chinese buyer of the platform to be found.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "'I have terminal cancer and lost my life savings to whisky barrel scammers'",
        "description": "Jay Evans was among hundreds duped into ploughing millions of pounds into casks that were overpriced or did not exist.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "Six things that could get more expensive for Americans under Trump tariffs",
        "description": "Economists say the president's import taxes could result in higher prices for a range of products in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-29T07:22:41.282230"
    },
    {
        "title": "‘Agatha All Along,’ ‘Hacks’ Among Top Winners at GLAAD Media Awards",
        "description": "'9-1-1: Lone Star,' 'My Old Ass,' Doechii and 'The Real Housewives of New York City' were also recognized at the L.A. ceremony on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Will Smith Addresses Chris Rock Oscars Slap On ‘Based On a True Story,’ His First Album in 20 Years",
        "description": "The new record marks Smith's first album since 2005's 'Lost and Found.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Beyoncé Snubbed by 2025 Academy of Country Music Awards After Album of the Year Grammy Win",
        "description": "Beyoncé won album of the year and best country album for 'Cowboy Carter' at the Grammy Awards earlier this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Terry Manning, Key Architect of Stax Records’ Memphis Sound, Dies at 77",
        "description": "Affiliated with Led Zeppelin, ZZ Top and Big Star, the recording engineer and producer was also a noted photographer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Dennis McDougal, Author of Books About Lew Wasserman, Jack Nicholson and Bob Dylan, Dies at 77",
        "description": "His subjects also included Otis Chandler, Robert Blake and Bonny Lee Bakley. The former L.A. Times reporter and his wife were fatally injured in a car accident.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Charred Oscar Destroyed in L.A. Wildfires Turns Up at Chateau Marmont, Months After Fake Viral Photo",
        "description": "Four-time Oscar winner Colleen Atwood brought her torched statuette to the Vogue World: Hollywood announcement Wednesday: \"Without the help of my friends, I do not know what I would’ve done.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Young Thug to Play First Live Show Since Jail Release at Summer Smash in June",
        "description": "Thug will headline the festival along with Future and the duo of Don Toliver and Yeat.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "The Hollywood Reporter Boosts Awards Team With New Hire, Promotion",
        "description": "THR doubles down on its prestigious, best-in-class awards coverage as well as technology and politics, strategically meeting the future with authority and expertise.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Kesha Drops Country-Pop Single “Yippee-Ki-Yay” With T-Pain, Unveils New Album ‘Period’",
        "description": "The album, her first as an independent artist, is set to release on July 4.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "2025 Academy of Country Music Awards Nominations Unveiled: First-Time Nominee Ella Langley Leads With Eight",
        "description": "Other top contenders include seven-time nominees Morgan Wallen, Lainey Wilson and Cody Johnson and Chris Stapleton with six nods.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "French Prosecutors Call for 18-Month Suspended Sentence for Gérard Depardieu in Assault Case",
        "description": "Two women have accused the French actor of sexually inappropriate behavior on the set of 'The Green Shutters' in 2021.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Why Heart’s Nancy Wilson Says It’s “More Embarrassing” to Be an American Now Than During Vietnam War",
        "description": "The guitarist and singer gets candid about the current political climate under the Trump administration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-29T07:22:41.604577"
    },
    {
        "title": "Controversy as fans fume at ‘killer’ AFL call",
        "description": "A controversial call in Melbourne’s loss to the Gold Coast had fans up in arms and adamant a team was dudded by a buzzer beater.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "South Australia end Shield drought",
        "description": "The Queensland Bulls picked up three early wickets on Saturday in their attempt to prevent South Australia making the 270 runs needed to win the Sheffield Shield final before Jason Sangha and Alex Carey took command with the bat.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Red Bull boss drops brutal truth bomb",
        "description": "Red Bull supremo Helmut Marko has opened on the bombshell axing of Liam Lawson, dropping a brutal truth on the youngster.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Kyrgios shocks with huge life update",
        "description": "Australian tennis star Nick Kyrgios and his long-term partner have called it quits with details coming to light over the break up.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "NRL Live: Canberra crash over after Cowboys go close",
        "description": "After the Cowboys went close to crossing over early, the Raiders defence has proved up to the task, denying them to score the first points themselves. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "‘Oh no’: Refs miss shocker in Broncos drama",
        "description": "The Dolphins were robbed in brutal fashion on Friday night after a refereeing howler let the Broncos get away with murder.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Controversy as fans fume at ‘killer’ AFL call",
        "description": "A controversial call in Melbourne’s loss to the Gold Coast had fans up in arms and adamant a team was dudded by a buzzer beater.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Fans call for coach to be sacked immediately",
        "description": "Michael Voss’ tenure as the coach of Carlton is under intense scrutiny with fans calling for the club to make an immediate change.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "South Australia end Shield drought",
        "description": "The Queensland Bulls picked up three early wickets on Saturday in their attempt to prevent South Australia making the 270 runs needed to win the Sheffield Shield final before Jason Sangha and Alex Carey took command with the bat.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "South Australia ends 29-year drought to win Sheffield Shield",
        "description": "Jason Sangha has steered South Australia home to claim a first Sheffield Shield in 29 years with a stirring century in front of their home fans.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Kyrgios shocks with huge life update",
        "description": "Australian tennis star Nick Kyrgios and his long-term partner have called it quits with details coming to light over the break up.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "World number 12 defects to Australia",
        "description": "Tennis in Australia has received a massive boost after one of the top players in the world switched her allegiance to Down Under.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "9yo footy fan ‘in shock’ after mascot push",
        "description": "A nine-year-old boy’s mum has contacted police and the NRL after the South Sydney mascot didn’t take kindly to his high-five request.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Cold-blooded F1 video exposes brutal detail",
        "description": "A video that inadvertently predicted the future has been uncovered and is going viral after Red Bull’s cold-blooded betrayal.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "‘Bullying’: Verstappen move raises eyebrows",
        "description": "F1 star Max Verstappen has raised eyebrows with a bizarre social media act after Liam Lawson was dropped by Red Bull in favour of Yuki Tsunoda.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Smith ‘honoured’ to captain Reds",
        "description": "‘Massive’ thrill for lock Ryan Smith to captain the Queensland Reds in Super Rugby Pacific clash against Western Force.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Levi lights up Hong Kong, shatters Australian try scoring record",
        "description": "Maddison Levi has made a stunning return to the world stage after breaking her thumb, scoring seven tries on an historic, opening day of the Hong Kong Rugby Sevens tournament.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Coach axing leaves NBA world in shock",
        "description": "An NBA championship contender has left fans in disbelief after sacking their head coach only weeks out from the playoffs starting.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "‘Taylor Swift run’: LeBron feud goes nuclear",
        "description": "LeBron James has slammed a leading NBA commentator, breaking his silence on a confrontation about his son that went viral.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Victory and Adelaide ‘desperate’",
        "description": "Melbourne Victory and Adelaide United have plenty to play for in Saturday night’s ‘Original Rivalry’ clash at AAMI Park.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "City won’t fear star-studded Sydney FC",
        "description": "Melbourne City has promised to fight fire with fire against Sydney FC at Allianz Stadium on Saturday night.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Tszyu and Volk in fight to save their careers",
        "description": "Tim Tszyu and Alex Volkanovski are former world champions – and both will fight to save their respective careers over what’s been billed as the biggest week in Aussie combat sport history.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Dowling’s remarkable recovery to lead field at The National",
        "description": "Queensland amateur Billy Dowling showed his remarkable powers of recovery to lead the final event of the PGA Tour of Australasia season – just two months after having his appendicitis removed.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Giddey stuns Lakers and LeBron with extraordinary buzzer beater",
        "description": "Australian basketball star Josh Giddey has done the unthinkable in the NBA, stunning the Los Angeles Lakers and LeBron James.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "‘Pretty special’: Kiwi filly too fast in Flemington raid",
        "description": "New Zealand raider Alabama Lass will head back home for a well-earned spell after a commanding frontrunning win at Flemington, and the filly could be back for the spring.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Spiranac lifts lid on ‘sexual favour’ rumours",
        "description": "Golfer and social media sensation Paige Spiranac has spoken out over rumours that plagued her in the early stages of her career.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    },
    {
        "title": "Nine star breaks silence on abrupt break-up",
        "description": "Danika Mason made headlines when she suddenly called off her 2023 wedding just weeks out. Now, she’s breaking her silence.",
        "source": "News AU",
        "fetched_date": "2025-03-29T07:22:44.221183"
    }
]