[
    {
        "title": "TikTok users flock to Chinese app RedNote as US ban looms",
        "description": "A swarm of \"TikTok refugees\" has made RedNote the most downloaded app on Apple's US App Store.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Buy something or leave, Starbucks says",
        "description": "The policy being rolled out in the firm's North American cafes comes as it tries to boost flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "The truth behind your $12 dress: Inside the Chinese factories fuelling Shein's success",
        "description": "Workers making clothes for the fast fashion giant tell the BBC they labour for up to 75 hours a week.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Norway leads world in electric cars. What can others learn?",
        "description": "Nine in 10 new cars in the country are now battery-powered, and it aims to hit 100% later this year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Buy something or leave, Starbucks says",
        "description": "The policy being rolled out in the firm's North American cafes comes as it tries to boost flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "TikTok says report of possible sale to Musk 'pure fiction'",
        "description": "The firm has repeatedly said it will not sell its US operation as it face a 19 January deadline.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Spain plans 100% tax for homes bought by non-EU residents",
        "description": "The measure is meant to help tackle the country's housing crisis, the prime minister said.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "US tightens control on AI chips export drawing pushback",
        "description": "The new rules are intended to make sure the \"the world's AI runs on American rails\", and stays out of the hands of \"malicious actors\", say officials.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "How a viral post saved a Chinese actor from Myanmar's scam centres",
        "description": "Many Chinese are now asking: what about their loved ones still trapped in scam centres?",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "'Trump 2.0' looms large over the global economy",
        "description": "Donald Trump's planned tariffs are expected to greatly impact international trade in 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "US stocks under pressure after jobs report - 10 Jan 2025",
        "description": "The latest healthy US jobs report adds more uncertainty about whether the Fed will cut its key interest rate.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Apple pushes back on call to end  diversity programme",
        "description": "The tech giant has asked investors to reject a proposal from a conservative group to end its DEI policies.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Chancellor will remain for all of Parliament, Downing Street says",
        "description": "Market jitters have raised questions over Rachel Reeves' management of the economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Online safety laws unsatisfactory, minister says",
        "description": "Peter Kyle responds as internet safety campaigner Ian Russell says laws to protect children need fixing.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Watch: I will work with Trump for low whisky tarriffs - Swinney",
        "description": "John Swinney says he will capitalise on Donald Trump's Scottish connection in an attempt to avoid tariffs being applied on imports to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Reeves defends China visit and hails £600m boost to UK",
        "description": "The chancellor has been criticised for making the trip while the UK government is under pressure from rising borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "More people in late 20s still living with parents",
        "description": "The rising cost of buying or renting home in the UK has led more to remain in the family home, a think-tank says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Meta and Amazon scale back diversity initiatives",
        "description": "The companies are among the latest major corporations to alter their diversity programmes since Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "US and UK toughen sanctions on Russian oil industry",
        "description": "The actions are aimed at cutting off revenue Moscow is using to fund its war in Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Fewer rate cuts and higher loan costs - how US jobs surprise affects you",
        "description": "Jobs growth in the US surged unexpected last month. That's good news for the world's largest economy but could be \"punishing\" for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "'I don't like this Musk chap': Reform members say they're unbothered by spat",
        "description": "Activists gathering at a regional conference assess whether the US billionaire could help or hinder the party.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "US top court leans towards TikTok ban over security concerns",
        "description": "The platform with nearly 170 million American users is challenging a law that would see it banned in the US in a matter of days.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "UK MPs urge checks as Shein refuses to answer questions",
        "description": "The chair of a committee of MPs has written to the London Stock Exchange with concerns over the fashion retailer.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Can young Americans live without TikTok?",
        "description": "The BBC spoke to young people as the Supreme Court discusses a potential ban on the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Boeing and Google each give $1m for Trump inauguration",
        "description": "The US companies join other major firms donating funds for the ceremony on 20 January.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "LA wildfire damages set to cost record $135bn",
        "description": "Some of the most expensive properties in the US have been wiped out by the fires.",
        "source": "BBC Business",
        "fetched_date": "2025-01-14T07:22:04.489576"
    },
    {
        "title": "Eva Longoria Donates $1M of Jeff Bezos Courage and Civility Award to Support L.A. Fire Recovery",
        "description": "The star, who received the $50 million prize from the Amazon founder last year, will donate a part of it to the Latino Community Foundation as well as the California Community Foundation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "“It’s the Little Things”: Hollywood Charity Says Many Victims Overwhelmed With Most Basic Needs",
        "description": "The Motion Picture & Television Fund, whose outreach was pivotal during both the pandemic and the Hollywood strikes, has turned its social-service apparatus to the destructive L.A. wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "How the 2025 Oscars Could Save Los Angeles (and Themselves)",
        "description": "Awards shows are in a frenzy trying to figure out how to meet this fast-changing fires moment. Here's one way.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "A Lahaina Fire Survivor’s Step-by-Step Guide to Recovering From Tragedy and What to Do First",
        "description": "A former Billboard editor-in-chief (and THR music editor) and her family escaped the inferno that reduced her beloved Maui town to ashes. She offers actionable steps for those in the same position following the blazes raging across Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Universal Music Group to Cancel Its Grammy Events; Will Redirect Resources to Wildfire Relief",
        "description": "The company, home to Ariana Grande and Kendrick Lamar, will longer hold its pre-Grammy artist showcase and awards show afterparty.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Ricki Lake Says Medium Tyler Henry Predicted Her House Would Burn Down",
        "description": "The 'Hairspray' actress and her husband lost the home where they \"planned to grow old together\" in the wildfires raging across L.A.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Carrie Underwood to Perform at Donald Trump’s Inauguration, Surprising Some Fans",
        "description": "The typically nonpolitical country singer adds star wattage to Trump's return to the White House.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Oliviero Toscani, Photographer Behind Provocative Benetton Campaigns, Dies at 82",
        "description": "The creative force behind '80s and '90s ads with images such as the pope kissing an imam died at a hospital in Tuscany after a battle with rare disease amyloidosis.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "L.A. Lakers and Clippers Head Back to Courts, Plan Fire Relief Efforts",
        "description": "The two NBA teams are slated to play home games on Monday after postponing contests last week due to the wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Famed Foodie Phil Rosenthal Hosts Dinner At Michelin Starred Restaurant For Chase United Cardmembers",
        "description": "The exclusive epicurean event at Washington, D.C.’s Albi also raised money for non-profit No Kid Hungry.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Beyoncé’s BeyGood Foundation Donates $2.5 Million to L.A. Wildfire Relief Efforts",
        "description": "The Knowles-Carter family, which owns a home in Bel Air, is sheltering in Las Vegas during the firestorm, says a source.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Grammys Will Still Take Place Feb. 2; Show Will Raise Funds for Wildfire Relief Efforts",
        "description": "The show will air live from the Crypto.com Arena in downtown in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-14T07:22:05.328896"
    },
    {
        "title": "Strange bedfellows: Whittaker’s secret weapon to the title",
        "description": "It was a cold call to Israel Adesanya’s coach Eugene Bareman which has turned two of the UFC’s biggest rivals into training partners, and now friends. And it could take Robert Whittaker back to the promised land.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Totally lost’ star given brutal diagnosis",
        "description": "Jelena Dokic has delivered a cold truth bomb for a “totally lost” star who was left fuming in Melbourne this week after a first-round battering.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Spirit of Warnie lives on in ‘bloody gutsy’ Ashes win",
        "description": "Bowling in front of the Shane Warne stand in Melbourne another leg-spinner did the King proud bowling Australia to a memorable win to put the Ashes within reach.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Wallabies star confident of securing new deal",
        "description": "A leading Wallaby is yet to secure his future beyond this year, but he seems anything but concerned about it.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Spirit of Warnie lives on in ‘bloody gutsy’ Ashes win",
        "description": "Bowling in front of the Shane Warne stand in Melbourne another leg-spinner did the King proud bowling Australia to a memorable win to put the Ashes within reach.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Loved the challenge’: Test revelation’s next move",
        "description": "After a breakthrough Test debut, Beau Webster will tick some big boxes to keep his career going after signing a new deal.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Evergreen star wins all-French thriller",
        "description": "France’s most exciting tennis prospect has been sent packing by a compatriot playing at his 19th Australian Open.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Ultimate underdog leaves furious Medvedev on verge of disaster",
        "description": "2024 Aus Open finalist Daniil Medvedev is on the verge of a stunning defeat against the 418th ranked player in the world. FOLLOW DAY THREE LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Sad Hird wife detail emerges amid split",
        "description": "It was revealed on Monday that James and Tania Hird had split after 27 years together – but there were clear signs it had been over for a while.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "James Hird splits from wife after 27 years",
        "description": "AFL legend James Hird and wife Tania have reportedly separated after keeping a secret for more than a year.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "NRL trials schedule: First-look at new signings, positional puzzles",
        "description": "The countdown is on for NRL action with trials less than a month away. Find out when and where your team is playing and read every club’s in-depth season preview inside.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Dragons make shock captaincy call",
        "description": "Two players who joined St George Illawarra from other clubs after the 2024 season have been named as co-captains in their first season for the Dragons.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Football icon splits from wife after 30 years",
        "description": "Manchester City manager Pep Guardiola has split from his wife of 30 years, with reports claiming the pair had been living apart for nearly five years.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Nick Kyrgios reveals retirement bombshell",
        "description": "Nick Kyrgios has dropped a bomb surrounding his future at the Australian Open and it is not what fans want to hear.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "World losing its mind over Shaq footage",
        "description": "Video of NBA legend Shaquille O’Neal left looking tiny next to a record-breaking teenager is racing across the internet.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Absolutely rocking’: Eddie’s son in title game",
        "description": "The sons of well-known AFL figures Eddie McGuire and Matt Rendell are going to face off in the national championship decider.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Good deal’: Socceroo heads to US",
        "description": "A Socceroos defender and one of the A-League’s most exciting young attackers are moving to the United States.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Ange cracks over historic embarrassment",
        "description": "A brutal, viral fan video said it all as Ange Postecoglou’s team blundered its way to something only seen four times in history.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Strange bedfellows: Whittaker’s secret weapon to the title",
        "description": "It was a cold call to Israel Adesanya’s coach Eugene Bareman which has turned two of the UFC’s biggest rivals into training partners, and now friends. And it could take Robert Whittaker back to the promised land.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Sour taste’: Aussie F1 gun in huge trouble",
        "description": "A rare, thinly-veiled driver move could spell trouble for Australia’s newest F1 driver Jack Doohan with eyebrows raised.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Stop touching us’: Coach’s wild rant at refs",
        "description": "Justin Tatum has been courting controversy all season but after another run-in with the NBL referees went at them again in the post-match on Monday.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘Easier than having a mate’: Why Doull’s partner was perfect caddy",
        "description": "Jordan Doull’s girlfriend, Kathryn Norris, put her own on course disappointment behind her to play an “instrumental” role in his remarkable win at the Webex Players Series. Here’s how it played out in WA.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "‘She felt enormous’: Group 1 filly gets big tick after trial return",
        "description": "The Sires’ Produce Stakes winner was one of several autumn contenders to step out at Royal Randwick on Tuesday morning.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Wallabies star confident of securing new deal",
        "description": "A leading Wallaby is yet to secure his future beyond this year, but he seems anything but concerned about it.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Sales pitch begins to keep Wallabies coach",
        "description": "Public lauding of Wallabies coach Joe Schmidt will be the players’ way of convincing him to stay rather than private urgings that could put unwanted pressure on him.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-14T07:22:07.319814"
    }
]