[
    {
        "title": "Judge blocks Trump plan to put thousands of USAID staff on leave",
        "description": "A last-minute lawsuit means Trump's efforts to dismantle the overseas aid agency have been put on hold.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "How Japan sparked Trump's 40-year love affair with tariffs",
        "description": "As a young real estate developer in New York, Trump said a rising Japan was ripping off the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Trump says Nippon Steel will 'invest heavily' in US Steel, drop takeover bid",
        "description": "The Japanese firm's $14.9bn (£12bn) takeover was blocked by President Joe Biden on national security grounds.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Cheaper China e-bikes 'kick in teeth' for UK firms",
        "description": "British makers of e-bikes are worried after the government scraps tariffs on Chinese e-bikes .",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "How Japan sparked Trump's 40-year love affair with tariffs",
        "description": "As a young real estate developer in New York, Trump said a rising Japan was ripping off the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Baltic states making historic switch away from Russian power grid",
        "description": "More than 30 years after leaving the Soviet Union, Estonia, Latvia, and Lithuania will join the EU's grid.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "How big tech ad money helped fund child abuse",
        "description": "Some of the biggest tech companies in the world served ads on a website featuring images of child abuse, helping to fund its operations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "'We're pawns in a game': US aid workers left in limbo overseas as agency slashed",
        "description": "USAID foreign staff say in addition to feeling stranded, they also worry how their absences will harm the countries and people they leave behind.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Casinos, high-rises and fraud: The BBC visits a bizarre city built on scams",
        "description": "A haven for the super rich, or a city built on scams? The BBC was invited to find out.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Low growth and rising prices - it's looking gloomy for the UK",
        "description": "The central bank may have cut rates but forecasts of low growth and rising inflation make a challenging domestic vista.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Trump suspends tariffs on small packages from China",
        "description": "The order ending duty-free shipment of packages from China worth less than $800 had caused chaos.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "US job growth slows but unemployment stays low",
        "description": "Firms created 143,000 jobs last month, below analysts' forecasts, but December's figure was upgraded.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Musk to rehire Doge aide who resigned over racist posts",
        "description": "Vice-President JD Vance had said the young employee should be given a second chance.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "USAID could slash staff to hundreds after placing most on leave",
        "description": "But US President Donald Trump's plan to dramatically cut back US foreign aid faces a legal challenge.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Panama says US 'spreading lies' over free canal passage",
        "description": "The US State Department had claimed that they were no longer required to pay a fee for transit.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "India cuts interest rates for the first time in five years",
        "description": "The latest cut happens when India's GDP growth is seen slowing to a four-year-low of 6.7%.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "TikTok sued by parents of UK teens after alleged challenge deaths",
        "description": "The US-based Social Media Victims Law Center filed the wrongful death lawsuit  on Thursday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Senate confirms Project 2025 co-author as Trump budget chief",
        "description": "Democrats call Russell Vought the president's \"most dangerous nominee\", but Republicans say he will \"stop the waste of US taxpayers' dollars\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Judge halts Trump's government worker buyout plan",
        "description": "The offer is part of an ongoing effort by the Trump administration to slash the size of the federal government.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "US should support World Bank and IMF, says Bank of England boss",
        "description": "Andrew Bailey says he is \"following closely\" whether Trump will change US support for the institutions.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "£22bn for 'unproven' green tech could raise bills, UK MPs warn",
        "description": "The Public Accounts Committee warns the government of gambling public money on carbon capture.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "'Land we paid for is being sold for millions - but we don't see any of the money'",
        "description": "Ex-miners say money from the sale of social welfare sites is not being re-invested in the community.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Concern UK's AI ambitions could lead to water shortages",
        "description": "Data centres can use vast quantities of water to cool them - but it's not clear where it will come from.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Panama denies US claims over free canal passages",
        "description": "Washington had suggested Panama had agreed to no longer charge fees for US government vessels using the waterway.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Carmaker Kia becomes latest global firm to face tax trouble in India",
        "description": "Customs authorities have accused Kia India of evading taxes worth millions of dollars.",
        "source": "BBC Business",
        "fetched_date": "2025-02-08T07:21:33.628637"
    },
    {
        "title": "Chappell Roan Fires Back at Grammys Speech Critic  With $25K Throw-Down",
        "description": "The pop star replied to a critique of her Grammys speech, where she blasted the music industry.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Why the Chappell Roan Speech Critic “Couldn’t Be More Wrong” (Guest Column)",
        "description": "Musician Kay Hanley has some words for the mansplainer-in-chief: “Good luck, babe!”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "50 Cent Trolls Irv Gotti Following Rap Mogul’s Death",
        "description": "The \"In Da Club\" rapper took to Instagram to pay his own kind of tribute to the late Murder Inc. founder, who was a close associate of his longtime rival, Ja Rule.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Fake Online Video Claiming USAID Paid Hollywood Stars to Visit Ukraine Debunked",
        "description": "Stars mentioned in the video to have received payments included Angelina Jolie, Sean Pean, Jean Claude Van Dam, Orlando Bloom and Ben Stiller.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Inside the AFI Awards With Ariana Grande, Colin Farrell, Kristen Bell and a Pacific Palisades Fireman",
        "description": "The awards luncheon, held at the Four Seasons on Thursday, toasted AFI's top 10 films and top 10 TV shows of the year and hosted a hotbed of A-list mingling.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Netflix Will Not Release Controversial Prince Doc Following New Deal With Singer’s Estate",
        "description": "A New York Times report last year alleged that the unreleased documentary accused the late musician of physical and emotional abuse.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Ozzy Osbourne Says He “Can’t Walk” Due to Parkinson’s Disease Ahead of Black Sabbath Reunion Show",
        "description": "Osbourne is set to reunite with original bandmates Tony Iommi, Geezer Butler and Bill Ward for a farewell concert in July.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Will.i.am., ‘The Bear’ Co-Showrunner, Composer Laura Karpman Set for Lighthouse Campus Festival (Exclusive)",
        "description": "The event, from the Tribeca Festival and Whalar Group, running Feb. 11-12 in Venice, California, is part of Tribeca's move into the creator space.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Cindy Mabe, UMG Nashville Chair and CEO, Exits",
        "description": "Ascending to the CEO position is Mike Harris, who served COO since 2016. Also joining the company, as chief creative officer, is Grammy-winning producer Dave Cobb.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "The Black Keys Open Up About Tour Cancellation, Management Split: “We Fired Their A**”",
        "description": "“Essentially as artists ... it’s almost impossible to talk about this,\" Patrick Carney said about ties between management companies and concert promotion. \"You’re dealing with management companies that co-own festivals with this other company.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Kendrick Lamar Previews “Storytelling” at Super Bowl Halftime Show as “Not Like Us” Speculation Swirls",
        "description": "The rapper's Grammy-winning diss track about Drake is currently the subject of a defamation lawsuit against Universal Music Group.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "Beat the Press: Inside Trump’s War on Big Media",
        "description": "Settling landmark lawsuits, jettisoning \"loser\" anchors, shoveling out millions for vanity productions nobody (but Trump) wants to see — how Hollywood and the media are caving to the new MAGA order.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-08T07:21:33.929638"
    },
    {
        "title": "7-63: Rapid Aussie collapse puts Test back in balance",
        "description": "Sri Lanka has turned the Galle Test on its head in a frantic hour, transforming a likely Australian outright victory into a match which is in the balance on day three. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Mixed Australian Open format scrapped",
        "description": "Golf Australia has listened to the concerns of leading players in making a significant decision about the format of the Australian Open.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Pat Cummins announces huge personal news",
        "description": "Pat Cummins and his wife have shared some delightful news after the Australian cricket captain stayed home, missing the tour of Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "7-63: Rapid Aussie collapse puts Test back in balance",
        "description": "Sri Lanka has turned the Galle Test on its head in a frantic hour, transforming a likely Australian outright victory into a match which is in the balance on day three. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Pat Cummins announces huge personal news",
        "description": "Pat Cummins and his wife have shared some delightful news after the Australian cricket captain stayed home, missing the tour of Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "World-famous singer makes pro tennis debut",
        "description": "He once vowed to never stop party rocking but it appears he hasn’t listened to his own advice, as the iconic singer made his professional tennis debut, aged 49.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Shock, tears as ex-world No. 1 retires on spot",
        "description": "A much-loved tennis champ’s career has ended in sad scenes when she grabbed a microphone on court and left spectators in tears.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Partner detail in likely $20m Reid contract",
        "description": "West Coast Eagles are set to throw everything at AFL draft sensation Harley Reid but his partner could have a big say on the youngster’s future.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Police rule out suicide in AFL tragedy",
        "description": "Investigators have released new details about their inquiry after Eagle Adam Hunter died at the age of 43.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Hayne’s family admission amid footy return",
        "description": "Jarryd Hayne has opened up about his rugby league return and the reasons why he is wanting to give it one final crack.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Nathan Cleary’s brother turns heads in NRL",
        "description": "All eyes were on Nathan Cleary’s younger brother as fans got their first taste of NRL action with an injury concern to one star player.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Walters’ Vegas truth, Broncos declaration",
        "description": "Kevin Walters has revealed his key advice for the NRL team’s travelling to Las Vegas for Round 1 as he makes a big call about the Broncos.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Super Bowl rocked by reporter’s death, arrest",
        "description": "A woman with a history of drugging men has been arrested in connection to the death of a reporter in New Orleans to cover the Super Bowl.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "US icon, 72, turns heads with 24yo girlfriend",
        "description": "After an NFL icon turned heads with his 24-year-old girlfriend in a bold red carpet move, Snoop Dogg roasted the legendary coach.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "40-year-old Ronaldo stuns football world",
        "description": "Can anything slow Cristiano Ronaldo down is a question on many fans’ lips after the football great scored an incredible goal at 40-years-old.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "‘He’s the perfect age’: Volk protege ready to make UFC mark",
        "description": "Colby Thicknesse will have Alex Volkanovski in his corner when he makes his UFC debut. And, the Aussie legend of the sport is tipping big things from his protege.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Ben Simmons’ $280m Nets nightmare over",
        "description": "Aussie basketball star Ben Simmons is on the lookout for a new team and it could result in him winning an unlikely NBA title.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Mixed Australian Open format scrapped",
        "description": "Golf Australia has listened to the concerns of leading players in making a significant decision about the format of the Australian Open.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Rivellino wins the 2025 Inglis Millennium",
        "description": "Rivellino, named after a World Cup-winning Brazilian footballer, could get his chance at Sydney’s juvenile triple crown after a barnstorming win in the Inglis Millennium at Randwick.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Reds primed for Super season",
        "description": "The Reds don’t want to waste their good work on a successful pre-season tour of the United Kingdom when they kick-off their Super Rugby Pacific season later this month.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Wallabies in turmoil as coach calls it quits",
        "description": "Rugby Australia is back on the hunt for yet another new coach after Joe Schmidt confirmed he will step down ahead of the World Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    },
    {
        "title": "‘Absolutely ridiculous’: Olympics bomb drops",
        "description": "Donald Trump is pushing International Olympic Committee to change its rules on transgender athletes after he signed a ban of his own.",
        "source": "News AU",
        "fetched_date": "2025-02-08T07:21:36.556351"
    }
]