[
    {
        "title": "Hair: 'It’s just thrown away but it's gold'",
        "description": "India is the world's biggest exporter of human hair but it wants more of the lucrative wig market.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Meta plans globe-spanning sub-sea internet cable",
        "description": "It is the latest move from Meta to invest more in global connectivity rather than its apps.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "US government tries to rehire nuclear staff it fired days ago",
        "description": "It is having problems contacting people who were fired in Trump's blitz to shrink the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Trump steel tariffs negative for UK and US, says Reynolds",
        "description": "President Donald Trump is set to impose 25% taxes on steel entering the US \"without exceptions\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Meta plans globe-spanning sub-sea internet cable",
        "description": "It is the latest move from Meta to invest more in global connectivity rather than its apps.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "S Korea removes Deepseek from app stores over privacy concerns",
        "description": "App stores in South Korea have removed DeepSeek over concerns about how  it manages users' data.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Musk v Altman: What might really be behind failed bid for OpenAI",
        "description": "Elon Musk's goal might be hindering the growth potential of the AI firm of his rival Sam Altman, experts say.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Irish goods exports to US surge by 34%",
        "description": "Ireland has a goods-trade surplus with the US of just over €50bn (£41.6bn), according to new data.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Mapping China's influence around the Panama Canal",
        "description": "A close-up look at Chinese projects that worry the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Why don't Europeans buy more American cars?",
        "description": "Trump wants US vehicles to be more popular in Europe, but it's a difficult market for them to crack.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "'This battle is my 9 to 5 - I won't stop until I have my £620m of Bitcoin back'",
        "description": "James Howells claimed his ex-girlfriend threw out the hard drive, today worth £620m, in 2013.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "What happens in the world's deepest gypsum mine?",
        "description": "The mine is 1,000ft (305m) below ground and its raw materials are used in the building industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "'Gnarly' battle over £1m farmhouse as off-grid group refuse to leave",
        "description": "The non-hierarchical group live communally and are dedicated to sustainable living.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Scattered anti-Musk protests target Tesla dealerships",
        "description": "Protesters organized small #TeslaTakeover demonstrations on BlueSky, the rival to Musk's platform X.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "What it means when Elon Musk brings his children to work",
        "description": "You'll sometimes see one of his children on his shoulders as billionaire Elon Musk makes public appearances.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Is Trump right when he says the US faces unfair trade?",
        "description": "He wants to hit back at countries that place import taxes on American goods that he thinks are too high.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Too quiet on set? Hollywood pushes for more LA productions post wildfires",
        "description": "January's wildfires have exacerbated the decline of Hollywood's once booming film and television industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Five key takeaways from Modi-Trump talks",
        "description": "Modi and Trump rekindle ties amid a global trade war, balancing tariffs, trade deals and strategic interests.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "What we've learned about Rachel Reeves's expenses - and the Labour response",
        "description": "Senior figures defended the chancellor after we revealed her expenses were investigated before she was an MP.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Why Muslims in India are opposing changes to a property law",
        "description": "Muslim groups say the changes are politically motivated but the government says it is responding to demands for reform.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Uber and Bolt drivers strike on Valentine's Day",
        "description": "Thousands of drivers are taking part in the strike action over pay and working conditions, a union says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "US politicians furious at UK demand for encrypted Apple data",
        "description": "They say the US should re-evaluate its cyber-security partnership with the UK unless the \"dangerous\" request is withdrawn.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Trump tariff VAT threat raises fears of hit to UK",
        "description": "The surprise inclusion of VAT to calculate tariffs prompts questions over the possible impact on British businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "TikTok returns to Apple and Google app stores in the US",
        "description": "TikTok is again available on app stores in the US after President Donald Trump delayed a ban on the app.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "More migrant workers claim UK farm exploitation",
        "description": "The UK government says it always takes \"decisive action\" where abusive practices are found on farms.",
        "source": "BBC Business",
        "fetched_date": "2025-02-18T07:22:51.371796"
    },
    {
        "title": "Meet KiiiKiii: First Look at the New K-Pop Group Poised for Global Teen Pop Stardom (Exclusive)",
        "description": "Get an exclusive behind-the-scenes look at the girl group’s first music video for their prerelease single, \"I Do Me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Julianne Moore Expresses “Great Shock” Over ‘Freckleface Strawberry’ Book Being “Banned by the Trump Administration”",
        "description": "The Oscar-winning actress said she was “truly saddened” that her semi-autobiographical picture book was under “further review” by the Department of Defense, highlighting her multiple military connections.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Hollywood Flashback: Sam Peckinpah Put Bob Dylan Through the Wringer",
        "description": "Peter Biskind recalls the time the legendary director hired the folk singer to work on his 1973 Western but made sure he knew who was boss.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Kim Sae-ron, South Korean Actress Known for ‘A Brand New Life’ and ‘The Man From Nowhere,’ Dies at 24",
        "description": "The promising young actress' career took a hit after a drunk driving incident in 2022, and she was found dead at home on Sunday, according to South Korea's Yonhap News Agency.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Shop Talk: 6 Berlin Boutiques You Don’t Want to Miss",
        "description": "The city’s fashion and design scene threads together innovative, progressive and countercultural elements into a style all its own.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "K-Pop Star Wonho on Touring, Working “Really Hard” on a New Album and What’s Next For Him",
        "description": "The 31-year-old singer has been busy in the five months since returning from his military enlistment with meeting fans in the U.S., performing at Jingle Ball shows and releasing new music.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Amazon CEO “Incredibly Relieved” After Employee’s Release From Being Held Hostage Since Oct. 7 Attacks",
        "description": "\"Since we learned of Sasha [Troufanov] and his family’s abduction, we’ve had a dedicated team working behind the scenes with experts to support efforts to secure their release,\" Andy Jassy said Saturday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Berlin According To… Susan Wendt, Managing Director, Sales, TrustNordisk",
        "description": "The veteran sales exec weighs in on how to stay warm, where to take a stroll and how to ward off the festival flu (it involves a bitters liquor).",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "6 Ways to Get to Know Berlin (Inside and Out)",
        "description": "Never tackle Berlin without a plan: A well-thought-out day exploring the city means having an agenda of both indoor and outdoor options.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Sheryl Crow Says “So Long Tesla,” Donates Money to NPR: “Under Threat By President Musk”",
        "description": "The Grammy-winning singer sold her Elon Musk-manufactured Tesla because she's no longer \"willing to align\" herself with the billionaire following his move into the Trump administration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Murdoch Family Drama Details Emerge After Nevada Trial Ruling Over Fate of Empire",
        "description": "The Roy clan of HBO's 'Succession' has nothin' on the bitter and deep divides in the Murdoch family, as is revealed this week in an Atlantic Magazine feature.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Blink-182 Reunite With Former Guitarist Matt Skiba at L.A. Fire Relief Concert",
        "description": "The band performed a sold-out show at the Hollywood Palladium, with proceeds benefiting those impacted by the recent Los Angeles wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-18T07:22:52.236264"
    },
    {
        "title": "Souths confirm Latrell Mitchell playing return",
        "description": "After a slew of big names sat in the sidelines last week the wait is over for NRL fans with the star power injected for the final week of trial games including one of the game’s best.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Setbacks to test Bulldogs: Bont",
        "description": "Western Bulldogs skipper Marcus Bontempelli believes the handful of early-season setbacks will test the club’s depth and resilience.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Host raises eyebrows in see-through dress",
        "description": "A football presenter has set pulses racing after appearing on a live broadcast in an outfit that has caused a global stir.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Gold Coast Suns hacked as attack goes viral",
        "description": "The Gold Coast Suns have issued an apology after the AFL club was compromised in bizarre fashion on Tuesday.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Complete madness as Konstas loses plot",
        "description": "Sam Konstas has gone from a relatively unknown prospect to a household name this summer but his latest act has not gone down well.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Big problem with unusual Australian squad",
        "description": "There is a key detail missing from Australia’s squad for the Champions Trophy with the unusual line-up raising eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Sinner at centre of bombshell Djokovic claim",
        "description": "Novak Djokovic has called out a blatant double standard in tennis after World No.1 Jannik Sinner was hit with a three-month ban.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "‘Cheat’: Aus Open ‘stained’ as bombshell drops",
        "description": "There have been calls for Jannik Sinner to be stripped of his Australian Open title over one detail in his doping ban settlement.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Setbacks to test Bulldogs: Bont",
        "description": "Western Bulldogs skipper Marcus Bontempelli believes the handful of early-season setbacks will test the club’s depth and resilience.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Gold Coast Suns hacked as attack goes viral",
        "description": "The Gold Coast Suns have issued an apology after the AFL club was compromised in bizarre fashion on Tuesday.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "NRL Teams: Teddy, Latrell rolled out in near full-strength line-ups",
        "description": "The Roosters and Rabbitohs are among a number of clubs set to roll out near full strength squads for week three of the pre-season challenge. See the full team lists.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Souths confirm Latrell Mitchell playing return",
        "description": "After a slew of big names sat in the sidelines last week the wait is over for NRL fans with the star power injected for the final week of trial games including one of the game’s best.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "NBA star Australia forgot drops Boomers bomb",
        "description": "NBA All-Star Kyrie Irving has Australian basketball in a spin with extraordinary moves being made behind the scenes.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "NBA star slammed over racy holiday snap",
        "description": "Philadelphia 76ers $333m man Paul George has been torn to shreds after sharing snaps on holidays over the NBA All-Star weekend.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Host raises eyebrows in see-through dress",
        "description": "A football presenter has set pulses racing after appearing on a live broadcast in an outfit that has caused a global stir.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "A-League shamed as star quits amid lewd act",
        "description": "Macarthur captain Valere Germain has sensationally terminated his contract ahead of the A-League finals, citing poor refereeing standards.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Mike Tyson addresses huge Jake Paul claim",
        "description": "Boxing great Mike Tyson has addressed a major health rumour started by his last opponent Jake Paul.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Team moves, series revamp: Your 2025 Supercars Ultimate Guide",
        "description": "The Supercars season is right around the corner – and there’s plenty that has changed since last year. Here’s everything you need to know about the series revamp, team changes and upcoming milestones.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Schumacher wife upset over prison sentence",
        "description": "Sentences have been handed down and new details have emerged about the plot to blackmail the family of Formula 1 legend Michael Schumacher.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "NBA star Australia forgot drops Boomers bomb",
        "description": "NBA All-Star Kyrie Irving has Australian basketball in a spin with extraordinary moves being made behind the scenes.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Aussie PGA dates revealed",
        "description": "This year’s Australian PGA Championship will be played in the last week November at Royal Queensland.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Espionage could be afoot in Oakleigh Plate",
        "description": "Returning colt Espionage will be action at Caulfield on Saturday and co-trainer Adrian Bott is keen to see the three-year-old take on the older horses in the Group 1 Oakleigh Plate.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Wallabies skipper won’t pressure Reds coach",
        "description": "Reds mentor Les Kiss is considered the favourite to replace Joe Schmidt as Wallabies mentor, but for now his sole focus is guiding Queensland to Super Rugby Pacific glory, according to Australia’s captain, Harry Wilson.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Queensland Reds win race for best teenage forward in Australia",
        "description": "Eligible for both the Springboks and Wallabies, the Gold Coast powerhouse announced himself to the international rugby scene by leading Australia to victory over New Zealand.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "‘Tacky’: Reality Taylor Swift can’t escape",
        "description": "Taylor Swift might be one of the most famous and liked women in the world but there’s a wild reality even she can’t escape.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-18T07:22:54.998135"
    }
]