[
    {
        "title": "Coca-Cola says it may use more plastic due to Trump tariffs",
        "description": "Beverage giant's boss says his company may need to action if aluminium cans become more expensive.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Goldman axes diversity rule that has 'served purpose'",
        "description": "The bank ditches a policy that stopped it acting on flotations for firms with an all male, all white board.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Trade, tariffs and visas to dominate Trump-Modi talks",
        "description": "The leaders share a warm relationship, but both will have their own wish list when they meet this week.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Germany's once-mighty car industry is in crisis. What will it take to fix it?",
        "description": "The German auto manufacturing sector is struggling. Can it get back on the road to recovery?",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Goldman axes diversity rule that has 'served purpose'",
        "description": "The bank ditches a policy that stopped it acting on flotations for firms with an all male, all white board.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "The American goods that could rise in price from metal tariffs",
        "description": "Donald Trump's plans for tariffs risk raising prices for items from cars to canned food.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Amazon bans number plates as illegal supply found",
        "description": "A BBC investigation finds seven companies on the platform selling plates without checking customers' documents.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Oil clean-up 'scam' warnings ignored by Shell, whistleblower tells BBC",
        "description": "The oil giant faces allegations it ignored warnings that a clean-up scheme was beset by corruption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "With Trump's tariffs looming - will countries scramble to cut deals?",
        "description": "US steel suppliers have just over a month to decide how to respond before the new tariffs take effect.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Trump's citizenship order leaves expecting Indian immigrant parents in limbo",
        "description": "Thousands of Indian-origin couples in the US are anxious over Trump's plan to end birthright citizenship.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Law firm restricts AI after 'significant' staff use",
        "description": "The chief technology officer of Hill Dickinson warned of the use of AI tools.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Heathrow to expand two terminals ahead of third runway",
        "description": "The chief executive of the UK's largest airport will unveil plans to develop terminals two and five.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "UK and US refuse to sign international AI declaration",
        "description": "It follows a warning from US Vice-President JD Vance that excessive regulation could \"kill a transformative industry.\"",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Trump halts prosecution of firms accused of bribery abroad",
        "description": "Trump has paused enforcement of an anti-corruption law, saying it \"overreached\" and stopped US firms from winning business overseas.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Canada vows swift retaliation to 'unjustified' Trump tariffs",
        "description": "As top exporter of steel and aluminium to the US, Canada sees new trade barriers as a threat to its economy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "BP set to scale back green investments as profits drop sharply",
        "description": "The oil giant is widely expected to say it will scale back on renewables later this month.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "UK not planning to hit back at US on steel tariffs",
        "description": "Trade Minister Douglas Alexander said the UK would not have \"a knee-jerk reaction\" but \"a clear-headed\" response.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Trump says no exemptions with metal tariffs to start in March",
        "description": "The move threatens to have a big impact in Canada, a major source of the metals in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "'We are not for sale,' ChatGPT boss says after Musk bid",
        "description": "Musk's attorney confirmed he had submitted the bid for \"all assets\" of the company on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Data of four dead British teens may have been removed, says TikTok",
        "description": "The parents of four British teenagers are suing the social media firm over the deaths of their children.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Japan ministry worker loses sensitive files on night out",
        "description": "The ministry employee left behind the files and his laptop after drinking with co-workers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "No more minting 'wasteful' pennies, Trump tells Treasury",
        "description": "The US President cites rising costs as the reason for discontinuing production of the one cent coin",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "China's tit-for-tat tariffs on US take effect",
        "description": "Beijing's move comes after President Donald Trump imposed a 10% levy on goods imported from China.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "China's ex-UK ambassador clashes with 'AI godfather' on panel",
        "description": "Fu Ying also expressed regret about the impact of US-China tensions on the progress of AI safety.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "How Spain's economy became the envy of Europe",
        "description": "The growth is led by a tourism boom, with Spain nearing France as the world's most visited country.",
        "source": "BBC Business",
        "fetched_date": "2025-02-12T07:22:52.787287"
    },
    {
        "title": "Liam Payne’s Ex-Fiancée Speaks Out as One Direction Singer’s Final Days Are Detailed in Rolling Stone",
        "description": "The international pop star struggled with demons, his sexuality and his stuttering career ahead of his death in Argentina last year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Lyor Cohen Addresses Kanye West in Open Letter: “I Am Deeply Disappointed and Troubled”",
        "description": "The Def Jam Recordings alum currently serves as global head of music at YouTube.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Coi Leray Signs With Epic Records (Exclusive)",
        "description": "With a new label home (after four years with Universal Music Group) and an EP dropping tonight, the artist proves again that “girls is players too.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Kanye West’s Fashion Brand Yeezy Has Website Shut  Down After Reducing Stock to Nazi T-Shirt",
        "description": "Shopify said that the brand has violated its terms; meanwhile, a former Yeezy staffer filed a suit claiming West sent antisemitic and misogynistic texts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Issa Rae, ‘Last of Us’ Cast Set for SXSW Speakers Line-Up",
        "description": "Conan O’Brien and Kevin Bacon are also set for panels and conversations at the Austin-based conference.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Juno Awards: Josh Ross, Tate McRae Lead With Five Nominations",
        "description": "Shawn Mendes and The Weeknd followed with four nods each for Canada’s versions of the Grammys, to be hosted this year by Michael Bublé.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Blake Lively and Justin Baldoni March Toward Mutually Assured Destruction",
        "description": "The 'It Ends With Us' duo seem hell-bent on controlling the narrative, while the press and public feeding off Hollywood's best feud are the real winners.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Private Plane Owned by Mötley Crüe’s Vince Neil Involved in Fatal Arizona Crash",
        "description": "The singer was not on the plane, but his girlfriend Rain Andreani was one of the several people taken to hospital, and one person died.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Syracuse University’s Bandier Program Announces Inaugural Advisory Board",
        "description": "The entertainment-focused program at Syracuse’s Newhouse School is considered one of the top music business programs in the country.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "John Oliver Welcomes America to Its Monarchy Era in Surprise ‘Daily Show’ Appearance",
        "description": "“America had its little fun, experimenting with democracy,\" Oliver said. \"You fought so hard to get away from us, acting up, throwing all that tea into the harbor — you still owe us for that.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "IVE Is That Girl (Group)",
        "description": "The chart-topping K-Pop group, back with a new album ‘IVE Empathy,’ dish on preparing for their latest release, how they stay close as a group and the biggest lessons they’ve learned since debuting.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "Charlie Puth Condemns Kanye West’s Super Bowl Ad",
        "description": "\"I beg you to stop,\" Puth wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-12T07:22:53.730346"
    },
    {
        "title": "‘Oh my god’: Smith stuns cricket world",
        "description": "Australian star Steve Smith has left jaws on the floor after producing an other-worldly act that you have to see too believe.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Auckland test excites United young gun",
        "description": "Having shocked the A-League earlier this season with a 4-0 thrashing of Auckland FC, Western United get another chance to beat the competition leaders on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Sickening Sam Kerr hypocrisy exposed",
        "description": "The superstar has been found not guilty after a seven-day trial that gripped Australia – but there’s one thing nobody’s talking about.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Mitch Starc steps away for ‘personal reasons’",
        "description": "Mitchell Starc has made a sudden decision to withdraw from Australia’s squad for the Champions Trophy, citing a private matter.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "‘Oh my god’: Smith stuns cricket world",
        "description": "Australian star Steve Smith has left jaws on the floor after producing an other-worldly act that you have to see too believe.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Mitch Starc steps away for ‘personal reasons’",
        "description": "Mitchell Starc has made a sudden decision to withdraw from Australia’s squad for the Champions Trophy, citing a private matter.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Shock career move after star flees country",
        "description": "Italian tennis star Camila Giorgi has changed her career again after sensationally quitting tennis to become a lingerie model last year.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Tennis world loses it over de Minaur speech",
        "description": "Alex de Minaur lost the final, but won the crowd with a classy speech before he let slip a secret he had carried all week.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Bont ‘comfortable’ with delayed contract talks",
        "description": "In the final year of his contract the Western Bulldogs captain is comfortable with delaying talks about an extension after being appointed skipper for the sixth season.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Dogs prepare for life without star",
        "description": "Western Bulldogs will unveil an “adapted” attack against Essendon as Jamarra Ugle-Hagan continues his flexible return plan.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Painful revelations behind star’s retirement",
        "description": "NRL players put themselves through a lot and the full toll of playing for his club and his state has proved too much for the former Storm captain to bear.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Star retires, reveals devastating problem",
        "description": "The powerhouse forward has revealed a secret injury as he announced the difficult decision to hang up his boots immediately.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "‘Expect greatness’: Simmons fired up for new start",
        "description": "After getting to work at his new NBA team, the Australian star says he’s ready to put years of frustration and disappointment behind him.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Aussies stunned by incredible Mailata photo",
        "description": "Jordan Mailata blew everyone away to make Australian sporting history — and now a photo has emerged that’s dropping jaws.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Auckland test excites United young gun",
        "description": "Having shocked the A-League earlier this season with a 4-0 thrashing of Auckland FC, Western United get another chance to beat the competition leaders on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Sickening Sam Kerr hypocrisy exposed",
        "description": "The superstar has been found not guilty after a seven-day trial that gripped Australia – but there’s one thing nobody’s talking about.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "‘P***y’: Why Dana unleashed on Aussie editor",
        "description": "UFC President Dana White has taken aim at the Australian media in an explosive press conference, even calling one Sydney newspaper editor a “p***y”.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "‘Expect greatness’: Simmons fired up for new start",
        "description": "After getting to work at his new NBA team, the Australian star says he’s ready to put years of frustration and disappointment behind him.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "‘Very long time’: LIV’s key Aussie move",
        "description": "As other states circle and LIV’s own future remains up in the air, there was a clear message coming out of Adelaide ahead of this week’s blockbuster event.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Wyong, Sapphire Coast previews: Ryan and Alexiou filly set to Fly",
        "description": "A pair of handy three-year-olds an provide trainers Gerald Ryan and Sterling Alexiou with a couple of wins when they head to Wyong on Thursday.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Suaalii’s new position revealed ahead of Super Rugby opener",
        "description": "After missing NSW’s final trial match against the Brumbies a fortnight ago, Super Rugby’s highest-profile recruit has been given a positional switch for his Waratahs debut.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Reds primed for Super season",
        "description": "The Reds don’t want to waste their good work on a successful pre-season tour of the United Kingdom when they kick-off their Super Rugby Pacific season later this month.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    },
    {
        "title": "World erupts over presenter’s daring dress",
        "description": "A TV presenter has narrowly avoided a wardrobe malfunction while wearing a daring dress during coverage of a major football game.",
        "source": "News AU",
        "fetched_date": "2025-02-12T07:22:55.675715"
    }
]