[
    {
        "title": "Striking Boeing workers reject 35% pay rise offer",
        "description": "Earlier, Boeing's boss warned the firm was at a \"crossroads\" as losses surged to roughly $6bn.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "IMF warns world to avoid global trade war",
        "description": "Economic fears have been rising over Donald Trump's mega-tariff plan and rising US debts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Nigeria drops charges against Binance cryptocurrency boss",
        "description": "Tigran Gambaryan, a US citizen arrested in February, will be allowed abroad to seek medical treatment.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Ohtani's '50-50' baseball sells for record £3.4m",
        "description": "The ball struck by LA Dodgers hitter Shohei Ohtani when he secured a record-breaking 50th home run sells for £3.39m at auction.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Ex-Abercrombie CEO used power, wealth and influence to traffic vulnerable men, prosecutors say",
        "description": "Mike Jeffries and his British partner have been arrested and charged in the alleged sex trafficking of more than a dozen victims.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "IMF warns world to avoid global trade war",
        "description": "Economic fears have been rising over Donald Trump's mega-tariff plan and rising US debts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Customers 'shocked' by hefty Juul settlement payouts",
        "description": "He wasn't expecting much from a class-action suit against vaping firm Juul. Then he got $3,000.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "All aboard Tanzania's electric train breaking new ground for East Africa",
        "description": "An electric fast train - the first in East Africa - now links Tanzania's capital to its commercial hub, Dar es Salaam, in under four hours.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Starbucks boss shakes up menu to win back customers",
        "description": "The coffee shop chain has also promised to look at pricing and staffing to prevent bottlenecks",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Nigeria drops charges against Binance cryptocurrency boss",
        "description": "Tigran Gambaryan, a US citizen arrested in February, will be allowed abroad to seek medical treatment.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "'Election uncertainty driving gold trades' - 23 Oct 2024",
        "description": "Markets analyst Edward Moya says election uncertainty has traders heading for safe haven investments.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Trump has the world’s richest man on his side. What does Musk want?",
        "description": "The SpaceX boss says only his fellow billionaire can save democracy - but some question Musk's motives.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Nerves frayed in Canada and Mexico over US trade relations",
        "description": "As Americans prepare to vote in the presidential election, Canadians and Mexicans mull the likely impact.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Ubisoft confirms Prince of Persia game team disbanded",
        "description": "The French publisher confirms that the well-reviewed title has reached the end of its \"roadmap\".",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Boeing-made satellite breaks up in space",
        "description": "The \"total loss\" of the communications satellite has affected Intelsat customers around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Budget deals struck with all departments, says UK chancellor",
        "description": "Despite reports of internal rifts all government departments have agreed spending settlements, Rachel Reeves says.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Musk v Ambani: Billionaires battle over India's satellite internet",
        "description": "Musk's Starlink and Mukesh Ambani are preparing to face off in India’s satellite broadband market.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Will AI make work burnout worse?",
        "description": "There are numerous AI tools to help simplify tasks for workers - but some argue these are instead contributing to employee burnout.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "McDonald's burgers linked to E. coli outbreak in the US",
        "description": "At least 49 people have been sickened and one person has died, according to the CDC.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Giuliani must turn over $6m NYC apartment to election workers",
        "description": "He has a week to also hand over watches and sports memorabilia to two election Georgia workers who successfully sued him for defamation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "HSBC splits bank between East and West in major overhaul",
        "description": "At the same time the banking giant named its first female finance chief in the firm's 159-year history.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Reeves welcomes IMF's improved growth forecast",
        "description": "The global financial institution predicts stronger UK growth of 1.1% this year and 1.5% next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Facebook and Instagram launch celebrity scam ad crackdown",
        "description": "Celebrities including Elon Musk and Martin Lewis repeatedly feature in ads for products they have not endorsed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "How scammers duped India job seekers with a fake bank",
        "description": "Job scams are not uncommon in India but the setting up of a fake branch still took many by surprise.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Blade Runner 2049 maker sues Musk over robotaxi images",
        "description": "Alcon Entertainment says it denied a request to use material from the film at the Tesla cybercab event.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "UK borrowing rises ahead of Budget",
        "description": "Official data shows borrowing - the difference between spending and tax take - reached £16.6bn last month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "Ex-president of Peru gets 20 years for corruption",
        "description": "Prosecutors say Alejandro Toledo took $35m in bribes from a Brazilian construction company.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "A Netflix for the village - India's start-ups go rural",
        "description": "Many Indian start-ups are shifting their focus to rural consumers, hoping to tap into a new wave of growth.",
        "source": "BBC Business",
        "fetched_date": "2024-10-24T07:23:09.151778"
    },
    {
        "title": "City of Hope Gala Delivers an Elton John Set, David Blaine’s Magic and Surprise Cameo by Celine Dion",
        "description": "Dion made a surprise showing at the podium to present the night's highest honor to AEG Presents chairman and CEO Jay Marciano. Highlights included a fiery trick by Blaine and hosting by Fred Armisen.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Insane Clown Posse’s Violent J Hands Juggalo Vote to Kamala Harris With ‘Daily Show’ Endorsement",
        "description": "The Comedy Central news show went to The Gathering of the Juggalos to have an audience with Violent J, perhaps the counterculture community's most influential member.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Harris and Trump’s Much-Hyped Podcast Appearances Aren’t Transforming the Election: Poll",
        "description": "The nontraditional media strategy may be falling flat, as polling from USA Today/Suffolk University shows fewer than 30 percent of respondents heard either candidate's guest spots.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Stop Screening Your Calls! Stars Are Dialing for Kamala",
        "description": "You don’t see many celebrity ads this election cycle, but a slew of actors (like Jessica Alba and Patton Oswalt) are making their voices heard… on the other end of your telephone. Plus, James Patterson on how he picks his co-authors and Ursula’s costume shop calls it quits.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Menendez Resentencing Decision Moved Up to This Week, L.A. District Attorney Says",
        "description": "George Gascón told CNN he moved up his timeline because of renewed public attention on the case.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Harvey Weinstein in Court: Judge Consolidates Charges for New Trial",
        "description": "The former mogul appeared in court Wednesday after reports of a cancer diagnosis.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Eminem Expresses Support for Kamala Harris at Detroit Rally as Obama Raps Lyrics from “Lose Yourself”",
        "description": "The rapper said people shouldn't be afraid of retribution or of making their opinion known, adding that the vice president \"supports a future for this country where these freedoms and many others will be protected and upheld.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Spanish Government Launches Ambitious Campaign to Promote Booming Film and TV Sectors",
        "description": "From location shoots to homegrown streaming hits like 'Money Heist' and 'Society of the Snow,' film and TV production is thriving in Spain — and the Spanish government continues to play a key role in its growth: “Talent exists everywhere, but not all countries value it equally.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Fernando Valenzuela, Mexican-Born Pitcher Whose Feats for Dodgers Fueled “Fernandomania,” Dies at 63",
        "description": "He remains the only pitcher in MLB history to win the Cy Young and Rookie of the Year awards in the same season.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Geena Davis on Paving the Way for America’s First Female President",
        "description": "The actress and series creator Rod Lurie talk about their groundbreaking ABC show 'Commander in Chief' and its impact on American politics: \"We’re going to get the whole world comfortable with the term Madam President\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "20 Years After First Hitting the Charts, JoJo Enters Her “Flirtatious Era”",
        "description": "The Hollywood Reporter's latest \"Person of Interest\" first rocketed to the top of the music charts two decades ago. The now 33-year-old singer-slash-actress says these days she's trying not to take things too seriously: \"I just want to get into my body and out of my head.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Shyne Says He Was “Set Up to Be the Fall Guy” For 1999 Club Shooting Involving Diddy in Doc Trailer",
        "description": "'The Honorable Shyne' will debut on Hulu on Nov. 18 and follows the rapper-turned-politician's life and career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-24T07:23:10.347302"
    },
    {
        "title": "Star spills the beans on $1m-a-year teammate",
        "description": "Roosters half Sam Walker has reportedly decided his immediate future after a star teammate appeared to spilled the beans.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "UK film star’s surprise Rabbitohs link",
        "description": "Film star Stephen Fry boasts a collection of South Sydney Rabbitohs merch in his house, despite never having watched a game.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Aussie’s title fight with ‘monster’ locked in",
        "description": "Another Australian will fight for a world boxing title after it was confirmed Sam Goodman will take on one of the sport’s biggest names.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "‘One-off’: Bowler’s insight into Test rotation dilemma",
        "description": "A leader of Australia’s attack has responded to calls including from a fast bowling great to commit to playing all Tests this summer.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Swans icon lifts lid on bombshell theory",
        "description": "Sydney premiership coach Paul Roos says players believed umpires were influenced by a public swipe that came from the AFL boss.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "‘Most self-absorbed’: AFL great torches Smith",
        "description": "Steve Smith has come under fire over his antics after a moment at the crease that sets a “shocking example” for the team.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Star spills the beans on $1m-a-year teammate",
        "description": "Roosters half Sam Walker has reportedly decided his immediate future after a star teammate appeared to spilled the beans.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "UK film star’s surprise Rabbitohs link",
        "description": "Film star Stephen Fry boasts a collection of South Sydney Rabbitohs merch in his house, despite never having watched a game.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "‘One-off’: Bowler’s insight into Test rotation dilemma",
        "description": "A leader of Australia’s attack has responded to calls including from a fast bowling great to commit to playing all Tests this summer.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Cricket insanity as world records obliterated",
        "description": "The cricketing world has been rocked by the biggest massacre the sport has ever seen with uncomfortable scenes unfolding.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Tennis bad boy nearing shock Aus return",
        "description": "He’s been forgotten and virtually disowned in Australian tennis circles, but Bernard Tomic has quietly been improving his ranking.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Tennis stars hit out: ‘Stop ruining the sport’",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Olympic great inducted into most elite group",
        "description": "An Olympic champion and a surfing legend are among the new inductees to the most elite group of Australian sportspeople in history.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Norris stripped of podium in wild F1 drama",
        "description": "Lando Norris had a podium finish taken away as the McLaren driver traded protests with Max Verstappen in a wild finish on Monday.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "‘Went crazy’: Aussie golden girl’s sad reveal",
        "description": "Aussie swimming star Ariarne Titmus has opened up on a major health scare, revealing she would give up her Olympic medals for one thing.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "America loses it as Trump streaker ’jailed’",
        "description": "An X-rated entertainer waving a divisive sign has been identified as the woman behind an NFL stadium stunt that has gone viral.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "The secret behind Chiefs success: NFL Week 7 preview",
        "description": "Will another blockbuster WR trade help the Chiefs win back-to-back NFL Super Bowls and the actual secret behind KC’s success",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Classless NBA TV pop-up causes anger",
        "description": "Australian’s may feel frustrated by live sport TV ads, but it’s on another level in the United States — and this one has flopped hard.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Sydney star hamstrung in Japan",
        "description": "Sydney FC coach Ufuk Talay has an important selection decision to make this weekend after his prized import Douglas Costa went off with a hamstring problem in the Sky Blues’ AFC Champions League Two loss in Japan.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "‘Make the right decision’: Matildas’ plea to FA on crucial future call",
        "description": "Having being asked about who should be their next coach, the Matildas say it’s now up to Football Australia to make the right appointment.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Aussie’s title fight with ‘monster’ locked in",
        "description": "Another Australian will fight for a world boxing title after it was confirmed Sam Goodman will take on one of the sport’s biggest names.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "American favourite to contest ‘Aussie majors’",
        "description": "An American golfer and fan-favourite is heading to Australia for the two ‘majors’ in Queensland and Victoria.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "NBL Late Mail: Kings lose star, Cotton details gruesome rib injury",
        "description": "The Kings have copped a cruel injury blow on the eve of their blockbuster clash with the Wildcats, as four-time NBL MVP Bryce Cotton lifts the lid on a rib injury that saw him hospitalised.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "NRL convert in shock Wallabies call",
        "description": "His last game was in an NRL final and now Joseph-Aukuso Suaalii is set to play his next match as a Wallaby in the UK after a rapid elevation and confirmation he’s not going to England just for a ride.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "J-Mac reveals passion for tradition in Group 1 century hunt",
        "description": "If James McDonald is unable to claim his 100th Group 1 in the Cox Plate, there are a few more of his favourite races coming up in Melbourne for him to do so.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    },
    {
        "title": "Second tragedy hits Olympian icon after reveal",
        "description": "After dropping heartbreaking news about his terminal diagnosis, Sir Chris Hoy has gone public with his family’s second secret tragedy.",
        "source": "News AU",
        "fetched_date": "2024-10-24T07:23:11.933858"
    }
]