[
    {
        "title": "Trade trumps geopolitics as Australia PM visits China",
        "description": "Anthony Albanese's visit comes as countries around the world navigate US President Trump's \"America First\" policies.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Canada's Carney talked tough on Trump - now some say he's backing down",
        "description": "Canada has made concessions to win goodwill with the White House. Trump, in return, has threatened steeper tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "'Sour taste': Jellycat pulls supply, leaving UK independent shop owners confused",
        "description": "Jellycat has stopped supplying its plush toys to around 100 independent stores in the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "UK chancellor disappointed after economy unexpectedly shrinks",
        "description": "The economy contracted in May for the second month in a row, adding to pressure on the chancellor.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Canada's Carney talked tough on Trump - now some say he's backing down",
        "description": "Canada has made concessions to win goodwill with the White House. Trump, in return, has threatened steeper tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "More than 1,000 people laid off at US State Department",
        "description": "The involuntary staff reductions are part of the Trump administration's efforts to reduce the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Al Fayed-owned London penthouse has 'leaky roofs and noisy lifts'",
        "description": "An exclusive Park Lane address owned by the Fayed family is at the centre of an eight-year dispute.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "A bridge too far? Prague railway project draws criticism",
        "description": "The 123-year-old Vysehrad railway bridge is set to be replaced but conservationists say it should stay.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "How Trump's tariff chaos could reshape Asia's businesses",
        "description": "The US president's tough stance on global trade is shaking up the region's crucial supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Markets 'betting' tariffs resolve by fall - 11 Jul 2025",
        "description": "Expert says markets are betting that Trump will not want to cause a recession before the US midterms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "'Autofocus' spectacles promise sharp vision, near or far",
        "description": "Start-up firms and researchers are working on lenses that can change their focus.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Trump threatens 35% tariffs on Canadian goods",
        "description": "Trump has threatened blanket levies of 15% or 20% on most trade partners, and says he will soon announce new tariffs on the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Asia is reeling from Trump's tariff salvo – is anyone winning?",
        "description": "The US president has reset the tariffs clock again, leaving Asia's export-driven economies in limbo.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Why is Trump targeting Brazil - and will it backfire for Bolsonaro?",
        "description": "The US president's threatened new tariffs are likely to have major political ramifications in the country.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Original Birkin bag shatters record with £7m sale",
        "description": "The prototype of the most famous bag in fashion, made for Jane Birkin in 1985, smashes auction records.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "When to book and where to stay: Six ways to save money on your summer holiday",
        "description": "Package holidays from the UK to popular destinations are more expensive but there are ways to cut costs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "US government to invest in rare earths production",
        "description": "The government is to become the biggest shareholder in the US's only operational rare earths mine.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Brazil vows to match US tariffs after Trump threatens 50% levy",
        "description": "Trump's threat is over what he calls the \"mistreatment\" of his ally, ex-President Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Four arrested in connection with M&S and Co-op cyber-attacks",
        "description": "Three men and one woman - aged between 17 and 20 - have been arrested in London and the Midlands.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Video game actors' strike officially ends after AI deal",
        "description": "Performers agree to a deal with 10 of the biggest companies in the games industry after reaching a deal on AI.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Holidays from UK to Spain, Cyprus and Turkey soar in price",
        "description": "The cost of all-inclusive family package holidays to many popular destinations has risen this year.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Ferrero to take over US breakfast cereal giant Kellogg",
        "description": "The $3.1bn acquisition is part of a broader expansion by the Italian chocolate company.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "India and China strive to reset ties but with caution",
        "description": "Bilateral relations between India and China have improved since the 2020 clash - but larger challenges remain.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Linda Yaccarino departs as boss of Musk's X",
        "description": "Her exit comes at a difficult time for Musk who, in a brief reply, thanked her for her \"contributions.\"",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Trump threatens Brazil with 50% tariff and demands Bolsonaro's trial end",
        "description": "Trump accused Brazil of \"attacks\" on US tech companies and conducting a \"witch hunt\" against its former president Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Why Trump invited five African leaders to the White House",
        "description": "The presidents of Gabon, Guinea-Bissau, Liberia, Mauritania and Senegal hope to be offered \"incredible\" deals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-12T07:27:12.236880"
    },
    {
        "title": "Justin Bieber’s ‘Swag’: A Track-by-Track Breakdown",
        "description": "R&Bieber is back for his first album in four years: a 21-track collection that's both earnest and doesn’t take itself too seriously.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Julian McMahon’s Cause of Death Revealed",
        "description": "The actor known for his work on 'Nip/Tuck,' 'Charmed' and 'Fantastic Four' died on July 2 after a private battle with cancer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Travis Scott Reveals Sunday Release Date for ‘Jackboys 2’",
        "description": "\"The Jack is back with 17 tracks full of trunk rattling classics in the making,\" reads the album promo art Scott shared Thursday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Benny Blanco Says He Shazams His Own Songs Sometimes: “I Can’t Remember Anything”",
        "description": "The record producer said \"he's been making songs for 16 years\" and can't remember them all.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "‘KPop Demon Hunters’ Cannot Be Stopped on the Charts",
        "description": "The Netflix film’s song, “Golden,” just hit No. 1 on Spotify’s Daily Top Songs Global Chart and earned seven entries on this week’s Billboard Hot 100.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Kanye West’s Ex-Assistant Adds Sexual Battery and Sex Trafficking to Claims in Lawsuit",
        "description": "OnlyFans model Lauren Pisciotta had previously sued the rapper, for whom she worked from 2021 to 2024.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Doechii on Viral BET Awards Speech Calling Out President Trump: “Wasn’t Sh** They Could Do”",
        "description": "In a new 'British Vogue' cover story, the Grammy-winning performer said she “felt like I needed to use that moment” to respond to the immigration raids happening outside of L.A.’s Peacock Theater.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "OneRepublic Leaves Interscope After 18 Years, Sign New Deal With BMG",
        "description": "BMG will release the band's upcoming seventh album, with lead single \"Beautiful Colors\" set for release on July 25.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Tyler Perry Accuser Derek Dixon Speaks: “I Couldn’t Stay Silent Anymore” (Exclusive)",
        "description": "In his first interview since filing a $260 million sexual assault claim against the Madea creator, actor Derek Dixon says he felt compelled to go public because “everyone deserves to go to work and do their job without their boss trying to have sex with them.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Justin Bieber to Release Seventh Album on Friday (Exclusive)",
        "description": "Surprise! Sources say the long-awaited project includes features from Gunna, Sexyy Red and Cash Cobain.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Rob Thomas Signs With Universal After Two Decades at Atlantic Records",
        "description": "The label switch was a smooth one for the Matchbox Twenty singer, who drops new music on July 11.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    },
    {
        "title": "Why Wet Leg’s Rhian Teasdale Can’t Stop Writing Silly Love Songs",
        "description": "The sarcasm-loving British post punk band was the surprise sensation at 2023’s Grammys. Now they’re back for more — with a little less sass but a lot more heart.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-12T07:27:12.556451"
    }
]