[
    {
        "title": "European stock markets plunge on opening as US tariffs cause slumps across Asia",
        "description": "The drop in European markets follows similar falls across Asia - but Donald Trump again defends his tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Tariffs: Why was there a 'bloodbath' on Asian markets?",
        "description": "Major stock indexes from Shanghai to Tokyo and Sydney to Hong Kong plunged when they opened on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Trump has turned his back on the foundation of US economic might - the fallout will be messy",
        "description": "What made the US step back from the system that it profited handsomely from for decades?",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Carmakers mull action over tariffs as JLR pauses car exports to US",
        "description": "The British firm say no vehicles will be shipped in April as it processes the impact of Donald Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Tariffs: Why was there a 'bloodbath' on Asian markets?",
        "description": "Major stock indexes from Shanghai to Tokyo and Sydney to Hong Kong plunged when they opened on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "'Sometimes you have to take medicine': Trump defends sweeping tariffs",
        "description": "Just hours after Trump's comments, stock markets plunged in Asia early on Monday, with Hong Kong's Hang Seng losing 9.8%.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "How PM might tackle impact of Trump tariffs",
        "description": "The BBC understands the PM is considering several options to mitigate the impact of US tariffs on the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Why shoppers are snapping up 'stripes' products for eye-popping prices",
        "description": "As Canada's Hudson's Bay Company faces an end to its 355-year legacy, shoppers are scrambling for anything with its iconic \"stripes\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Spain tackles housing 'social emergency' as rents double in a decade",
        "description": "The Spanish government is moving to make renting more affordable and boost the supply of homes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Week in Markets - 4 Apr 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Zimbabwe to scrap tariffs on US goods as it faces 18% Trump levy",
        "description": "President Mnangawa says he wants improved relations, days after Donald Trump said the US would impose an 18% tariff on Zimbabwe.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Starmer vows to protect UK businesses from tariff 'storm'",
        "description": "Starmer says he will take a \"cool-headed\" approach on tariffs but all options remain on the table.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "How worried should we be about tumbling stock markets?",
        "description": "Workers are right to fear for their pensions, but the greater worry is the here and now - the economy they live in.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "EU firms will try for lower tariffs via NI, says Nobel economist",
        "description": "US President Donald Trump has imposed a 10% tariff on UK goods, but a 20% tariff on EU goods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Trump urges US to 'hang tough' as 10% tariffs come into effect",
        "description": "It comes on the largest day of protests against Trump's administration since he returned to office.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Starmer's response to Trump tariffs is both to slow down and go faster",
        "description": "What's happening in Whitehall to try to limit the harm to the UK, perhaps by making a deal with the US, and make the most of any opportunities?",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Trump's agenda grapples with political and economic reality",
        "description": "Trump says it’s all going to plan but stock market turmoil plus struggles at home and abroad show how hard it is to deliver as president.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "'Sometimes you have to walk through fire': Tariffs get backing in Trump heartland",
        "description": "As economic uncertainty swirls and the markets take a hit, many in this deeply Republican area back the president's plan.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "How might tariffs change the price of Nike's iconic trainers?",
        "description": "What impact will the introduction of hefty tariffs on countries in Asia have on Nike's iconic US trainer?",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Trump extends deadline to keep TikTok running in US",
        "description": "The president has granted the app a second 75-day extension to comply with a law that requires it to either sell its US assets or face a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Who's trying to buy TikTok?",
        "description": "Oracle, Microsoft and the founder of OnlyFans are also among names that have cropped up as the president seeks to broker a deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Sam Altman's AI-generated cricket jersey image gets Indians talking",
        "description": "Some found the image delightful, but others wondered about OpenAI founder's motives for wooing India.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Will £75 be the new normal for video games after Switch 2's Mario Kart?",
        "description": "There's a lot of excitement about the new console - but also concern about the high price of its games.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Trump's tariffs could be death knell for  US-Africa trade pact",
        "description": "Some African countries got privileged access to US markets, but the future of that deal is uncertain.",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Americans could pay more for these everyday basics under Trump's new tariffs",
        "description": "The next cup of coffee, Shein shopping haul and more may soon cost more as tariffs take effect",
        "source": "BBC Business",
        "fetched_date": "2025-04-07T07:27:42.752829"
    },
    {
        "title": "Ed Sheeran and Weezer Join Coachella 2025 Lineup",
        "description": "Their addition comes after FKA Twigs dropped out of the festival due to \"ongoing visa issues.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "FKA Twigs Cancels Coachella Performances, Remaining Tour Dates Over Visa Issues",
        "description": "The British singer-songwriter was also scheduled to perform at AXE Ceremonia.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Why Hollywood Feuds Aren’t What They Used to Be",
        "description": "Baldoni vs. Lively is the latest in a long, claw-scarred history of celebrity battles. A former reality show producer (who knows a thing or two about conflict) recalls how the more vintage clashes benefited from a dash of class.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Paul Schrader Accused of Sexually Harassing Former Assistant and Backing Out of Settlement",
        "description": "Schrader’s attorney denies the accusations, calling the legal filing a “desperate, opportunistic and frivolous lawsuit to enforce a settlement that was never signed by” the 'Taxi Driver' and 'Raging Bull' screenwriter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "OK Go’s Damian Kulash On Two Decades of Making “Ridiculous” Viral Music Videos",
        "description": "Kulash and the band's bass player Tim Nordwind sat down for a panel earlier this week with music video director Aaron Duffy.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Prosecutors Bring Third Superseding Indictment Against Sean “Diddy” Combs",
        "description": "In total, the mogul faces five counts on three charges of racketeering, sex trafficking and transportation to engage in prostitution. He awaits trial in a Brooklyn jail.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Drake Bell Talks Using Music to Heal From Child Acting Trauma: “I Tell My Story Through My Art",
        "description": "The ‘Drake and Josh’ star tells THR he's “exhausted” answering the same questions about working with sex abuser Brian Peck on a Nickelodeon kids TV series as he touts his latest album, 'Non-Stop Flight.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "How the Coastal Record Labels Crashed Nashville: “Artists Don’t Have to Follow Those Old Rules”",
        "description": "Country is one of the hottest genres in music, and now labels outside of the old Nashville system have come to town to cash in.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Coldplay Featured on New Version of League of Legends ‘Arcane’ Song “Ma Meilleure Ennemie” (Exclusive)",
        "description": "Coldplay's feature comes as Riot Games and Virgin Music released an extended version of 'Arcane's season two soundtrack.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Elton John and Brandi Carlile Release Collaborative Album ’Who Believes in Angels?’",
        "description": "The duo recently played a one-night only engagement in London that will air as a concert special on CBS this Sunday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Mel Gibson’s Gun Rights Restored by Justice Department (Report)",
        "description": "The decision comes after former U.S. Pardon Attorney Elizabeth G. Oyer claimed she was fired from the DOJ for refusing to recommend the actor be allowed to carry a handgun again.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Ed Sheeran Drops First Single “Azizam” From Eighth Studio Album",
        "description": "The new song is the first from Sheeran’s forthcoming album ‘Play.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-07T07:27:42.992581"
    },
    {
        "title": "Nation claims record, icon wiped from history",
        "description": "One of the most iconic figures in American sports has been on top of the record books for decades, but he has finally been knocked off.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Coach slammed for ‘dangerous’ presser move",
        "description": "North Melbourne coach Alastair Clarkson has been called out over his post-game press conference in the wake of another loss.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Bulldogs make major coaching change",
        "description": "The Bulldogs have locked in a major piece of the puzzle for their inaugural NRLW season, with a familiar name set to coach the team in 2025.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "AFL great torches coach in blistering rant",
        "description": "An AFL great has delivered a scathing rant in the direction of Geelong coach Chris Scott in the wake of recent comments he made.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Bulldogs make major coaching change",
        "description": "The Bulldogs have locked in a major piece of the puzzle for their inaugural NRLW season, with a familiar name set to coach the team in 2025.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Bulldogs sign rugby league journeyman to lead NRLW team",
        "description": "Phil Gould has finished his exhaustive search to find a coach for the Bulldogs’ NRLW team, knocking back up to 90 applicants for the role to settle on a former Fijian international.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "AFL Now: Levi already proving he’s ‘not another Ashcroft’",
        "description": "His father is a Lions hall of famer and 3x premiership winner, his brother the reigning Norm Smith medallist, but Levi Ashcroft says the pressure of his famous last name is a blessing, not a curse.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Coach slammed for ‘dangerous’ presser move",
        "description": "North Melbourne coach Alastair Clarkson has been called out over his post-game press conference in the wake of another loss.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "‘Abused’ Aussie batter gets last laugh",
        "description": "Last time Marcus Harris was at Lord’s he was copping it from the crowd but the former Test opener made a statement on his return.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Never-seen-before act stuns cricket world",
        "description": "Cricket fans couldn’t believe their eyes when a Sri Lankan star did something rarely seen before during his debut IPL match.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Aussie tennis star fumes at influencer reality",
        "description": "Aussie star Daria Saville has called out ‘marketing teams’ behind the rise of tennis influencers, something she said is costing players dearly.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Sinner’s ex-trainer drops doping bombshell",
        "description": "Jannik Sinner’s former trainer has reignited the doping case that rocked tennis by dropping a bombshell that’s bad news for one person.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "‘Scary’ star set to tear Australia apart",
        "description": "One player is tipped to make such a difference to Super Netball that “something will have to go horribly wrong” for her team not to win the premiership.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Ugly clip shows Aussie F1 ace hid huge secret",
        "description": "Aussie Jack Doohan didn’t want to talk to reporters at the Japanese Grand Prix and brutal footage shows why he was hiding a secret.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Piastri speaks out on McLaren team orders call",
        "description": "The decision to not move Lando Norris aside and give Oscar Piastri a crack at Max Verstappen has been viewed as a missed opportunity — and the Aussie star has weighed in.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Poll: 1st Colts comp offering rising rugby talent a second chance",
        "description": "It’s a comp helping launch young talent and identifying others who may have slipped under the radar and Waratah selectors will be monitoring every game of Colts in 2025 for future stars",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "New AI move in Aus sport infuriates",
        "description": "Aussie sporting teams are in hot water after using a new AI feature that can generate artwork in seconds, in a move on the nose to fan bases and artists alike.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Nation claims record, icon wiped from history",
        "description": "One of the most iconic figures in American sports has been on top of the record books for decades, but he has finally been knocked off.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Shaq: ‘Ben Simmons needs to be arrested’",
        "description": "NBA icon Shaquille O’Neal has taken a flamethrower to Ben Simmons in a stunning take-down, declaring he “needs to be arrested”.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Why Matildas can’t make Mary Fowler experiment work",
        "description": "Mary Fowler is one of the top players on the planet, and is viewed as the Matildas’ saviour. But after announcing herself as a star at the 2023 World Cup, has struggled to find a place in the team.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "‘Should be ashamed’: Vile chant goes too far",
        "description": "Manchester United fans have been savaged after unleashing an ugly chant not at a rival fan himself but at his mother.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Tszyu’s wife blindsided by family revelation",
        "description": "Tim Tszyu stunned the boxing world by putting on a clinic against Joey Spencer before shocking his wife with a claim about their kids.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "‘Winning formula’: Smith’s massive change for Masters success",
        "description": "Cam Smith has finished second and third at the Masters where he has a great record without winning but will take a special lucky charm to Augusta this week.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Shaq: ‘Ben Simmons needs to be arrested’",
        "description": "NBA icon Shaquille O’Neal has taken a flamethrower to Ben Simmons in a stunning take-down, declaring he “needs to be arrested”.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "‘He ran his heart out’: J-Mac, Romantic Warrior fall agonisingly short",
        "description": "Star jockey James McDonald and Hong Kong idol Romantic Warrior have fallen agonisingly short in a second successive Middle Eastern Group 1, beaten a nose by Soul Rush in a thrilling Group 1 Dubai Turf (1800m) at Meydan overnight.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Schumacher announcement delights F1 world",
        "description": "Michael Schumacher’s family are celebrating some happy news after the F1 legend’s child made a heartwarming announcement.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    },
    {
        "title": "Hollywood rocked by Aussie’s tragic death",
        "description": "An Australian mixed martial arts legend, who helped train countless Hollywood stars for iconic movies, has tragically passed away.",
        "source": "News AU",
        "fetched_date": "2025-04-07T07:27:45.348991"
    }
]