[
    {
        "title": "'I can't keep up': Trump's changing tariffs leave shoppers feeling paralysed",
        "description": "The rapid change of Trump's tariff policy has shoppers wondering if they should stock up or just wait this out.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "UK takes control of British Steel under emergency powers",
        "description": "Business Secretary Jonathan Reynolds says nationalisation is \"likely\" next step as Parliament rushes law through.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "US coffee shops worried about bitter price hike after tariffs",
        "description": "Higher prices are worrying independent US coffee shops, which import almost all their beans.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Why Beijing is not backing down on tariffs",
        "description": "Amid a trade war with the US, our China correspondent explains why Beijing doesn't need to change tactics.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "UK takes control of British Steel under emergency powers",
        "description": "Business Secretary Jonathan Reynolds says nationalisation is \"likely\" next step as Parliament rushes law through.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Chris Mason: British Steel law rushed through Parliament but it is just a stop gap",
        "description": "For all of Saturday's drama, the government's intervention so far is just a stop gap, writes our political editor.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Universal theme park is coming to the UK - so what could it look like?",
        "description": "Imagination should have no limit when drawing up new resorts, rollercoaster and theme park experts say.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Trump exempts smartphones and computers from new tariffs",
        "description": "It follows concerns that tech prices could skyrocket, as many gadgets are made in China, with the US president saying he will give more detail on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Week in Markets - 11 Apr 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Do we need cocoa-free chocolate and is it nice?",
        "description": "Cocoa prices are soaring so new chocolate firms are looking at an alternative ingredient.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "OpenAI sues Elon Musk, claiming 'bad-faith tactics'",
        "description": "Claim follows Mr Musk's own lawsuit earlier this year against OpenAI's Sam Altman.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "UK MPs approve emergency law to save British Steel as PM Starmer meets workers",
        "description": "This bill allows the business secretary to direct the board and staff of British Steel, as work can start soon.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Australia's looming election brings housing crisis into focus",
        "description": "Australia's housing crisis has hit its worst point in decades, becoming a key issue in the upcoming election.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "UK economy grew more than expected in February",
        "description": "Analysts warn the unexpected growth could prove short-lived due to the threat of US tariffs and business tax rises.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Trump had five tariff goals - has he achieved any of them?",
        "description": "The president made a partial reversal this week - here's a look at where it leaves five of his key ambitions.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Will trade-shy India gain edge in tariff-driven slowdown?",
        "description": "India's trade detachment may cushion it as others scramble to adjust to Trump’s 90-day tariff pause.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "General strike hits transport in Argentina",
        "description": "President Javier Milei has made sweeping cuts to public services since he took office 16 months ago.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Two American Airlines jets clip wings on ground at Reagan airport",
        "description": "At least two members of Congress were aboard one of the flights when the minor collision occurred.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "What does Trump's tariff pause mean for global trade?",
        "description": "What is the situation after the historic upheaval in American trade policy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Investors facing tariff turmoil: 'It's fastest finger first'",
        "description": "Traders are trying to reckon with impact of Trump's shifting tariff policy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Prada to buy rival fashion brand Versace for $1.36bn",
        "description": "The deal to unite the two Italian brands has an estimated value of $1.36bn (£1.06bn).",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Trump may have backtracked, but this is far from over",
        "description": "There is an anxious wait to find out what comes next - and if a currency war will follow.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Trump allies relieved by tariffs reprieve",
        "description": "A billionaire backer praises Trump's deal-making, while Republicans senators reportedly cheer the reversal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "British Steel talks still deadlocked, source says",
        "description": "A source said the issues being discussed by government officials and the firm remain unresolved.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Will iPhones cost more because of Trump's tariffs on China?",
        "description": "Some analysts say that if costs incurred by tariffs pass to consumers, US iPhone prices could rise by hundreds of dollars.",
        "source": "BBC Business",
        "fetched_date": "2025-04-13T07:23:30.880791"
    },
    {
        "title": "Coachella 2025: All The Special Guest Performances We Know About",
        "description": "Billie Joe Armstrong already came out for The Go-Go's, while Troye Sivan is slated to join Charli xcx on stage later this weekend, sources say.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Bowen Yang Opens Up About “Painful and Detrimental” Experience With Conversion Therapy",
        "description": "The ‘Saturday Night Live’ star shared the ultimatum his parents gave him as a teenager in a preview for NBC’s ’Sunday Sitdown with Willie Geist.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Canadian Singer-Songwriter Bells Larsen Forced to Cancel U.S. Tour Dates Over Anti-Trans Visa Requirements",
        "description": "\"To put it super plainly, because I'm trans (and have an M on my passport), I can't tour the States,\" Larsen wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Bella Thorne Accuses Former Co-Star Mickey Rourke of Injuring Her Genitals on Set: “I Had Bruises on My Pelvic Bone”",
        "description": "\"Working with Mickey was one of the all time worst experiences of my life working as an actress,\" she recalled.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "What Sean “Diddy” Combs’ Rumored New Attorney Mark Geragos Has Said About His Legal Troubles",
        "description": "The reported powerhouse addition to the beleaguered rapper's crack legal team has made many TV appearances to discuss his longtime friend's case.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Joe Rogan Scolded by Own Guest for Pushing Conspiracy Theories",
        "description": "\"You're not asking questions. You're telling people something,\" British conservative columnist Douglas Murray said as he confronted the influential podcaster on his show about Nazi apologist rhetoric from recent guests.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Coachella Talent Agency Count: CAA Rules in Headliners, Wasserman Leads for Most Acts Booked in 2025",
        "description": "Rob Light and Co. swept the top slots, representing Lady Gaga, Green Day and Post Malone.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Coachella Crunch: Festivalgoers Complain of “Dehumanizing” 12-Hour Lines",
        "description": "Car campers take to social media to complain of epic wait times at the popular festival: \"This is a complete s*** show.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "2025 Breakthrough Prize Ceremony Puts Science in the Spotlight",
        "description": "The “Oscars of Science” honor groundbreaking pioneers in science and mathematics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Grace VanderWaal Gets Real on New Album ‘Childstar’: “I’m Not Scared of My Own Story”",
        "description": "“I just feel like for the first time in my life, I was in a comfortable enough space to start exploring those things I’ve ignored for a while,” the singer-songwriter says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Bon Iver Drops ‘SABLE, fABLE,’ First Album in Six Years",
        "description": "'SABLE, fABLE' follows their 2019 Grammy-nominated album 'I,I'.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Lana Del Rey Releases “Henry, Come On,” First Single From Upcoming Album ‘The Right Person Will Stay’",
        "description": "The Grammy nominee first teased the track in January 2024 on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-13T07:23:31.117719"
    },
    {
        "title": "Aussie makes UFC history in wild scenes",
        "description": "Aussie Alex Volkanovski has rewritten the UFC record books, winning an epic title fight to reclaim his belt and become champ again.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Gout Gout sends ominous warning to rival",
        "description": "Australian teen sensation Gout Gout has put his biggest rival on notice as he looks to exact his revenge following a shock loss.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Aussie stars in heated clash, video goes viral",
        "description": "Aussie Test star Travis Head has been forced to explain a heated exchange he had with Glenn Maxwell and Marcus Stoinis in the IPL.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Thurston video says it all as claims rock NRL",
        "description": "Raw footage of Johnathan Thurston’s confrontation with Spencer Leniu has emerged with the NRL legend breaking his silence.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Turuva continues stunning try-scoring run",
        "description": "Star Wests Tigers recruit Sunia Turuva has notched his seventh try of the year to sit second in the NRL behind only Brisbane’s Jesse Arthars.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Thurston video says it all as claims rock NRL",
        "description": "Raw footage of Johnathan Thurston’s confrontation with Spencer Leniu has emerged with the NRL legend breaking his silence.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Stringer breaks Giant drought, NWM continues hot Saints form",
        "description": "Another cracker in Norwood could be on the cards as the Saints and Giants go head-to-head, with Jake Stringer finally getting himself on the board for his new club. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "AFL star slams Premier’s ‘bizarre’ comment",
        "description": "An Aussie rules legend said Jacinta Allan’s decision to weigh in on an incident with an AFL player was “bizarre” while the state grapples with a crime wave.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Aussie stars in heated clash, video goes viral",
        "description": "Aussie Test star Travis Head has been forced to explain a heated exchange he had with Glenn Maxwell and Marcus Stoinis in the IPL.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Probe launched into match-fixing incident",
        "description": "A potential match-fixing incident has left the cricket world in disbelief with an investigation being launched after the shocking scenes.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Consolation win for Australia",
        "description": "Playing for pride, Australia bounced back from its loss to Kazakhstan with a win over Colombia in the Billie Jean King Cup Group D qualifier in Brisbane.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "‘Insane’ : De Minaur blows tennis world away",
        "description": "Aussie Alex de Minaur is the talk of the tennis world right now after an act of total insanity that has shattered records.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "AFL club ‘in a hell of a lot of trouble’ right now",
        "description": "An often forgotten AFL team is preparing to unleash a massive war chest, while other clubs are “in a hell of a lot of trouble”.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Piastri takes pole before punishment drama",
        "description": "There has been high drama in Bahrain with Oscar Piastri taking pole position while his teammate’s sad gesture has raised eyebrows.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Piastri dominates title rivals to snatch pole position in Bahrain",
        "description": "Oscar Piastri has claimed pole position at the Bahrain Grand Prix, with stablemate Lando Norris left frustrated after a much tougher day out at qualifying.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "‘True team man’: Aussie NRL recruit’s surprise visit",
        "description": "A favourite son was a surprise visitor at Queensland training on Friday to further boost spirits ahead of a massive milestone match.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Broken arm sidelines Wallabies captain",
        "description": "Wallabies captain Harry Wilson has suffered an unfortunate injury blow ahead of Queensland’s battle with the ACT Brumbies.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "‘No way I’m playing’: Luka’s emotional return",
        "description": "Luka Doncic was in tears in his emotionally charged, highly-anticipated return to Dallas before producing a vintage display.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Josh Giddey stuns America with ‘monster’ game",
        "description": "Josh Giddey’s NBA hot streak has continued with the Aussie young gun notching up a milestone that puts him in an exclusive club.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Sam Kerr’s nan breaks silence on crash",
        "description": "Sam Kerr’s grandmother has defied the odds to celebrate her 90th birthday, after suffering horrific injuries when she was struck by a car while getting off a bus.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Arsenal held by Brentford as faint title hopes fade",
        "description": "Arsenal’s faint Premier League title hopes were effectively extinguished as a late equaliser from Yoane Wissa earned Brentford a 1-1 draw. EPL WRAP",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Aussie makes UFC history in wild scenes",
        "description": "Aussie Alex Volkanovski has rewritten the UFC record books, winning an epic title fight to reclaim his belt and become champ again.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Aussie surges, McIlroy roars back at Augusta",
        "description": "Rory McIlroy’s epic charge put him back in the mix, while a LIV star impressed and an Aussie just missed an all-time Masters record.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "‘No way I’m playing’: Luka’s emotional return",
        "description": "Luka Doncic was in tears in his emotionally charged, highly-anticipated return to Dallas before producing a vintage display.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Mitch Cohen’s Blackbook: Five to follow from Randwick Saturday",
        "description": "Daily Telegraph racing expert Mitch Cohen has run the rule over all the action on Day 2 of The Championships at Royal Randwick.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "12yo quits rugby league over ugly incident",
        "description": "The father of a schoolboy whose shoulder was shattered after a dangerous tackle during a division three rugby league match is calling for change.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    },
    {
        "title": "League hits back after brutal tackle on 12yo",
        "description": "Footage of the tackle shows Oliver being lifted by the other boy and landing on his shoulder.",
        "source": "News AU",
        "fetched_date": "2025-04-13T07:23:33.663448"
    }
]