[
    {
        "title": "US says 'deal' reached with China after trade talks",
        "description": "The US treasury secretary calls the talks \"productive\", while China's vice premier describes them as \"candid\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Trump heads to Saudi Arabia eyeing more investment in US",
        "description": "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Kwik Fit founder Sir Tom Farmer dies aged 84",
        "description": "The Edinburgh-born businessman built the firm into a £1bn business and also owned Hibernian FC.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "'I freaked out and spent $400 online': US consumers on cheap shipping changes",
        "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Trump heads to Saudi Arabia eyeing more investment in US",
        "description": "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "White House and Qatar discuss transfer of luxury jet for Air Force One",
        "description": "Qatar says a deal for \"temporary use\" of the plane is under negotiation, amid media reports of a gift.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Along the Canada border, small-town America feels sting of Trump's trade war",
        "description": "Since the trade war began, crossings between the US and Canada are down some 17%. What has that cost towns such as Port Huron and Michigan?",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "The US and China are finally talking. Why now?",
        "description": "Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "US and China are ready to talk tariffs - who will blink first?",
        "description": "The BBC's journalists in Washington DC and Singapore analyse US and China's moves ahead of the negotiation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "India worried about Chinese 'dumping' as trade tensions with Trump escalate",
        "description": "Experts warn that a flood of cheap Chinese goods could hurt the competitiveness of Indian exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Mexico sues Google over 'Gulf of America' name change",
        "description": "President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Hormone-treated beef will not enter UK after US deal, says government",
        "description": "Farmers are raising questions over how checks will ensure US beef produced using hormones doesn't enter the UK market.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Trump proposes 80% China tariff ahead of trade talks",
        "description": "The meeting is the strongest sign yet that the world's two biggest economies are ready to de-escalate their trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Trump misspeaks and calls toy firm Mattel a country",
        "description": "The US president says tariffs are \"the most misunderstood thing\" in business and threatens more action.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "UK to announce fresh sanctions on Putin's 'shadow fleet'",
        "description": "Officials say action will be taken against up to 100 oil tankers that have been carrying cargo.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "What is in the UK-US tariff deal?",
        "description": "The two nations have announced a deal to reduce tariffs - here's what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "US and UK agree to deal slashing Trump tariffs on cars and metals",
        "description": "It will leave a 10% import tax on most goods shipped from the UK to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "How good is the UK trade pact for America?",
        "description": "In Trump's new trade pact with the UK, we got a glimpse of the types of agreements he may seek across the globe.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Inside the secretive world of Zara",
        "description": "The BBC's Emma Simpson gets a rare glimpse behind the scenes of how the fashion brand operates.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "UK must 'do everything' to rebuild trade with EU, says Bank boss",
        "description": "Andrew Bailey says he does not take a view on Brexit, but reversing the post-Brexit hit to UK-EU trade would be \"beneficial\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Bill Gates plans to give away most of his fortune by 2045",
        "description": "Microsoft founder said he will speed up his charitable giving - and accused Elon Musk and Doge of \"killing children\" through aid cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "US agreement leaves the UK open to do a much more significant EU deal",
        "description": "Economically this US deal is relatively small, although important to very specific sectors.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Chris Mason: Starmer can claim limited win with America deal",
        "description": "The government's diplomatic achievement in sorting this deal before anyone else delivers reprieve to carmakers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Trump deal is a significant achievement for Starmer",
        "description": "The UK looks set to be the first to get a deal since US President Trump unleashed a wave of global tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Apple hits back at US judge's 'extraordinary' contempt order",
        "description": "The legal battle - started by Epic Games - could determine the future of the highly lucrative App Store.",
        "source": "BBC Business",
        "fetched_date": "2025-05-12T07:27:33.374472"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Beyoncé, Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Bad Bunny, Benson Boone, Blackpink, Katy Perry, Shakira, Lil Baby, Ed Sheeran and Morgan Wallen are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Shakira Insisted Label Add “Hips Don’t Lie” to Album: “I Knew I Had a Hit”",
        "description": "The Grammy winner \"had to repackage the albums\" to include the song because they were initially distributed without the track.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Is Europe the Last Bastion of DEI in Film and TV?",
        "description": "European producers are pushing back on Trump's crackdown on diversity initiatives: \"We have no lessons to learn from the boss of America.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Dump Truck Crashes Into Whisky a Go Go Music Venue on Sunset Strip",
        "description": "Mötley Crüe, the Doors, Janis Joplin and Guns N' Roses have all performed at the beloved Los Angeles site.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "The Hollywood Reporter Takes Home 2025 American Society of Magazine Editors Best Cover Award",
        "description": "The news organization won best local magazine cover for THR’s 2024 “The Work Issue,” photographed by Fredrik Broden.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "SoundCloud Says It “Has Never Used Artist Content to Train AI Models” After Backlash on Terms of Service Change",
        "description": "\"Any application of AI at SoundCloud will be designed to support human artists, enhancing the tools, capabilities, reach and opportunities available to them on our platform,\" SoundCloud said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "California Attorney General Says He’s Considering a New Way to Stop Trump’s Hollywood Tariff Plan",
        "description": "The First Amendment could be key, state's top prosecutor Rob Bonta tells The Hollywood Reporter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "This Alternative Artist Landed a Top-20 Chart Debut With an Album Made Almost Entirely on His Phone",
        "description": "Darkroom/Interscope's D4Vd debuted at No. 13 on the Billboard 200 this week, recording most of the album through the popular music creation app BandLab.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Harry Styles Attended Pope Leo XIV’s Historic Conclave Election",
        "description": "The singer joined the crowd gathered at Saint Peter's Square in the Vatican on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Sean “Diddy” Combs Trial Sees Jury Finalization Kicked to Monday So No One Gets “Cold Feet”",
        "description": "The trial should remain on schedule after the defense suggested that the final 12 jurors and six alternates could ask to be excused after spending a weekend contemplating a role in a major celebrity's fate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Stars Talk L.A Wildfires, Home Rebuilds and What to Do With Your Tesla at EMA Impact Summit",
        "description": "Phil Rosenthal, Kevin Nealon, Miranda Cosgrove, Jenna Dewan, Drew Scott and Malin Akerman were among the stars who kicked off the Environmental Media Association event on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Menendez Brothers Attorney Suddenly Nixes Request for D.A.’s Recusal From Resentencing",
        "description": "The brothers' battle to regain their freedom was back in court Friday, but instead of hearing why D.A. Hochman's bias against them means he needs to go, their lawyer killed the motion for withdrawal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-12T07:27:33.750222"
    },
    {
        "title": "Kohli bombshell ends torment for Aussie bowlers",
        "description": "Indian megastar Virat Kohli scored more of his Test runs against Australia than any other opponent and his mastery will become legend now he’s made a huge career call.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "A-League star set for Scotland",
        "description": "One of the A-League’s best players has signed a deal with Scottish Premiership club Aberdeen.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Troubled AFL star checks into health retreat",
        "description": "Jamarra Ugle-Hagan has reportedly taken a key step towards reviving his fledgling AFL career after taking indefinite leave.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Explosive twist in ball tampering controversy",
        "description": "The North Queensland Cowboys find themselves in the spotlight as the NRL’s ball-tampering controversy takes a dramatic turn.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Explosive twist in ball tampering controversy",
        "description": "The North Queensland Cowboys find themselves in the spotlight as the NRL’s ball-tampering controversy takes a dramatic turn.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Coach goes scorched Earth on NRL rival",
        "description": "A premiership-winning NRL coach has slammed a rival for the way they handled trying to get their hands on one of his players.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Troubled AFL star checks into health retreat",
        "description": "Jamarra Ugle-Hagan has reportedly taken a key step towards reviving his fledgling AFL career after taking indefinite leave.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Beloved TV personality reveals why he quit",
        "description": "Former Western Bulldogs star turned popular media personality Luke Darcy has opened up about his shock decision to quit Channel 7.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Kohli bombshell ends torment for Aussie bowlers",
        "description": "Indian megastar Virat Kohli scored more of his Test runs against Australia than any other opponent and his mastery will become legend now he’s made a huge career call.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "All-time Indian great delivers blow to Test cricket",
        "description": "Virat Kohli announcement rocks the cricket world stepping away from another international format.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Andy Murray in shock career change",
        "description": "Tennis legend Andy Murray has made a shock career switch on the back of a largely unsuccessful partnership with Novak Djokovic.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Tears to joy for Aussie French Open wildcard",
        "description": "There will now be 15 Australians in singles action at the French Open after sadness turned to jubilation for one player.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "‘Hoodwinked’: Wayne Bennett sold a lemon",
        "description": "The South Sydney Rabbitohs were meant to turn things around in 2025, instead Wayne Bennett has been sold a lemon in his return to the club.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Piastri topples Ricciardo in the one area we never thought possible",
        "description": "For the first time ever, Oscar Piastri is officially Australia’s most popular F1 driver. But there’s one area he still trails Daniel Ricciardo – even after torching the F1 circuit this year.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Watch: Third closest finish in Supercars history ignites Super 440",
        "description": "Grove Racing star Matt Payne has produced a stunning drive to stave off a fast finishing Broc Feeney in the third-closest finish in Supercars history at Symmons Plains. WATCH THE FINISH",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Aussie star KOd in frightening scenes",
        "description": "Joseph Suaalii left Allianz Stadium on a stretcher after an ugly incident involving teammate Andrew Kellaway.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Reds conquer Tahs after Suaalii’s sickening head clash",
        "description": "With the British and Irish Lions heading to Australia soon, the only concern among New South Wales and Queensland was the health of Joseph-Aukuso Suaalii rather than the scoreboard.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "‘Chaos’: Football star arrested for murder",
        "description": "A former college football star is facing second-degree murder charges after allegedly opening fire in a bar in a chaotic scene.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "‘Unthinkable’: Simmons hits $252m crossroad",
        "description": "Ben Simmons is an NBA free agent and noises coming from around the NBA show he still has some lifelines left to save his career.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "A-League star set for Scotland",
        "description": "One of the A-League’s best players has signed a deal with Scottish Premiership club Aberdeen.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "First games for likely new Matildas coach",
        "description": "The Matildas have announced four upcoming games in Western Australia, with their new coach set to be in charge.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Aussie becomes champ, stuns UFC world",
        "description": "Australian fighter Jack Della Maddalena has produced a masterclass display to become the UFC’s new welterweight champion.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Less is more for Aussie ahead of US PGA",
        "description": "Elvis Smylie will pace himself in the build-up to this week’s US PGA Championship in his bid to make the cut at a golf major for the first time.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Opals lose star as Australia seals Trans-Tasman Challenge titles",
        "description": "Kings star Xavier Cooks has led the Boomers to the Trans-Tasman Challenge title as the Opals ensured Australia claimed both best of three series against New Zealand.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Messara weighs up Scone Cup tilt with The Coast winner",
        "description": "Scone trainer Paul Messara is weighing up running Know Thyself in Friday’s Listed $200,000 Scone Cup (1600m).",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Road attack has to be seen to be believed",
        "description": "Cycling fans couldn’t quite believe their eyes when a rogue intruder ran onto the road, sparking chaos in the Giro d’Italia.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "‘Heart broken’: WWE legend dead at age 60",
        "description": "An icon of the wrestling world has died just weeks after his final match with stars of the industry left “heartbroken”.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    },
    {
        "title": "Brutal truth about Candice, David’s marriage",
        "description": "Candice Warner has opened up about her decade-long marriage to cricketer David Warner, saying the couple have faced their challenges.",
        "source": "News AU",
        "fetched_date": "2025-05-12T07:27:34.861221"
    }
]