[
    {
        "title": "Trump signs order confirming parts of UK-US tariff deal",
        "description": "The pact between the US and UK means tariffs will be reduced on certain goods such as cars entering the US.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Starmer to announce new sanctions targeting Russia",
        "description": "No 10 says G7 allies back the measures - but Donald Trump indicates the US will not impose more sanctions now.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "How the Israel-Iran conflict could affect energy prices",
        "description": "Conflict in the Middle East often leads to higher energy prices, which can feed through to inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "WhatsApp to start showing more adverts in messaging app",
        "description": "People who link their WhatsApp account to Facebook or Instagram will see personalised ads.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Starmer to announce new sanctions targeting Russia",
        "description": "No 10 says G7 allies back the measures - but Donald Trump indicates the US will not impose more sanctions now.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Why Ukraine is one of the world's most digital countries",
        "description": "Despite the war, Ukraine has developed of the most advanced systems for digital government services.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "MyPillow boss Mike Lindell loses $2.3m defamation case",
        "description": "The verdict comes after the election conspiracy theorist accused a voting equipment employee of treason.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Trump Organization enters mobile phone business",
        "description": "It is the latest plan by US President Donald Trump's family that looks to cash on his name.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Can shoes be made in the US without cheap labour?",
        "description": "American production is possible, but it often needs to be automated to be cost effective.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Indian scientists search for the perfect apple",
        "description": "India can't grow enough apples to meet demand but farmers are struggling to raise production.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "US shares open higher as crude prices ease - 16 Jun 2025",
        "description": "Expert says the Israel-Iran conflict is unlikely to cause big disruptions to the oil market.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "From festivals to weddings: Why drone shows are booming",
        "description": "Light shows involving hundreds and even thousands of drones are becoming big attractions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "UK's largest road tunnel project awarded £590m",
        "description": "Work on the Lower Thames Crossing is expected to begin in 2026 and finish by 2032.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Son of Estée Lauder, who took the brand global, dies aged 92",
        "description": "Leonard Lauder joined his parents' company in 1958 and served as chief executive for 17 years.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Race to mine metals for EV batteries threatens marine paradise",
        "description": "Photographs appear to show how nickel mining damaged one the world's most diverse marine environments",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "The reality behind Trump's incredible investment claims",
        "description": "The president's impact on investment in the US is far more incremental than he has claimed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Hiding in the fields - farm workers fearing deportation stay in California's shadows",
        "description": "Immigration raids on American farms are having ripple effects across the agricultural industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "The women at the centre of Somalia's construction boom",
        "description": "Mogadishu's rapid expansion after decades of war is giving unexpected opportunities in a male-dominated society.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Global oil prices soar after Israel attacks Iran",
        "description": "The cost of crude oil affects everything from the price of food at the supermarket to how much it costs to fill up your car.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Fifa, the Club World Cup and Saudi Arabia",
        "description": "A detailed look at the figures behind the Fifa Club World Cup, and how investment from Saudi Arabia appears to be underpinning the tournament.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Meta AI searches made public - but do all its users realise?",
        "description": "Meta AI users may be inadvertently making their searches public without realising it.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "What does the Air India crash mean for Boeing?",
        "description": "Until Thursday's tragic Air India crash in Ahmedabad, Boeing's 787 Dreamliner had an exemplary safety record.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Sweets from US company could damage DNA and increase cancer risk, UK agency warns",
        "description": "The FSA says chemical compounds in the sweets can increase the risk of cancer and damage DNA.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "China ready to drop all tariffs on African imports",
        "description": "The move comes as the continent's exports face the possibility of high tariffs from the US.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Reeves refuses to rule out tax rises after UK economy shrinks",
        "description": "The chancellor highlights \"uncertainty\" in the world as economists warn of tax rises if the economy fails to grow.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "Human-sized Labubu doll sells for more than $150,000",
        "description": "The 131cm-high figurine was sold at the Yongle International Auction in Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "These scalpers made millions - and claimed staff at big ticketing firms helped",
        "description": "The touts alleged staff at resale sites Ticketmaster once owned helped them trade in bulk, the BBC reveals.",
        "source": "BBC Business",
        "fetched_date": "2025-06-17T07:28:20.773936"
    },
    {
        "title": "‘Project Runway’ Contestant Killed by Gunfire During “No Kings” March in Salt Lake City",
        "description": "Arthur Folasa Ah Loo, a 39-year-old former contestant on the fashion design competition series, died Saturday after being struck by gunfire, as police refer to him as an “innocent bystander.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Outside the Diddy Trial, a New Media Guard Rules",
        "description": "As television cameras in the courtroom rattled the O.J. Simpson trial 30 years ago, influencers and livestreamers outside 500 Pearl St. in Manhattan during the rapper's federal trial point to a trend and conundrum for media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Sabrina Carpenter Lands Second Number One Single With “Manchild”",
        "description": "\"Manchild\" marks Carpenter's second time topping Billboard's Hot 100 in the past 12 months, following \"Please Please Please\" last year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Trump Family Announces Launch of New Mobile Phone Service",
        "description": "Eric Trump said the new venture called, Trump Mobile, will sell phones that will be built in the U.S., and the phone service will maintain a call center in the country as well.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Black Male Juror in Diddy Trial Dismissed Over Inconsistencies in State Where He Lives",
        "description": "The juror said he spends the week in his Bronx apartment and weekends with his daughter in New Jersey, which was not made clear previously.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Caitlyn Jenner Escapes Israel Amid Escalating Conflict With Iran",
        "description": "CNN's Scott Jennings remains, however, as IDF issues evacuation warnings to Tehran and both sides claim casualties and injuries in the hundreds.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Eric Dane Reveals His Right Arm No Longer Works Amid ALS Battle",
        "description": "\"I feel like maybe a couple, few more months, and I won't have my left hand either,\" the 'Grey's Anatomy' alum said, adding that he worried about losing the use of his legs, in a sobering interview that aired on Monday's 'Good Morning America.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Israel-Iran Conflict Dominates Global News",
        "description": "CNN and Al Jazeera go all-in on Israel-Iran escalation, as international media coverage reflects deepening global divisions.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "How Tennis Icon Andy Murray Is Moving From Centre Court to ‘Centre Stage’ on the Road to Wimbledon",
        "description": "WME and its IMG Tennis division worked with the Scottish star athlete to develop a very different kind of tour, bringing him to venues where fans will place their mobiles in lockable pouches for a VIP experience.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Shakira Says Being an Immigrant in the U.S. Amid Trump’s Policies “Means Living in Constant Fear”",
        "description": "The Colombian-born singer moved to the U.S. as a teenager to expand her music career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Mark Ruffalo, Jimmy Kimmel, Gracie Abrams, Kerry Washington and More Stars Participating in “No Kings” Protests",
        "description": "Additional celebrities including Anna Kendrick, Gina Rodriguez-LoCicero and Tessa Thompson were out on Saturday to protest against the Trump administration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    },
    {
        "title": "Bonnaroo Music and Arts Festival Canceled Due to Weather",
        "description": "The news of the event’s cancellation came after they issued several weather delays and an evacuation for concertgoers on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-17T07:28:21.762587"
    }
]