[
    {
        "title": "Ex-Abercrombie CEO used power, wealth and influence to traffic vulnerable men, prosecutors say",
        "description": "Mike Jeffries and his British partner have been arrested and charged in the alleged sex trafficking of more than a dozen victims.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Boeing-made satellite breaks up in space",
        "description": "The \"total loss\" of the communications satellite has affected Intelsat customers around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "McDonald's burgers linked to E. coli outbreak in the US",
        "description": "At least 49 people have been sickened and one person has died, according to the CDC.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Giuliani must turn over $6m NYC apartment to election workers",
        "description": "He has a week to also hand over watches and sports memorabilia to two election Georgia workers who successfully sued him for defamation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "HSBC splits bank between East and West in major overhaul",
        "description": "At the same time the banking giant named its first female finance chief in the firm's 159-year history.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Boeing-made satellite breaks up in space",
        "description": "The \"total loss\" of the communications satellite has affected Intelsat customers around the world.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Starbucks boss shakes up menu to win back customers",
        "description": "The coffee shop chain has also promised to look at pricing and staffing to prevent bottlenecks",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Musk v Ambani: Billionaires battle over India's satellite internet",
        "description": "Musk's Starlink and Mukesh Ambani are preparing to face off in India’s satellite broadband market.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Will AI make work burnout worse?",
        "description": "There are numerous AI tools to help simplify tasks for workers - but some argue these are instead contributing to employee burnout.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "McDonald's burgers linked to E. coli outbreak in the US",
        "description": "At least 49 people have been sickened and one person has died, according to the CDC.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Pound falls as UK inflation declines - 16 Oct 2024",
        "description": "The British currency fell greater than expected and came up against a very strong dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Trump has the world’s richest man on his side. What does Musk want?",
        "description": "The SpaceX boss says only his fellow billionaire can save democracy - but some question Musk's motives.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Nerves frayed in Canada and Mexico over US trade relations",
        "description": "As Americans prepare to vote in the presidential election, Canadians and Mexicans mull the likely impact.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Reeves welcomes IMF's improved growth forecast",
        "description": "The global financial institution predicts stronger UK growth of 1.1% this year and 1.5% next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Facebook and Instagram launch celebrity scam ad crackdown",
        "description": "Celebrities including Elon Musk and Martin Lewis repeatedly feature in ads for products they have not endorsed.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "How scammers duped India job seekers with a fake bank",
        "description": "Job scams are not uncommon in India but the setting up of a fake branch still took many by surprise.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Blade Runner 2049 maker sues Musk over robotaxi images",
        "description": "Alcon Entertainment says it denied a request to use material from the film at the Tesla cybercab event.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "UK borrowing rises ahead of Budget",
        "description": "Official data shows borrowing - the difference between spending and tax take - reached £16.6bn last month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Ex-president of Peru gets 20 years for corruption",
        "description": "Prosecutors say Alejandro Toledo took $35m in bribes from a Brazilian construction company.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "A Netflix for the village - India's start-ups go rural",
        "description": "Many Indian start-ups are shifting their focus to rural consumers, hoping to tap into a new wave of growth.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Musk is giving some US voters $1m. Is it legal?",
        "description": "Nearly a dozen former Republican officials have urged the US justice department to look into Mr Musk's cash incentive to voters.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Liam Payne's death prompts music industry soul searching",
        "description": "Is duty of care to musicians, particularly young artists, being addressed in the music industry?",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Vulnerable customers had VW cars taken away",
        "description": "VW Finance showed \"a lack of empathy\", according to the Financial Conduct Authority.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "TikTok owner sacks intern for sabotaging AI project",
        "description": "Chinese technology giant ByteDance denied reports that the incident caused more than $10m of damage.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "How hoax bomb threats are hurting air travel in India",
        "description": "An unprecedented surge in hoax bomb threats to Indian airlines is wreaking havoc on the industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Holiday in Greenland? New airports aim to entice tourists",
        "description": "The Arctic territory hopes that three new airports will pave the way for direct flights from the US and Europe.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "The work sickness timebomb that risks a lost generation of UK workers",
        "description": "Britain is sick, and getting sicker. Economics editor Faisal Islam unpacks whether the government can get people working again.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Top vaccine maker buys stake in major Bollywood studio",
        "description": "The deal comes at a time when Bollywood is struggling to overcome its lean patch since the Covid-19 pandemic.",
        "source": "BBC Business",
        "fetched_date": "2024-10-23T07:24:42.982995"
    },
    {
        "title": "Shyne Says He Was “Set Up to Be the Fall Guy” For 1999 Club Shooting Involving Diddy in Doc Trailer",
        "description": "'The Honorable Shyne' will debut on Hulu on Nov. 18 and follows the rapper-turned-politician's life and career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Donald Trump to Appear on Joe Rogan’s Podcast (Report)",
        "description": "The former U.S. president is to do a potential sit-down interview on Friday with the Austin-based podcaster to target male voters, according to Politico.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Robert Pattinson to Produce ‘Primetime’ for A24, ‘Ren Faire’ Director Lance Oppenheim",
        "description": "The feature is rumored to take inspiration from 'To Catch a Predator,' though the studio is not confirming any connection.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "The Hollywood Sign Once Had a White Dot. Was the Reason Racist?",
        "description": "The curious circle was part of a Los Angeles commerce campaign to \"Keep the White Spot White.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Kamala Harris Taps Eminem and Bruce Springsteen for Campaign Events as Election Day Approaches",
        "description": "The Democratic presidential hopeful has booked some major talent and will, at last, host a joint rally with former President Barack Obama.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Grammy Ballot: Here’s Where Beyoncé, Taylor Swift, Sabrina Carpenter and More Landed",
        "description": "Nominations will be announced Nov. 8, and THR reveals where acts like Billie Eilish, Ariana Grande, Lady Gaga, BTS members RM and Jung Kook, Post Malone and Chappell Roan appear on the 2025 Grammy ballot.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Nicole Kidman to Receive Sherry Lansing Leadership Award at The Hollywood Reporter’s Women in Entertainment Gala",
        "description": "The invite-only Dec. 4 event will also mark the 15th anniversary of the WIE Mentorship Program, which is welcoming new program partners Entertainment Industry Foundation and Roybal Film and Television Magnet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Mimi Hines, Who Replaced Barbra Streisand on Broadway in ‘Funny Girl,’ Dies at 91",
        "description": "She and late husband Phil Ford had a musical comedy act that played nightclubs and variety programs like ‘The Tonight Show’ and ‘The Ed Sullivan Show.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Ex-Abercrombie & Fitch CEO Mike Jeffries Arrested on Sex Trafficking and Interstate Prostitution  Charges",
        "description": "The former head of the brand's partner, Matthew Smith, was also arrested in West Palm Beach while an associate, James Jacobson, was arrested in Wisconsin.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Sean Diddy Combs Children Express “United” Support for Dad Amid His Sex-Trafficking Charges",
        "description": "The children, some of whom Diddy shared with his late ex Kim Porter, had previously released a statement after Al B. Sure! called for an investigation into Porter's death.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Tim Walz Calls Donald Trump’s Viral Trip to McDonald’s Disrespectful Pandering",
        "description": "The republican nominee caught flack for his afternoon spent serving customers at a Pennsylvania McDonald's.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Harvey Weinstein Diagnosed With Cancer",
        "description": "The disgraced movie mogul and convicted rapist has suffered a number of health problems in recent years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-23T07:24:44.568412"
    },
    {
        "title": "Test hopeful’s nightmare run continues",
        "description": "The dominant Sheffield Shield run-scorer of this decade can’t buy a run, and his slump has come at the worst possible time.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "NFL planning for new Kelce-Swift rule",
        "description": "The NFL is making plans to introduce a major new rule designed to protect Travis Kelce during his relationship with superstar Taylor Swift.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Chief declares Commonwealth Games will live on",
        "description": "Australia’s Commonwealth Games head is confident the event will survive a reduced program in 2026 missing several key sports.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Broncos break silence on Mam ‘s**t storm’",
        "description": "Broncos coach Michael Maguire has fronted the media as Ezra Mam’s future hangs in the balance after his car crash.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "‘Most self-absorbed’: AFL great torches Smith",
        "description": "Steve Smith has come under fire over his antics after a moment at the crease that sets a “shocking example” for the team.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Hawks love star despite absurd pre-game ritual",
        "description": "An eccentric Hawthorn star has raised eyebrows with her pre-game routine, but looms as the Hawks’ ace in the pack at the pointy end of the season.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Broncos break silence on Mam ‘s**t storm’",
        "description": "Broncos coach Michael Maguire has fronted the media as Ezra Mam’s future hangs in the balance after his car crash.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Manly opens door for DCE ‘replacement’",
        "description": "The Manly Sea Eagles are starting preparations for life without halfback superstar Daly Cherry-Evans with a left field call.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Test hopeful’s nightmare run continues",
        "description": "The dominant Sheffield Shield run-scorer of this decade can’t buy a run, and his slump has come at the worst possible time.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "‘Most self-absorbed’: AFL great torches Smith",
        "description": "Steve Smith has come under fire over his antics after a moment at the crease that sets a “shocking example” for the team.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Tennis stars hit out: ‘Stop ruining the sport’",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Big tennis change coming to Aussie comps",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Norris stripped of podium in wild F1 drama",
        "description": "Lando Norris had a podium finish taken away as the McLaren driver traded protests with Max Verstappen in a wild finish on Monday.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Vintage Marquez produces stunning Aus MotoGP victory",
        "description": "A stunning ride from eight-time world champion Marc Marquez has delivered him a brilliant victory at the Australian MotoGP despite a dramatic start off the grid, while Aussie Jack Miller came home strong.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "America loses it as Trump streaker ’jailed’",
        "description": "An X-rated entertainer waving a divisive sign has been identified as the woman behind an NFL stadium stunt that has gone viral.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "World rocked as surfer impaled by swordfish",
        "description": "A popular surfing figure has died at the age of 36 after a freak incident where she was fatally impaled by a swordfish.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "NFL planning for new Kelce-Swift rule",
        "description": "The NFL is making plans to introduce a major new rule designed to protect Travis Kelce during his relationship with superstar Taylor Swift.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "NBA world loses it as history made",
        "description": "The NBA world has been treated to a stunning slice of history after LeBron and Bronny James did something incredible.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "‘Professional’ Victory coach seeking derby delight",
        "description": "Patrick Kisnorbo will be part of another Melbourne derby on Saturday night, but this time he will be in the other coaching dugout.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Mariners coach ‘proud’ of his team",
        "description": "Central Coast coach Mark Jackson was full of pride despite the Mariners losing to the Chinese club guided by former Melbourne Victory mentor Kevin Muscat.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Champ’s surprise Volkanovski call opens door for Sydney showdown",
        "description": "Featherweight champion Ilia Topuria is ready to hand Alex Volkanovski a massive boost with a home title fight for the Australian.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Wet and wild conditions wreaks havoc as Smylie secures first tour win",
        "description": "Queensland young gun Elvis Smylie secured his first tour win as a professional in a tense final day at the WA Open despite horrible conditions threatening to stop play all throughout the day.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "LeBron, Bronny James make NBA history with father-son appearance",
        "description": "Future basketball Hall of Famer LeBron James created more history when he appeared alongside his son Bronny for the Lakers to become the first father-son duo to play together in the NBA.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "NRL convert in shock Wallabies call",
        "description": "His last game was in an NRL final and now Joseph-Aukuso Suaalii is set to play his next match as a Wallaby in the UK after a rapid elevation and confirmation he’s not going to England just for a ride.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Williams lands Geelong Cup to secure Melbourne Cup ride",
        "description": "Champion jockey Craig Williams says import Onesmoothoperator looks well placed for the Melbourne Cup after his dominant Geelong Cup win.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    },
    {
        "title": "Second tragedy hits Olympian icon after reveal",
        "description": "After dropping heartbreaking news about his terminal diagnosis, Sir Chris Hoy has gone public with his family’s second secret tragedy.",
        "source": "News AU",
        "fetched_date": "2024-10-23T07:24:46.330591"
    }
]