[
    {
        "title": "HSBC profits jump as bank set for major shakeup",
        "description": "Pre-tax profits rose to $8.5bn in the three months to the end of September, beating analysts' expectations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "JP Morgan sues customers over viral TikTok cheque fraud",
        "description": "“Infinite money glitch” allowed the withdrawal of funds from cheques before they were cleared by the bank.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Apple's AI features roll out on iPhones - but not for all",
        "description": "The new features include notification summaries and tools to assist users in writing messages.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Stolen cheese might be sold abroad - supplier",
        "description": "A supplier of cheese stolen in a £300,000 scam said the business was based on trust.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Bus fares to rise to £3 in England under new cap",
        "description": "The new limit replaces the existing £2 cap but some have criticised the decision.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "JP Morgan sues customers over viral TikTok cheque fraud",
        "description": "“Infinite money glitch” allowed the withdrawal of funds from cheques before they were cleared by the bank.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Can AI make life easier for people with dementia?",
        "description": "AI projects are underway to help ease the challenges of dementia.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Why female entrepreneurs are key to getting more women to work",
        "description": "A study highlights how promoting female entrepreneurship can greatly enhance women's workforce participation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Philadelphia prosecutor sues Musk over $1m swing-states voter lottery",
        "description": "The billionaire has been aggressively campaigning to help Republican candidate Donald Trump win back the White House.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Apple's AI features roll out on iPhones - but not for all",
        "description": "The new features include notification summaries and tools to assist users in writing messages.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Investors question US Fed rate cut - 28 Oct 2024",
        "description": "Expert says the strength of the dollar has prompted many to question if an earlier US Fed rate cut was necessary.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "'It's rough out here': Why Trump and Harris should listen to this mum of seven",
        "description": "Inflation and high prices are primary concerns for Sin City's voters ahead of the 5 November vote.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Trump has the world’s richest man on his side. What does Musk want?",
        "description": "The SpaceX boss says only his fellow billionaire can save democracy - but some question Musk's motives.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Tariffs hurt his business. He's voting for Trump anyway",
        "description": "Donald Trump's call for sweeping tariffs is resonating, as protectionism gains steam in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "McDonald's Quarter Pounder back  after E. coli outbreak",
        "description": "The fast food giant said beef patty samples had tested negative for the bacteria.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "World's most indebted oil firm is headache for new Mexico leader",
        "description": "Claudia Sheinbaum inherits a buoyant manufacturing sector, but also a troubled state-owned oil firm.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "How my investigation led to sex trafficking charges against ex-Abercrombie boss",
        "description": "Rianna Croxford digs into a cryptic Instagram comment, unravelling allegations of abuse - and now the multi-millionaire is in court.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "'My £250 Child Trust Fund is now worth only £12'",
        "description": "Max Prince was shocked to discover that surprise fees had left him with just £12.39 in his trust fund.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "The couple who took on Google and cost the tech giant £2bn",
        "description": "Shivaun Raff and her husband, Adam, describe their long court battle with technology giant Google.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "The hybrid workers seeking fulfilment in French fields",
        "description": "These part-time farmers say they want the best of both worlds, splitting life between Paris and the country.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "'I can't run a business like this': Why the WordPress row matters",
        "description": "WordPress's tools are used by 40% of the world's websites, making this a spat with big consequences.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Why is Maghull the best railway station in the UK?",
        "description": "Staff are basking in the afterglow of victory in the 2024 World Cup of Stations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Mining giants sign $30bn settlement for 2015 Brazil dam collapse",
        "description": "The dam collapse released toxic waste and mud, which flooded nearby towns, rivers and forests.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Cubans endure days without power as energy crisis hits hard",
        "description": "People cook with firewood after days of blackouts and supply issues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Ex-Abercrombie CEO pleads not guilty to sex trafficking charges",
        "description": "Mike Jeffries and his partner are accused of using fraud and force to sexually abuse young men.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Microsoft boss gets 63% pay rise despite asking for reduction",
        "description": "Satya Nadella asked for a reduction because of cyber attacks the firm suffered - but still saw his earnings increase massively.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Action demanded over surge in illegal meat imports into UK",
        "description": "The government is warned of a \"foot-and-mouth\" level crisis over potentially diseased meat flooding into the UK.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "What we know about the McDonald's E. coli outbreak",
        "description": "Health officials say the number of people infected after eating McDonald's Quarter Pounders has risen to 75 across 13 states.",
        "source": "BBC Business",
        "fetched_date": "2024-10-29T07:24:17.820702"
    },
    {
        "title": "Quinta Brunson Honored at EMA Awards: “We All Have to Do What We Can to Hand Over This Planet and Make it Sustainable”",
        "description": "The Environmental Media Association's annual awards also recognized 'Twisters,' 'True Detective: Night Country,' 'Hacks' and more shows and films for their green commitments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Madison Square Garden Owner Responds to Criticism Over Trump Rally: “We Are Neutral in Political Matters”",
        "description": "\"We rent to either side,\" a spokeperson said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Armie Hammer Announces Podcast in Comeback Bid",
        "description": "'The Armie HammerTime Podcast' will serve as a personal diary, offering insights into his inner thinking amid one of the most spectacular downfalls in Hollywood history.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Bad Bunny, Jennifer Lopez, Ricky Martin Show Support for Kamala Harris After Comedian Insults Puerto Rico at Trump Rally",
        "description": "Stand-up comedian Tony Hinchcliffe called Puerto Rico \"a floating island of garbage\" at Sunday's event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Bruce Vilanch, Former Academy Awards Head Writer, to Spill Oscars Tea on Podcast",
        "description": "The legendary funnyman debuts 'The Oscars: What Were They Thinking?' on Nov. 11.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Fox News Plans a “Super Desk” and Virtual Set For Election Night Coverage (Exclusive)",
        "description": "The cable news channel is planning a slew of data-driven bells and whistles to enhance its TV product.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Universal Music Strikes Strategic Deal With “Ethical AI Music Company” Klay Vision",
        "description": "The music major is focused on \"ethical solutions for artists and the wider music ecosystem, advancing generative AI technology in ways that are respectful of copyright\" and enabling human creativity.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Gérard Depardieu, Citing Poor Health, Calls for Postponement of Sexual Assault Trial",
        "description": "The French film star was set to appear in court Monday to face charges from two women who allege he assaulted them on a film set in 2021.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "John Legend, Kerry Washington, Stevie Wonder and LeToya Luckett-Coles Lend Voices to Harris",
        "description": "As part of a seven-figure ad campaign, the Hollywood stars appear in radio ads targeting Black voters.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Hulk Hogan, Dr. Phil, Elon Musk Speak at Donald Trump’s Insult-Filled Rally at Madison Square Garden",
        "description": "Dana White, J.D. Vance, Tucker Carlson and Melania Trump also took the stage at Sunday's event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Timothée Chalamet Crashes His Own Look-Alike Contest in New York City",
        "description": "The rowdy event resulted in at least one arrest.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Adele Tears Up When Hugging Celine Dion at Las Vegas Residency",
        "description": "Adele spotted Dion in the audience of her show on Saturday night. Adele told Dion on Instagram how much the moment meant to her:  \"Words will never sum up what you mean to me, or what you coming to my show means.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-29T07:24:18.173868"
    },
    {
        "title": "Kyrgios’ insane Egyptian pyramid conspiracy",
        "description": "Nick Kyrgios, who hasn’t been seen on a tennis court for some time, has voiced his feelings on some of the world’s great conspiracy theories.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Finals heartbreak likely for hamstrung Tiger",
        "description": "A senior Richmond player is set to be sidelined for the Tigers’ finals campaign, but there’s better news for a St Kilda star after grave injury fears.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "‘It became clear’: Sad reveal after retirement shock",
        "description": "Jaidyn Stephenson has revealed why he decided to hang up the boots with a year left on his contract. See every AFL list change so far.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Defending PGA champ embraces Cam’s presence",
        "description": "The reigning Queensland PGA champion will ‘stick to his game’ rather than worry about what Cam Smith is doing on the Nudgee course.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Finals heartbreak likely for hamstrung Tiger",
        "description": "A senior Richmond player is set to be sidelined for the Tigers’ finals campaign, but there’s better news for a St Kilda star after grave injury fears.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "‘It became clear’: Sad reveal after retirement shock",
        "description": "Jaidyn Stephenson has revealed why he decided to hang up the boots with a year left on his contract. See every AFL list change so far.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "NRL transfer tracker: Every signing as players hit open market",
        "description": "The NRL player market is set to go into a frenzy when a host of the game’s biggest stars enter free agency from November 1. Keep up to date with all the player movement as it happens in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Jillaroos sweat as star sent for scans ahead of Pacific Champs final",
        "description": "The Jillaroos are managing injuries to two key stars ahead of the Pacific Championships final, with one sent for scans as the her team scrambles to find a replacement.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Aussie World Cup winner calls it quits",
        "description": "With 170 games for Australia and a World Cup victory on his resume, Matthew Wade could make a big impression after confirming his next move.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Cummins has his say on rookie’s Test claims",
        "description": "Sam Konstas has been the name on everyone’s lips heading into the first Test against India, with Pat Cummins impressed by what the youngster has produced this season.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Kyrgios’ insane Egyptian pyramid conspiracy",
        "description": "Nick Kyrgios, who hasn’t been seen on a tennis court for some time, has voiced his feelings on some of the world’s great conspiracy theories.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Tennis bad boy nearing shock Aus return",
        "description": "He’s been forgotten and virtually disowned in Australian tennis circles, but Bernard Tomic has quietly been improving his ranking.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "F1 star’s horror decline laid bare as axe sharpens",
        "description": "Sergio Pérez’s Formula 1 future is in jeopardy after another scoreless race at his home Mexico City Grand Prix, with Kiwi Liam Lawson waiting in the wings for promotion.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "F1 star flips the script on grid walk snub",
        "description": "F1 icon Martin Brundle has cleared the air with a young driver in Mexico after he was seemingly ignored on his grid walk in Austin.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Brutal sledge as Raygun shows off new look",
        "description": "Raygun has opened up about the emotional toll the Olympic breakdancing saga took on here, and one thing her critics need to get over.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "‘Went crazy’: Aussie golden girl’s sad reveal",
        "description": "Aussie swimming star Ariarne Titmus has opened up on a major health scare, revealing she would give up her Olympic medals for one thing.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "NBA erupts over shocking Ben Simmons act",
        "description": "Battling Aussie Ben Simmons is under a blowtorch once more, accused of playing scared in his latest NBA act against Milwaukee.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Simmons sledge sparks NBA confrontation",
        "description": "Ben Simmons Brooklyn Nets teammates have come to the Aussies’ defence after a cowardly heckler sledged the NBA veteran.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Football’s biggest night rocked by ugly twist",
        "description": "World football’s biggest awards night has been rocked by drama, with one of the game’s most powerful clubs launching an ugly boycott.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Absolute worldie stuns, Matildas hit back",
        "description": "An absolute worldie of a goal from Matildas young gun Kyra Cooney-Cross has powered the Aussies to a droughtbreaking win.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "‘OMG’: Aussie UFC star has jaw shattered",
        "description": "GRAPHIC WARNING: A gruesome photo has emerged showing just how badly Australia’s Rob Whittaker was mutilated in his UFC loss.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Defending PGA champ embraces Cam’s presence",
        "description": "The reigning Queensland PGA champion will ‘stick to his game’ rather than worry about what Cam Smith is doing on the Nudgee course.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Fresh Ben Simmons promise sparks trade rumours",
        "description": "Ben Simmons has gone from being one of the worst contracts in the NBA to a fascinating trade watch. Plus why the Lakers’ hot start to life under new coach JJ Redick is so promising.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "‘Great man’: Wallabies convert talks up Folau link",
        "description": "One of the biggest signings in Australian rugby history is leaning on another famous cross-code star as he prepares for a highly anticipated Wallabies debut.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Rugby player admits to supplying cocaine",
        "description": "A women’s rugby player who travelled to Fiji to compete has had her trip unexpectedly extended after she was refused re-entry into Australia while facing charges of drug supply.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Melbourne Cup betting shake up with doubts on Via Sistina",
        "description": "The Melbourne Cup market has dramatically changed with Cox Plate winner Via Sistina a doubtful starter as another contender was withdrawn.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    },
    {
        "title": "Second tragedy hits Olympian icon after reveal",
        "description": "After dropping heartbreaking news about his terminal diagnosis, Sir Chris Hoy has gone public with his family’s second secret tragedy.",
        "source": "News AU",
        "fetched_date": "2024-10-29T07:24:19.975553"
    }
]