[
    {
        "title": "Chinese-owned Volvo Cars to cut 3,000 jobs",
        "description": "The firm's boss pointed to the \"challenging period\" faced by the industry as a reason for the layoffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Fake discounts on Shein 'breach law', EU says",
        "description": "Shein has one month to respond to the EU's findings or face fines based on its sales, the bloc has said.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "The people who think AI might become conscious",
        "description": "With a leap in the evolution of large language models, some leading thinkers are questioning whether AI might become sentient",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Rate 'rigging' traders say they were scapegoated - now the Supreme Court will decide",
        "description": "Tom Hayes and Carlo Palombo were among 37 City traders prosecuted for \"manipulating\" interest rate benchmarks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Fake discounts on Shein 'breach law', EU says",
        "description": "Shein has one month to respond to the EU's findings or face fines based on its sales, the bloc has said.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Frugal tech: The start-ups working on cheap innovation",
        "description": "Indian start-ups are using local materials and innovative ideas to make useful and affordable products.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Trump agrees to extend EU trade talks after 50% tariff threat",
        "description": "Trump extended the deadline after EU chief Ursula von der Leyen said the bloc needed more time to \"reach a good deal\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Winemakers finding Trump's tariffs hard to swallow",
        "description": "Wine producers in both France and the US are unhappy at the US president's trade actions.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Cyber criminals contact BBC to claim hack on Co-op, M&S",
        "description": "Hackers reached out to the BBC's Joe Tidy on Telegram, frustrated that their ransom demands weren't being met.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Chip maker TSMC expands US reach with new Arizona factory",
        "description": "The BBC gets exclusive access to the Taiwanese company's new factory in the Arizona desert, just outside Phoenix.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Why so many military veterans move into cybersecurity",
        "description": "The vigilance needed in the military can be an asset in the cybersecurity industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Analysis: Trump's tariff plans could spark global economic shock",
        "description": "The move threatens significant volatility in the coming weeks, ahead of a crucial G7 summit in Canada next month.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "EU calls for 'respect' after Trump threatens 50% tariffs",
        "description": "Trade chief Maros Sefcovic said the EU is \"ready to defend\" its interests after Trump threatened 50% tariffs on the bloc.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Boeing to avoid prosecution in US Justice Department deal over crashes",
        "description": "The two crashes happened in 2018 and 2019 and left 346 people dead.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "The Bitcoin hum that is unsettling Trump's Maga heartlands",
        "description": "Trump has said he wants to turn the US into the crypto-mining capital of the world - but that has real-world implications for many of his core voters",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Harvard foreign students face uncertainty as Trump plan to block enrolment is halted - for now",
        "description": "It comes a day after the administration said it had revoked Harvard's access to student visa programmes.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Protestors accuse Trump of corruption as he hosts crypto gala dinner",
        "description": "Trump hosted the biggest investors in his own cryptocurrency, but insisted he put the country ahead of his  businesses interests.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Amazon tribe sues New York Times over story it says led to porn addict claims",
        "description": "The lawsuit claims a report portrayed the Marubo people as \"unable to handle\" basic internet exposure.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Trump reignites tensions with EU tariff threats",
        "description": "EU says threats should not guide trade talks as Trump says he wants tariffs of 50% on European goods as soon as 1 June.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "What tariffs has Trump announced and why?",
        "description": "Tariffs are a key part of the US president's political vision but economists fear a global trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Daily Telegraph to be sold to US firm RedBird",
        "description": "The American company agrees to buy the Daily and Sunday Telegraph after a two-year ownership vacuum.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Labubu fan fury after dolls pulled from stores",
        "description": "The popular toys have been removed from UK shelves until June, following reports of customers fighting over them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which must still pass in the Senate, includes sweeping changes to the tax code, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "Denmark to raise retirement age to highest in Europe",
        "description": "From 2040, Danish people born after 31 December 1970 will be eligible to retire at 70 years old.",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "In South Korea, even your cup of Starbucks could be too political",
        "description": "All six presidential candidates' names are banned in Starbucks stores to \"maintain neutrality\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "US House passes Trump's 'big, beautiful' tax and spending bill",
        "description": "The bill's passage is a victory for the White House, which warned that failure would be a \"betrayal\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-27T07:27:40.105657"
    },
    {
        "title": "American Music Awards: Full List of Winners",
        "description": "Billie Eilish, SZA, Beyoncé, Eminem, Post Malone, Becky G and Gracie Abrams were among the night's winners at the Las Vegas ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "American Music Awards: Benson Boone, Reneé Rapp, Shaboozey, Tiffany Haddish and More Stars Walk the Carpet",
        "description": "Machine Gun Kelly, Becky G, Lainey Wilson and Nikki Glaser are also in attendance at the 2025 ceremony in Las Vegas on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Miley Cyrus Got a “Brutal Infection” After Filming on Hollywood Walk of Fame: “My Leg Began to Disintegrate”",
        "description": "The singer was shooting for her new film, accompanying her ninth studio album, 'Something Beautiful.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Rosamund Pike Recalls Getting Mugged and Punched in the Face for Her Phone",
        "description": "The Oscar-nominated actress said she was on the phone with her mother at the time of the attack.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Cannes Power Outage Disrupts City, Festival Continues",
        "description": "A regional power outage, apparently caused by sabotage on electrical infrastructure, hit southern France on Saturday, disrupting the final day of the 78th Cannes Film Festival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Justin Bieber Joins SZA for Surprise Performance at SoFi Stadium Stop of Grand National Tour",
        "description": "The two artists previously collaborated on the track “Snooze” from SZA's Grammy-nominated album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Sacha Jenkins, Journalist Turned Documentarian, Dies at 54",
        "description": "He previously served as a music editor and writer-at-large at Vibe.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "This Week in Sean “Diddy” Combs’ Trial: Freezer Meat, DNA Evidence and Kompromat",
        "description": "A wide range of testimony was heard in the sex-trafficking and racketeering case as prosecutors and the rap mogul's defense team spoke with rapper Kid Cudi, \"The Punisher\" and Roberta Ventura.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "The Nine-Minute Bromance Video That Launched a $6 Billion AI Mystery",
        "description": "They stroll, they sip, they gaze meaningfully. The one thing Open AI CEO Sam Altman and former Apple designer Jony Ive don't do? Explain what their new device actually is.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Different President, Same Song: Trump Pulls a Nixon in His Battle Against The Boss",
        "description": "Bruce Springsteen isn’t the first rock star to face the ire of a pushy POTUS. Fifty years ago, Richard Nixon went to war against John Lennon over the former Beatle’s peacenik politics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Who Really Took the Iconic “Napalm Girl” Photo? Director of New Doc Addresses the Controversy (Exclusive)",
        "description": "Since its premiere at Sundance, 'The Stringer' has led to a divisive re-examination of the credit for the Pulitzer Prize–winning 1972 photograph that captured the horrors of the Vietnam War.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Paris Court Finds Ringleader, Seven Others Guilty in 2016 Robbery of Kim Kardashian",
        "description": "None of the eight people convicted will face additional time behind bars as two of the 10 defendants were acquitted.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-27T07:27:40.358082"
    },
    {
        "title": "Club cops triple blow, Tigers make Galvin call",
        "description": "The Sea Eagles will be without three key stars this weekend, while the Tigers have made a call on Lachlan Galvin with his departure imminent.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Sydney club cops brutal triple blow",
        "description": "The Sea Eagles will be without three key stars this weekend, while Lachlan Galvin is expected to join the Bulldogs in the coming days after he wasn’t named by the Tigers.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Teen dies playing controversial contact sport",
        "description": "The deadly reality of the newest contact sport has been realised after a teenager died from injuries sustained playing ‘run it straight’.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Bulldogs blow, star’s season over",
        "description": "The Western Bulldogs have opened up a spot on their list just before the mid-season draft, but it came at a cost to another star.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Club cops triple blow, Tigers make Galvin call",
        "description": "The Sea Eagles will be without three key stars this weekend, while the Tigers have made a call on Lachlan Galvin with his departure imminent.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Sydney club cops brutal triple blow",
        "description": "The Sea Eagles will be without three key stars this weekend, while Lachlan Galvin is expected to join the Bulldogs in the coming days after he wasn’t named by the Tigers.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Bulldogs blow, star’s season over",
        "description": "The Western Bulldogs have opened up a spot on their list just before the mid-season draft, but it came at a cost to another star.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "‘Career best’: Why age is only a number in AFL",
        "description": "The two teams up the top of the AFL ladder have a long list of older players and one Brisbane star says that’s a key to success.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "‘Muddled mess’: Key factor in Marnus’ fate",
        "description": "Cameron Green looks a certainty to return to the Australian team, but a decision on who opens with Usman Khawaja could be determined by one thing.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Green’s third ton ups Marnus pressure",
        "description": "Who opens the batting for Australia in the World Test Championship final remains unclear, but there’s one red-hot batter selectors have to get back into the team.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "‘What the f**k is this’: Osaka rocks tennis",
        "description": "Four-time grand slam champion Naomi Osaka left herself in tears and the tennis world stunned after a brutal self assessment.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Aussie trio triumph amid grim Kyrgios news",
        "description": "As his hopeful doubles partner revealed why Nick Kyrgios had to pull out of the French Open, a trio of Aussies got on the winners’ list.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "‘Cold blood’: What Norris’ Monaco win means for Oscar Piastri",
        "description": "McLaren team principal Andrea Stella predicted the “cold blood” victory from Lando Norris in Monaco could mark the start of a charge from the Brit in an ominous warning to his title leading teammate Oscar Piastri.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Driver takes out pit crew in ‘scary’ scenes",
        "description": "The Indianapolis 500 pole sitter’s race came to an unfortunate end after one of his pit crew was left in a stretcher.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Reds their own worst enemy after falling short in nailbiter",
        "description": "Queensland Reds were shooting for a guaranteed spot in the Super Rugby playoffs and its first win over the Hurricanes since 2013, but were their own worst enemy in a nailbiting loss.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Sliding Reds ‘need to be better’",
        "description": "The Queensland Reds are searching for some answers to their dip in form ahead of the Super Rugby Pacific finals series.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Football star’s girlfriend killed by deer",
        "description": "A former college wide receiver’s girlfriend has been killed in a horrific freak crash that left the ex-football star with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Ange’s passionate plea as sack call looms",
        "description": "Tottenham manager Ange Postecoglou has made a passionate plea to Spurs owner Daniel Levy as his managerial future hangs in the balance.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "One thing missing from Socceroo’s bucket list",
        "description": "One major goal continues to drive Western Sydney Wanderers forward Brandon Borrello in his bid for a regular spot in Australia’s squad.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "25yo star dies weeks after getting married",
        "description": "Tributes are flowing around the boxing world after a talented fighter died at the age of 25 in a heartbreaking tragedy.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Scheffler outlasts Rahm to claim third major at PGA Championship",
        "description": "World number one Scottie Scheffler has captured his third major title, seeing off Spain’s Jon Rahm down the back nine in the final round to win the PGA Championship.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Unthinkable ‘choke’ turns NBA on its head",
        "description": "Tyrese Haliburton knocked down a ridiculous game-tying shot, sparking a truly extraordinary Indiana Pacers comeback win.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Canterbury preview: Price wants a soft option for Mogwai",
        "description": "Trainer Luke Price feels his Canterbury-bound trio have found themselves in the right races, he just hopes the track can improve to the soft range to maximise their chances.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-27T07:27:41.893305"
    }
]