[
    {
        "title": "Heathrow closed all day after nearby fire causes power outage",
        "description": "A fire at an electrical substation has caused a \"significant power outage\" and the closure is expected to last until midnight.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Trump uses emergency powers to boost mineral production",
        "description": "The executive order comes as the US president tries to reduce America's reliance on imports of the vital materials.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "The slow but steady advance of driverless vehicles",
        "description": "Robo-taxi services and driverless trucks are gaining ground but progress is painstaking.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Tesla makes largest-ever Cybertruck recall",
        "description": "It is the eighth recall involving the pickup since early 2024, shortly after the truck hit the roads.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Trump uses emergency powers to boost mineral production",
        "description": "The executive order comes as the US president tries to reduce America's reliance on imports of the vital materials.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Court rules against K-pop group NewJeans in record label dispute",
        "description": "The band, who renamed themselves NJZ, had begun organising their own appearances.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Why Elon Musk's Grok is kicking up a storm in India",
        "description": "The chatbot has become an \"unfiltered and unhinged\" digital sensation in India.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Tesla vandals face up to 20 years in prison, says attorney general",
        "description": "The US attorney general said a wave of vandalism and arson attacks at Tesla dealerships is \"domestic terrorism\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "How fears of inflation could impact interest rates",
        "description": "Consumer inflation expectations could creep into the Federal Reserve's calculations on interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Why does Japan have a reserve of rice?",
        "description": "What is a \"strategic reserve\" and why does Japan have one for rice?",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "TikTokers call for 'chubby filter' to be banned",
        "description": "Fans of the viral AI tool treat it as a bit of fun - but critics say it is a form of body shaming.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Tesla's challenges run deeper than 'toxic' controversy around Elon Musk",
        "description": "The company is still valued at more than 100 times its earnings - but it faces problems that experts say go beyond questions around its CEO",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "NBA champions Boston Celtics in record $6.1bn sale",
        "description": "A group led by American businessman William Chisholm agrees to purchase the Boston Celtics for a record $6.1bn (£4.7bn).",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Family sues Boeing over whistleblower death",
        "description": "John Barnett's family say he was subjected to harassment and humiliation after he raised safety concerns.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "EU delays plans to retaliate against Trump tariffs",
        "description": "Its tit-for-tat tariffs had prompted Trump to threaten a 200% tariff on European alcohol and wine.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "UK interest rates will go down gradually, says Bank",
        "description": "Borrowing costs had been widely expected to be left unchanged with inflation, predicted to go up in the coming months.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Will Trump's tariff war spark big-bang reforms in India?",
        "description": "Could this be a chance for the world’s fifth-largest economy to shed protectionism and open up further?",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Greenpeace ordered to pay more than $660m for defaming oil firm in protests",
        "description": "Greenpeace has warned it could be forced into bankruptcy because of the case brought by Energy Transfer.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Hollywood director charged with defrauding $11m from Netflix",
        "description": "The sci-fi director allegedly used his studio budget to purchase a fleet of luxury cars and other personal items.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Fed cuts US growth forecast as tariff fears increase",
        "description": "The US president, who has previously criticised the central bank, called on it to cut interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Ben & Jerry's boss 'ousted over political activism'",
        "description": "The ice cream maker alleges the move is part of efforts by its parent company to silence its activism.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Google agrees to pay $28m in racial bias lawsuit",
        "description": "The tech giant confirmed it had \"reached a resolution\" but rejected the allegations made against it.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Splurge or save? Americans struggle as tariffs hit economy",
        "description": "Families in the US are trying to dodge higher prices from tariffs, as worries rise about the economy.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Migrant carers from India's Kerala await justice in UK visa 'scams'",
        "description": "The care workers, who paid thousands of pounds for UK visas, are in deep debt and without work.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "Federal judge halts further shuttering of USAID",
        "description": "The ruling orders Elon Musk's Department of Government Efficiency to halt its termination of workers and programmes.",
        "source": "BBC Business",
        "fetched_date": "2025-03-21T07:24:29.299574"
    },
    {
        "title": "A Whitesell Brother’s Ex Is Pitching a TV Show",
        "description": "But it's not about the Whitesell Brothers. Instead, Ladan Rafii is taking meetings around town about a series based on her globe-trotting life as a UN officer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "How The Creative Coalition Will Swarm Capitol Hill",
        "description": "On April 25, TCC president Tim Daly and a horde of celebrity delegates will make their case to the White House and Congress for continued federal funding of the arts: \"Supporting the arts isn’t charity — it’s sound economic policy.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Primary Wave Finalizes Deal For Biggie Smalls Catalog",
        "description": "Sources previously told The Hollywood Reporter the rapper’s estate was seeking at least $100 million in the deal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Courtney Love is Making Her U.K. Move Permanent, Calls Trump 2.0 “Emperor-core”",
        "description": "\"Can’t get rid of me!\" the undisputed queen of grunge rock told the London crowd then slammed the Trump administration at a Royal Geographical Society event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Graydon Carter Has “Never Been Happier”",
        "description": "The storied onetime steward of Vanity Fair — and, at 75, a newly minted memoirist — sits with a former intern for a probing interview about guiding the influential magazine through a cultural minefield that included Harvey Weinstein, Jeffrey Epstein and Gwyneth Paltrow.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Rio Ferdinand, TV Pundit and Retired English Soccer Star, Signs With WME (Exclusive)",
        "description": "With the FIFA World Cup coming to North America next year, the agency will be focusing on securing broadcast, digital and commercial opportunities in the U.S.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Eminem’s Former Employee Charged With Leaking Rapper’s Music",
        "description": "Joseph Strange has been charged with criminal infringement of a copyright and interstate transportation of stolen goods.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "On ‘Hot,’ K-Pop Stars Le Sserafim Explore Love and Perseverance: “We Are Going to Give Our All”",
        "description": "The girl group discusses their favorite songs on their new EP and how their bond with one another has only grown since their debut: “We always say that we need all five of us together to be complete.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Aubrey Plaza Was Separated From Husband Jeff Baena Months Before Death, New Report Reveals",
        "description": "The indie film director and writer died by suicide in January.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Ed Sheeran Teases New Single “Azizam,” First New Album Since 2023",
        "description": "The singer shared a snippet of his upcoming song but hasn't given a release date yet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Sean “Diddy” Combs’ Right-Hand Woman Breaks Silence on Accusations Against Her",
        "description": "Former Chief of Staff at Bad Boy Entertainment, Kristina Khorram, now named in three lawsuits, expressed disbelief about the allegations lobbed at her.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Mara Wilson Remembers Defending Childhood Friend Michelle Trachtenberg From Bullies: “She Was a Sweetheart”",
        "description": "The two actresses went to the same middle school in Burbank.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-21T07:24:30.102311"
    },
    {
        "title": "Joey fumes as celebration wiped from history",
        "description": "Dragons star Christian Tuipulotu’s controversial try celebrations have been banned and Andrew Johns has a blunt message for the winger.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Wife fumes as text exposes cricket bombshell",
        "description": "Usman Khawaja has made extraordinary claims as he faced the press to respond to what he has called “devastating” slurs.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Scoreline ‘flattered’ Socceroos",
        "description": "It’s hard not to be happy after a 5-1 victory, but the Socceroos know they need a better performance to win in China on Tuesday night.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Pure carnage as Storm stars wiped out",
        "description": "The Melbourne Storm’s gripping win in the NRL Grand Final rematch has come at a cost with three big injuries rocking the club.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Joey fumes as celebration wiped from history",
        "description": "Dragons star Christian Tuipulotu’s controversial try celebrations have been banned and Andrew Johns has a blunt message for the winger.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "NRL Live: SuperCoaches flock back to maligned Warriors star",
        "description": "He was the most traded SuperCoach player heading into round two, but a Warriors star is on the good list after a bumper score. See the final teams and FOLLOW LIVE as the Warriors host the Roosters.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Dorky new mantra sweeping across AFL",
        "description": "A footy legend has given some advice for some his “bold” colleagues in the media as an unfashionable trend takes over the AFL.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "TV star tipped to be new state Lib leader",
        "description": "The TV star, sport commentator and Lord Mayor of Perth is putting his hand up to lead the WA Liberals after the recent state election loss.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Wife fumes as text exposes cricket bombshell",
        "description": "Usman Khawaja has made extraordinary claims as he faced the press to respond to what he has called “devastating” slurs.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Record-setting Aussies smash world champs",
        "description": "Australia travelled to Auckland to take on the T20 World Cup winners and re-asserted their dominance with a stunning innings from the world’s best T20 batter in game 200.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Star pushes back on Kyrgios’ shock lawsuit",
        "description": "Nick Kyrgios thought he was changing tennis for everyone when he put his name to a bombshell lawsuit, but not all of his fellow players are on-board.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Kyrgios bombshell after first win in years",
        "description": "Nick Kyrgios questioned whether injuries would end his career, but the Australian tennis star is now finally back.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Dorky new mantra sweeping across AFL",
        "description": "A footy legend has given some advice for some his “bold” colleagues in the media as an unfashionable trend takes over the AFL.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "F1 world devastated after legend’s death",
        "description": "The Formula 1 great and legendary character announced late last year he was battling “aggressive” prostate and bladder cancer.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Schumacher family devastated as icon dies",
        "description": "The Schumacher family’s devastating final edict to a Formula 1 icon has emerged after his death rocked the sport on Thursday night.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Rugby, cricket stars share captaincy tips",
        "description": "A bond forged on the junior sport ovals in Brisbane has improved the captaincy skills of rugby union’s Harry Wilson and cricket’s Nathan McSweeney.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Wallabies great could face Lions",
        "description": "Having come out of retirement in Japan to play club rugby in Japan, ex-Wallabies captain Michael Hooper’s comeback may extend to a game against the British and Irish Lions.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Absurd price of pop star’s proposal",
        "description": "The NFL quarterback signed to an eye-watering $350 million contract has dropped an absolute fortune for his pop singer partner.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Actor’s ‘gross’ courtside act turns heads",
        "description": "This popular US actor has been photographed vomiting in the front row while attending a basketball game at Madison Square Garden.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Scoreline ‘flattered’ Socceroos",
        "description": "It’s hard not to be happy after a 5-1 victory, but the Socceroos know they need a better performance to win in China on Tuesday night.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "‘Something special’: Socceroos finally ignited",
        "description": "A 5-1 take-down of Indonesia could kickstart a significant Socceroos run to the next World Cup according to the new coach.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "‘Swinging like an idiot’: Tszyu learns a hard lesson",
        "description": "Tim Tszyu didn’t mince his words when discussing his strategy and mental state ahead of his April 6 showdown with Joey Spencer.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Peake shocker puts Elvis in box seat to claim title",
        "description": "Ryan Peake’s disastrous quadruple bogey on his opening hole of the Heritage Classic has all but ensured Elvis Smylie will be crowned PGA Tour of Australasia order of merit champion.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "SuperCoach champ: Young mum-of-three wins 4WD in second season",
        "description": "Charlotte Phillips beat the odds, mastering the chaos of parenting while crafting the perfect fantasy basketball strategy to take home the ultimate SuperCoach NBL prize – a brand-new Mitsubishi 4×4.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Kembla preview: Beer launches his Championship Mission",
        "description": "A long term plan to wait his the Provincial-Midway Championship Qualifier on his home turf with a pair of track specialists can pay big dividends for trainer Mitch Beer.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "‘OMG’: Superstar power couple go public",
        "description": "The sporting world has a new power couple after a US tennis star went public with his relationship with another famous athlete.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    },
    {
        "title": "Newman, underworld figure drop bombshell",
        "description": "Sam Newman has aired an extraordinary “conspiracy theory” and hit out over a video showing him with an infamous Melbourne figure.",
        "source": "News AU",
        "fetched_date": "2025-03-21T07:24:31.544205"
    }
]