[
    {
        "title": "TikTok goes offline in the US hours before ban due to come in",
        "description": "A message appearing for US users said a law banning TikTok had been enacted, meaning \"you can't use TikTok for now\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Shein backlash fails to deter shoppers: 'I spend £20 a month'",
        "description": "Some young shoppers will continue to buy from the fast fashion giant despite concerns over how workers are treated.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Has Trump promised too much on US economy?",
        "description": "He won the election partly to fix inflation but Trump may find his pledges on prices and tariffs conflict, say experts.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Mark Carney, the 'unreliable boyfriend' who ran UK's central bank",
        "description": "Carney is now running for the Liberal Party leadership in Canada. What does his time in London tell us?",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Shein backlash fails to deter shoppers: 'I spend £20 a month'",
        "description": "Some young shoppers will continue to buy from the fast fashion giant despite concerns over how workers are treated.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Trump launches cryptocurrency with price rocketing",
        "description": "Hours after its launch, the market capitalisation for $Trump reached nearly $5.5bn (£4.5bn).",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Trump says he will 'most likely' give TikTok 90-day reprieve from ban",
        "description": "Trump says an announcement will probably come once he takes office on Monday about the app's future in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Toyota unit to settle emissions scandal for $1.6bn",
        "description": "The truck company will also be banned from importing its diesel engines into the US for five years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "'Irreplaceable': The real cost of losing TikTok",
        "description": "With an American TikTok ban threatening the app, users and creators reflect on what it did for internet culture – and what their online worlds might look like without it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Three reasons Trump tariffs aren't China's only problem",
        "description": "China's economy has hit the government's 5% growth target for 2024 in the face of multiple challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Bank performance signals boost to US economy - 16 Jan 2025",
        "description": "Jason Betz from Ameriprise Financial says that there is untapped resilience in the American economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "US Supreme Court upholds TikTok ban law",
        "description": "A law passed last year requires TikTok's Chinese parent company to sell the video platform or face a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "TikTok says it will 'go dark' on Sunday without US government action",
        "description": "The Supreme Court earlier upheld a law that would ban the video app in the US unless its Chinese parent-company sells it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Al Fayed claimed 'poor health' when police investigated abuse",
        "description": "Pelham Spong reported to police in 2017 that Mohammed Al Fayed had assaulted her a decade before but the investigation was shut down.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "IMF warns on Trump's plans but upgrades UK outlook",
        "description": "Trump's policies could benefit the US, but not the rest of the world, the IMF says",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "US grounds SpaceX's Starship after test flight explosion",
        "description": "The rocket's upper stage disintegrated over the Caribbean, forcing airline flights to alter course.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Fears empty restaurant TikTok trend could last",
        "description": "There are fears that tax and wage rises mean restaurants and bars will be quieter than usual all year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Americans and Chinese share jokes on 'alternative TikTok' as US ban looms",
        "description": "RedNote's Chinese users say it is the first time they have been able to speak directly to Americans online.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Apple suspends error-strewn AI generated news alerts",
        "description": "The tech giant was facing pressure to pull the feature after it made repeated mistakes summarising headlines.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "US FDA officially authorises Zyn nicotine pouches for sale",
        "description": "The pouches are used by less than 2% of US teens, the FDA said in granting the application allowing them to continue to be sold.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Global growth forecast to flatline as tariffs add to strains",
        "description": "The World Bank predicts global economic growth of 2.7% this year amid concerns living standards will struggle to improve.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Mark Carney runs for leader of Canada's Liberal Party",
        "description": "The former central banker for the UK and Canada pitched himself as a someone who can help a country navigate economic challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Trump will 'put measures in place' to stop TikTok ban, top adviser says",
        "description": "Incoming National Security Adviser Mike Waltz says the law allows a 90-day grace period for the app's Chinese owner.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "United Health boss defends firm in first earnings results since CEO killing",
        "description": "Sir Andrew Witty says there is \"heightened energy\" to address customers' frustrations.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Jeff Bezos blasts into commercial space race with rocket launch",
        "description": "The Amazon boss's space company is vying to challenge the dominance of Elon Musk's SpaceX.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "US firm that accused Adani Group of fraud shuts down",
        "description": "Nate Anderson, the founder of Hindenburg Research, has announced his decision to disband the company.",
        "source": "BBC Business",
        "fetched_date": "2025-01-19T07:21:15.902312"
    },
    {
        "title": "Menendez Brothers’ Sentencing Postponed Due to Raging L.A. Wildfires",
        "description": "The DA’s office announced Friday yet another turn in the twisted saga of the Menendez brothers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "This Just In: TV News Still Matters",
        "description": "The L.A. fires have put old-fashioned broadcast reportage back in the spotlight, with both national correspondents — like NBC’s Jacob Soboroff — and a slew of local newscasters proving that legacy media isn’t over just yet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "What Fire Wants: Understanding the Enemy",
        "description": "What long has been considered merely a chemical reaction perhaps is best compared to another all-too-familiar scourge — a virus.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "L.A.’s Now in a Doom Era. It’ll Boom Again",
        "description": "History reminds us that this town eventually flips the script on its apocalyptic storyline.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "Rick Caruso Tells Bill Maher He Predicted Palisades Fire: “I’m So Sad That I Was Right”",
        "description": "The former L.A. mayoral candidate said on 'Real Time' that people should be asking, \"Why wasn't more done\" to prevent the Los Angeles wildfires?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "Speaker Mike Johnson Suggests “Conditions” Needed on Federal Aid for L.A. Wildfires",
        "description": "Johnson also blasted California’s Democratic leadership, saying, \"It appears to us that state and local leaders were derelict in their duty.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "Critics Choice Awards Set New Date Amid Los Angeles Fires",
        "description": "The awards show, which was originally set for Jan. 14 in Santa Monica, has been postponed twice and is now scheduled for Feb. 7.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "The Weeknd Donates $1M to L.A. Wildfire Relief",
        "description": "The news comes on the heels of the artist postponing a planned album release on Jan. 24 for 'Hurry Up Tomorrow' and subsequent concert at the famed Rose Bowl stadium.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "Scenes From Hollywood’s Own Disaster Epic: “Sometimes, Words Fail”",
        "description": "Portraits of decimation, heroism and loss from the most destructive wildfires in U.S. history.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "David Lynch Fans Flock to L.A. Landmark Bob’s Big Boy to Pay Homage to Late Filmmaker: “It’s An Extra Gut Punch”",
        "description": "With the city still reeling from the destruction and loss from the wildfires, local Lynch devotees paid homage to the writer-director with coffee and milkshakes at his favorite Burbank diner.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "How to Help: A Guide to Organizations Providing Relief to Those Impacted By L.A. Wildfires",
        "description": "In the wake of the L.A. wildfires, the entertainment industry has stepped up to assist those who need help the most. Major studios — including Disney, Warner Bros. Discovery, Netflix and more — have committed to large donations, set up relief funds and mobilized the industry to take care of its own.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "Alexander Brothers, Sex Trafficking Case Documentary in the Works at Rakontur",
        "description": "Award-winning director Billy Corben says work has started on 'Delisted: The Alexander Brothers,' about two Miami luxury realtors and their brother who have been indicted on sex-trafficking charges.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-19T07:21:16.143247"
    },
    {
        "title": "Next Rafa? Teenager making Melbourne Park his own",
        "description": "Learner Tien’s stunning run at Melbourne Park has him within striking distance of the last eight, a feat that could place him in the rarest of company. FOLLOW DAY 8 LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Kings survive massive JackJumpers scare",
        "description": "The injury hit Tasmania JackJumpers threatened to cause a boilover against Sydney but in the end Kouat Noi’s heroics off the bench led the way for the Kings. Catch up on all the latest news from round 17.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘Disgusting’: US turns on NFL’s golden child",
        "description": "NFL fans have turned on Patrick Mahomes after the superstar quarterback was at the centre of some fiery playoffs controversy.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Kyrgios makes it personal with Ch9 ‘clown’",
        "description": "Nick Kyrgios is still firing off shots at the Australian Open with the Australian taking offence to the actions of a Channel 9 host.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘Never ever’ seen scenes leave BBL stunned",
        "description": "Melbourne Renegades skipper Will Sutherland has been left in disbelief after he was removed from his side’s bowling attack in bizarre circumstances.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Batting dynamo goes berserk in controversial BBL clash",
        "description": "Not one, but two bowlers for the Melbourne Renegades were banned from finishing their overs in a controversial umpiring move at Marvel Stadium as a batting dynamo finally made his mark.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Next Rafa? Teenager making Melbourne Park his own",
        "description": "Learner Tien’s stunning run at Melbourne Park has him within striking distance of the last eight, a feat that could place him in the rarest of company. FOLLOW DAY 8 LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Kyrgios makes it personal with Ch9 ‘clown’",
        "description": "Nick Kyrgios is still firing off shots at the Australian Open with the Australian taking offence to the actions of a Channel 9 host.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘Weak boy’: Star torn to shreds over AO act",
        "description": "Media personality Abbie Chatfield has taken the gloves off and slapped down an AFL player over a comment he left on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Carlton boss finally responds to pic leak",
        "description": "More than a week after the lewd photo scandal broke, the Carlton president and the club has finally responded to the “shocking incident”.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Broncos cult hero set to make NRL history",
        "description": "Former Brisbane Broncos hardman Sam Thaiday has issued a blunt warning as he prepares to step outside of his comfort zone.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Hayne named for return, team list revealed",
        "description": "Jarryd Hayne is set to feature in an upcoming rugby league tournament but his incredible comeback won’t end there.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Steph Rice shares stunning honeymoon pics",
        "description": "Aussie swimming legend Stephanie Rice is living her best life on honeymoon after getting married and celebrating in the style.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Football icon splits from wife after 30 years",
        "description": "Manchester City manager Pep Guardiola has split from his wife of 30 years, with reports claiming the pair had been living apart for nearly five years.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘Disgusting’: US turns on NFL’s golden child",
        "description": "NFL fans have turned on Patrick Mahomes after the superstar quarterback was at the centre of some fiery playoffs controversy.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Chiefs’ quest for historic NFL three-peat continues as star shoves coach in shocking moment",
        "description": "An NFL player was captured sensationally shoving one of his own coaches in the opening minute of the Kansas City Chiefs’ divisional round win over the Houston Texans.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Adelaide United goes top after thrilling Victory clash",
        "description": "Adelaide United moved to the top of the A-League men’s ladder after a thrilling win over Melbourne Victory. See the latest A-League news.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Gunners’ implosion dents title hopes as Nunez rescue Reds",
        "description": "A barnstorming cameo from Darwin Nunez helped Liverpool to a thrilling win over Brentford, as Arsenal’s title tilt was dealt a major blow by Aston Villa.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘I will finish the fight’: Matthews’ promise ahead of UFC return",
        "description": "In a card that has two title fights and is stacked with Aussie talent from head to toe, diehard UFC fans will find it hard for anything to overshadow the homecoming of Jake Matthews.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "$2bn Verstappen bombshell rocks F1",
        "description": "A report has stunned the entire F1 world with reports Max Verstappen has been offered the biggest deal in sporting history.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘Instant chills’: Sanders wins Dakar Rally; second Aussie to win classic",
        "description": "Victorian motorbike racer Daniel Sanders has won the prestigious Dakar Rally, becoming only the second Australian to achieve the feat in 47 years.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Kings survive massive JackJumpers scare",
        "description": "The injury hit Tasmania JackJumpers threatened to cause a boilover against Sydney but in the end Kouat Noi’s heroics off the bench led the way for the Kings. Catch up on all the latest news from round 17.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "‘Good move’: Rory gets in one more Shark sledge",
        "description": "Rory McIlroy’s thoughts on LIV Golf have thawed since the early days of golf’s war, but he still doesn’t have a lot of time for ousted chief executive Greg Norman.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Lockwood to test Give Me Space over further during winter carnival",
        "description": "Trainer Barry Lockwood has revealed his plans with exciting three-year-old Give Me Space.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Wallabies star confident of securing new deal",
        "description": "A leading Wallaby is yet to secure his future beyond this year, but he seems anything but concerned about it.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-19T07:21:18.794525"
    }
]