[
    {
        "title": "EU 'strongly' regrets US plan to double steel tariffs",
        "description": "The 27-member bloc says Donald Trump's move undermines efforts to reach a deal, warning of \"countermeasures\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "The fallout from Trump's war on Harvard will long outlast his presidency",
        "description": "The US president's ramped-up threats are seen by many as an attempt to reshape a stronghold of the left. Could he succeed?",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Football and other premium TV being pirated at 'industrial scale'",
        "description": "New research singles out the Amazon Fire Stick as the most popular means of accessing illegal streams.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "China hits back after Trump claims it is 'violating' tariff truce",
        "description": "The remarks from both sides raise concerns that a trade war could erupt again between the two largest economies.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "The fallout from Trump's war on Harvard will long outlast his presidency",
        "description": "The US president's ramped-up threats are seen by many as an attempt to reshape a stronghold of the left. Could he succeed?",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Defence review to send 'message to Moscow' – Healey",
        "description": "At least six new factories will be built and up to 7,000 UK-built long-range weapons will be procured.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "US to double tariffs on steel and aluminium imports to 50%, Trump says",
        "description": "President Donald Trump says the increase in tariffs will protect America's steel industry, along with an expected partnership with Japan.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "UK steelmakers call Trump doubling tariffs 'another body blow'",
        "description": "Donald Trump says he will double tariffs on steel and aluminium imports to 50% from Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Winemakers finding Trump's tariffs hard to swallow",
        "description": "Wine producers in both France and the US are unhappy at the US president's trade actions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Cyber criminals contact BBC to claim hack on Co-op, M&S",
        "description": "Hackers reached out to the BBC's Joe Tidy on Telegram, frustrated that their ransom demands weren't being met.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "US green energy firms brace for federal funding cuts",
        "description": "Billions of dollars of US federal funding for green energy projects hangs in the balance.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "UK taxpayers no longer own NatWest - but 17 years on, are banks safer from collapse?",
        "description": "The last shares have been sold from the RBS bailout during the financial crisis. But, with banks facing fresh risks today, has enough changed?",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Ryanair boss on target for bonus worth more than €100m",
        "description": "Michael O’Leary is set to earn a bonus worth more than €100m (£84m) after clearing a key performance target.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "India GDP grows faster than expected, latest figures show",
        "description": "Full year growth for financial year 2024-25 is pegged at 6.5%, the slowest in four years.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Trump tariffs can stay in place for now, appeals court rules",
        "description": "The president's signature import taxes win a legal reprieve, as the White House rails against \"activist judges\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Court fight threatens Trump's power to wield favourite weapon",
        "description": "Despite the legal mire over tariffs, all signs point to a battle the Republican president won't give up easily.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "How the West is helping Russia to fund its war on Ukraine",
        "description": "Data shows that Russian fossil fuel revenues are three times higher than aid allocated to Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "It's Musk's last day - what has he achieved at the White House?",
        "description": "The tech billionaire and Doge have spearheaded dramatic changes in the US government and Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Haribo recalls bags of sweets in Netherlands after cannabis found",
        "description": "The confectionary company says it is working with the police after several people report feeling ill.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "The impact of Trump tariffs ruling – in numbers",
        "description": "BBC Verify examines what the latest development means for US and global trade.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Elon Musk leaves White House but says Doge will continue",
        "description": "Musk's exit comes after he criticised the legislative centrepiece of the president's agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "UK car making plunges to lowest for over 70 years",
        "description": "The number of new vehicles made in the UK was the lowest figure for April - outside the pandemic - since 1952.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "The man making darts for the Premier League winner",
        "description": "Lee Huxtable has made darts for a legion of world champions, and pursues the perfect arrow.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Hailey Bieber's make-up brand sold to e.l.f.",
        "description": "Buyer e.l.f. Beauty calls it a \"beautiful brand that we believe is ready for rocketship growth\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Chile's salmon farms hope for calmer waters",
        "description": "Chilean salmon producers are being criticised for operating in some of the country's national parks.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Nvidia revenues surge despite tariff uncertainty",
        "description": "Nvidia's share price rose by more than 5% in pre-market trading on Thursday after it beat Wall Street expectations.",
        "source": "BBC Business",
        "fetched_date": "2025-06-01T07:25:45.495958"
    },
    {
        "title": "Would Trump Pardon Sean “Diddy” Combs? “I Would Certainly Look at the Facts,” President Says",
        "description": "He said “nobody’s asked” about a potential pardon for the former music mogul, though he believes “some people have been very close to asking\" amid the ongoing trial.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Sean “Diddy” Combs’ Lawyers Question Assistant’s Dedication Amid Abuse Allegations",
        "description": "The woman testifying under the pseudonym \"Mia\" worked for Combs for years, smiling through multiple alleged sexual assaults, an experience she said left her with post-traumatic stress and suicidal thoughts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Todd Chrisley Maintains Innocence, Teases Reality Show After Trump Pardon",
        "description": "The 'Chrisley Knows Best' star and daughter Savannah spoke at a press conference two days after he and his wife were released from prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Taylor Swift Buys Back Her Catalog: How We Got Here",
        "description": "The tug-of-war for the rights to her first six albums is over as the singer ends one of the most notorious disputes in music industry history.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Elon Musk Was Using So Much Ketamine While Campaigning for Donald Trump It Was Affecting His Bladder, NY Times Reports",
        "description": "The newspaper says the Tesla and SpaceX CEO, who said earlier this week he was leaving the Trump administration after his work with DOGE, was using drugs \"far more intensely than was previously known\" as he became a close ally of the president near the beginning of his second term.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Sean “Diddy” Combs’ Ex-Personal Assistant Says She Was Too Traumatized to Answer His 2023 Call",
        "description": "The former assistant said she threw her phone across the room in terror and ran outside when she saw the hip-hop mogul calling her days after Cassie Ventura sued him.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Glenn Greenwald Sex Tape Leak: Journalist Cites “Maliciously Political” Motives",
        "description": "\"I have no embarrassment or regret about them,\" the blogger, who broke the Edward Snowden story in 2013, says of the videos.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Taylor Swift Buys Back Rights to Her First Six Albums Years After Scooter Braun Drama",
        "description": "\"I really get to say these words: All of the music I've ever made... now belongs... to me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Mike Sumler, Kool & the Gang Hype Man, Dies at 71",
        "description": "He first crossed paths with the legendary group in 1985 when he was performing with his own band, Power Pac.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "I Helped Pick National Endowment for the Arts Grant Recipients. Trump Eliminated Many of Them",
        "description": "On the panel I served on, nobody used the letters “DEI” to justify decisions, though the administration would later claim such logic was behind many of the canceled grants.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Who’s Who in the Sean “Diddy” Combs Trial: Key Witnesses, Industry Enablers and Victims So Far",
        "description": "Cassie Ventura, Kid Cudi and assistants of Combs have all testified in the ongoing trial.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Miley Cyrus Releases Ninth Album, ‘Something Beautiful’",
        "description": "Cyrus previously described the record as \"a unique visual experience fueled by fantasy” and a “one of a kind pop opera.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-01T07:25:46.447322"
    },
    {
        "title": "Viral sport ‘here to stay’ despite teen’s death",
        "description": "Controversial sport run it straight is reportedly ‘here to stay’ despite the viral trend claiming the life of a teenager.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "UFC world left stunned by shock seizure",
        "description": "UFC fans and commentators have been left lost for words after star Maycee Barber suffered a medical episode as she began to walk out.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "‘Nuts’: Aussie breaks 100m 10-second barrier",
        "description": "Australian sprinter Lachlan Kennedy has sensationally broken the 10-second barrier in the Men’s 100m, cementing his growing reputation as one of the fastest people on Earth.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "‘Not the coach’: Real Broncos problem exposed",
        "description": "The Broncos have been told to “harden up” after their latest loss as a theory about their coach Michael Maguire just won’t go away.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "NRL Live: Origin stars on deck as Blues halves face off",
        "description": "They led NSW to victory together, but now Origin halves Mitchell Moses and Nathan Cleary face off in the battle of the west. It comes after a Blues teammate was injured in the early game. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "‘Not the coach’: Real Broncos problem exposed",
        "description": "The Broncos have been told to “harden up” after their latest loss as a theory about their coach Michael Maguire just won’t go away.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Saints star in concussion scare after huge bump",
        "description": "St Kilda made a flying start in Alice Springs but the Saints are facing a Melbourne revival with two stars off the ground. Follow all the action live.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Swans ‘humiliated’, fans stage SCG walk-out",
        "description": "The Sydney Swans have been labelled a “rabble” by a rival player after an “embarrassing” loss that had fans walking out of the SCG.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Hoff’s statement in shootout for WTC spot",
        "description": "There’s only one spot for either Josh Hazlewood or Scott Boland in the World Test Championship final and one of them is on fire.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "‘Muddled mess’: Key factor in Marnus’ fate",
        "description": "Cameron Green looks a certainty to return to the Australian team, but a decision on who opens with Usman Khawaja could be determined by one thing.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Poportunity knocks: Aussie surges into French Open’s second week",
        "description": "Australian Alexei Popyrin has continued his career-best run at the French Open with a stirring victory that has seen him reach the second week of a major for the second time in his career.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "‘Not normal’: Demon calls for big change",
        "description": "After tasting second-round defeat at the French Open, an exhausted Alex de Minaur demanded tennis authorities make a big change.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "‘Gimmick’ threatens F1’s $36bn juggernaut",
        "description": "A motorsport legend has dropped a truth bomb on F1 as the glamour sport grapples with a massive problem with no obvious solution.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "McLaren drama, Piastri’s message says it all",
        "description": "Oscar Piastri got the last laugh in qualifying for the Spanish Grand Prix after his McLaren teammate attempted a brazen move on him.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Piastri stuns F1 rivals to snatch pole position in Spain",
        "description": "Oscar Piastri got one back over his McLaren teammate Lando Norris with a stunning performance in qualifying at the high-speed Catalunya circuit in Barcelona.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "SBW apologises for promoting Run it Straight after teen’s death",
        "description": "Sonny Bill Williams has apologised for sharing a video promoting ‘Run it Straight’ just days after a teenager in New Zealand died while playing a similar game with friends.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Reds captain rejects overseas stint",
        "description": "Reds captain Tate McDermott ‘loves’ playing for Queensland, and will continue to do so next year after rejecting the chance to ply his trade abroad.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "$300m NBA star in bombshell rape claim",
        "description": "Rumours have been spreading about a two-time NBA All-Star’s murky future and a bombshell rape lawsuit has now dropped.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "NBA on notice as Thunder make history",
        "description": "The Minnesota Timberwolves had no answers as the dominant OKC Thunder sent an ominous message and charged into the NBA Finals.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "World Cup bolter: Socceroos great’s son wins national team call-up",
        "description": "The son of a Socceroos great has been named in the national squad for Australia’s World Cup qualifiers against Japan and Saudi Arabia.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Leckie needs ‘really good break’, out of Socceroos squad",
        "description": "Battered and bruised after his man-of-the-match performance in the A-League grand final, Mathew Leckie has withdrawn from the Socceroos squad.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "UFC world left stunned by shock seizure",
        "description": "UFC fans and commentators have been left lost for words after star Maycee Barber suffered a medical episode as she began to walk out.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "YouTube guide to conquer US Open beast",
        "description": "A baptism of fire awaits a rookie Australian pro at the US Open on a course that few of the field have ever laid eyes on other than through videos.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "$300m NBA star in bombshell rape claim",
        "description": "Rumours have been spreading about a two-time NBA All-Star’s murky future and a bombshell rape lawsuit has now dropped.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Diwali springs a surprise in Sandown Cup",
        "description": "Developing stayer Diwali caused a minor upset in the Listed Sandown Cup (3200m) on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-06-01T07:25:47.449118"
    }
]