[
    {
        "title": "List accomplishments or resign, Musk tells US federal workers",
        "description": "The weekend email comes as Elon Musk leads an effort to aggressively curtail the government workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "BMW delays electric Mini over 'uncertainty'",
        "description": "The vehicle manufacturer says \"multiple uncertainties\" in the industry led to its decision.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "'I make more in one hour on TikTok than a day in the shop'",
        "description": "Laura Mallows sells most of her products via TikTok but \"dreams\" of opening a physical shop once more.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Apple pulls data protection tool after UK government security row",
        "description": "Customers' photos and documents stored online will no longer be protected by end-to-end encryption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "BMW delays electric Mini over 'uncertainty'",
        "description": "The vehicle manufacturer says \"multiple uncertainties\" in the industry led to its decision.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Trump administration to cut thousands of jobs at Pentagon and IRS",
        "description": "The cuts targeting mostly new and recently promoted workers are part of the administration's push to shrink the federal work force.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Cryptocurrency theft of £1.1bn could be biggest ever",
        "description": "Dubai-based Bybit said it could afford to reimburse customers and that it was working to find the hackers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Musk wields his Doge chainsaw - but is a backlash brewing?",
        "description": "Facing constituents angry about the impact of sweeping government job cuts,  some Republicans are expressing concern.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "BBC undercover filming exposes Indian pharma firm fuelling opioid crisis",
        "description": "An Indian drug maker tells a BBC undercover team its addictive cocktail drug is “very harmful” but “this is business”.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "What does Jack Ma's return to the spotlight mean?",
        "description": "Analysts say the Alibaba founder's re-emergence could signal a policy change in Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Man offers to split winnings after thieves hit jackpot with his credit card",
        "description": "The Frenchman has called on the thieves to strike a deal with him to split the €500,000 (£413,664) prize.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Coinbase boss claims SEC will drop crypto lawsuit",
        "description": "The SEC's 2023 lawsuit formed part of a crackdown on crypto firms which President Trump pledged to reverse.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Scotch makers condemn English single malt whisky proposal",
        "description": "Scottish distilleries and MPs claim England's methods would damage the reputation of single malt.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Farmers say bird flu a 'crisis' as egg prices soar",
        "description": "Farmers say they are losing the fight against bird flu as Trump officials propose vaccines for birds.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "St Pancras plans for direct trains from UK to Germany",
        "description": "The London station's owner and Eurotunnel hope to expand routes to Cologne, Frankfurt and Switzerland.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "UK government finances in surplus but pressure builds on Reeves",
        "description": "Chancellor faces a rising challenge to keep her tax and spending plans on track after missing forecasts.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Trump 'very frustrated' and Zelensky must strike minerals deal, says adviser",
        "description": "The comments overshadowed Zelensky's meeting with US envoy Keith Kellogg in Kyiv.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Trump's '$21m for voter turnout' claim triggers political row in India",
        "description": "The governing BJP has accused the opposition Congress of seeking \"external interference\" in elections.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Passengers on crashed Toronto plane offered US$30,000 each",
        "description": "The gesture to the affected travellers - all of whom survived - comes with no strings attached, the airline says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "The tiny Danish town transformed by Ozempic",
        "description": "American demand for weight-loss drugs is supercharging Denmark’s economy and transforming a small Danish community into an unlikely boomtown.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Birkenstock sandals are not art, says German court",
        "description": "The firm wanted to claim protection under copyright law, to stop rivals selling copycat versions of its shoes.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "What will Amazon do with James Bond?",
        "description": "Long-serving masterminds Barbara Broccoli and Michael G Wilson give creative control to Amazon.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Apple gambles on new iPhone with AI features at lower cost",
        "description": "Apple is hoping its latest, lower cost iPhone model will boost sales of its flagship device.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Lloyds sets aside £1.2bn for car loan scandal",
        "description": "The banking group has nearly tripled the amount it has ringfenced for potential compensation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "I'm not happy with Boeing, Trump says over Air Force One",
        "description": "US president says he is looking for alternatives because Boeing is taking too long to build new planes",
        "source": "BBC Business",
        "fetched_date": "2025-02-23T07:22:15.726931"
    },
    {
        "title": "Do Couples That Sing Together Stay Together? Tate McRae and The Kid Laroi, Sonny & Cher and More Star-Studded Duets",
        "description": "From Beyoncé and Jay-Z to Camila Cabello and Shawn Mendes, take a look at the celebrity couples who have recorded songs together.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Dana Carvey Says Lorne Michaels Is Intrigued by Blake Lively-Justin Baldoni Legal Battle",
        "description": "The 'SNL' boss shared his commentary on the feud with the former castmember.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Tate McRae Draws Large Crowd to Kia Forum Parking Lot for Album Release Event",
        "description": "The “Greedy” singer debuted several new songs at the fan-focused event Thursday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "AP Sues Trump Administration Officials After White House Ban",
        "description": "The ban came after the Associated Press continued to use the phrase \"the Gulf of Mexico\" after Trump said he had renamed it \"the Gulf of America.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "New Kennedy Center President Says Trump Wants to “Make Art Great Again”",
        "description": "Ric Grenell says that the performing arts institution is planning a \"huge celebration of the birth of Christ\" for December.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Mayor Karen Bass Fires L.A. Fire Chief Following Deadly Wildfires",
        "description": "Bass said Friday that she \"met with and removed Kristin Crowley as fire chief effective immediately.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Voletta Wallace, Notorious B.I.G.’s Mother, Dies at 78",
        "description": "She was an outspoken advocate for her son and his memory in the wake of his 1997 death.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Tom Hanks and Rita Wilson Donate $1M for L.A. Wildfire Relief Efforts",
        "description": "The beloved couple is spreading funds across the Motion Picture and Television Fund, the Los Angeles Fire Foundation, SAG-AFTRA Foundation Disaster Relief Fund, the American Red Cross and MusiCares.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Grimes Says Elon Musk Is Ignoring “Child’s Medical Crisis”",
        "description": "The musician and producer made a public plea to the the tech mogul on his own social media platform, X, to try to get his attention.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "George Clooney Explains Why He Thinks Trump Won the Election",
        "description": "Clooney breaks down why he thinks Kamala Harris lost in 2024 and talks other political issues.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Hunter Schafer Says She Received a Passport With Male Sex Marker After Trump’s Anti-Trans Executive Orders",
        "description": "The 'Euphoria' star got candid in a revelatory eight-minute clip shared on social media: \"It doesn't change really anything about me or my transness. However, it does make life a little harder.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Lady Gaga to Perform a Free Concert on Rio’s Copacabana Beach in May",
        "description": "In 2017, she canceled a performance at Rock in Rio for medical reasons.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-23T07:22:16.549750"
    },
    {
        "title": "Ange claps back over targeted attacks",
        "description": "Tottenham boss Ange Postecoglou has gone on the attack in the wake of targeted attacks being levelled against his club in recent weeks.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Devastating blow rocks AFL club to its core",
        "description": "Carlton have been dealt a crushing blow on the eve of the 2025 AFL season with their top draft now set to miss the entire year.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Josh Giddey blows NBA world away",
        "description": "Australian star Josh Giddey has continued his red-hot NBA form as he delivered a new career-high against one of the league’s best teams.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Police seek help after Melbourne street brawl",
        "description": "Scary video shows the moment a street brawl erupted between apparent football fans with the violence spreading down a Melbourne street.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Aussie anthem outrage as complaint lodged",
        "description": "The expressions on the faces of Aussie players said it all when the wrong national anthem was played before their showdown with England.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "England’s weak excuse shows lack of class",
        "description": "Australia produced one of the great run chases to defeat England on Sunday morning, but all the Poms could talk about was something else.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Tennis rocked as stars spill horror stories",
        "description": "Alex de Minaur’s fiancee has revealed a terrifying experience as the tennis world reckons with a truly horrific incident this week.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "New footage says it all in Raducanu drama",
        "description": "New footage of the moment that left tennis star Emma Raducanu hiding and in tears after spotting a “fixated” fan has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Devastating blow rocks AFL club to its core",
        "description": "Carlton have been dealt a crushing blow on the eve of the 2025 AFL season with their top draft now set to miss the entire year.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Fans in ‘shock’ as Aussie star confirms split",
        "description": "A popular couple among Melbourne’s social scene have announced their break-up – just weeks after denying rumours they’d “quietly split”.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "NRL Vegas confidential: Raiders thrown second curveball in 24 hours",
        "description": "Canberra’s US jaunt took a turn when players had to share a training field with an under-12s girl’s flag team. Plus, Cronulla have received VIP treatment at an exclusive LA restaurant and the Warriors arrived in Vegas in style. WATCH THE VIDEOS",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Sharks’ NRLW team eyes $8m election promise",
        "description": "Cronulla’s NRLW team are one step closer to having their own changerooms with the Sharks and the Coalition pledging a combined $8 million in funding should they win the federal election.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "‘It’s greed’: Footy divided over $1.2m trend",
        "description": "“Exciting” AFL and NRL off-seasons with more player movement than ever has exposed a modern new reality about the footy codes.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Trudeau’s brutal 11-word message to Trump",
        "description": "Canadian PM Justin Trudeau has delivered a blunt message to US President Donald Trump as tension between the nations continues to simmer.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Anthem singer’s middle finger to Trump",
        "description": "The USA-Canada political tensions took another turn on Friday when a national anthem singer delivered a direct shot at Donald Trump.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Ange claps back over targeted attacks",
        "description": "Tottenham boss Ange Postecoglou has gone on the attack in the wake of targeted attacks being levelled against his club in recent weeks.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Stunning double save earns Glory draw against Sydney",
        "description": "Perth Glory was able to hold Sydney FC to a scoreless draw on Saturday night and it came courtesy of a stunning double save from keeper Oli Sail. See the highlights and biggest news from the weekend.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Star rushed to hospital in boxing insanity",
        "description": "A boxing beast has got his world title revenge as a star was rushed to hospital on a wild night that has stunned boxing commentators.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Waters perfects pole trifecta at opening Supercars weekend",
        "description": "Supercars’ qualifying king Cam Waters has notched up a third straight pole position in Sydney as he looks towards an opening round clean sweep.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Driver fined, relegated to last after embarrassing teammate crash",
        "description": "Teammates Aaron Love and James Courtney were involved in a bizarre collision at the start of Supercars qualifying which left their team principal fuming.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Savage slur sends shockwaves around world",
        "description": "An NBA and Team USA superstar has clapped back at a theory about the American basketball team that will cut rival nations deep.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Outlaw jailed bikie now a rising golf star",
        "description": "He was once jailed for five years for assault but Ryan Peake has put his dark past behind and is now focused on becoming a golf star.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Dee eyes third Group 1 Australian Guineas in five years",
        "description": "Newly-minted dual Blue Diamond Stakes-winning jockey Michael Dee has sights on a third Group 1 Australian Guineas (1600m) in five years on Saturday at Flemington.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Wright close to returning for Reds",
        "description": "As desperate as Liam Wright is to return from a shoulder injury for the Reds, the Queenslanders aren’t expected to risk him while there is any doubt over his fitness.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Wallabies captain signs new deal",
        "description": "The Wallabies captain wants the `best years’ of his career to be with the Queensland Reds and the Wallabies.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "Student collapses, dies at rowing training",
        "description": "The 17-year-old Melbourne student collapsed after finishing a training session on a rowing machine.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    },
    {
        "title": "‘Wicked’: AFL WAG compared to conwoman",
        "description": "An AFL player’s beloved wife, who is suffering from terminal cancer, has revealed she’s been compared to conwoman Belle Gibson.",
        "source": "News AU",
        "fetched_date": "2025-02-23T07:22:18.845408"
    }
]