[
    {
        "title": "South Korea bans downloads of China's DeepSeek AI",
        "description": "App stores in South Korea have removed DeepSeek over concerns about how  it manages users' data.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "US government tries to rehire nuclear staff it fired days ago",
        "description": "It is having problems contacting people who were fired in Trump's blitz to shrink the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "'Gnarly' battle over £1m farmhouse as off-grid group refuse to leave",
        "description": "The non-hierarchical group live communally and are dedicated to sustainable living.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Scattered anti-Musk protests target Tesla dealerships",
        "description": "Protesters organized small #TeslaTakeover demonstrations on BlueSky, the rival to Musk's platform X.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "US government tries to rehire nuclear staff it fired days ago",
        "description": "It is having problems contacting people who were fired in Trump's blitz to shrink the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Trump steel tariffs negative for UK and US, says Reynolds",
        "description": "President Donald Trump is set to impose 25% taxes on steel entering the US \"without exceptions\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "'This battle is my 9 to 5 - I won't stop until I have my £620m of Bitcoin back'",
        "description": "James Howells claimed his ex-girlfriend threw out the hard drive, today worth £620m, in 2013.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "What happens in the world's deepest gypsum mine?",
        "description": "The mine is 1,000ft (305m) below ground and its raw materials are used in the building industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Mapping China's influence around the Panama Canal",
        "description": "A close-up look at Chinese projects that worry the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Why don't Europeans buy more American cars?",
        "description": "Trump wants US vehicles to be more popular in Europe, but it's a difficult market for them to crack.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "What it means when Elon Musk brings his children to work",
        "description": "You'll sometimes see one of his children on his shoulders as billionaire Elon Musk makes public appearances.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Is Trump right when he says the US faces unfair trade?",
        "description": "He wants to hit back at countries that place import taxes on American goods that he thinks are too high.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Too quiet on set? Hollywood pushes for more LA productions post wildfires",
        "description": "January's wildfires have exacerbated the decline of Hollywood's once booming film and television industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Five key takeaways from Modi-Trump talks",
        "description": "Modi and Trump rekindle ties amid a global trade war, balancing tariffs, trade deals and strategic interests.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "What we've learned about Rachel Reeves's expenses - and the Labour response",
        "description": "Senior figures defended the chancellor after we revealed her expenses were investigated before she was an MP.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Why Muslims in India are opposing changes to a property law",
        "description": "Muslim groups say the changes are politically motivated but the government says it is responding to demands for reform.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Uber and Bolt drivers strike on Valentine's Day",
        "description": "Thousands of drivers are taking part in the strike action over pay and working conditions, a union says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "US politicians furious at UK demand for encrypted Apple data",
        "description": "They say the US should re-evaluate its cyber-security partnership with the UK unless the \"dangerous\" request is withdrawn.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Trump tariff VAT threat raises fears of hit to UK",
        "description": "The surprise inclusion of VAT to calculate tariffs prompts questions over the possible impact on British businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "TikTok returns to Apple and Google app stores in the US",
        "description": "TikTok is again available on app stores in the US after President Donald Trump delayed a ban on the app.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "More migrant workers claim UK farm exploitation",
        "description": "The UK government says it always takes \"decisive action\" where abusive practices are found on farms.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Beyoncé ticket sale runs smoothly, to fans' surprise",
        "description": "Tickets for Beyoncé's latest UK dates go on general sale on Friday, with prices reaching up to £950.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Trump launches plan to target countries with new tariffs",
        "description": "The US president ordered his staff to develop a response to countries with trade policies he says are unfair.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "UK signals it will seek US steel tariff exemption",
        "description": "Business secretary Jonathan Reynolds says the government has a strong case to avoid tariffs on UK-made steel entering the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "Jeff Bezos space firm Blue Origin to cut a tenth of jobs",
        "description": "The company is looking to trim manager ranks and focus on ramping up rocket launches.",
        "source": "BBC Business",
        "fetched_date": "2025-02-17T07:23:53.152393"
    },
    {
        "title": "K-Pop Star Wonho on Touring, Working “Really Hard” on a New Album and What’s Next For Him",
        "description": "The 31-year-old singer has been busy in the five months since returning from his military enlistment with meeting fans in the U.S., performing at Jingle Ball shows and releasing new music.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Amazon CEO “Incredibly Relieved” After Employee’s Release From Being Held Hostage Since Oct. 7 Attacks",
        "description": "\"Since we learned of Sasha [Troufanov] and his family’s abduction, we’ve had a dedicated team working behind the scenes with experts to support efforts to secure their release,\" Andy Jassy said Saturday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Berlin According To… Susan Wendt, Managing Director, Sales, TrustNordisk",
        "description": "The veteran sales exec weighs in on how to stay warm, where to take a stroll and how to ward off the festival flu (it involves a bitters liquor).",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "6 Ways to Get to Know Berlin (Inside and Out)",
        "description": "Never tackle Berlin without a plan: A well-thought-out day exploring the city means having an agenda of both indoor and outdoor options.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Sheryl Crow Says “So Long Tesla,” Donates Money to NPR: “Under Threat By President Musk”",
        "description": "The Grammy-winning singer sold her Elon Musk-manufactured Tesla because she's no longer \"willing to align\" herself with the billionaire following his move into the Trump administration.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Murdoch Family Drama Details Emerge After Nevada Trial Ruling Over Fate of Empire",
        "description": "The Roy clan of HBO's 'Succession' has nothin' on the bitter and deep divides in the Murdoch family, as is revealed this week in an Atlantic Magazine feature.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Blink-182 Reunite With Former Guitarist Matt Skiba at L.A. Fire Relief Concert",
        "description": "The band performed a sold-out show at the Hollywood Palladium, with proceeds benefiting those impacted by the recent Los Angeles wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Jay-Z and Sean “Diddy” Combs Rape Lawsuit Dropped",
        "description": "Tony Buzbee, a lawyer for the Jane Doe accuser who's filed several lawsuits on behalf of accusers advancing sexual assault allegations against Combs, moved to voluntarily dismiss the lawsuit.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Selena Gomez Says She Couldn’t “Have Accepted” Her Relationship With Benny Blanco 10 Years Ago",
        "description": "The couple's joint album 'Said I Love You First' will drop on March 21.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Ari Emanuel Explains Why He Believes Blake Lively Instead of Justin Baldoni",
        "description": "The Endeavor CEO on why he's \"ride or die\" for Lively and Ryan Reynolds in their legal battle with the 'It Ends With Us' director.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "JonasCon: Jonas Brothers Celebrate 20 Years With One-Day Fan Event",
        "description": "The trio of brothers are heading to their home state of New Jersey for a free fan experience with live performances, Q&A panels, DJ sets and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "Will Smith to Perform New Single “First Love” on Univision Awards Show ‘Premio Lo Nuestro’ (Exclusive)",
        "description": "This will mark the Grammy winner's first performance in the history of the show and the TV debut of the new track.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-17T07:23:53.538203"
    },
    {
        "title": "‘Worst game ever seen’: NBA world loses it",
        "description": "The basketball world has all been left saying the same after the latest installment of the NBA All Star Game unfolded on Monday.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Andrews and Neale to again lead Lions",
        "description": "Having won the AFL premiership last season, the Brisbane Lions have predictably kept the same leadership structure in place.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Socceroo set to miss qualifiers",
        "description": "The Socceroos seem likely to be without one of their brightest young talents for next month’s games against Indonesia and China.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Cheat’: Aus Open ‘stained’ as bombshell drops",
        "description": "There have been calls for Jannik Sinner to be stripped of his Australian Open title over one detail in his doping ban settlement.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Need to be stronger’: Where Vics need to lift",
        "description": "Victoria batter Peter Handscomb says the Vics must be stronger in the high-pressure moments to secure a Sheffield Shield final berth.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Cricket Australia has failed Aussie star",
        "description": "A former Test bowler has put the onus on Cricket Australia after Matt Kuhnemann was cited for a suspect action in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Cheat’: Aus Open ‘stained’ as bombshell drops",
        "description": "There have been calls for Jannik Sinner to be stripped of his Australian Open title over one detail in his doping ban settlement.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Damning clip emerges as Sinner violates ban",
        "description": "Banned tennis star Jannik Sinner may find himself in even more hot water after recent footage appeared to show him in violation of his doping ban.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Andrews and Neale to again lead Lions",
        "description": "Having won the AFL premiership last season, the Brisbane Lions have predictably kept the same leadership structure in place.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Seamless transition’: Dogs fill key role",
        "description": "The Western Bulldogs boss has thrown his support behind a new appointment, confident he can oversee the club through a period of prolonged success.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "WATCH: PVL’s personal NRL Vegas invitation to Trump",
        "description": "ARL Commission boss Peter V’landys is going all out in a bid to host Donald Trump at the NRL’s Las Vegas extravaganza, issuing a public plea for the US president to attend the season opener. SEE THE VIDEO",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Roosters rookie locked in for NRL debut",
        "description": "The Roosters may have lost two of the best outside backs in the world, but there’s a big reason for their fans to be excited.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "3 fights in 9 secs after US anthem booed",
        "description": "The USA-Canada political tensions exploded into the sporting world overnight after an insane start after US anthem was booed.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Getting fired anyway’: Shaq goes rogue",
        "description": "The basketball legend yelled “we’re getting fired anyway” as he stunned onlookers with a wild rant on a live NBA broadcast.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Socceroo set to miss qualifiers",
        "description": "The Socceroos seem likely to be without one of their brightest young talents for next month’s games against Indonesia and China.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Welcome to my world’: Ange’s warning",
        "description": "With Tottenham’s injury crisis easing, Spurs boss Ange Postecoglou is optimistic about what his team can still achieve this season.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Racist scandal overshadows title fight",
        "description": "An American boxer has become a champion of the world in the wake of an ugly racist scandal that overshadowed the title fight.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Team moves, series revamp: Your 2025 Supercars Ultimate Guide",
        "description": "The Supercars season is right around the corner – and there’s plenty that has changed since last year. Here’s everything you need to know about the series revamp, team changes and upcoming milestones.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Schumacher wife upset over prison sentence",
        "description": "Sentences have been handed down and new details have emerged about the plot to blackmail the family of Formula 1 legend Michael Schumacher.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Phoenix keep NBL title dream alive with stunning comeback",
        "description": "South East Melbourne Phoenix has surged into the NBL’s final four after a stunning second half comeback powered by import Matt Hurt. Here’s how they set up a date with the Illawarra Hawks.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Crazy’: Five-year LIV deal shocks Smith",
        "description": "After taking big bucks to move to LIV and copping criticism for it Cam Smith says the new Adelaide deal means a lot.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Jockey dead at 24 after horrific incident",
        "description": "The horse racing word is in mourning after the death of a champion jockey following a five-horse “pile up”. WARNING: Distressing images.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Reds star staying patient in comeback bid",
        "description": "With a ‘weird’ 2024 behind him, Queensland Reds co-captain Liam Wright is eager to return from a shoulder injury that has sidelined him since July.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Suaalii turns heads in crazy debut",
        "description": "Joseph Suaalii stole the show in his Super Rugby debut with an instant impact on the Waratahs, as they clinched a last-gasp win over the Highlanders.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "‘Tacky’: Reality Taylor Swift can’t escape",
        "description": "Taylor Swift might be one of the most famous and liked women in the world but there’s a wild reality even she can’t escape.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-17T07:23:55.402338"
    }
]