[
    {
        "title": "Trump threatens extra 10% tariff on nations siding with Brics",
        "description": "The president said the levy will apply to \"any country aligning themselves with the Anti-American policies of Brics\".",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Trump calls Musk's new political party 'ridiculous'",
        "description": "The US president and Tesla boss were close allies before a dramatic falling out in recent weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Trump signs sweeping tax and spending bill into law",
        "description": "A signing ceremony at the White House on Friday afternoon kicked off celebrations for 4 July.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Not getting a summer job? Here are eight ways to change that",
        "description": "Grace Pickett, 18, says it's \"frustrating\" so many part-time jobs require previous experience.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Trump calls Musk's new political party 'ridiculous'",
        "description": "The US president and Tesla boss were close allies before a dramatic falling out in recent weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "How Trump's tariff chaos could reshape Asia's businesses",
        "description": "The US president's tough stance on global trade is shaking up the region's crucial supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "How tariffs are shifting global supply chains",
        "description": "Trump's 90-day pause on his sweeping tariffs plan is about to expire. But already some firms are radically changing how they work.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Elon Musk says he is launching new political party",
        "description": "The world's richest man says he is setting up a new political organisation called the America Party.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Why the world's superyachts are getting bigger and bigger",
        "description": "Billionaires and multimillionaires around the globe are trading up for more space and luxury.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "The bridge changing lives and boosting business",
        "description": "The Öresund bridge, which connects Denmark and Sweden, is celebrating 25 years since its opening.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Markets mixed ahead of US jobs data - 2 July 2025",
        "description": "Chief Investment Officer at Hamilton Capital Partners says markets are in a 'wait and see' mode over tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "'I'm being paid to fix issues caused by AI'",
        "description": "Businesses that rush to use AI to write content or computer code, often have to pay humans to fix it.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "'Is there gold in them?': Indian artisans up in arms over Prada's sandals",
        "description": "Artisans who make Kolhapuri sandals are demanding better recognition after Prada failed to acknowledge design roots.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "US debt is now $37tn – should we be worried?",
        "description": "President Trump's budget bill will add to the US debt pile but is there a limit to how much the rest of the world will lend Uncle Sam?",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Pride in London returns as events struggle with falling funds",
        "description": "UK Pride organisers tell the BBC that less sponsorship funding and fewer volunteers are behind cancelled events.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Crying at work: A sign of strength, weakness or just being human?",
        "description": "After UK Chancellor Rachel Reeves cried in parliament this week, how acceptable is it to show emotion at work?",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "One in 10 cars sold in UK made in China",
        "description": "One in 10 cars bought in the UK are Chinese owned, new figures suggest.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Trump says US to start sending out tariff letters",
        "description": "The move comes ahead of a deadline that may see much higher import taxes on goods coming into the US.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "What have tariffs really done to the US economy?",
        "description": "As President Trump weighs tariff plans, he will have one eye on the US economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Sport agent Jonathan Barnett accused of rape in US lawsuit",
        "description": "Barnett denies allegations he kept the woman as a \"sex slave\" over a six year period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Fictional K-pop bands beat BTS and Blackpink in US charts",
        "description": "Songs from the film KPop Demon Hunter have surpassed the success of real-life K-pop bands BTS and Blackpink.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Congress passes Trump's 'big, beautiful bill' cutting taxes and spending",
        "description": "The US president wins over sparring factions within his own party to get the bill passed after months of wrangling.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "The sale of illegal cigarettes signals a deeper problem with UK high streets",
        "description": "Some black market cigarettes have been found to contain dead flies and asbestos. But the trade nods to a wider issue, a BBC investigation has found.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Ryanair increases size limits for free cabin bags",
        "description": "The increase comes as the EU mandates a universal minimum size for free underseat bags.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Trump gets major win now - but it comes with risks down the road",
        "description": "The mega-bill helps the president deliver on promises, but also contains the seeds of political peril, writes Anthony Zurcher.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "What will Trump's tax and spending bill do to the US national debt?",
        "description": "US President Donald Trump's tax and spending bill has sparked intense debate. BBC Verify's policy and analysis correspondent Ben Chu has been looking at what the bill could do to the US national debt.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "What are the key items in Trump's sprawling budget bill?",
        "description": "The tax and spending bill, which is set to become law, includes sweeping changes to taxes, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-07-07T07:29:52.983999"
    },
    {
        "title": "Kun on Latest Single “Deadman” and His Next Chapter: “It’s Really Just the Beginning”",
        "description": "The Chinese singer-songwriter dropped into 88Rising’s Head in the Clouds festival last month to give fans a first listen to his “vintage” sounding new single.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Kelly Clarkson Postpones Opening Night of Las Vegas Residency Shortly Before Showtime",
        "description": "“I am devastated to have to postpone tonight and tomorrow’s opening at Caesars. The prep and rehearsals have taken a toll on my voice,” she wrote in a statement shared on Instagram Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Young Noble, Member of Tupac Shakur’s Outlawz Rap Group, Dies at 47",
        "description": "The rapper made his debut on Shakur’s posthumous album, ‘The Don Killuminati: The 7 Day Theory.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Trump Signs Republican Tax and Spending Cut Bill at White House July 4th Picnic",
        "description": "Against odds that at times seemed improbable, the president achieved his goal of celebrating a historic — and divisive — legislative victory in time for the nation's birthday, which also was his self-imposed deadline for Congress to send the legislation to his desk.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Caitlyn Jenner’s Manager Sophia Hutchins Dies at 29 (Reports)",
        "description": "The close friend of the former Olympian served as a Trump 2024 campaign surrogate and founded the sunscreen company Lumasol.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Top Dogs Again: Joey Chestnut and Miki Sudo Win 2025 Nathan’s Famous Hot Dog Eating Contest",
        "description": "Sudo captured her 11th title, defending her 2024 win, as Chestnut made a triumphant comeback after last year's ban.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "La Roux Wants You to Know That Beyond Singing, She Also Writes,  Produces and Performs Her Music",
        "description": "Elly Jackson, playing this year’s Karlovy Vary Film Festival opening concert, discusses her upcoming album, interest in creating a soundtrack, Tilda Swinton, sexism, ‘Bulletproof,’ and her development as an artist.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "J-Pop Trio Number_i Just Wants to Make Music They Love",
        "description": "The chart-topping Japanese act recently performed at 88Rising’s SoCal music festival, Head in the Clouds.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Derek A.E. Fuhrmann, Co-Writer of Phillip Phillips’ “Gone, Gone, Gone,” Dies at 44",
        "description": "The song peaked at No. 24 on the Billboard Hot 100 and appeared in films such as ‘The Amazing Spider-Man 2’ and ‘Grudge Match.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Oasis’ Liam Gallagher Apologizes for Using Racial Slur: “Sorry If I Offended Anyone”",
        "description": "“I do not discriminate,” the musician wrote in a follow-up X post on Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Can Diddy’s Career Survive His Verdict? What the Music Industry Is Saying",
        "description": "Offers one executive: “You’ve always had bad boys and bad behavior. It was glorified, it wasn’t punished. It’s built into the roots of the business.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    },
    {
        "title": "Tennis Star Taylor Fritz Is Eyeing His First Grand Slam — and He Really Hates to Lose",
        "description": "With Wimbledon underway, the U.S. sports star catches up with The Hollywood Reporter about life inside and outside of tennis: \"I always need to have something I'm working towards.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-07T07:29:53.999076"
    }
]