[
    {
        "title": "DNA-testing site 23andMe to lay off 40% of its workers",
        "description": "The once-popular general DNA-testing firm holds a trove of sensitive genetic data from its customers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Gold, prices, and jobs: What's at stake in Ghana's elections?",
        "description": "In an echo of the US, the current vice-president is up against an ex-president in the 7 December vote.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "India's luxury airline Vistara flies into the sunset",
        "description": "Vistara is operating its last flight on Monday as it completes its merger with Air India.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "'Upskilling helped us fix the staff shortage'",
        "description": "As employers face a skill shortage, some firms have turned to unusual tactics to get the right workforce.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Gold, prices, and jobs: What's at stake in Ghana's elections?",
        "description": "In an echo of the US, the current vice-president is up against an ex-president in the 7 December vote.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Airlines suspend Haiti flights after plane hit by gunfire",
        "description": "It is the second time in weeks an aircraft has come under fire over Port-au-Prince, as gang violence worsens.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Bitcoin tops record $80,000 as Trump nears sweep of US Congress",
        "description": "On the campaign trail the president-elect pledged to make America \"the crypto capital of the planet\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Mattel 'deeply regrets' porn site misprint on Wicked dolls",
        "description": "Recently-released dolls tied to the new Wicked movie inadvertently carry the address of an adult website.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Will Trump's victory spark a global trade war?",
        "description": "Trump has promised tariffs on all foreign goods. If he follows through, many smaller economies may be forced to respond in kind.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "'Trump's climate rollback to deter investors' - 11 Nov 2024",
        "description": "Expert says the US will lose opportunities if it steps back from climate commitments after Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Will new battery-powered trains replace diesel, and are they safe?",
        "description": "Manufacturers see lithium power as the future of rail travel in the UK - but the trains could pose unique challenges.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Why luxury cheese is being targeted by black market criminals",
        "description": "How cheese has become so valuable that it's being stolen to order.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "In Russia's shadow: The Baltics wait for Europe's strategic new railway",
        "description": "Building the link to western Europe has become more urgent as the Baltics see Russia as a threat.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Return of unpredictable US president puts UK defence spending top of agenda",
        "description": "Politicians say we're living in dangerous times, and Trump is a lot less willing than Biden to pay for Europe's defence.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "The UK home that's hosted royals, the likes of Michael Jackson - and a battle",
        "description": "England's Stapleford Park has an uncertain future - with liquidators appointed - but also a fascinating past.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Crypto expert with links to gang shot dead at Brazilian airport",
        "description": "Antônio Vinicius Gritzbach had recently agreed to hand over information about the Primeiro Comando da Capital group.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Too much debt or value for money? UK students divided over tuition fee rise",
        "description": "University fees are rising to £9,535, meaning students will be left in more debt after their course.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Trump tariffs could cost UK £22bn of exports",
        "description": "The UK could face a £22bn hit to its exports if Donald Trump carries out his tariff threats, researchers say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "China is trying to fix its economy - Trump could derail those plans",
        "description": "Trump won the election on a platform of steep import taxes, including tariffs as high as 60% on China.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "DNA firm holding highly sensitive data 'vanishes' without warning",
        "description": "Customers of Atlas Biomed are angry and worried about what's happened to the highly sensitive data they shared.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Nissan to lay off thousands of workers as sales drop",
        "description": "The Japanese car making giant has not yet said where in its global operations the job cuts will be made.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "US central bank boss says Trump can't fire him",
        "description": "The US central bank cuts interest rates, as its chairman vows to stay on the job.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Ultra-rich using jets like taxis, climate scientists warn",
        "description": "Researchers worked out the amount of planet-warming gas released by private jets over four years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Would Donald Trump’s tariffs hurt US consumers?",
        "description": "Trump claims more taxes on trade wouldn't be a cost to the US - almost all economists dispute this.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Harrods boss tells BBC he is 'dreadfully sorry' for Al Fayed abuse",
        "description": "It is the first time the managing director of the luxury store has personally apologised on camera.",
        "source": "BBC Business",
        "fetched_date": "2024-11-12T07:22:15.390999"
    },
    {
        "title": "Snoop Dogg and Wife Shante Broadus Receive Surprise Honor at Give Her FlowHERS Awards Gala",
        "description": "Jill Scott, Chloe and Halle Bailey, GloRilla, Doechii, Saweetie, Lady London and Nija were also recognized at Friday night's Femme it Forward ceremony in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "How Rapper Shyne Evolved From Diddy Protégé to the Belize Opposition Leader",
        "description": "The ex-Bad Boy Records artist sat with The Hollywood Reporter for an in-depth interview as Hulu releases 'The Honorable Shyne' to discuss the chapters of his life, forgiveness and divine intervention.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Nicole Scherzinger Responds to Criticism for Comment on Russell Brand’s “Make Jesus First Again” Post",
        "description": "\"I made a mistake of not realizing that they could be easily interpreted as being politically related and I apologize to anyone who understandably reached that conclusion,\" she wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Rapper Lil Durk Faces New Charges in Alleged Murder-for-Hire Case",
        "description": "The rapper could receive a maximum sentence of life in federal prison if convicted.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Grammy Nominations Facts: Female Acts Dominate, Ariana Grande and K-Pop Snubbed, Beyoncé Makes History (Again)",
        "description": "Fifteen things worth noting about the nods for the 2025 awards, including snubs, surprises and André 3000 scoring big with his flute album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Nicole Scherzinger Faces Backlash for Commenting on Russell Brand’s “Make Jesus First Again” Post",
        "description": "Scherzinger is currently starring in 'Sunset Blvd.' on Broadway and her comments were met with a wave of outrage from the theater community.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Grammys CEO on Beyoncé’s Country Sweep, Controversial Best New Artist Category and How Quincy Jones Influenced Him",
        "description": "Harvey Mason jr. on the 2025 nominations, the bold letter he sent to voters in July and who will win album of the year: \"I know somebody's going to be mad.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Grammy Nominations: Beyoncé Leads with 11; Kendrick Lamar, Charli XCX, Billie Eilish Earn 7 Each",
        "description": "Post Malone also earned seven nominations, while Taylor Swift, Sabrina Carpenter and Chappell Roan picked up six apiece.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "U.K. Government Forum to Scrutinize Future of TV Broadcasting Amid Streaming Concerns",
        "description": "A new government-commissioned report has found that by 2040, over 95 percent of households will be able to watch TV via the Internet, leaving 5 percent or 1.5 million people relying on traditional linear broadcasting.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Chappell Roan Opens Up About Her Mental Health, Love and Onstage Persona: “Chappell Is a Character”",
        "description": "The 26-year-old singer, speaking in conversation with her producer Daniel Nigro, also assured fans that the new country song she debuted on 'SNL' will be released: \"It'll come out, don't worry.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Rashida Jones Mourns Father Quincy Jones: “Your Love Lives Forever”",
        "description": "The record producer died last weekend at age 91.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Liam Payne Death Investigation: Two Arrested as Businessman and Friend Faces Abandonment Charge",
        "description": "Investigators are also tracking down one of the two women who were in the late One Direction singer's hotel room on the day that he fell from a third-floor balcony to his death in October.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-12T07:22:15.700093"
    },
    {
        "title": "Rumoured leak sends fans into meltdown",
        "description": "Eagle-eyed footy fans have lost their minds after a club’s reported new look logo was uploaded online before quickly being taken down.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "How much Raygun has made from her fame",
        "description": "Rachael “Raygun” Gunn has dropped sobering news about her personal life as a myth about her latest moves was busted.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Star’s snub as Hawks dominate AA squad",
        "description": "The reigning All-Australian captain was a shock omission from a 42-player squad stacked with players from the top four sides.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Ben Simmons blows NBA world away",
        "description": "Ben Simmons went on an assists rampage as he lead the Brooklyn Nets to a win in a masterclass display that left fans in disbelief.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Rumoured leak sends fans into meltdown",
        "description": "Eagle-eyed footy fans have lost their minds after a club’s reported new look logo was uploaded online before quickly being taken down.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Contentious ban puts Lions star in doubt for crunch final as 68-game streak on thin ice",
        "description": "Brisbane will challenge the suspension handed to midfielder Belle Dawes — one of the Lions’ best players — as she faces the prospect of missing her team’s preliminary final.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "‘What I get paid to do’: Kick-off change slammed",
        "description": "A proposed change to the NRL kick-off in 2025 has been slammed by an international star who was the victim of an ugly high shot in the finals.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Public plea as nation turns on NRL star",
        "description": "Kangaroos winger Xavier Coates has revealed the anguish he has felt after an ugly backlash where he was branded a “traitor”.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Extra incentive for ‘X’ to hit the spot",
        "description": "Xavier Bartlett is eager to bowl well on Thursday night when he’s set to play for Australia for the first time at his home ground, the Gabba.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Aussies not rushing to review World Cup loss",
        "description": "The disappointment of World Cup elimination is in the rearview mirror as the Aussie women’s team prepares for a bumper summer.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Journo dumped after ‘inappropriate’ comment",
        "description": "A Wimbledon champ has hit out at a leading tennis commentator after the reporter was suspended over a disparaging comment about her.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Star ‘loses mind’ with never before seen act",
        "description": "Daniil Medvedev’s opponent couldn’t stop laughing after the world No. 4 imploded in truly bizarre scenes at the ATP Tour Finals.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "‘Too easy’: Proof stars have hacked basketball",
        "description": "The NBA season is in full swing and there are already calls to change a 44-year rule as a wild trend spells trouble for Australia’s players.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "‘Complete bulls***’: F1 star blows up in rant",
        "description": "F1 driver and proud Kiwi Liam Lawson has teed off at McLaren’s choice of national anthem after race wins, calling it “bulls***”.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Mercedes blindsided by Hamilton’s switch",
        "description": "Mercedes boss Toto Wolff has made a huge call about Lewis Hamilton’s exit and the future of two of the sport’s biggest stars.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Shock as Raygun emerges from retirement",
        "description": "Olympic breakdancer Raygun has hit the stage with an Aussie popstar, performing just days after announcing she was retiring.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Fans blame twins for football’s ‘biggest curse’",
        "description": "College basketball twins Haley and Hanna Cavinder are well aware of the “curse” they supposedly inflict on their boyfriends.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "$80m star snaps, attacks own teammates",
        "description": "An NFL captain has attacked his own teammates in scenes that have shocked America, but one detail is dividing fans.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "US loses it at AFL legend’s son’s insane act",
        "description": "Mason Fletcher, the son of Essendon legend Dustin, turned heads in the States with a massive hit during a college football game.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "‘Very positive’: Hopes gun Socceroo will return",
        "description": "A Socceroos young gun is “confused” over his future, but a teammate hopes he will stick with Australia amid questions over his allegiance.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Premier League ref suspended over viral clip",
        "description": "A viral video of a Premier League referee using offensive language when talking about a major figure in the game has led to his suspension.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Crute’s shock reveal ahead of UFC comeback",
        "description": "It looked as though Jimmy Crute was retiring following his loss to Alonzo Menifield last year. 18 months on, he reveals the dramatic change in his life – and why he’s making a UFC comeback.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "American ‘super excited’ about Aussie trip",
        "description": "If American Harry Higgs needed any more convincing about playing golf in Australia, he got it from one of the world’s best players.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Caitlin Clark mania and Brondello’s plans for WNBA domination",
        "description": "Sandy Brondello could be forging her own path in the NBA, but the Mackay-born coaching maestro is content where she is: trying to give the WNBA the biggest spotlight she can.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Unwanted code-hopper set for French stint",
        "description": "No longer wanted by Queensland and the Wallabies, a code-hopper is expected to continue his rugby career in France.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Teammates all say same thing about star",
        "description": "Joseph-Aukuso Suaalii didn’t just star in his Wallabies debut, he did something the national team has needed for a long time and his teammates are buzzing about it.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Appeal date set for massive Golden Eagle sanctions",
        "description": "It will be another fortnight before both international riders will have their appeals heard for hefty Golden Eagle sanctions.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-12T07:22:18.259649"
    }
]