[
    {
        "title": "US hacker sentenced over Bitcoin heist worth billions",
        "description": "Ilya Lichtenstein laundered the stolen cryptocurrency with his wife Heather Morgan aka Razzlekhan.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "UK must rebuild post-Brexit relations with EU - Bank of England boss",
        "description": "Governor Andrew Bailey delivers his strongest comments yet on the UK's departure from the EU.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "The Onion buys Alex Jones's Infowars at auction",
        "description": "Infowars was auctioned as part of a defamation ruling after Jones falsely called the Sandy Hook School shooting a hoax.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Diamond necklace linked to Marie Antoinette sells for $4.8m",
        "description": "Experts say some of the stones in the piece are a match with the original diamonds central to a royal scandal.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "UK must rebuild post-Brexit relations with EU - Bank of England boss",
        "description": "Governor Andrew Bailey delivers his strongest comments yet on the UK's departure from the EU.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Europe's flying taxi dreams falter as cash runs short",
        "description": "Makers of a new generation of European electric aircraft are struggling to raise money.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Outage hits Bluesky just as the platform's popularity takes off",
        "description": "Bluesky has at times been the most downloaded app on the Apple Store in the days following the US election.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Al Fayed's brother Salah also abused us, women say",
        "description": "Three former employees give accounts of abuse, including sexual assault and trafficking.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Why Canada could become the next nuclear energy 'superpower'",
        "description": "With its rich resources, uranium mining companies want Canada to play a key role in fuelling nuclear reactors worldwide.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "As DNA-testing giant fights to survive, what went wrong?",
        "description": "Once used by millions of people to discover their family histories, 23andMe was recently almost delisted.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Lag effect makes inflation look higher, expert says - 14 Nov 2024",
        "description": "David Bahnsen, CIO at The Bahnsen Group, says that PPI figures are 'totally unhinged from reality'.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Meta fined €798m over 'unfair' Facebook Marketplace",
        "description": "The European Union says the tech giant crowded out rivals, breaching competition law.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "New York to become first US city to have congestion charge",
        "description": "New York's governor announced she would revive the programme, which faces opposition from Donald Trump.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Amazon launches Temu and Shein rival with 'crazy low' prices",
        "description": "The price of products on Haul, which is being trialled in the US, will be capped at $20.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Why is Kamala Harris still asking for campaign donations?",
        "description": "A week after losing the election, Kamala Harris's team are still appealing for funds.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "'I spend £30 a week on baby milk because I can't breastfeed'",
        "description": "Parents say they feel penalised by the high cost of formula in the UK, which cannot be discounted under the law.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Apple accused of trapping and ripping off 40m iCloud customers",
        "description": "A UK consumer group is seeking a £3bn payout for British users as a result of the legal action it is launching.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Will Elon Musk be able to cut $2 trillion from US government spending?",
        "description": "The Tesla CEO claimed he could slash US spending by eradicating “waste”.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Reeves in radical pension shake-up to boost growth",
        "description": "The chancellor wants to merge the UK's pension funds but critics worry about the impact on savers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Inflation progress stalls in US in October",
        "description": "Prices in the US rose 2.6% over the 12 months to October, driven by more expensive food and groceries.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "VW launches $5.8bn tie-up with Tesla rival Rivian",
        "description": "The firms will share EV technology as they face slowing sales growth and competition from Chinese rivals.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "The Guardian stops posting on Elon Musk's 'toxic' X",
        "description": "It has accused X of promoting \"disturbing content\", and says Mr Musk is using it to \"shape political discourse.\"",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Bali flights cancelled due to dangerous volcanic ash",
        "description": "Australian airlines say it is unsafe to fly after Mount Lewotobi Laki-laki spewed ash.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Why Tesla, crypto and prisons are Trump trade winners",
        "description": "As the dust settles on a post-election stock market rally, some firms have already gained.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "‘Adults buying kids' toys to escape global turmoil’",
        "description": "Retailers are increasingly targeting the \"kidult\" market as family finances are squeezed.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Shell wins landmark climate case against green groups in Dutch appeal",
        "description": "A court throws out a ruling that the gas and oil giant cut its greenhouse gas emissions.",
        "source": "BBC Business",
        "fetched_date": "2024-11-15T07:23:54.037080"
    },
    {
        "title": "Meet NCT’s Mark Lee, the Busiest Man in K-Pop",
        "description": "The Hollywood Reporter's newest \"Person of Interest\" is a hugely popular 25-year-old Canadian-born K-pop star who is finally starting to feel his age. \"I'm kind of old now,\" he laments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Elon Musk Rebuked by Italian President for Interfering in Domestic Affairs",
        "description": "After calling German Chancellor Scholz “a fool,” the mercurial billionaire buddy of President-elect Donald Trump is now angering the Italians.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Michael Strahan Addresses National Anthem Backlash",
        "description": "\"The only statement that should be made and that I want to make is that I love the military, I’ve always loved the military, and I will always love the military,\" he said in a social media post.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "If Presidents Were Chosen Like Oscars, You Might Not Be So Sad Right Now",
        "description": "Plus, has Madonna gone MAGA or has her inner circle been catfished? And why pianist Jon Batiste thinks Trump might be good for art.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "In Return to Washington, Donald Trump Meets With President Joe Biden in Oval Office",
        "description": "The president-elect's triumphant return to the White House on Wednesday began with a celebratory visit with House Republicans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Snoop Dogg Launches New Jewelry Line Called Lovechild (Exclusive)",
        "description": "The rap icon created the collection in collaboration with jewelry brand Metal Alchemist and gamma.: “I wanted to have a product I could share with the world that speaks to every element of who I am at this point in my life.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "‘Full House’ Star Dave Coulier Reveals He Has Stage 3 Non-Hodgkin Lymphoma",
        "description": "\"I went from, I got a little bit of a head cold to I have cancer,\" the actor and comedian says of his diagnosis, as he's trying to stay positive.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Charter Communications to Acquire John Malone’s Liberty Broadband in All-Stock Deal",
        "description": "\"I am grateful for Liberty Broadband's strategic partnership since 2013,\" says Charter CEO Chris Winfrey.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Social Listening Platform Hangout Launches With Universal, Sony, Warner Music Backing",
        "description": "With more than 100 million tracks, the service is \"inspired by queuing up the jukebox or putting on a favorite album with friends\" at a time when social media is \"based on division,\" says CEO Joseph Perla.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "The Guardian Will Stop Posting on “Toxic Media Platform” X",
        "description": "The London-based media group said it would stop posting to any of its official editorial accounts on the Elon Musk-owned social media platform.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Timothy West, Legendary British Stage, TV and Film Actor, Dies at 90",
        "description": "An actor in 'The Day of the Jackal,' 'Gentleman Jack,' EastEnders' and Shakespeare plays, he was the husband of Fawlty Towers star Prunella Scales.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "‘The Substance,’ ‘The Girl With the Needle,’ ‘Emilia Pérez’ Among European Film Awards Craft Winners",
        "description": "The awards ceremony will be held in Lucerne, Switzerland on Dec. 7.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-15T07:23:54.262719"
    },
    {
        "title": "Stunning demise of Test contender",
        "description": "A month ago there was a chance Cameron Bancroft could play for Australia again but after a disastrous start to the domestic season continued on Friday his Test chances could be done forever.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Kyrgios reveals Novak role in comeback",
        "description": "Nick Kyrgios has played one competitive tour match in two years but has confirmed the location for his Australian comeback en route to the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Icon saved, big shake-up coming to Formula 1",
        "description": "Formula One has made a call on the future of an iconic race amid a schedule crunch and talk of some popular races being taken off the calendar.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "‘Overwhelming’: World Cup hero’s brave call",
        "description": "Having become a national hero during the Matildas’ glorious World Cup run, Cortnee Vine has made a significant revelation about her life since that major moment.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "‘WTF’: New AFL jersey detail torn to shreds",
        "description": "AFL fans have had their say after a club unveiled its new logo and guernsey design, and the reviews are particularly harsh.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Star Eagle sidelined after training incident",
        "description": "West Coast’s pre-season has got off to the worst possible start, with its star man sidelined after a knock at Eagles training.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Man charged after NRLW ring stolen",
        "description": "A man has been charged after a NRLW star’s home was allegedly broken into and her premiership ring stolen.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is already in overdrive with a host of big names led by Ben Hunt and Josh Addo-Carr on the move. Keep up to date with all the player movement in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Stunning demise of Test contender",
        "description": "A month ago there was a chance Cameron Bancroft could play for Australia again but after a disastrous start to the domestic season continued on Friday his Test chances could be done forever.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "‘King is back’: Indian great’s Kohli warning",
        "description": "The critics are circling the Indian superstar after a recent run of outs, but there’s one factor that suggests Virat Kohli still looms as a man Australia has to stop.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Kyrgios reveals Novak role in comeback",
        "description": "Nick Kyrgios has played one competitive tour match in two years but has confirmed the location for his Australian comeback en route to the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Double blow for winless Demon",
        "description": "Alex de Minaur finished his maiden ATP finals winless and in pain as his lingering hip issue took a toll.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Aussie great: ‘I don’t care how good you are’",
        "description": "An Aussie cricket great believes David Warner’s obvious successor is “selling himself short”, amid a tough start to his international career.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "‘Too easy’: Proof stars have hacked basketball",
        "description": "The NBA season is in full swing and there are already calls to change a 44-year rule as a wild trend spells trouble for Australia’s players.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Icon saved, big shake-up coming to Formula 1",
        "description": "Formula One has made a call on the future of an iconic race amid a schedule crunch and talk of some popular races being taken off the calendar.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Last-minute call earns Murray surprise Adelaide debut",
        "description": "Cooper Murray has just a couple of days to get his head around a Supercars debut after a last minute call-up for Erebus to replace imminent new dad, Jack Le Brocq.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Shock as Raygun emerges from retirement",
        "description": "Olympic breakdancer Raygun has hit the stage with an Aussie popstar, performing just days after announcing she was retiring.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Fans blame twins for football’s ‘biggest curse’",
        "description": "College basketball twins Haley and Hanna Cavinder are well aware of the “curse” they supposedly inflict on their boyfriends.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "The sad state of the Cowboys and can KC go unbeaten?",
        "description": "Jerry Jones and the Dallas Cowboys lament a lost season, with the amazing stats showing why, and can the Chiefs go unbeaten the rest of the way?",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Viral NFL star sends Raygun a message",
        "description": "Days after going viral for his Raygun celebration, an NFL star has made some huge claims about the Olympic breakdancer.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "‘Overwhelming’: World Cup hero’s brave call",
        "description": "Having become a national hero during the Matildas’ glorious World Cup run, Cortnee Vine has made a significant revelation about her life since that major moment.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Reborn Socceroo open to overseas move",
        "description": "A Melbourne Victory star could consider an overseas move if suitors emerge following his impressive comeback to international football.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Outrageous Tyson moment everybody missed",
        "description": "Mike Tyson’s slap on Jake Paul got all the headlines after the duo’s weigh in, but the former world champ also asserted his dominance in another way.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Aussie rookie matches world No.1",
        "description": "He went to the same college as Tiger Woods and now a rising Aussie star has secured the same award won by the current world No.1.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Bullets fly: SuperCoach NBL experts reveal round 9 trades",
        "description": "The Brisbane Bullets are suddenly the hottest team in SuperCoach NBL – and one player is on the radar for most of our experts. See their full moves here.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Cash-strapped rugby’s pursuit of NRL stars is ‘ludicrous’",
        "description": "Rugby Australia has been linked with premier NRL talent like Nathan Cleary and Payne Haas, but there’s only one way the cash-strapped code can deliver on any poaching mission.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Rugby boss drops Cleary defection bombshell",
        "description": "Nathan Cleary remains the biggest name in the NRL, but a former Rugby Australia boss has detailed a potential bombshell code switch.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "‘Total forgive run’: Miller’s push for Placid Ark roughie",
        "description": "Champion Perth trainer says a blowout result from one of his three gallopers can’t be ruled out in Saturday’s Listed Placid Ark Stakes at Ascot.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-15T07:23:55.948886"
    }
]