[
    {
        "title": "McDonald's Quarter Pounder back  after E. coli outbreak",
        "description": "The fast food giant said beef patty samples had tested negative for the bacteria.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Tariffs hurt his business. He's voting for Trump anyway",
        "description": "Donald Trump's call for sweeping tariffs is resonating, as protectionism gains steam in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "The couple who took on Google and cost the tech giant £2bn",
        "description": "Shivaun Raff and her husband, Adam, describe their long court battle with technology giant Google.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "The hybrid workers seeking fulfilment in French fields",
        "description": "These part-time farmers say they want the best of both worlds, splitting life between Paris and the country.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "'I can't run a business like this': Why the WordPress row matters",
        "description": "WordPress's tools are used by 40% of the world's websites, making this a spat with big consequences.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Tariffs hurt his business. He's voting for Trump anyway",
        "description": "Donald Trump's call for sweeping tariffs is resonating, as protectionism gains steam in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Mexican economy a mixed bag for new president",
        "description": "Claudia Sheinbaum inherits a buoyant manufacturing sector, but also a troubled state-owned oil firm.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "How my investigation led to sex trafficking charges against ex-Abercrombie boss",
        "description": "Rianna Croxford digs into a cryptic Instagram comment, unravelling allegations of abuse - and now the multi-millionaire is in court.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "'My £250 Child Trust Fund is now worth only £12'",
        "description": "Max Prince was shocked to discover that surprise fees had left him with just £12.39 in his trust fund.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "The couple who took on Google and cost the tech giant £2bn",
        "description": "Shivaun Raff and her husband, Adam, describe their long court battle with technology giant Google.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "US markets open up after Tesla stock boom — 25 Oct 2024",
        "description": "Expert says the firm's stronger than expected profits give optimism to the markets.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "'It's rough out here': Why Trump and Harris should listen to this mum of seven",
        "description": "Inflation and high prices are primary concerns for Sin City's voters ahead of the 5 November vote.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Trump has the world’s richest man on his side. What does Musk want?",
        "description": "The SpaceX boss says only his fellow billionaire can save democracy - but some question Musk's motives.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "How the best railway station in UK earned its title",
        "description": "Staff in Maghull are basking in the afterglow of victory in the 2024 World Cup of Stations.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Mining giants sign $30bn settlement for 2015 Brazil dam collapse",
        "description": "The dam collapse released toxic waste and mud, which flooded nearby towns, rivers and forests.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Cubans endure days without power as energy crisis hits hard",
        "description": "People cook with firewood after days of blackouts and supply issues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Ex-Abercrombie CEO pleads not guilty to sex trafficking charges",
        "description": "Mike Jeffries and his partner are accused of using fraud and force to sexually abuse young men.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Microsoft boss gets 63% pay rise despite asking for reduction",
        "description": "Satya Nadella asked for a reduction because of cyber attacks the firm suffered - but still saw his earnings increase massively.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Action demanded over surge in illegal meat imports into UK",
        "description": "The government is warned of a \"foot-and-mouth\" level crisis over potentially diseased meat flooding into the UK.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "What we know about the McDonald's E. coli outbreak",
        "description": "Health officials say the number of people infected after eating McDonald's Quarter Pounders has risen to 75 across 13 states.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "India's balancing act with the West as Brics flexes new muscles",
        "description": "Brics enables India to work with some of its closest friends and espouses principles close to Delhi's heart.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "US gets $100m settlement for Baltimore bridge collapse",
        "description": "The US justice department sued the owners of the Dali container ship after it crashed into a bridge in Baltimore in March.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Twice homeless millionaire tops UK black power list",
        "description": "The now multimillionaire began his career in a call centre after failing to become a professional footballer.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Would Harris's price gouging plan really help US consumers?",
        "description": "The Democrat has proposed a federal ban in certain circumstances - economists are divided on whether it would work.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "The software extending the life of your phone",
        "description": "Greener software could make devices last longer and use less electricity.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "UK chancellor to change debt rules to release billions",
        "description": "Reeves has said the government will change these rules to free up billions for spending on big projects.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "The water industry is in crisis. Can it be fixed?",
        "description": "Simon Jack asks what reform of the troubled sector could mean for customers and their bills.",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "What form could reparations for slavery take in the UK?",
        "description": "How likely is the UK to provide reparations for the slave trade, and what could that look like?",
        "source": "BBC Business",
        "fetched_date": "2024-10-28T07:23:59.830940"
    },
    {
        "title": "Dodgers Star Shohei Ohtani Injures Shoulder During World Series Win",
        "description": "The baseball superstar was helped off the field after a failed attempt to steal second base against the New York Yankees.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Liz Cheney Cancels Washington Post Subscription After Outlet Won’t Endorse Presidential Candidate",
        "description": "\"First of all, it's fear,\" said Cheney of the Jeff Bezos-owned publication's decision to not endorse Kamala Harris or Donald Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Lee Greenwood, Tony Hinchcliffe Set to Perform at Donald Trump MSG Rally",
        "description": "Elon Musk, Tucker Carlson, Dana White, Robert F. Kennedy Jr. and Rudy Giuliani will speak at the Sunday event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Donald Trump Guests on ‘The Joe Rogan Experience,’ Again Falsely Claims 2020 Election Was “Stolen”",
        "description": "The former president and threepeat GOP candidate criticized the host after he had kind words for independent candidate Robert Kennedy Jr. back in August.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Bob Woodward, Carl Bernstein Say Washington Post Decision to Not Endorse Presidential Candidate Is “Disappointing”",
        "description": "Their joint statement comes following the publication reverting back to an old policy in which the editorial team did not endorse anyone for president.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "“Dear Remy”: Hollywood Career Coach on Life with a Practical YouTube Jokester and Cancelling Yourself",
        "description": "This week, Remy Blumenfeld, our resident expert on everything, helps the wife of a soap opera actor-turned-social media prankster, a squeamish biopic director and a fame-wary superstar who's thinking of turning himself into a pariah.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Kerry Washington, Annette Bening and Kate Winslet Among Women Celebrated at WIF Honors",
        "description": "Michelle Buteau, Joey King, Ellen Kuras and Danielle Sanchez-Witzel were among the night's other honorees.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Hollywood’s Highest-Profile Harris Endorsements: Taylor Swift, George Clooney, Bruce Springsteen and More",
        "description": "Celebrities have expressed their support for the Democratic ticket this November. Here's 11 of the biggest names.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Beyoncé Endorses Kamala Harris Alongside Kelly Rowland at Houston Rally: “We Must Vote”",
        "description": "The appearance ends months of speculation about whether the singer would publicly endorse the Democratic party’s presidential nominee.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "DJ Clark Kent, Hip-Hop Record Producer, Dies at 58",
        "description": "The record producer will soon be the subject of a documentary, 'God’s Favorite DJ: The Story of DJ Clark Kent.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Ted Cruz Gets the Patrick Bateman Treatment in ‘American Psycho’-Themed Attack Ad",
        "description": "The environmental PAC NRDC Action Votes created the Easter egg-filled spot, which sees the senator standing in for the would-be serial killer from the 2000 cult classic film.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Grammy-Winning Rapper Lil Durk Charged With Orchestrating 2022 Los Angeles Killing",
        "description": "Durk was arrested Thursday night in South Florida as he attempted to flee the country.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-28T07:24:00.956356"
    },
    {
        "title": "Simmons under fire for latest fragile act",
        "description": "Battling Aussie Ben Simmons is under a blowtorch once more, accused of playing scared in his latest NBA act against Milwaukee.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "NRLW player admits to supplying cocaine",
        "description": "An NRLW player who travelled to Fiji to compete has had her trip unexpectedly extended after she was refused re-entry into Australia while facing charges of drug supply.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘Been a lot’: Teenage phenom drawing rave reviews",
        "description": "She’s one game into her WBBL career, but 15-year-old Caoimhe Bray is already fielding questions about her future as she mirrors a sporting great.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "NBA erupts: ‘How did this get approved?’",
        "description": "NBA fans couldn’t believe their eyes when Miami Heat legend Dwyane Wade’s statue was unveiled, sparking widespread disbelief.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘Lack of trust’: Reason for Bulldog’s exit revealed",
        "description": "Caleb Daniel was one of two All-Australians who battled for game time at the Western Bulldogs in 2024 and he’s revealed where it all went sideways.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Aussie star unrecognisable as AFL champ",
        "description": "A beloved Aussie has kicked off Halloween by dressing up as popular AFL star Bailey Smith.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Ex-NRL prodigy lashed for ‘foolish’ cop tussle",
        "description": "A troubled former NRL prodigy has received a biting critique from a magistrate after he ran from police in a failed escape attempt that ended in a bloody tussle.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "NRLW player admits to supplying cocaine",
        "description": "An NRLW player who travelled to Fiji to compete has had her trip unexpectedly extended after she was refused re-entry into Australia while facing charges of drug supply.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘Been a lot’: Teenage phenom drawing rave reviews",
        "description": "She’s one game into her WBBL career, but 15-year-old Caoimhe Bray is already fielding questions about her future as she mirrors a sporting great.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Selection boss responds to shock Warner offer",
        "description": "George Bailey has responded to David Warner’s offer to come out of retirement and shut down one idea for his Test opening replacement.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Tennis bad boy nearing shock Aus return",
        "description": "He’s been forgotten and virtually disowned in Australian tennis circles, but Bernard Tomic has quietly been improving his ranking.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Tennis stars hit out: ‘Stop ruining the sport’",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Brutal remark is a nail in F1 star’s coffin",
        "description": "Sergio Perez’s Formula 1 career appears over following a disastrous Mexico GP and comments from his Red Bull team.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Feeney all-but concedes title fight to Brown as Kostecki wins GC500",
        "description": "Will Brown is on the cusp of sealing a maiden Supercars championship after exorcising his Surfers Paradise demons to take second behind Brodie Kostecki at the Gold Coast 500 on Sunday.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Brutal sledge as Raygun shows off new look",
        "description": "Raygun has opened up about the emotional toll the Olympic breakdancing saga took on here, and one thing her critics need to get over.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘Went crazy’: Aussie golden girl’s sad reveal",
        "description": "Aussie swimming star Ariarne Titmus has opened up on a major health scare, revealing she would give up her Olympic medals for one thing.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Simmons under fire for latest fragile act",
        "description": "Battling Aussie Ben Simmons is under a blowtorch once more, accused of playing scared in his latest NBA act against Milwaukee.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Simmons sledge sparks NBA confrontation",
        "description": "Ben Simmons Brooklyn Nets teammates have come to the Aussies’ defence after a cowardly heckler sledged the NBA veteran.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘Killed us’: Furious fans turn on Postecoglou",
        "description": "The pressure is ramping up on Ange Postecoglou after Tottenham suffered a loss and the prickly Aussie’s tactics came under fire.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘Difficult’: Matildas admit to Fowler problem",
        "description": "In the continued absence of Sam Kerr, the spotlight is on Mary Fowler every time she steps out for the Matildas.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "‘OMG’: Aussie UFC star has jaw shattered",
        "description": "GRAPHIC WARNING: A gruesome photo has emerged showing just how badly Australia’s Rob Whittaker was mutilated in his UFC loss.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Rankin on track for Webex Players Series triumph",
        "description": "A new grip and putter has helped to turn Brett Rankin’s career around, with the new father on the path for a drought-breaking victory at the Webex Players Series in South Australia.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Simmons under fire for latest fragile act",
        "description": "Battling Aussie Ben Simmons is under a blowtorch once more, accused of playing scared in his latest NBA act against Milwaukee.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Bledisloe drought breaker even tougher",
        "description": "The Wallabies haven’t won the Bledisloe Cup since 2002 and the schedule for the 2025 showdown is a tough one.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "NRL convert in shock Wallabies call",
        "description": "His last game was in an NRL final and now Joseph-Aukuso Suaalii is set to play his next match as a Wallaby in the UK after a rapid elevation and confirmation he’s not going to England just for a ride.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Via Sistina remains in Melbourne Cup mix after third acceptances",
        "description": "Outstanding Cox Plate winner Via Sistina is one of 35 hopefuls remaining in the Melbourne Cup after Monday’s third acceptances for next Tuesday’s showpiece event.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    },
    {
        "title": "Second tragedy hits Olympian icon after reveal",
        "description": "After dropping heartbreaking news about his terminal diagnosis, Sir Chris Hoy has gone public with his family’s second secret tragedy.",
        "source": "News AU",
        "fetched_date": "2024-10-28T07:24:02.178974"
    }
]