[
    {
        "title": "Tesla battery maker sees shares jump on Hong Kong debut",
        "description": "China's CATL makes more than a third of electric vehicle batteries sold worldwide and also supplies VW and Toyota.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Sesame Street heads to Netflix after Trump pulled funding",
        "description": "The platform will offer a new season and 90 hours of previous episodes to its 300 million subscribers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Who are the winners and losers from the UK-EU agreement?",
        "description": "A deal between the UK and European Union (EU) has been agreed at a post-Brexit leaders summit in London.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Why we need 'revolutionary' cooling tech",
        "description": "Cooling systems that avoid the use of polluting refrigerants are being launched.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Sesame Street heads to Netflix after Trump pulled funding",
        "description": "The platform will offer a new season and 90 hours of previous episodes to its 300 million subscribers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "US debt downgrade drives up borrowing costs",
        "description": "Borrowing costs for long-term US government debt jumped past 5% for the first time in 18 months, before retreating.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "UK now best placed country on trade - Chancellor",
        "description": "UK chancellor Rachel Reeves tells the BBC the latest trade agreements with the EU, US and India will boost economic growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "UK-EU deal moves us on from Brexit rows, Starmer says",
        "description": "The deal covers defence, trade, fishing, and a possible youth scheme, in the first big reset since Brexit.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "The world's most dangerous country for trade unionists",
        "description": "More trade union members are murdered in the South American nation than anywhere else.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Week in Markets - 16 May 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Expert: Tax cuts are distraction from tariffs - 19 May 2025",
        "description": "John Mowrey says its remains to be seen if the US can afford President Trump’s tax cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "The camera tech propelling shows like Adolescence",
        "description": "Whole TV shows shot in one long take are made possible by new lightweight cameras.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Struggling DNA testing firm 23andMe to be bought for $256m",
        "description": "It said new buyers Regeneron had committed to protect user data as part of the deal.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Five unanswered questions in UK-EU deal",
        "description": "A youth visa scheme and how much the UK will contribute financially are among issues still being negotiated",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Brussels hails UK deal as 'new chapter' - but much is yet to be written",
        "description": "The two sides have struck a new post-Brexit deal but this so-called 'reset' of the relationship is just the beginning.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "The secretive US factory that lays bare the contradiction in Trump's America First plan",
        "description": "An exclusive look inside the closely guarded factory the president wants to become a foundation stone for a US golden age.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "The new UK-EU deal at a glance",
        "description": "A new agreement setting out post-Brexit relations on areas including fishing rights, trade and defence has been reached.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Starmer banks on public being over Brexit",
        "description": "For the UK-EU deal to succeed the PM needs it to seem as insignificant and uncontroversial as possible.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "UK driverless cars coming in 2027 - but Uber says it's ready now",
        "description": "The previous government had said autonomous vehicles were \"set to be on the road\" by 2026.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "New buy now, pay later rules aim to protect shoppers",
        "description": "Lenders will have to carry out affordability checks and shoppers will have faster access to refunds under the plans.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Defence deals and palace invites: UK and EU haggle before first summit since Brexit",
        "description": "Defence deals, fishing rights and closer economic ties among the talking points at Downing Street.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "What one of America's most lively sporting events says about the economy",
        "description": "The Preakness horse race is also famous for its party atmosphere - so what was the mood at a time of tariffs and market turmoil?",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Ros Atkins on... Trump's deals in the Gulf",
        "description": "The BBC's Analysis Editor Ros Atkins examines President Trump's trip to the Gulf.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "US loses last perfect credit rating amid rising debt",
        "description": "Moody's said successive US administrations had failed to reverse ballooning deficits and interest costs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Why youth mobility and fishing are key issues ahead of UK-EU summit",
        "description": "Youth mobility and fishing rights are key negotiating points between the UK and the EU as PM Keir Starmer attempts a post-Brexit \"reset\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Five House Republicans stall Trump's 'big, beautiful' tax bill",
        "description": "Lawmakers from the president's own party  joined all Democrats to reject a key domestic bill, demanding deeper budget cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Four obstacles for Republican rebels in Trump's tax bill",
        "description": "Government-funded welfare programmes have become a major point of contention in Trump's tax bill.",
        "source": "BBC Business",
        "fetched_date": "2025-05-20T07:27:34.671076"
    },
    {
        "title": "Cyndi Lauper on if She’d Want Chappell Roan to Induct Her at Rock Hall of Fame: “She’s Really Great”",
        "description": "\"I wore a very long red wig when I did the Berlin Wall ... I was laughing because I saw [Roan] on the horse with the long red wig. I was like, 'That's really good,'\" Lauper said in an upcoming interview on SiriusXM's 'Fierce: Women in Music.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "DePaul University Hosts Chicago’s First AI-Centric Conference",
        "description": "The School of Cinematic Arts welcomed a group of experts to address the current use and teaching of the technology.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Son of Longtime ‘Letterman’ Producer Charged With Attempted Murder",
        "description": "Arlo Willner, the child of late 'SNL' music sketch producer Hal Willner and Emmy-winning late night producer Sheila Rogers, was arrested after allegedly stabbing three men outside of a bar in Manhattan.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Brody Jenner Signs With UTA for Music and Touring (Exclusive)",
        "description": "The reality television personality and DJ has also announced an artist project, BROSA, “a tech/house venture that showcases his passion for dance music.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Backstreet Boys’ Howie Dorough Talks Handbag Line, Hotel Opening and the One Epic Move Fans Are Dying to See at “Movie-Like” Las Vegas Residency",
        "description": "“The show is based around [the] Millennium [tour], so we're definitely going to bring people back in time, and if they didn't see that show in the past, it’s a chance to see a creation of it, Sphere-style,\" he says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Trump Calls for “Major Investigation” Into Springsteen, Beyoncé Appearances at Kamala Harris Rallies",
        "description": "Trump's call comes amid his feud with Springsteen as the president appeared to threaten the rock star for calling the the administration \"corrupt, incompetent, and treasonous\" during recent U.K. concerts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "The Hollywood Reporter Names Heidi Linnebach VP Entertainment and Awards Strategy",
        "description": "In this newly created role, Linnebach will oversee the brand’s entertainment sales and awards strategy, including the continued development of its specials and features business.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Singer Dawn Richard Says Sean “Diddy” Combs Threatened Her With Death After She Saw Him Assault Cassie",
        "description": "During her testimony on Monday, Richard said Combs told her and another woman who saw the attack that “we could go missing” if either revealed what they saw.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Joe Biden Diagnosed With “Aggressive Form” of Prostate Cancer",
        "description": "His office said the cancer cells have spread to the bone.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "The Who Parts Ways With Drummer Zak Starkey (Again)",
        "description": "\"I was fired two weeks after reinstatement and asked to make a statement saying I had quit the who to pursue my other musical endeavors,\" Starkey wrote on Instagram, but that \"this would be a lie.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "Victoria Justice Says She Got Death Threats for “We All Sing” Ariana Grande Meme: “I Got All This Hate”",
        "description": "The actress said the video clip, which resurfaced in 2017 and went viral, was misinterpreted.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "The Weeknd Credits Tom Cruise’s “Can’t Feel My Face” Lip Sync for Helping With Early Career Success",
        "description": "The song became the singer's first No. 1 hit on the Billboard Hot 100 chart.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-20T07:27:35.238037"
    },
    {
        "title": "NRL clubs scrambling to cover Origin stars",
        "description": "NRL clubs are scrambling to cover the absence of their State of Origin stars this weekend, as a forgotten Rooster earns a recall.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘Breakdown’ behind AFL coaches’ pub meeting",
        "description": "Coaches have spilled the beans on a high powered meeting with AFL bosses amid growing concerns around the game’s senios leadership.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘Unbearable’: AFL rocked by six suicides",
        "description": "As the AFL reels from the death of Adam Selwood, months after his brother took his own life, a Swans legend has lifted the lid on the game’s “suicide crisis”.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Star Eagle’s future in concussion panel’s hands",
        "description": "The future of a star West Coast Eagle is in the AFL Concussion Panel’s hands after he failed to advance through the mandatory concussion protocols.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "NRL clubs scrambling to cover Origin stars",
        "description": "NRL clubs are scrambling to cover the absence of their State of Origin stars this weekend, as a forgotten Rooster earns a recall.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Toia tipped to quell Latrell on Origin debut",
        "description": "Roosters players have been following Robert Toia for a lot longer than his 10 NRL matches, and it’s why they’ve backed the Maroons rookie to handle his shock debut.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘Breakdown’ behind AFL coaches’ pub meeting",
        "description": "Coaches have spilled the beans on a high powered meeting with AFL bosses amid growing concerns around the game’s senios leadership.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘Unbearable’: AFL rocked by six suicides",
        "description": "As the AFL reels from the death of Adam Selwood, months after his brother took his own life, a Swans legend has lifted the lid on the game’s “suicide crisis”.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘World class’: Stars’ big announcement",
        "description": "The Melbourne Stars have moved quickly to make a key appointment ahead of the upcoming Big Bash League summer.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Khawaja stays at Bulls despite feud",
        "description": "Despite his anger with Queensland’s head of elite cricket Joe Dawes, Test star Usman Khawaja is staying with the Bulls for another season.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Jelena Dokic drops huge baby news",
        "description": "Tennis star Jelena Dokic, who survived horrific abuse at her father’s hands, has spoken about her own plans to start a family.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘Call Roger’: Djoker’s shock coaching move",
        "description": "Just weeks out from the French Open and Wimbledon, Novak Djokovic has announced a shock moving in his coaching ranks.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Nation turns on Aussie family, lie goes too far",
        "description": "The Formula 1 world has been left devastated for Aussie driver Jack Doohan with disgusting messages causing outrage.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "‘Stop harassing my family’: Doohan slams fake social media post",
        "description": "Axed Australian Formula One star Jack Doohan has publicly pleaded with fans to stop ‘harassing’ his family after fake social media post went viral.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Combined Aussie-Kiwi team coach named",
        "description": "The next coach of the Wallabies will lead a combined Australia-New Zealand outfit against the British and Irish Lions in July.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "American facing huge ban for stomping Aussie",
        "description": "An American rugby sevens star is facing a mammoth ban for brutally stomping on the head of an Australian player in an act of “thuggery” on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Baseball world rocked by Aussie icon’s death",
        "description": "A massive ‘outpouring of shock and loss’ has swept through the Australian sporting world after the unexpected death of an Aussie Olympian.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Controversial icon confirms BBC exit after antisemitism row",
        "description": "One of the golden boys of English football, Gary Lineker, has confirmed his days at the BBC are coming to an end after a controversial social media post.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Huge twist in race for football’s biggest prize",
        "description": "FIFA’s Club World Cup has a new home in Australia, and the tournament could have a big bearing on who wins football’s highest honour.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Aussie champ rejects legend in brutal clip",
        "description": "Former Aussie world champion Skye Nicolson has given a boxing legend a lesson with a six-word comment too brutal in the eyes of some.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Scheffler outlasts Rahm to claim third major at PGA Championship",
        "description": "World number one Scottie Scheffler has captured his third major title, seeing off Spain’s Jon Rahm down the back nine in the final round to win the PGA Championship.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Warwick Farm preview: Title fire still burns bright for Roper",
        "description": "Following a delayed start to the season, apprentice Anna Roper is making the most of her opportunities and is looking to hit the target with a strong book of rides at Warwick Farm.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    },
    {
        "title": "Olympian’s apology will break your heart",
        "description": "Rohan Dennis’s heartwrenching apology letter to his late wife has emerged after the Olympic cyclist was sentenced for his role in her death.",
        "source": "News AU",
        "fetched_date": "2025-05-20T07:27:36.153482"
    }
]