[
    {
        "title": "Splurge or save? Americans struggle as tariffs hit economy",
        "description": "Families in the US are trying to dodge higher prices from tariffs, as worries rise about the economy.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Google agrees to pay $28m in racial bias lawsuit",
        "description": "The tech giant confirmed it had \"reached a resolution\" but rejected the allegations made against it.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "US steel customers spooked by tariffs, Tata says",
        "description": "Tata boss Rajesh Nair says US customers are looking for other suppliers as 25% tariffs take effect.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Chinese state media hails Trump's cuts to Voice of America",
        "description": "State newspaper gloated that the network has \"now been discarded by its own government like a dirty rag\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Google agrees to pay $28m in racial bias lawsuit",
        "description": "The tech giant confirmed it had \"reached a resolution\" but rejected the allegations made against it.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Migrant carers from India's Kerala await justice in UK visa 'scams'",
        "description": "The care workers, who paid thousands of pounds for UK visas, are in deep debt and without work.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Why is China spending billions to get people to open their wallets?",
        "description": "Beijing hopes better wages and discounts can encourage spending and stave off greater economic trouble.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Germany votes for historic boost to defence spending",
        "description": "The move alters the German constitution, allowing the country to increase its military spending.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Why does Japan have a reserve of rice?",
        "description": "What is a \"strategic reserve\" and why does Japan have one for rice?",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "'I'm a little angry': Canadian firms boycott US products",
        "description": "Canadian firms say there is a need for more homegrown production after tariffs imposed by the US sparked a trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Kendall promises to fix 'broken' UK benefits system",
        "description": "Measures include restricting eligibility for disability payments and cutting benefits for health conditions.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Gang guilty over £4.8m gold toilet heist",
        "description": "Five thieves were seen on CCTV stealing the fully-functional toilet from Blenheim Palace in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "India's Modi joins Trump-owned platform Truth Social",
        "description": "The Indian prime minister is one of the few world leaders on Trump's social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Irish-US exports continue to surge ahead of expected tariffs",
        "description": "President Donald Trump has vowed to impose a sweeping range of tariffs on Irish goods on 2 April.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Czechs appeal for EU help with Radio Free Europe after Trump cuts",
        "description": "The US president signed an executive order on Friday to stop funding the American global broadcaster, following criticism from Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "The Matrix film producer files for bankruptcy",
        "description": "Village Roadshow blames its troubles on a fall-out with Warner Bros and a failed move into independent film production.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Yoga mats and VR headsets used to measure UK inflation",
        "description": "Items added and removed from the basket of goods used to calculate inflation give an insight into current fashions.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Trade turmoil forecast to slash growth in Canada and Mexico",
        "description": "Trump's tariffs will hit its biggest steel trading partners' economies the most, the OECD predicts.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Jonathan Anderson steps down as creative director of Loewe",
        "description": "Jonathan Anderson thanks Loewe as he departs the Spanish luxury fashion house after 11 years.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "King meets Carney in symbolic support for Canada",
        "description": "The King, who is also head of state of Canada, meets the country's new prime minister Mark Carney amid a trade war with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Forever 21 operator files for bankruptcy in the US",
        "description": "US stores will remain open as Forever 21's operating company \"begins its process of \"winding down\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Small electric cars were said to be the future – but SUVs now rule the road",
        "description": "Despite dire predictions of climate breakdown, more Sports Utility Vehicles are being spotted on, and off, the roads.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Trump moves to close down Voice of America",
        "description": "More than 1,300 staff placed on administrative leave as White House accuses VOA of being anti-Trump, \"radical\" and \"leftist\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "US government shutdown averted as Senate passes spending bill",
        "description": "The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "Clothes brand gets 100 complaints a day that models are 'too fat'",
        "description": "Snag clothing is cited in an online debate over whether adverts showing models who appear \"unhealthily fat\" should be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-03-19T07:25:30.987716"
    },
    {
        "title": "100M In the U.S. Are Now Paying For Music Streaming Subscriptions",
        "description": "The RIAA revealed the new figure in its latest year-end report, while also reporting that revenue growth slowed to 3 percent.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Olivia Rodrigo, Sabrina Carpenter, Tyler, the Creator to Headline Lollapalooza",
        "description": "Twice, Luke Combs, A$AP Rocky, Korn, Rüfüs du Sol, Gracie Abrams and Doechii are also on the headlining bill.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Tracy Morgan Updates Fans From Hospital That He Had Food Poisoning After MSG Incident",
        "description": "The comic actor is in good condition after vomiting at a Knicks game on Monday night then being taken out in a wheelchair.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Tantoo Cardinal to Receive Hollywood Reporter Women in Entertainment Canada Honor",
        "description": "The ‘Killers of the Flower Moon’ actress will be honored with the Equity in Entertainment Award at the second annual event in Toronto on May 29.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Banijay U.K. Inks Development Deal With ‘The Dig’ Producer, Acquires Rights to ‘Excellent Women’",
        "description": "Ellie Wood of Clearwood Films is also the producer behind ITV's 'Stonehouse.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Tracy Morgan Leaves New York Knicks Game in a Wheelchair After Appearing to Vomit While Sitting Courtside",
        "description": "Videos and photos posted online show the actor becoming physically ill during Monday night's basketball game at Madison Square Garden.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "iHeartRadio Music Awards Winners: Billie Eilish and Finneas Take Album of the Year",
        "description": "Taylor Swift, Benson Boone, SZA, GloRilla, Sabrina Carpenter and Green Day also were among the winners during Monday night's show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Semisonic Blasts White House Deportation Video Featuring “Closing Time”: “They Have Missed the Point Entirely”",
        "description": "Asked about the post Monday, press secretary Karoline Leavitt said \"our entire government clearly is leaning into the message of this president.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Jesse Colin Young, Youngbloods’ Frontman and “Get Together” Singer, Dies at 83",
        "description": "His biggest hit called for everyone to “smile on your brother” and “try to love one another right now.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "James Taylor Songs Set to Take Stage In New Musical",
        "description": "'Fire & Rain' will feature an original story written by Tracy Letts and direction by David Cromer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Ex-CNN Anchor Don Lemon Reveals He Was Sexually Harassed by Women While at Network",
        "description": "While appearing on Bill Maher’s podcast this weekend, the veteran broadcaster shared a dark piece of his past as he explained his thoughts on gender and power dynamics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "Lady Gaga Unleashes ‘Mayhem’ On Albums Chart With No. 1 Debut",
        "description": "The seventh such feat for Gaga comes as Kendrick Lamar and SZA's \"Luther\" spent a fourth week atop the Hot 100.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-19T07:25:31.739158"
    },
    {
        "title": "‘What a career’: Former Test quick ends with a bang",
        "description": "After nearly 20 years, Peter Siddle still had the ball in hand as his career neared a close and he ended it in perfect style.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘Unplayable’ Arzani tipped to shine for ‘Roos",
        "description": "Performances at Socceroos training this week suggest that Daniel Arzani has responded to the scathing criticism he received from national coach Tony Popovic.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘Hush-hush’ meeting to lure NRL club legend",
        "description": "The Roosters have a war cheat at their disposal and have reportedly put Manly veteran Daly Cherry-Evans at the top of their wish list.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Incredible scenes as legend bids farewell",
        "description": "Australian cricket great Peter Siddle has signed off his career in perfect style after proving he still had what it takes to the final ball.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘Hush-hush’ meeting to lure NRL club legend",
        "description": "The Roosters have a war cheat at their disposal and have reportedly put Manly veteran Daly Cherry-Evans at the top of their wish list.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "NRL star’s bombshell defection to rival",
        "description": "Sydney Roosters star Brandon Smith has put pen to paper on a bombshell new deal that will see him join a bitter NRL rival.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "AFL Now: Geelong stars officially commit to the Cattery",
        "description": "The mix of old and new will roll on at the Cattery, with three of Geelong’s finest putting pen to paper to commit their futures to the Cats. TODAY’S FOOTY NEWS LIVE",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Pies plan for Darcy-sized ‘headache’",
        "description": "Western Bulldogs star Sam Darcy has been high on Collingwood’s list of priorities after he produced a coming-of-age performance against the Magpies last season.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘What a career’: Former Test quick ends with a bang",
        "description": "After nearly 20 years, Peter Siddle still had the ball in hand as his career neared a close and he ended it in perfect style.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Incredible scenes as legend bids farewell",
        "description": "Australian cricket great Peter Siddle has signed off his career in perfect style after proving he still had what it takes to the final ball.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Nick Kyrgios named in bombshell lawsuit",
        "description": "Novak Djokovic, Nick Kyrgios and several other stars have launched legal action over alleged “systematic abuse”.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘OMG’: Superstar power couple go public",
        "description": "The sporting world has a new power couple after a US tennis star went public with his relationship with another famous athlete.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Disgusting accusations after Gout Gout feat",
        "description": "Australian athletics great John Steffensen has spoken out about the disgusting accusations made towards teen sensation Gout Gout.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Shock F1 ruling rocks Piastri title dream",
        "description": "Formula 1 bosses have announced a shock rule change in a move that could seriously impact Oscar Piastri’s title hopes.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Shock F1 ruling could rock Piastri title hopes",
        "description": "In a shock move that could seriously impact Oscar Piastri’s quest for a world title, F1 teams have been given just five days to make a significant change to cars ahead of the China GP.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘Privileged’: First for Wallabies captain",
        "description": "The Reds don’t seem to have any problems in terms of their leadership depth, with Wallabies skipper Harry Wilson set to captain Queensland for the first time.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Kiss firming for Wallabies job",
        "description": "Les Kiss has praised his support staff at the Queensland Reds as he edges closer to becoming the next coach of the Wallabies.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Absurd price of pop star’s proposal",
        "description": "The NFL quarterback signed to an eye-watering $350 million contract has dropped an absolute fortune for his pop singer partner.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Actor’s ‘gross’ courtside act turns heads",
        "description": "This popular US actor has been photographed vomiting in the front row while attending a basketball game at Madison Square Garden.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘Unplayable’ Arzani tipped to shine for ‘Roos",
        "description": "Performances at Socceroos training this week suggest that Daniel Arzani has responded to the scathing criticism he received from national coach Tony Popovic.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Woman’s ‘WAG’ claim before alleged rape",
        "description": "A woman accusing a former Socceroo of raping her had told him she wanted to “live her dream of being a WAG” two days earlier, a court has been told.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘Swinging like an idiot’: Tszyu learns a hard lesson",
        "description": "Tim Tszyu didn’t mince his words when discussing his strategy and mental state ahead of his April 6 showdown with Joey Spencer.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘I was stunned’: Underdog’s nightmare as Rory wins Players decider",
        "description": "Rory McIlroy has cruised to a St Patrick’s Day victory at the Players Championship, defeating J.J. Spaun in a nervy three-hole playoff at TPC Sawgrass after the American imploded.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "One win from glory: Will United end the thriller with the Hawks?",
        "description": "The NBL title may be decided tonight, Melbourne United needing one more win to take out the championship series. But in typical Hawks style, they won’t let it be a landslide. Who wins? Cast your vote.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Newcastle, Albury previews: Sargent out to rule Qualifier",
        "description": "Luck wasn’t on the side of trainer John Sargent in the opening Provincial-Midway Qualifier but hopes change as he attacks the Newcastle heat with a pair of rising stars.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "‘OMG’: Superstar power couple go public",
        "description": "The sporting world has a new power couple after a US tennis star went public with his relationship with another famous athlete.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    },
    {
        "title": "Newman, underworld figure drop bombshell",
        "description": "Sam Newman has aired an extraordinary “conspiracy theory” and hit out over a video showing him with an infamous Melbourne figure.",
        "source": "News AU",
        "fetched_date": "2025-03-19T07:25:33.351952"
    }
]