[
    {
        "title": "Google joins firms dropping diversity recruitment goals",
        "description": "U-turn by former the diversity champion comes as major companies face pressure to drop the policies.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "China challenges Trump tariffs as 'discriminatory'",
        "description": "Beijing says the US is making \"unfounded\" claims about its role in the fentanyl trade to justify new tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "UK to make it easier to build nuclear reactors",
        "description": "The process of loosening rules on where reactors could be built began under the previous government.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Trump ally Musk is remaking government - but will they clash?",
        "description": "Musk has emerged as a dominant force in Trump's second term, gutting an agency and issuing ultimatums to staff.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "China challenges Trump tariffs as 'discriminatory'",
        "description": "Beijing says the US is making \"unfounded\" claims about its role in the fentanyl trade to justify new tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "USAID staff will be put on leave starting on Friday",
        "description": "The move is the latest in a concerted effort by the Trump administration to shut down the US international aid agency.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "World leaders set to vie for AI domination at Paris summit",
        "description": "Global politicians and AI bosses will next week attend a summit to debate the disruptive technology.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Trump tariff 'made something snap in us' - many Canadians see US rift beyond repair",
        "description": "The tariffs and US President Donald Trump's '51st State' comments have made way for a surge of patriotism in Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "The tariff wars have begun - buckle up",
        "description": "The UK will still be hit even if not directly targeted by Trump's tariff measures.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Ghana wants more for its cashews, but it's a tough nut to crack",
        "description": "The African nation exports its cashews in raw form, but processing them would be more lucrative.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Twenty thousand federal workers sign up for resignation scheme - US media",
        "description": "The scheme is part of an ongoing effort by the new administration to slash the size of the federal bureaucracy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Bank of England expected to cut interest rates",
        "description": "A cut to interest rates could mean lower mortgage rates.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Norwegian oil giant cuts green investment in half",
        "description": "Equinor will slash investment in renewable energy while ramping up oil and gas production.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Trump's real-estate instincts clash with his America First worldview",
        "description": "This isn't the first time he has seen a foreign policy problem as a business opportunity, writes Anthony Zurcher.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Billionaire and spiritual leader the Aga Khan dies",
        "description": "The philanthropist and spiritual leader died \"peacefully\" at the age of 88 in Lisbon, Portugal.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Concern over Google ending ban on AI weapons",
        "description": "The tech giant previously ruled out applications that were \"likely to cause harm\".",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Why Trump tariffs could mean Barbie dolls cost more",
        "description": "The firm says it could raise prices and make changes to its supply chains to deal with new import taxes.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Reddit community banned as user spat with Musk intensifies",
        "description": "The tech billionaire had complained that some Reddit users were advocating violence against his staff.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "US Postal Service resumes deliveries from China",
        "description": "The company said it is working with customs after Donald Trump closed a tax loophole on low-value parcels.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "100,000 eggs stolen from one US grocer as bird flu drives up prices",
        "description": "The price of eggs has risen amid a bird flu epidemic, making them an unexpectedly costly menu option.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "UK denies it faces paying billions more for Chagos deal",
        "description": "The Mauritian prime minister had said the renegotiated deal linked payments to inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "'Visionary' South African businessman Douw Steyn dies",
        "description": "The insurance magnate was a close friend of Nelson Mandela, who he housed after the statesman's divorce in 1992.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "India looks on nervously as Trump wields tariff threat",
        "description": "Delhi hopes tariff cuts have put it ahead of the game - but will that satisfy Trump, or is trade action still on the table?",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Ros Atkins on... What is the US getting out of tariffs?",
        "description": "The BBC's Analysis Editor takes a look at the latest round of tariffs announced by President Trump - and what the US has got in return.",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "The opening salvos have been fired in Trump's trade war - what comes next?",
        "description": "Are we seeing the opening moves in a wider trade war, and what are the potential economic consequences?",
        "source": "BBC Business",
        "fetched_date": "2025-02-06T07:24:03.144191"
    },
    {
        "title": "Man Who Claimed to Be Hollywood Producer Found Guilty of Murder, Rape in Overdose Deaths",
        "description": "David Pearce, a self-described \"entertainment professional,\" faces a sentence of up to life in prison for his crimes, which included the rapes of seven women across more than a decade.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Blackpink in Your Area: K-Pop Superstars Tease 2025 World Tour",
        "description": "The news comes as each member of the quartet has released or is about to release new solo music.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "How That All-Star Grateful Dead Tribute Came Together for MusiCares (Exclusive)",
        "description": "Don Was talks about curating a lineup that included Norah Jones, Dwight Yoakam, Maren Morris, Sierra Ferrell and Wynonna Judd, and reveals the song Dave Matthews was set to perform with John Mayer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Exclusive: Kamala Clobbers Caruso in CA Gov Poll",
        "description": "A private new survey has the billionaire developer questioning a potential statewide run.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Grammys: All of the Album of the Year Winners",
        "description": "From Henry Mancini's 'The Music From Peter Gunn' to Harry Styles' 'Harry's House,' The Hollywood Reporter rounds up all of the album of the year Grammy winners, dating back to the very first ceremony in 1959.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Elton John and Brandi Carlile Dropping New Album ‘Who Believes In Angels?’",
        "description": "\"It’s a radical act to seek out joyful and euphoric happenings. And that is what this album represents to me,\" Carlile says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Studio of the Americas Launches in Atlanta With Slate of Projects, Focus on Native-Led Storytelling",
        "description": "Led by CEO and co-founder Robert Wilson with chairman and co-founder Clifton Chippewa, the studio operates with a mission to \"authentically portray Native American stories, culture and traditions.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Post Malone, Doechii and Joni Mitchell: An Exclusive Peek Inside Clive Davis’ Grammy Gala Photo",
        "description": "The music mogul, celebrating the 50th anniversary of his famous Grammy party, gathered an impressive roster of talent to share the stage for THR's group portrait.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Whoopi Goldberg Slams Fox News Critics Angry Over Beyoncé’s Best Country Album Grammy Win",
        "description": "\"You want to hold on to country music like white people didn’t also buy her country album. Come on, man!\" the Oscar winner said in response to conservative author Raymond Arroyo's criticisms.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Billie Eilish Sends Care Package to L.A. Wildfire Victim at the Request of Meghan Markle",
        "description": "The duchess shared the story on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Grammys Exec Producer Addresses Kanye West and Bianca Censori’s Nude Red Carpet Moment",
        "description": "Raj Kapoor says the dress code is “artistic black-tie,\" however, \"I guess that's up for interpretation.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "David Edward Byrd, Famed Rock and Broadway Poster Artist, Dies at 83",
        "description": "He did iconic work for Jimi Hendrix, The Who, KISS, ‘Follies,’ ‘Little Shop of Horrors,’ ‘Godspell’ and much more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-06T07:24:04.220925"
    },
    {
        "title": "Aussie star announces shock retirement",
        "description": "The Australian cricket squad has been rocked just weeks out from a major tournament after the shock retirement of a big name star.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Retirement bombshell shocks Aussie team",
        "description": "Just three weeks out from the start of the Champions Trophy a snap retirement means Australia will have to make a fourth player change.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Star signing: Spin gun makes late BBL move",
        "description": "One of the longest standing Big Bash League spinners is on the move, joining a team which finished the season in red-hot form.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Sri Lanka fight back after Lyon’s early breakthrough",
        "description": "It is often said that winning the toss means winning the Test in Galle. Sri Lanka made hard work of it early, but they have fought back by lunch. FOLLOW DAY 1 LIVE",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Aussie star announces shock retirement",
        "description": "The Australian cricket squad has been rocked just weeks out from a major tournament after the shock retirement of a big name star.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Retirement bombshell shocks Aussie team",
        "description": "Just three weeks out from the start of the Champions Trophy a snap retirement means Australia will have to make a fourth player change.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Shock, tears as ex-world No. 1 retires on spot",
        "description": "A much-loved tennis champ’s career has ended in sad scenes when she grabbed a microphone on court and left spectators in tears.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Hewitt’s brutal blow after ‘nepotism’ claim",
        "description": "Cruz Hewitt’s push to replicate his tennis legend father Lleyton continues to suffer setbacks, with the latest a brutal blow to the youngster.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "AFL star’s final act revealed in wake of death",
        "description": "West Coast Eagles premiership star Adam Hunter has died at the age of 43, with police seizing drugs from the scene in Western Australia.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Fevola breaks down over Selwood death",
        "description": "AFL great Brendan Fevola was left broken hearted and cut a dejected figure as he paid tribute to former teammate Troy Selwood.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Brave NRLW coaching call the Bulldogs must make",
        "description": "The Bulldogs have a groundbreaking NRLW opportunity. There are two obvious candidates for the vacant coaching job if they’re brave enough to make a big decision for the future, writes PAMELA WHALEY.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Halfback locked in but Warriors mystery remains",
        "description": "Luke Metcalf has been handed the keys to the castle, and Warriors coach Andrew Webster has revealed what to expect from the club’s new halfback.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "NFL Down Under 2026: Everything you need to know",
        "description": "The NFL is officially coming to Australia, and to get you ready for a piece of sporting history, we’ve got every question covered ahead of the Rams’ venture to Melbourne.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Aussie city wins out as NFL confirms move",
        "description": "The NFL’s move in to Melbourne raised questions about an AFL clash at the MCG but all fears have been allayed for what looms as special event.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Matildas stars make verdict on Sam Kerr",
        "description": "A couple of prominent former Matildas have weighed in on the swirling future of Sam Kerr and her place as the team’s captain.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Matildas greats back ‘disrupter’ Kerr",
        "description": "A couple of prominent former Matildas believe Sam Kerr’s significant contribution to Australian football should not be forgotten.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Conor McGregor’s ugly fan act goes viral",
        "description": "Former UFC champ Conor McGregor has been caught on video appearing to spit in the face of a fan after jibe about a UFC rival.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "‘Hard moments for me’: Doncic’s title vow after shock of LA trade",
        "description": "Luka Doncic has vowed to lead the LA Lakers to an NBA title and admitted his own shock at being traded away by the Dallas Mavericks.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Aussie siblings’ starring role in Netflix hit",
        "description": "Two superstar Aussie sporting siblings could be in for a profile boost as feature acts in the third season of a Netflix sporting hit.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Palm Angel to show no mercy with Prelude tactics",
        "description": "Trainer Jason Warren will revert to the tactics that saw Palm Angel win on debut when the filly lines up in the Blue Diamond Prelude on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Update on $5m code hopper after scare",
        "description": "After a false start stopped his club rugby debut, Rugby Australia’s most expensive signing ever has given a clear indication when he’ll play again.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Tahs suffer early Suaalii blow with injury icing debut",
        "description": "Superstar Joseph-Aukuso Suaalii’s hotly anticipated debut in the NSW Waratahs jersey has been cruelled by an injury.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "‘Absolutely ridiculous’: Olympics bomb drops",
        "description": "Donald Trump is pushing International Olympic Committee to change its rules on transgender athletes after he signed a ban of his own.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-06T07:24:06.034000"
    }
]