[
    {
        "title": "Chinese electric carmaker BYD sales beat Tesla",
        "description": "The Shenzhen-based firm says revenue for last year came in at $107bn, boosted by sales of its hybrid vehicles.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Analysis: No UK tax rises and no return to austerity but will it last?",
        "description": "The Spring Statement is \"not a Budget\", but the chancellor is facing major tax and spending challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Bitcoin in the bush - the crypto mine in remote Zambia",
        "description": "Bitcoin miners will go to remote locations to take advantage of cheap electricity.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "China frees staff of US consultancy firm after two years",
        "description": "The release of five Mintz Group staff members comes as China tries to attract foreign investments.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Analysis: No UK tax rises and no return to austerity but will it last?",
        "description": "The Spring Statement is \"not a Budget\", but the chancellor is facing major tax and spending challenges.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "What are Rachel Reeves's borrowing rules?",
        "description": "What are UK Chancellor Rachel Reeves's rules for the economy?",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "What is the Signal messaging app and how secure is it?",
        "description": "Experts say using even such a privacy-focussed platform for national security matters is very unusual.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Hyundai unveils $21bn US expansion as Trump tariffs loom",
        "description": "The announcement comes as the US president is set to impose new tariffs on trading partners from 2 April.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Building the world's largest underwater tunnel",
        "description": "A mega project is underway in Denmark to build a tunnel under the Baltic to provide a link to Germany.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "What makes a rum Jamaican? Question at heart of Caribbean legal dispute",
        "description": "The dispute centres on whether it is acceptable to age and bottle the spirit overseas.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "AI job application rise 'risks hiring incapable staff'",
        "description": "AI could allow job hunters to get work they are not \"capable\" of doing, a UK business owner says.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Trump threatens tariffs on buyers of Venezuelan oil",
        "description": "The president said he would impose \"secondary\" taxes but appeared to soften his stance on other tarrifs.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "DNA testing site 23andMe files for bankruptcy protection",
        "description": "The company said that it will now attempt to sell itself under the supervision of a court.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Meta considers charging for ad-free Facebook and Instagram in the UK",
        "description": "The firm is considering asking people to pay to remove ads if they do not want their data to be tracked.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Heathrow closure deeply concerning, says PM",
        "description": "Sir Keir Starmer says he is 'deeply concerned' about the closure of Heathrow Airport as a result of a power cut caused by a fire on Friday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Disney's Snow White film tops box office despite bad reviews",
        "description": "The film has taken an estimated $87.3m globally during its opening weekend, according to Box Office Mojo.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "National Grid boss says Heathrow had 'enough power'",
        "description": "Heathrow's boss previously said the shutdown was not for lack of power but to reboot complex systems.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Everything you need to know about the Spring Statement",
        "description": "Chancellor Rachel Reeves will give more detail about the government's plans for the UK economy.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "UK mulls big tech tax changes to avoid US tariffs",
        "description": "Rachel Reeves says talks are \"ongoing\" about the Digital Services Tax, paid by giants like Amazon.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Investigation ordered into power outage that closed Heathrow",
        "description": "Energy Secretary Ed Miliband says there are lessons to be learned after substation fire led to major flight disruption on Friday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Experts to investigate student loan fraud claims",
        "description": "The education secretary says claims of student loan fraud point to one of the \"biggest financial scandals\" in the university sector.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Reeves confirms 15% cut to Civil Service running costs",
        "description": "Savings will be from back office and administrative roles rather than front-line services, chancellor tells the BBC.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "End of hedonism? Why Britain turned its back on clubbing",
        "description": "In the last five years, around 400 clubs have closed in Britain – could the lasting impact of the pandemic play a part?",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "The open secret about rare earth minerals",
        "description": "They are the focus of many diplomatic skirmishes, but how are rare earth minerals used and where are they found?",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "Canada can win trade war with US, foreign affairs minister Mélanie Joly says",
        "description": "Canada is among the countries waiting to see what Trump's 2 April reciprocal tariffs look like.",
        "source": "BBC Business",
        "fetched_date": "2025-03-26T07:24:53.291216"
    },
    {
        "title": "An Eyewitness Account of Oscar Winner Hamdan Ballal’s Arrest: “Zip-Tied and Blindfolded While His Family Prayed”",
        "description": "Raviv Rose, who bore witness to the aftermath of the attack on the Palestinian co-director of 'No Other Land' and two others in the West Bank Monday night, tells THR: \"There was a pool of his blood outside of his front door.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Miley Cyrus Drops Trailer for ‘Something Beautiful’ Film Accompanying New Album: “A One of a Kind Pop Opera”",
        "description": "Cyrus' album is set to be released on May 30, while the movie will come out in June.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Diddy Wins Dismissal of Lil Rod’s RICO, Breach of Contract Claims as Civil Lawsuit Moves Forward",
        "description": "The beleaguered billionaire will still have to answer for claims of sex trafficking and sexual assault in the case that opened the floodgates of legal woes against the rap mogul.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Napster Finds New Owners in $200M Acquisition",
        "description": "Tech company Infinity Reality said it hopes to turn the streaming service into a \"social and interactive music platform.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Megan Thee Stallion, Kathy Bates, Keke Palmer and Cristin Milioti Among Gracie Awards Honorees",
        "description": "The Hollywood Reporter's senior editor, film, Rebecca Keegan, is on the digital media winners list for her podcast 'The Godfather: A Film We Can't Refuse' from Audible, Paramount Audio and Spoke Media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Theo Kingma, Former HFPA President, Dies at 58",
        "description": "The Dutch photographer presided over the home of the Golden Globes from 2013-15.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Trump’s National Security Adviser Mistakenly Added Atlantic Editor to Military Ops Group Chat",
        "description": "Mike Waltz added Jeffrey Goldberg to a top-secret Signal chat where airstrikes in Yemen were discussed ahead of the bombing campaign.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Gérard Depardieu Sexual Assault Trial Begins",
        "description": "Two women have accused the French actor of assault on the set of 'The Green Shutters' in 2021.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Concord Finalizes Acquisition of Music Distributor Stem",
        "description": "The deal reflects a hot market of record labels buying up distribution services as indie music continues to grow.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Conan O’Brien Accepts Mark Twain Prize for Humor While Acknowledging the Kennedy Center’s Uncertain Future",
        "description": "Among those paying tribute to the comedian at Sunday night's event in Washington, D.C., were Adam Sandler, John Mulaney, Sarah Silverman and a dozen Mark Twain impersonators.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Hannah Einbinder Says She’s “Horrified by the Israeli Government’s Massacre” of Palestinians: “We Should All Be Against Murdering Civilians”",
        "description": "The 'Hacks' star spoke out while being honored by the Human Rights Campaign, adding, \"I see it as antithetical to our deepest Jewish traditions to fall in line and not question the actions of a state enacting atrocities in our name.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Mike Myers Takes Jab at Trump in Ad for Canada’s Liberal Party",
        "description": "The actor wears a \"Never 51\" hockey jersey in reference to Trump's suggestion that the country should become the 51st U.S. state.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-26T07:24:53.501811"
    },
    {
        "title": "Change upends 116 years of Olympic history",
        "description": "As Brisbane announced its plans for the 2032 Olympics this week, Aussies are getting a taste of a new sport set to enter the Games.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "NRL side named as likely DCE destination",
        "description": "Daly Cherry-Evans announced he wants to leave Manly at the end of the season, and one club has emerged as a clear frontrunner for his signature.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Sutherland special secures Aussies another whitewash",
        "description": "Annabel Sutherland has accelerated her meteoric rise by guiding Australian to another series whitewash.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Wallabies half named on Reds bench",
        "description": "Kalani Thomas has kept his place in Queensland’s starting team for Saturday night’s Super Rugby Pacific clash against Western Force at Suncorp Stadium.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "NRL side named as likely DCE destination",
        "description": "Daly Cherry-Evans announced he wants to leave Manly at the end of the season, and one club has emerged as a clear frontrunner for his signature.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "‘Just wrong’: Bennett blasts NRL soap opera",
        "description": "Rabbitohs coach Wayne Bennett has taken aim at the NRL, saying the Daly Cherry-Evans saga has exposed a major flaw in the current game.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Young gun set to make major AFL history",
        "description": "Port Adelaide young gun Tom Cochrane will make AFL history when he debuts on Thursday night.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "‘Feeling sick’: AFL star wasting his career",
        "description": "An AFL club has been labelled a “one-man” team and an “excuse factory” after a horror loss left the struggling team reeling.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Sutherland special secures Aussies another whitewash",
        "description": "Annabel Sutherland has accelerated her meteoric rise by guiding Australian to another series whitewash.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Doggett leads SA’s Shield final blitz, Test stars fall cheaply",
        "description": "South Australia is charging toward its first Sheffield Shield title in almost 30 years after reducing Queensland to 95 all out, including the dismissals of Usman Khawaja and Marnus Labuschagne cheaply.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "From world number one to rock bottom",
        "description": "At just 12, Todd Ley was the best juniors tennis player in the world and Australia’s next Lleyton Hewitt, until his world fell apart.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Star pushes back on Kyrgios’ shock lawsuit",
        "description": "Nick Kyrgios thought he was changing tennis for everyone when he put his name to a bombshell lawsuit, but not all of his fellow players are on-board.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "9yo footy fan ‘in shock’ after mascot push",
        "description": "A nine-year-old boy’s mum has contacted police and the NRL after the South Sydney mascot didn’t take kindly to his high-five request.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "F1 rocked in most brutal sacking seen",
        "description": "Red Bull have reportedly dropped the axe on their under siege driver after holding emergency crisis talks following a dire start to the year.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "‘Unimaginable’ rumour rocks Aussie, F1 grid",
        "description": "Formula 1’s silly season has exploded with rumours an “unimaginable twist” could save Jack Doohan, who may still be a dead man walking.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Wallabies half named on Reds bench",
        "description": "Kalani Thomas has kept his place in Queensland’s starting team for Saturday night’s Super Rugby Pacific clash against Western Force at Suncorp Stadium.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Staggering Folau news hard to fathom",
        "description": "Months after suggestions Israel Folau’s name had been “scrubbed from history” the former Wallaby is making a public plea.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Aussie star, family leave America ‘speechless’",
        "description": "A gesture of pure class has made Aussie NBA star Joe Ingles and his family the most heart-melting story of the season.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Absurd price of pop star’s proposal",
        "description": "The NFL quarterback signed to an eye-watering $350 million contract has dropped an absolute fortune for his pop singer partner.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "‘Special’ game awaits Socceroos",
        "description": "A win over Japan in Perth in June could seal the Socceroos a spot in next year’s FIFA World Cup, and the coach knows it’s a “special” game.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Hero emerges as Socceroos catch fire",
        "description": "The Socceroos are on the brink after a crucial World Cup qualification victory on Tuesday night that was full of class.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "UFC legend given five-year prison sentence",
        "description": "Two-time UFC heavyweight world champion Cain Velasquez will spend the next five years in prison — but it was almost so much worse.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Tiger asks for privacy as news rocks Trumps",
        "description": "Legendary golfer Tiger Woods has taken the rare step of going public with his new romance after weeks of rumours.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Coach breaks silence over hair pull scandal",
        "description": "The high school basketball coach who was sacked for yanking one of his players’ ponytails has spoken out over the “disturbing” scandal.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Gosford tips: She Conquers to live up to her name",
        "description": "The Gerald Ryan and Sterling Alexiou-trained She Conquers was a first-up winner last campaign and can kick off this preparation the same way.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Change upends 116 years of Olympic history",
        "description": "As Brisbane announced its plans for the 2032 Olympics this week, Aussies are getting a taste of a new sport set to enter the Games.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    },
    {
        "title": "Insane amount Aussies spend on sport",
        "description": "Cost of living might be putting pressure on the household budget, but sport is one thing Australians aren’t willing to give up.",
        "source": "News AU",
        "fetched_date": "2025-03-26T07:24:54.807041"
    }
]