[
    {
        "title": "India cuts interest rates for the first time in five years",
        "description": "The latest cut happens when India's GDP growth is seen slowing to a four-year-low of 6.7%.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Panama says US 'spreading lies' over free canal passage",
        "description": "The US State Department had claimed that they were no longer required to pay a fee for transit.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Judge halts Trump's government worker buyout plan",
        "description": "The offer is part of an ongoing effort by the Trump administration to slash the size of the federal government.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "£22bn for 'unproven' green tech could raise bills, UK MPs warn",
        "description": "The Public Accounts Committee warns the government of gambling public money on carbon capture.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Panama says US 'spreading lies' over free canal passage",
        "description": "The US State Department had claimed that they were no longer required to pay a fee for transit.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Unions sue Trump administration over USAID agency cuts",
        "description": "The lawsuit is the first seeking to block the Trump administration's overhaul of the US Agency for International Development.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Scams, casinos and high-rises: The BBC visits a bizarre city in a war zone",
        "description": "A haven for the super rich, or a city built on scams? The BBC was invited to find out.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "US should support World Bank and IMF, says Bank of England boss",
        "description": "Andrew Bailey says he is \"following closely\" whether Trump will change US support for the institutions.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Low growth and rising prices - it's looking gloomy for the UK",
        "description": "The central bank may have cut rates but forecasts of low growth and rising inflation make a challenging domestic vista.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Trump's real-estate instincts clash with his America First worldview",
        "description": "This isn't the first time he has seen a foreign policy problem as a business opportunity, writes Anthony Zurcher.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "'Land we paid for is being sold for millions - but we don't see the benefit'",
        "description": "Ex-miners say money from the sale of social welfare sites is not being re-invested in the community.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Concern UK's AI ambitions could lead to water shortages",
        "description": "Data centres can use vast quantities of water to cool them - but it's not clear where it will come from.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Panama denies US claims over free canal passages",
        "description": "Washington had suggested Panama had agreed to no longer charge fees for US government vessels using the waterway.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Carmaker Kia becomes latest global firm to face tax trouble in India",
        "description": "Customs authorities have accused Kia India of evading taxes worth millions of dollars.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "South Korea orders airports to install bird detection cameras",
        "description": "The directive comes as investigators focus on bird strike as one of the causes for December's deadly plane crash.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Twenty thousand federal workers sign up for resignation scheme - US media",
        "description": "The scheme is part of an ongoing effort by the new administration to slash the size of the federal bureaucracy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Blow for UK finance minister as growth forecast slashed",
        "description": "Bank boss Andrew Bailey told the BBC it expected to cut rates further but warned the road ahead would be bumpy.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Google remakes Super Bowl ad after AI cheese gaffe",
        "description": "Its Gemini tool wildly overestimated global gouda consumption in ad that was meant to show off its capabilities.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Google joins firms dropping diversity recruitment goals",
        "description": "U-turn by the former diversity champion comes as major companies face pressure to drop the policies.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "'Build baby build', says PM as he sets out nuclear plan",
        "description": "The government wants to make it quicker and easier to build mini nuclear power stations in England and Wales.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Indian media pile into lawsuit against OpenAI chatbot ChatGPT",
        "description": "India's largest news agency has sued OpenAI for 20m rupees, accusing it of using copyrighted material illegally.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "China challenges Trump tariffs as 'discriminatory'",
        "description": "Beijing says the US is making \"unfounded\" claims about its role in the fentanyl trade to justify new tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "USAID staff will be put on leave starting on Friday",
        "description": "The move is the latest in a concerted effort by the Trump administration to shut down the US international aid agency.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "World leaders set to vie for AI domination at Paris summit",
        "description": "Global politicians and AI bosses will next week attend a summit to debate the disruptive technology.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "Trump tariffs 'made something snap in us' - many Canadians see US rift beyond repair",
        "description": "The tariffs and US President Donald Trump's '51st State' comments have made way for a surge of patriotism in Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-02-07T07:22:36.465581"
    },
    {
        "title": "The Black Keys Open Up About Tour Cancellation, Management Split: “We Fired Their A**”",
        "description": "“Essentially as artists ... it’s almost impossible to talk about this,\" Patrick Carney said about ties between management companies and concert promotion. \"You’re dealing with management companies that co-own festivals with this other company.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Kendrick Lamar Previews “Storytelling” at Super Bowl Halftime Show as “Not Like Us” Speculation Swirls",
        "description": "The rapper's Grammy-winning diss track about Drake is currently the subject of a defamation lawsuit against Universal Music Group.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Beat the Press: Inside Trump’s War on Big Media",
        "description": "Settling landmark lawsuits, jettisoning \"loser\" anchors, shoveling out millions for vanity productions nobody (but Trump) wants to see — how Hollywood and the media are caving to the new MAGA order.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Spotify, Warner Music Strike New Multiyear Deal",
        "description": "“This major agreement delivers new benefits for artists, songwriters and fans, while unlocking further collaboration that expands the music ecosystem.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Whoopi Goldberg Slams Weight Loss Drug for Using AI Version of Her Face: “Do Not Look at This”",
        "description": "Goldberg said the company \"melded\" a 'CBS News Sunday Mornings' appearance from her to sell “bad weight loss drugs.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Irv Gotti, Murder Inc. Records Founder Who Worked With Ashanti and Ja Rule, Dies at 54",
        "description": "“Def Jam has lost one of its most creative soldiers who was hip-hop,” says YouTube’s Lyor Cohen.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Chappell Groan: The Misguided Rhetoric of an Instant Industry Insider (Guest Column)",
        "description": "The Grammy winner for best new artist gets respect and true appreciation for her creativity and gumption, but is far too green and uninformed to be the agent of change she aspires to be today.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Howie Mandel Apologizes to Bill Burr for Billy Corgan Ambush on His Podcast: “I Feel Horrible”",
        "description": "Mandel's apology comes after the comedian called him a \"Hollywood whore.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Man Who Claimed to Be Hollywood Producer Found Guilty of Murder, Rape in Overdose Deaths",
        "description": "David Pearce, a self-described \"entertainment professional,\" faces a sentence of up to life in prison for his crimes, which included the rapes of seven women across more than a decade.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Blackpink in Your Area: K-Pop Superstars Tease 2025 World Tour",
        "description": "The news comes as each member of the quartet has released or is about to release new solo music.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "How That All-Star Grateful Dead Tribute Came Together for MusiCares (Exclusive)",
        "description": "Don Was talks about curating a lineup that included Norah Jones, Dwight Yoakam, Maren Morris, Sierra Ferrell and Wynonna Judd, and reveals the song Dave Matthews was set to perform with John Mayer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Exclusive: Kamala Clobbers Caruso in CA Gov Poll",
        "description": "A private new survey has the billionaire developer questioning a potential statewide run.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-07T07:22:36.665957"
    },
    {
        "title": "Khawaja, Smith show battling Marnus how it’s done",
        "description": "Marnus Labuschagne’s immediate Test future has been thrust back into the spotlight after another failure in Galle. FOLLOW DAY TWO LIVE",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "NRL star to work three jobs after rejecting $300k",
        "description": "An NRL journeyman has accepted a a part-time deal to stay at his old club just three months after rejecting a $300,000 deal.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "The day Adelaide rumbled like never before",
        "description": "Adelaide lived through LIV’s first Watering Hole hole-in-one, but the energy that created was nothing on the breakaway tour’s team playoff win by four Aussies riding an unforgettable wave.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Police rule out suicide in AFL tragedy",
        "description": "Investigators have released new details about their inquiry after Eagle Adam Hunter died at the age of 43.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Khawaja, Smith show battling Marnus how it’s done",
        "description": "Marnus Labuschagne’s immediate Test future has been thrust back into the spotlight after another failure in Galle. FOLLOW DAY TWO LIVE",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Gabba education vital for Konstas",
        "description": "The NSW team is more than happy to have Sam Konstas back from Australia’s tour of Sri Lanka to play against Queensland at the Gabba.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "World-famous singer makes pro tennis debut",
        "description": "He once vowed to never stop party rocking but it appears he hasn’t listened to his own advice, as the iconic singer made his professional tennis debut, aged 49.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Shock, tears as ex-world No. 1 retires on spot",
        "description": "A much-loved tennis champ’s career has ended in sad scenes when she grabbed a microphone on court and left spectators in tears.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Police rule out suicide in AFL tragedy",
        "description": "Investigators have released new details about their inquiry after Eagle Adam Hunter died at the age of 43.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Saints great defends Godfather offer",
        "description": "St Kilda’s pursuit of Tom De Koning gets the thumbs up from Nick Riewoldt, who believes big contracts offer flexibility.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "NRL star to work three jobs after rejecting $300k",
        "description": "An NRL journeyman has accepted a a part-time deal to stay at his old club just three months after rejecting a $300,000 deal.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Walters’ Vegas truth, Broncos declaration",
        "description": "Kevin Walters has revealed his key advice for the NRL team’s travelling to Las Vegas for Round 1 as he makes a big call about the Broncos.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Walters’ Vegas truth, Broncos declaration",
        "description": "Kevin Walters has revealed his key advice for the NRL team’s travelling to Las Vegas for Round 1 as he makes a big call about the Broncos.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Can Philly stop Kansas City making Super Bowl history?",
        "description": "In one of the highest profile Super Bowl match-ups we’ve seen, history is on the line: who’s the favourite for Super Bowl LIX in New Orleans on Monday?",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "NFL Down Under 2026: Everything you need to know",
        "description": "The NFL is officially coming to Australia, and to get you ready for a piece of sporting history, we’ve got every question covered ahead of the Rams’ venture to Melbourne.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Fowler’s stunning goal spree continues",
        "description": "As Matildas captain Sam Kerr battles her way through a court hearing, teammate Mary Fowler is starring on the field in England.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "‘Abject’: Postecoglou circles the drain",
        "description": "A photo shows “lonely” Ange Postecoglou is on his final legs with drums beating loudly about his potential termination.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "‘Bunch of communists’: Unhinged UFC star slams media",
        "description": "Controversial UFC star Sean Strickland has delivered another bizarre press conference ahead of UFC 312, blowing up at the media, before calling Australians ‘degenerates’ and ‘white trash’.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "NBL: Taipans star ends Bullets’ season with stunning triple-double",
        "description": "Taipans star Taran Armstrong has claimed his first NBL triple-double in his game for Cairns, and closed the curtains on the Brisbane Bullets’ season. See the latest NBL news.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "The day Adelaide rumbled like never before",
        "description": "Adelaide lived through LIV’s first Watering Hole hole-in-one, but the energy that created was nothing on the breakaway tour’s team playoff win by four Aussies riding an unforgettable wave.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Jamie Melham’s emotional motivation for Orr Stakes success",
        "description": "Jamie Melham has formed a winning combination with Another Wil and says victory in the Group 1 CF Orr Stakes will be “very special”.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Wallabies in turmoil as coach calls it quits",
        "description": "Rugby Australia is back on the hunt for yet another new coach after Joe Schmidt confirmed he will step down ahead of the World Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Update on $5m code hopper after scare",
        "description": "After a false start stopped his club rugby debut, Rugby Australia’s most expensive signing ever has given a clear indication when he’ll play again.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "‘Absolutely ridiculous’: Olympics bomb drops",
        "description": "Donald Trump is pushing International Olympic Committee to change its rules on transgender athletes after he signed a ban of his own.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-07T07:22:38.204039"
    }
]