[
    {
        "title": "The environmental campaigners fighting against data centres",
        "description": "A growing global movement is seeing people object to data centres in their locality.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "‘Lying talent agent took our money and dreams’",
        "description": "A talent agent who supplied actors to shows on the BBC and Netflix withheld cash due to them, former clients claim.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Living with Nigeria's blackouts - six weeks, no power",
        "description": "Large parts of Nigeria are experiencing power outages due to problems with the country's grid.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "US jobs growth slows sharply as election looms",
        "description": "Employers added 12,000 jobs in October, much lower than the 223,000 created in September, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "‘Lying talent agent took our money and dreams’",
        "description": "A talent agent who supplied actors to shows on the BBC and Netflix withheld cash due to them, former clients claim.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Hunt for Bitcoin's elusive creator hits another dead end",
        "description": "Why are we still no closer to unmasking the mysterious Satoshi Nakamoto?",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Weight-loss drug firm Wegovy invested £6bn in this town. So why is it not booming?",
        "description": "Europe's most valuable company has invested billions in Kalundborg on Denmark's coast - but it has many problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "DNA-testing site 23andMe fights for survival",
        "description": "Once used by millions to discover their family histories, this week 23andMe was almost delisted. What went wrong?",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Energy CEO says fracking still 'necessary' - 1 Nov 2024",
        "description": "Energy CEO Lorenzo Simonelli wants to work with either candidate to help meet the energy demands in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "US election bets surge, despite red flags and mixed record",
        "description": "Election bets have exploded in the US, as it barrels toward the polls next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Musk election cash giveaways can continue as judge mulls case",
        "description": "Prosecutors say the case will now move to a federal court, following a request from Musk's lawyers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Russia fines Google more money than there is in entire world",
        "description": "The mind-boggling figure has been levied due to the company restricting Russian state media on YouTube.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Investors' reaction to Budget 'very different' to Truss",
        "description": "Treasury secretary speaks out to reassure the markets after a rise in the cost of government borrowing.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "Canada has launched a tourist drive but will tensions with China doom it to fail?",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Hollywood stars grow Wrexham  empire with brewery",
        "description": "The football club's star co-owners grow their Wrexham by buying half of the Wrexham Lager brewery.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "UK Budget 2024: Key points at a glance",
        "description": "Chancellor Rachel Reeves has delivered Labour’s first Budget since 2010 – here’s what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "UK growth set to peak next year before slowing again",
        "description": "The government's official forecaster raises its prediction for UK growth in 2024 and 2025 but reduces it for later years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "Why Wikipedia has landed in legal trouble in India",
        "description": "India’s largest newswire service ANI has filed a $237,874 defamation lawsuit against Wikimedia Foundation.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "UK-based stars support US video game strikes as row continues",
        "description": "Famous voices from releases such as The Witcher and Cyberpunk 2077 say they support the SAG-Aftra strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-11-04T07:23:42.145982"
    },
    {
        "title": "How Kamala Harris’ Campaign Is Winning Back Black Men",
        "description": "The vice president's team enlisted some of the most famous Black men in America and had two weeks to hit the battleground states and explain opportunities her administration plans to provide for the first time.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Chloë Grace Moretz Comes Out as a “Gay Woman” in Post Endorsing Kamala Harris",
        "description": "\"I voted early and I voted for Kamala Harris. There is so much on the line this election,\" the actress wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Ryan Reynolds Reacts to Martha Stewart Saying He’s “Not So Funny in Real Life”",
        "description": "The celebrity chef recently called the 'Deadpool & Wolverine' star \"very serious.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Harrison Ford Endorses Kamala Harris: “What We Need Is a President Who Works for All of Us Again”",
        "description": "The actor released three videos in partnership with the Harris-Tim Walz campaign three days before the election.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Jennifer Lawrence Knocks on Doors in Las Vegas for Kamala Harris Ahead of Election Day",
        "description": "The two-time Oscar winner knocked on doors, had lunch with Sen. Jacky Rosen and sat with first-time voters and business owners in the city as part of a Democratic push to get out the vote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Martha Stewart Thinks Neighbor Ryan Reynolds Is “Not So Funny in Real Life”",
        "description": "\"He can act funny, but he isn’t funny,\" the celebrity chef and businesswoman said about the 'Deadpool & Wolverine' star.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "K-Pop Star Kang Daniel Is Ready for His Next ‘Act’",
        "description": "As The Hollywood Reporter's latest \"Person of Interest,\" the once K-pop boy group Wanna One member opens up about \"restarting\" with his latest solo album 'Act.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Lin-Manuel Miranda, Martin Short, Rosie Perez Set for “Stars in the House” Election Day Vote-A-Thon",
        "description": "Wayne Brady, Jessie Mueller, Shoshana Bean and Judy Kuhn, among others, will join hosts Seth Rudetsky and James Wesley Jackson.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Jamie Foxx Netflix Special About Mystery Illness to Release in December",
        "description": "“I said, ‘If I can stay funny, I can stay alive,’” the Oscar-winning actor says in a trailer for ‘Jamie Foxx: What Had Happened Was…,' set to bow globally on Dec. 10.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Fat Joe on New Starz Series, Rappers Endorsing Trump and Why Hip-Hop Artists Don’t Want to Talk to Journalists",
        "description": "“Who can you trust more than a rapper?” says the host of 'Fat Joe Talks.' And no, he's not joking.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "NBC News and MSNBC’s Election Day Gameplan: Data Is the Star of the Show",
        "description": "MSNBC's studio will have a virtual White House behind Steve Kornacki, while NBC's coverage will feature a virtual recreation of Rockefeller Plaza.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Jennifer Lopez Rallies Kamala Harris Supporters After Hinchcliffe Jibe: “It Wasn’t Just Puerto Ricans Offended That Day”",
        "description": "The actor-singer also described Republican candidate Donald Trump as someone \"who has constantly worked to divide us\" ahead of election day.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-04T07:23:43.152575"
    },
    {
        "title": "Foolproof five-minute Melbourne Cup guide",
        "description": "If you only have five spare minutes to work out who you’re on for the 2024 Melbourne Cup, this is the perfect guide for you.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Hat-trick mayhem as WA gets revenge",
        "description": "After an embarrassing one-day collapse, WA produced its own stellar bowling performance including a rare hat-trick in the Sheffield Shield.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Ump banned in fresh AFL costume scandal",
        "description": "An AFL official has been suspended following yet another investigation into offensive behaviour at an end-of-season function.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Brutal MCG picture says it all",
        "description": "We’re barely two hours into the summer of cricket and the punters are out in force, slamming Cricket Australia over a glum snap of the MCG.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Ump banned in fresh AFL costume scandal",
        "description": "An AFL official has been suspended following yet another investigation into offensive behaviour at an end-of-season function.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Finals locked in: Power clinch sixth in a thriller as Hawks cash in",
        "description": "The finals are locked in for the AFLW’s 2025 season after Port’s thrilling come-from-behind win over GWS and a massive Hawthorn payday. See the full Week 1.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Why size won’t matter for Aussies on Sunday",
        "description": "Australia will have to contend with a Tongan pack weighing more than a tonne, but the Kangaroos have a plan to combat the size mismatch.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Lomax reveals why he left the Dragons",
        "description": "Zac Lomax has opened up on why he left the Dragons to join Parramatta, what position he wants to play next year and why Ben Hunt’s critics have missed the mark.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Pakistan rolled for 203 in horror start to the summer",
        "description": "Mitchell Starc stole the spotlight early, before being joined by Pat Cummins and Adam Zampa in a Pakistan demolition. And now attention turns to the batsmen in the opening ODI of the summer.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Hat-trick mayhem as WA gets revenge",
        "description": "After an embarrassing one-day collapse, WA produced its own stellar bowling performance including a rare hat-trick in the Sheffield Shield.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Jelena Dokic’s shock claim about abusive dad",
        "description": "Tennis great Jelena Dokic has made a shock claim about her relationship with her abusive father ahead of the release of her documentary.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Aussie Demon set for 20-year first",
        "description": "Alex de Minaur was supposed to be battling with a hip injury, but the Australian star’s fight has put him on the verge of a 20-year-first.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Verstappen fuels rumour of bombshell move",
        "description": "Max Verstappen has thrown his weight behind a relatively unknown rookie who he believes can help steer a failing team out of the rubble.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Verstappen twists knife, drags entire country",
        "description": "Lando Norris says Max Verstappen “got lucky” by winning the the Brazilian Grand Prix, as his rival got the last laugh in a savage press conference.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Anger at $500 Welcome to Country, beach fee",
        "description": "Members of a surf club in a small town in northern NSW are angry after being forced to pay a fee for Welcome to Country ceremonies.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Raygun takes world by storm all over again",
        "description": "Aussie Olympic breakdancer Raygun has come clean on her true feelings after she once again took the world by storm.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "$283m star erupts over ‘dead brother’ swipe",
        "description": "NBA superstar Joel Embiid has reportedly shoved a reporter in heated scene in the change rooms over an ugly swipe.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Jason Kelce loses it over Taylor Swift slur",
        "description": "Footage is going viral of Jason Kelce responding to a man’s disgusting comment about his brother’s romance with Taylor Swift.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "EPL: Ange’s Spurs regroup, Man U start life after ten Hag with draw",
        "description": "Tottenham picked up a much-needed Premier League win with a second half demolition of Aston Villa, while Manchester United showed signs of improvement in a home clash with Chelsea.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Postecoglou stuns EPL rivals in 45-min blitz",
        "description": "Ange Postecoglou has once again silenced his critics as Tottenham blew their Premier League rivals away in a 45-minute blitz.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Rival stunned as Tyson reveals physique",
        "description": "Mike Tyson has incredibly transformed his body in just one year ahead of his fight with Jake Paul and it’s even stunned his opponent.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Smith in ‘good spot’ after Qld PGA",
        "description": "Despite a frustrating final round at the Queensland PGA, Cam Smith is pleased with the way his golf is trending.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Kings silence doubters as Phoenix continues rising from the ashes",
        "description": "The South-East Melbourne Phoenix has its fourth win in five games and – after being in all sorts early doors in the NBL season – are back in the top six hunt.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "NRL great ‘disappointed’ by anthem stance",
        "description": "Players make their own decisions about singing the national anthem before matches and it doesn’t sit well with one NRL great.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Aussie Olympians’ $100k pay day blocked",
        "description": "Rugby Australia are standing in the way of a plan for two of Australia’s biggest Rugby Sevens stars to maximise their earning potential.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Foolproof five-minute Melbourne Cup guide",
        "description": "If you only have five spare minutes to work out who you’re on for the 2024 Melbourne Cup, this is the perfect guide for you.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-04T07:23:45.666982"
    }
]