[
    {
        "title": "Trump launches probe into Brazil's 'unfair' trade practices",
        "description": "Last week, the US president urged Brazilian authorities to end their prosecution of the country's former President Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Trump claims tariff deal with Indonesia",
        "description": "Trump says the US will lower its tariffs threatened on goods from Indonesia to 19% from a planned 32%.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "French PM looks to scrap two public holidays in bold bid to cut national debt",
        "description": "MPs will vote on François Bayrou's budget plan in the autumn, in a moment of high risk for the government.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Trump imposes 17% tariff on Mexican tomatoes",
        "description": "It comes after US tomato growers accused their Mexican counterparts of dumping their produce.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Trump claims tariff deal with Indonesia",
        "description": "Trump says the US will lower its tariffs threatened on goods from Indonesia to 19% from a planned 32%.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Labubu firm sees profit soaring by at least 350%",
        "description": "Sales, branding and tight cost controls have helped Pop Mart's profits balloon in the first half of 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Carney says US-Canada trade deal likely to include some tariffs",
        "description": "The two countries are aiming for a 1 August deal even after Trump announced a new 35% tariff on imports from Canada last week.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "US inflation rises as tariffs drive up prices",
        "description": "Energy and housing costs were the major drivers of inflation, but consumers are starting to feel the impact of tariffs on basic goods.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "The deepening water shortage row between the US and Mexico",
        "description": "The US is accusing its southern neighbour of breaking a long-held water sharing agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Markets 'betting' tariffs resolve by fall - 11 Jul 2025",
        "description": "Expert says markets are betting that Trump will not want to cause a recession before the US midterms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Heat pump makers are ready for a rush: Will customers come?",
        "description": "Heat pump makers are ready to raise output, but demand is still sluggish.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Nvidia says it will restart AI chip sales to China",
        "description": "The move would reverse a US ban on sales of the high-end chip to the world's second largest economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "China growth beats expectations as Trump tariffs loom",
        "description": "The world's second largest economy grew by 5.2% in the three months to the end of June, official figures show.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "WeTransfer says files not used to train AI after backlash",
        "description": "Some social media users had threatened to delete their accounts after WeTransfer's terms were updated.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Drivers offered up to £3,750 discount to buy electric cars",
        "description": "UK government will subsidise prices cuts to encourage a shift away from petrol and diesel.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Meta to spend hundreds of billions to build AI data centres",
        "description": "The founder of the social media giant said one of the sites would cover an area nearly the size of Manhattan.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Trump threatens Russia with tariffs while unveiling Ukraine weapons plan",
        "description": "Under the new plan, the US will sell weapons to Nato countries who will send them to Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Musk's Grok signs $200m deal with Pentagon days after antisemitism row",
        "description": "The deal is part of the Trump administration's push for more aggressive adoption of artificial intelligence in the government.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Analysis: Russia more relieved than rattled by US tariff threat",
        "description": "The US is threatening Moscow with financial consequences if a deal to end the Ukraine war is not reached within 50 days.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Starbucks staff must work in the office four days a week",
        "description": "The coffees shop firm is offering one-time payments to staff who decide to leave rather than comply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Boeing fuel switches safe, regulator says after Air India crash",
        "description": "A preliminary investigation found the switches had been turned off in June's fatal Air India crash.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Bank boss ready to cut rates if job market slows",
        "description": "Andrew Bailey tells the Times he believes \"the path is downward\" on interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "EU delays retaliatory trade tariffs against US",
        "description": "The countermeasures were set to start on Tuesday but have been pushed back to early August.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Post Office could be owned by its postmasters, UK government says",
        "description": "The service could be turned into an employee-owned business, under options set out by the government.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Trump's tariffs are looming large over the UK’s last surviving steel towns",
        "description": "The future of industrial towns like Scunthorpe and Port Talbot may rest on the wider fate of the UK's steel industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Electric cars will be cheaper to buy, pledges minister",
        "description": "The Transport Secretary says she will announce measures to cut the cost of buying an electric car.",
        "source": "BBC Business",
        "fetched_date": "2025-07-16T07:30:25.458841"
    },
    {
        "title": "Diddy and the Deep State",
        "description": "How a decades-old sushi party, federal trial and sprawling online conspiracy community turned Sean \"Diddy\" Combs into the latest QAnon obsession.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Primary Wave Acquires Rights from Estate of Fleetwood Mac’s Peter Green",
        "description": "When I look at the definition of a musical genius, Peter Green ticks every box,\" Primary Wave's Robin Godfrey Cass said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "BBC Touts Record Digital Audience in Annual Report, Finds “No Evidence of Toxic Culture” After Huw Edwards Crimes",
        "description": "The U.K. broadcaster detailed how the company has remained the number one brand for media in the U.K., accruing over 4.5 billion viewing hours on BBC iPlayer alone.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Academy Museum and CJ ENM Partner Up for Korean Content-Themed Event Ahead of KCON",
        "description": "The event, titled “K-Culture Night at Academy Museum with KCON,” will celebrated the K-pop-focused festival’s 13th anniversary with idols, actors and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Andrea Gibson, Poet and Subject of Doc ‘Come See Me in the Good Light,’ Dies at 49",
        "description": "Gibson's books included 'You Better Be Lightning,' 'Take Me With You' and 'Lord of the Butterflies.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Unreleased Beyoncé Music Stolen From Rental Car Ahead of Cowboy Carter Tour Atlanta Stops",
        "description": "A suspect stole \"water marked music, some unreleased music, footage plans for the show and past and future set lists,\" according to an Atlanta Police incident report.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Blackpink Returns to L.A. to Remind Us All Why They’re the Biggest Girl Group in the World",
        "description": "The four-member supergroup brought their Deadline world tour to L.A.’s SoFi Stadium with two sold-out shows over the weekend, with the tour serving as a reunion of sorts after successful solo endeavors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Tears, Spaceships and Nostalgia: How Backstreet Boys “Pushed the Limits” of Las Vegas’ Sphere With “Mind-Boggling” Residency Launch",
        "description": "The group launched their Into the Millennium shows with a slew of emotions: \"I started breaking down and crying because it was so emotional and surreal.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "Son of Hollywood Producer Suspected in Triple Murder Found Dead in L.A. Jail Ahead of Hearing",
        "description": "Samuel Haskell Jr. is accused of the 2023 killings of Mei Haskell and her parents, Yanxiang Wang and Gaoshan Li, in the Tarzana home they all shared.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "THR’s 2025 Top Music Lawyers: Nominations Are Now Open",
        "description": "Submit your pick in the link below. Submissions are due by Aug. 8.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "New York Comedy Festival to Feature Louis C.K., Margaret Cho and ‘Strangers With Candy’ Reunion",
        "description": "The lineup features Alex Edelman, the Basement Yard, Hannah Berner, Michael Blackson, Chris Fleming, Pete Holmes, Morgan Jay, Ismo, Ryan Long, Nurse John, Yohay Sponder, Trevor Wallace and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    },
    {
        "title": "HBO’s ‘Harry Potter’ Reveals First Costumed Photo; Casts Neville and Dudley",
        "description": "HBO just confirmed additional cast for its upcoming Harry Potter TV series adaptation, plus released the first look of young Dominic McLaughlin as Potter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-16T07:30:25.695399"
    }
]