[
    {
        "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
        "description": "Several Chinese solar companies with factories across the region could face steep new tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Modi and Vance praise progress in trade talks as higher tariffs loom",
        "description": "US Vice-President JD Vance is currently on a four-day visit to India with his wife and three children.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "'I was careful and followed instructions closely, but still lost my crypto'",
        "description": "A customer's experience highlights issues dealing with cryptocurrency, where many regular banking safeguards do not apply.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "DHL suspends high value US deliveries over tariffs",
        "description": "The postal giant will stop shipping packages to American consumers after a rise in red tape at customs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Modi and Vance praise progress in trade talks as higher tariffs loom",
        "description": "US Vice-President JD Vance is currently on a four-day visit to India with his wife and three children.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "US stocks and dollar plunge as Trump attacks Fed chair Powell",
        "description": "The president amps up attack against US central bank boss calling him \"a major loser\" for not lowering interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "US FTC sues Uber, alleging deceptive subscription practices",
        "description": "The FTC accused Uber of charging people for its Uber One subscription service without getting their consent.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "China warns nations against 'appeasing' US in trade deals",
        "description": "Beijing was responding to reports that the US will pressure other nations to restrict trade with China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Firms say Meta not helping them to recover hacked accounts",
        "description": "Businesses around the world say they are unable to get back into their Facebook and Instagram pages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Malaysian trade minister on US tariffs",
        "description": "Malaysia's minister Zafrul Aziz will be representing the ASEAN bloc in its negotiations with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Inside the rural Texas town where Elon Musk is basing his business empire",
        "description": "The tycoon and Donald Trump adviser has moved his businesses from California to a mostly rural central Texas county.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Why everyone is suddenly so interested in US bond markets",
        "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Designed in US, made in China: Why Apple is stuck",
        "description": "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Anxiety at US colleges as foreign students are detained and visas revoked",
        "description": "High-profile detentions and visa revocations are putting students on edge, as Trump tightens his squeeze on US schools.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Starmer and Trump discuss 'productive' trade talks",
        "description": "The men held their first call since the US president imposed tariffs on UK goods earlier this month.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "What we know about US-Ukraine minerals deal",
        "description": "The US and Ukraine have taken the first step to finalising a deal that would set up an investment fund for Ukraine's reconstruction.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "US lays out plans to hit Chinese ships with port fees",
        "description": "The charges will start in 180 days and rise in the coming years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Nvidia: The AI chip giant caught between US and China",
        "description": "Led by Jensen Huang, dubbed the 'Taylor Swift of tech', the chip giant has become pivotal in the race for AI supremacy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "PM Modi and Elon Musk talk India-US tech collaboration",
        "description": "Modi said he discussed with Musk India's potential to collaborate with the US on technology.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Trump's tariffs leave China's neighbours with an impossible choice",
        "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "No global recession despite US tariffs, says IMF",
        "description": "The international economic group predicts \"notable markdowns, but not recession\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "'My home is worth millions, but my kids can't afford to live here'",
        "description": "Housing has taken a back seat in Canada's election to Donald Trump's tariffs, but advocates argue the affordability crisis is just as disruptive.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Google has illegal advertising monopoly, judge rules",
        "description": "It is the second major case Google has lost in a year, after it was found to have a monopoly on online search.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "The rise and wobble of India's EV pioneer Ola",
        "description": "Ola, once a rising star, is facing falling sales amid rising competition and regulatory scrutiny.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "Trump and Meloni talk up chances of US trade deal with Europe",
        "description": "The US president separately said he is confident of making \"a very good deal\" with China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-22T07:26:37.890244"
    },
    {
        "title": "EXO’s Kai on Diving Deeper Into Himself on New EP ‘Wait On Me’ and Meeting Fans After Two Years",
        "description": "The K-Pop star is back with his first album in over two years, sharing with The Hollywood Reporter his excitement and concerns around the album and why performing with SuperM was a core memory for him.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "First Look at the Cover of ‘BTS: A Little Golden Book Biography’ (Exclusive)",
        "description": "The latest addition to the Little Golden Book biographies series will hit the shelves in September.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "Pope Francis, First Latin American Pontiff, Dies at 88",
        "description": "The Vatican said the Catholic leader, who suffered from chronic lung disease and recently spent 38 days in the hospital for a respiratory crisis that developed into double pneumonia, died of a stroke that put him into a coma and led to heart failure.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "‘The Crown’ Actress Olivia Williams Opens Up About Why She’ll Never Be Cancer-Free",
        "description": "The actress learned she had cancer in 2018 after years of misdiagnosis.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "Irish Band Kneecap Displays Anti-Israel Messages During Coachella Weekend 2 Set ‘Blindsiding’ Festival Organizers",
        "description": "Jewish groups are responding to the band’s actions and pointing fingers at festival promoter Goldenvoice who sources say was “blindsided.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "It Has Not Been Lost on Snoop Dogg That 4/20 Weed Holiday Falls on Easter Sunday",
        "description": "The rapper commented on the annual holiday celebrating marijuana culture, which this year occurs on the same day as Easter and the last day of Passover.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "J.K. Rowling References Easter in Response to “F*** JKR” Chants at U.K. Parliament Protest",
        "description": "“Only a thousand? #disappointed.... Enjoy your marshmallows” remarked the controversial 'Harry Potter' author on the number of trans rights activists that gathered in Parliament Square.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "The Who Bring Back Drummer Zak Starkey Days After Parting Ways",
        "description": "\"There have been some communication issues, personal and private on all sides, that needed to be dealt with, and these have been aired happily,\" Pete Townshend, the band's guitarist-songwriter shared.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "Harvey Weinstein’s Last Stand",
        "description": "The former Hollywood mogul's legal team is betting that the current climate around #MeToo will play in their client's favor this time around, or at the very least, not against him.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "Jordan Firstman Is Sharing All Your ‘Secrets’",
        "description": "The Hollywood Reporter’s latest “Person of Interest” is the comedian, writer and director who has released his first musical comedy album ‘Secrets’: “This project has been really liberating for me because it's fully my voice.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "Joel Katz, Longtime Music Industry Attorney, Dies at 80",
        "description": "He was one of the industry’s most powerful attorneys, representing the Recording Academy, Justin Timberlake and Willie Nelson, among others.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-22T07:26:38.605549"
    },
    {
        "title": "Tigers make shock Galvin call",
        "description": "Any fears that Lachlan Galvin may have played his last game for the Wests Tigers have been put to bed with the five-eighth rushed straight back into the squad for Sunday’s game against Cronulla.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Balta sorry after assault penalty lands",
        "description": "After a NSW magistrate imposed a curfew as part of Richmond defender Noah Balta’s sentence for a shocking assault the club has responded.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "‘I’m done, I’m done’: Bells drama as surfer hurt",
        "description": "As surfing finally got back underway at Bells Beach a visiting competitor hurt his knee so badly he had to be driven off the sand.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Shock Galvin backflip rocks NRL world",
        "description": "The NRL world has been stunned by the Tigers’ shock Lachlan Galvin move a week on from the youngster informing the club of his desire to leave.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "NRL teams: Fifita mysteriously shows up for Titans",
        "description": "He was originally ruled out for a month with a hamstring injury but David Fifita has mysteriously shown up on the Gold Coast team sheet.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Tigers make shock Galvin call",
        "description": "Any fears that Lachlan Galvin may have played his last game for the Wests Tigers have been put to bed with the five-eighth rushed straight back into the squad for Sunday’s game against Cronulla.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Balta sorry after assault penalty lands",
        "description": "After a NSW magistrate imposed a curfew as part of Richmond defender Noah Balta’s sentence for a shocking assault the club has responded.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Bulldogs’ $800k twist leaves club in ‘despair’",
        "description": "The Western Bulldogs have never needed Jamarra Ugle-Hagan more — and the latest development tells a very sorry state of affairs.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Aussie gun adds to century makers in England",
        "description": "There;s a huge cohort of Australians playing in England ahead of the World Test Championship final and plenty of them are making hundreds.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Cricket world loses it as 14yo makes history",
        "description": "A teenage phenom has lit up the cricket world in a historic moment in the IPL before breaking down in tears in sad scenes.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Tennis world slams ‘creepy’ shower rule",
        "description": "Tennis players will have to abide by a new ‘creepy’ shower rule as the sport works to implement stricter doping measures.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "De Minaur powerless as Alcaraz curse extends",
        "description": "It’s the same old story for Alex de Minaur after the Aussie star got in the way of a red-hot Carlos Alcaraz on Saturday morning.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "World all says same thing about Piastri",
        "description": "Oscar Piastri is the talk of the Formula 1 world and there is one thing everybody has noticed about the Australian driver.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Red Bull submits evidence to strip Piastri",
        "description": "One of the sport’s most controversial figures caught the attention of millions with a frantic last-ditch attempt to steal Oscar Piastri’s race.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Reds winger targeting win, not tries",
        "description": "Having scored tries for fun last year, Queensland Reds winger Tim Ryan has focused on other aspects of his game this season.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Olympian’s World Cup dream is on",
        "description": "The Rugby World Cup dream for a couple of Olympians is alive after being picked in the Australian squad.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Hearts melt over $1.1bn star’s selfless act",
        "description": "It’s going to take a lot more than a $1.1 billion deal to make this global Major League superstar forget his roots.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Global superstar’s incredible family update",
        "description": "Las Angeles Dodgers superstar Shohei Ohtani has taken to Instagram to reveal a heartwarming family update.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Socceroos rocked by star’s injury",
        "description": "A key Socceroo has a foot injury ahead of Australia’s FIFA World Cup qualifiers against Japan and Saudi Arabia.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Fans all say same thing about Ange disaster",
        "description": "Ange Postecoglou’s horror season continues to go from bad to worse with fans turning on the Aussie coach after an embarrassing defeat.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Fans fear worst as clip of boxing icon swirls",
        "description": "Boxing icon Butterbean has won an army of fans with his recent weight loss and celebrity fights — but there are serious fears for the former champ.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Aussie gun’s plan to end major drought",
        "description": "No Australian has won the opening major of the women’s season since 2006 and a the world No.5 wants to end that drought this week.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Newcastle preview: A confident Empress is ready to rule",
        "description": "A barnstorming win at Goulburn last start has done the world of good for the Michael Freedman-trained Empress Of Japan and she looks a great chance again and Newcastle.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Politician’s outrageous netball rant backfires",
        "description": "A self-styled “America First nationalist” who recently called for the deportation of Selena Gomez has gone on another online tirade.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    },
    {
        "title": "Hearts melt over $1.1bn star’s selfless act",
        "description": "It’s going to take a lot more than a $1.1 billion deal to make this global Major League superstar forget his roots.",
        "source": "News AU",
        "fetched_date": "2025-04-22T07:26:40.273012"
    }
]