[
    {
        "title": "North Korea to open beach resort as Kim bets on tourism",
        "description": "Wonsan Kalma opens to domestic tourists on 1 July, six years after it was due to be completed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Why your old mobile phone may be polluting Thailand",
        "description": "The Asian nation is importing thousands of tonnes of electronic waste per year, despite a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Trump says Nato's new 5% defence spending pledge a 'big win'",
        "description": "Nato leaders meeting in The Hague say they have an \"ironclad commitment to collective defence\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Ticket resellers employ overseas workers to bulk-buy",
        "description": "An undercover probe finds workers help touts make money from gigs including Oasis and Taylor Swift.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Why your old mobile phone may be polluting Thailand",
        "description": "The Asian nation is importing thousands of tonnes of electronic waste per year, despite a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Thailand's 'weed wild west' faces new rules as smuggling to UK rises",
        "description": "A number of British travellers have been arrested and prices have collapsed due to overproduction.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "'Our food doesn't even last the month': Americans brace for Trump's welfare cuts",
        "description": "About 16% of West Virginians rely on a federal food subsidy programme that is facing big cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "The virtually abandoned Florida airport being turned into 'Alligator Alcatraz'",
        "description": "Surrounded by alligator infested swamps, BBC Mundo visited the site forming part of the Trump administration's mass deportation agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Russia's economy is down but not out",
        "description": "The country's economy has been surprisingly resilient but there are underlying problems.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "How China made electric vehicles mainstream",
        "description": "The world's second-largest economy is both the biggest producer and buyer of EVs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Markets muted amid Middle East conflict - 18 Jun 2025",
        "description": "Global investment expert says markets are in a 'wait and see mode' amid escalating tensions in the Middle East.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Supercell boss: 'We need to take bigger risks'",
        "description": "The boss of mobile gaming giant Supercell says the industry needs to take bigger risks to compete.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Pledge to protect UK firms from cheap imports",
        "description": "The government's plan comes as UK businesses worry about the impact of US President Donald Trump's trade tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Deal or no deal? Zimbabwe still divided over land 25 years after white farmers evicted",
        "description": "Some white farmers accept compensation 25 years after land reform began - others fight on.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Turmoil and trade wars dominate China's 'summer Davos'",
        "description": "The conflict between Iran and Israel adds further uncertainty to an already strained global outlook.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Bumble to axe almost a third of staff as dating app struggles",
        "description": "The firm's founder became the world's youngest self-made female billionaire when it launched on the US stock market.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "US judge backs AI firm over use of copyrighted books",
        "description": "A US court has ruled Anthropic was not breaching copyright rules when it trained its AI model on books.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Eurostar services returning to normal after major disruption",
        "description": "The rail operator says that repairs are now complete, but delays are expected until the end of Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "This burger was made in a lab from cow cells… Should it be served in UK restaurants?",
        "description": "Lab-grown beef, chicken and even quail are served in restaurants in several countries around the world - and soon some cultivated meats could be sold in the UK too.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "'A slap in the face': Asos bans shoppers for making too many returns",
        "description": "The retailer has been cracking down on customers with high return rates - but some say it is unfair.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Oil prices tumble after Israel agrees to Iran ceasefire",
        "description": "Crude has dropped by more than 5% with prices now below the level when Israel first launched its attack.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "US safety regulators contact Tesla over erratic robotaxis",
        "description": "Videos posted online appear to show the newly launched self-driving cars speeding and driving in the wrong lane.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Israel-Iran conflict disrupts Middle East flights",
        "description": "Airlines scramble to cancel and reroute flights after Doha and Dubai airports shut briefly.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "'Best place to have herpes': New Zealand advert wins top prize",
        "description": "The charity was awarded a Cannes Lions award for its campaign to destigmatise the infection.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "Google may be forced to link to rival search platforms in the UK",
        "description": "The Competition and Markets Authority says it wants to open up the UK search market.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "How the attacks on Iran could affect oil prices and energy bills",
        "description": "Conflict in the Middle East often leads to higher energy prices, which can feed through to inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "US asks China to stop Iran from closing Strait of Hormuz",
        "description": "Iran's Press TV had earlier reported that parliament had approved a plan to close the Strait.",
        "source": "BBC Business",
        "fetched_date": "2025-06-26T07:28:37.137214"
    },
    {
        "title": "The Sphere Worked Modern Magic on the Soundtrack for ‘The Wizard of Oz’",
        "description": "The high-tech venue has painstakingly re-recorded the orchestral score and made new sound effects, while preserving the original dialogue and vocals",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "J-Pop Duo Yoasobi on Why Their Unique Concept Has Helped Lead to Global Success",
        "description": "The chart-topping Japanese act, known for adapting novels into music, say they’re hopeful for the future of J-Pop globally: “I hope that we can continue to create great music for the world to enjoy.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Zohran Mamdani Declares Victory in NYC’s Democratic Mayoral Primary as Cuomo Concedes",
        "description": "“Tonight is his night. He deserved it. He won,” Cuomo told supporters on Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Lizzo Reveals New Mixtape ‘My Face Hurts From Smiling’",
        "description": "The 13-track mixtape, with features from Doja Cat and SZA, is seemingly separate from her previously announced ‘Love in Real Life’ album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "‘Cobra Kai’ Star Martin Kove Admits to Biting the Arm of Former Co-Star While at Fan Convention",
        "description": "The incident that took place at Washington State's Summer Con began after Alicia Hannah-Kim tapped the shoulder of the actor, who plays the antagonist sensei John Kreese.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Pedro Pascal Looks Back on Calling J.K. Rowling a “Heinous Loser” for Anti-Trans Comments: “Bullies Make Me F***ing Sick”",
        "description": "“The one thing that I would say I agonized over a little bit was just, ‘Am I helping?’” the actor said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Brandy and Monica Announce First-Ever Co-Headlining Tour",
        "description": "The duo will embark on The Boy Is Mine Tour starting in October, with Kelly Rowland, Muni Long and Jamal Roberts tapped as supporting acts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Diego Luna Slams Trump’s Immigration Policies, Says Immigrants “Are the Ones Who Build This Country”",
        "description": "\"The multiple times that this country has had to rebuild itself, immigrants were always there to pick up the slack,\" the Mexican actor-director said on 'Jimmy Kimmel Live!.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Baby DONT Cry, First Girl Group Hailing From K-pop Icon Psy’s Label, Steps Into the Spotlight (Exclusive)",
        "description": "The four-member group, produced and creatively directed by Idle leader Soyeon, speak with THR in their first international interview about their trainee days, debuting and learning from Psy and Soyeon.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Mick Ralphs, Founding Guitarist of Bad Company and Mott The Hoople, Dies at 81",
        "description": "Ralphs wrote hits including \"Can't Get Enough\" and \"Good Lovin' Gone Bad.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "145 People Say They Were Stabbed With Syringes at French Music Festival",
        "description": "Twelve people were arrested for the alleged incidents, the French Interior Ministry told several outlets, including CNN.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    },
    {
        "title": "Actors Steven Weber, Lori Petty, Cynda Williams, Mitchell Anderson Join Lineup for Pride LIVE! Hollywood Festival",
        "description": "The inaugural pop culture festival continues through June 29 at venues across Hollywood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-26T07:28:38.012243"
    }
]