[
    {
        "title": "Is US economy better or worse now than under Trump?",
        "description": "BBC Verify looks at jobs, inflation, stocks and other indicators to compare the Trump and Biden economies.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "China's mission to win African hearts with satellite TV",
        "description": "China pledged to install satellite dishes in some 10,000 villages across Africa, aiming to generate goodwill.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Israel disruption as strike and protests push for Gaza hostage deal",
        "description": "Tensions are running high over the government's failure to secure the release of hostages held by Hamas.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Migrant farm worker deaths show cost of the 'American Dream'",
        "description": "Jose Arturo Gonzalez Mendoza died in the heat on a farm 2023. His death highlights the dangerous work many migrants do.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Málaga tourism: 'People feel the city is collapsing'",
        "description": "Protesting locals say hordes of tourists make the city feel like a \"theme park\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "China's mission to win African hearts with satellite TV",
        "description": "China pledged to install satellite dishes in some 10,000 villages across Africa, aiming to generate goodwill.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Cathay Pacific grounds planes after engine problem",
        "description": "Airline has found faulty engine parts during an inspection of its fleet of 48 A350 aircraft.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Top Brazil court upholds ban of Musk's X",
        "description": "A majority of justices has voted in favour of upholding the suspension which has seen X blocked in Brazil.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Young workers drive South Africa's video games industry",
        "description": "South Africa has a small but thriving video games industry, helped by plenty of young workers.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Israel disruption as strike and protests push for Gaza hostage deal",
        "description": "Tensions are running high over the government's failure to secure the release of hostages held by Hamas.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "From celebs and CEOS to sport stars and tech titans, find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire?Listen to season two. New episodes out on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "A £400m reunion? The potential risks and rewards of Oasis tour",
        "description": "After tickets for the band's reunion went on sale, many are asking: how much do the Gallaghers stand to make?",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "'A tech firm stole our voices - then cloned and sold them'",
        "description": "A voice over artist found out his voice had been taken when he heard a chatbot on a podcast using it.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "UK and EU airports are sticking with 100ml liquid rule - but why?",
        "description": "Air travellers who hoped the era of \"tiny toiletries\" was nearly over are facing fresh disappointment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Collapse after collapse - why Lagos buildings keep crashing down",
        "description": "These tragedies keep occurring in Nigeria's megacity, and yet no-one is ever held to account.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Musk's X banned in Brazil after disinformation row",
        "description": "The social media giant says it refused to comply with a judge's order to appoint a legal representative.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Telegram: 'The dark web in your pocket'",
        "description": "The arrest of Telegram’s chief executive in France has ignited a debate about moderation on his app.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Pontins says sorry to Travellers over discrimination",
        "description": "The apology is the first step in a company plan to tackle discrimination against Irish Travellers.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Post Office handles record amount of cash",
        "description": "The increasing use of the Post Office to handle cash comes as bank branch closures continue.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Workers' rights to four-day week could be strengthened",
        "description": "Employees could get greater powers to work their contracted hours over fewer days.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Toys R Us to return to city after six years",
        "description": "The new store will open as part of a wider UK relaunch of the toy shop.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "'We were fined £50 each over £3 extra train fare'",
        "description": "Ticket inspectors are urged to treat fare dodgers differently from people who make genuine mistakes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Mining boss opposes staff leaving office for coffee",
        "description": "Managing director of Mineral Resources Chris Ellison wants to \"hold staff captive all day long\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "£1bn spent housing homeless families in England",
        "description": "Councils spent more 50% more in the past year on housing families in temporary accommodation.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "Weekend strikes by LNER train drivers called off",
        "description": "Some 450 train drivers had been due to walk out this weekend before the dispute was resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "AI chip giant Nvidia shares fall despite record sales",
        "description": "The California-based technology giant has been one of the biggest beneficiaries of the AI boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-03T07:21:30.947178"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "'Why I cycled 1,500km to avoid a flight'",
        "description": "Looking for alternatives to flying, Matilda Welin decided to embark on a long-distance cycle from London to Sweden. Here's what she learned.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The flawed way we rank hurricanes",
        "description": "Scientists are racing to update the imperfect system we rely on to warn just how deadly a storm will be.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The deceptive power of a category 1 hurricane",
        "description": "Don't be lured into a false sense of security by a category one hurricane – storm surge and flooding mean they can be as dangerous as a category five.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "The tornadoes spinning over Europe’s waters",
        "description": "Spinning over water and land, these terrifying phenomena are more common than we might think",
        "source": "BBC Earth",
        "fetched_date": "2024-09-03T07:21:31.036609"
    },
    {
        "title": "Ketanji Brown Jackson Recalls Being Scene Partners With Matt Damon in Harvard Drama Class",
        "description": "Ketanji Brown Jackson and Matt Damon once shared the stage together — and she did better than he did. In an interview with CBS Sunday Morning, the Supreme Court justice recalled being in a drama class with the Oscar winner when they were both attending Harvard University. She explained that the two never did an […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Venice Diary Day 5: A Bicycle in the Gala Theatre, Harmony Korine’s Cigar and Late Night Libations on the Lido",
        "description": "A Bicycle in the Gala Theatre Saturday kicks off with an accredited guest casually attempting to enter the Sala Grande on a bicycle. Security immediately stops him, but he retorts: “But there’s so much unused space in the foyer.” Harmony Korine’s Lighted Cigar Harmony Korine shows up at his press conference for his delirious Baby […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Family Confirms Death of Israeli-American Hostage Hersh Goldberg-Polin",
        "description": "The family of Israeli-American hostage Hersh Goldberg-Polin announced the young man’s death early Sunday, ending a relentless campaign by his parents to rescue him that included meetings with world leaders and an address to the Democratic convention last month. Goldberg-Polin, 23, was seized by militants at a music festival in southern Israel on Oct. 7. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Telluride: ‘Nickel Boys,’ Adapted from Colson Whitehead’s Book, Will Challenge Oscar Voters",
        "description": "Nickel Boys, RaMell Ross’ big screen interpretation of Colson Whitehead’s Pulitzer Prize-winning book The Nickel Boys, had its world premiere at the Telluride Film Festival’s Herzog Theatre on Friday night. Reactions among attendees, including numerous Academy members, have been strongly divided — many were impressed and deeply moved by the film, while others were left […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Venice Diary Day 3: Sex and Controversy, A Pizza for Matteo, Diapers on the Red Carpet",
        "description": "Some Like it Hot (Some Don’t) Friday was supposed to be all about eroticism. Or so they say. Halina Reijn’s Babygirl centers around a middle-aged, successful woman who, married with children, embarks on an intense sexual relationship with a young intern. She jeopardizes her career and family, but everything resolves itself in the end. Nothing […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Missy Elliott, Questlove, Ludacris and More Remember Fatman Scoop: “His Impact Is Huge”",
        "description": "Missy Elliott, Questlove and Ludacris are some of the music legends to pay tribute to Fatman Scoop, the Grammy-winning DJ and hype man who died after collapsing during a performance on Friday. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing in Connecticut. His family announced his death on Saturday morning, but […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Fatman Scoop Dead After Collapsing Onstage: DJ Was 53",
        "description": "Fatman Scoop, the Grammy-winning DJ, hype man and radio personality, died after collapsing onstage this weekend. He was 53. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing at Town Center Park in Hamden, Connecticut, per video obtained by TMZ. His family announced his death on Saturday morning, but gave no cause. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Musical Acts Who’ve Called Out 2024 Trump Campaign for Illegal Use of Their Songs",
        "description": "Over the past nine or so years the same strange and uncomfortable moment has been experienced by some of our top recording artists. Presumably, this is felt and marks an experience reserved just for them because of their talents, and it seems that it would hit as a combination of feelings: sheer dread and stark […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Drew Barrymore on Why She Regrets “Chaste” ‘Playboy’ Photos: “Never Knew There Would Be an Internet”",
        "description": "Drew Barrymore is looking back at her Playboy cover nearly 30 years later, but now with a different pair of eyes since becoming a mother to two daughters. The actress opened up in a lengthy Instagram post on Friday, titled “PHONE HOME” (referencing her 1982 movie E.T. the Extra-Terrestrial), saying she wanted to “put myself out there […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Maren Morris Says Her Son Received Death Threats After She Called Out Morgan Wallen for Using Racial Slur",
        "description": "Maren Morris shares her son Hayes received death threats after she spoke out against Morgan Wallen for using a racial slur in 2021. While appearing on Thursday’s episode of Sophia Bush’s podcast Work in Progress, Morris said that the situation “as a young mother was obviously scary.” The Grammy-winning artist continued, “It wasn’t death threats […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Adnan Syed’s Murder Conviction Still Stands in ‘Serial’ Case as Court Orders New Hearing",
        "description": "Adnan Syed’s murder conviction still stands after Maryland’s highest court Friday ordered a redo of the hearing that freed him. The court ruled that the earlier proceeding violated the rights of the victim’s family, marking the latest development in a legal saga that gained widespread attention through the hit podcast Serial. The 4-3 ruling upheld […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Doctor in Matthew Perry Death Probe Set to Plead Guilty to Conspiracy to Distribute Ketamine Charge",
        "description": "Following an appearance in a Los Angeles federal court on Friday, one of the two California doctors indicted as part of the investigation into the overdose death of actor Matthew Perry is expected to plead guilty in the coming weeks to conspiring to distribute the surgical anesthetic ketamine, a Department of Justice official confirmed with […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-03T07:21:31.238095"
    },
    {
        "title": "Ziina banks $22M as growth explodes for the UAE-based fintech for small businesses",
        "description": "The Dubai-based startup, which now counts 50,000 retail and business customers in the UAE, has netted $22 million led by Altos Ventures.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Laptop-leasing startup Fleet wants to become the IT companion for small companies",
        "description": "Fleet is launching several software services on top of its hardware-as-a-service proposition, from device management to cybersecurity and insurance.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Payroll startup Cercli inks $4M to build the ‘Rippling for the Middle East and North Africa’",
        "description": "The potential of Cercli’s payroll platform has attracted investor interest, leading to $4 million in seed funding.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "‘Hospital at home’ startup Doccla raises $46 million for its European expansion",
        "description": "Hospitals around the world regularly face bed shortages — an issue that can get exacerbated to breaking point when a health scare or other large-scale disaster occurs. A startup called…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "BigEndian founders hope to use their deep chip experience to help establish India in semiconductors",
        "description": "India’s fabless semiconductor startup BigEndian has raised $3 million in a seed round led by Vertex Ventures SEA and India.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "SparkLabs closes $50M fund to back AI startups",
        "description": "SparkLabs — an early-stage venture capital firm that has made a name for itself for backing OpenAI as well as a host of other AI startups such as Vectara, Allganize,…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Accel, Docker and Redis will discuss what’s next in open source as a business model at TechCrunch Disrupt 2024",
        "description": "As companies grapple with the challenge of developing a sustainable business without sacrificing their core principles, open source has evolved from a niche approach to software development into the business…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Enhance your brand at TechCrunch Disrupt 2024 by hosting a Side Event",
        "description": "Whether it’s a sophisticated cocktail party, a casual happy hour, a niche meetup, or a skill-building workshop, “Disrupt Week” offers you the flexibility to host a Side Event that truly…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Students and recent grads: 5 days left to save on TechCrunch Disrupt 2024 tickets",
        "description": "Only 5 days remain to grab a $200 discount on Student Passes for TechCrunch Disrupt 2024. This special offer ends on September 6 at 11:59 p.m. PT. Don’t miss out!…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "A16z’s Joshua Lu says AI is already radically changing video games and Discord is the future",
        "description": "After joining the firm as an investor in 2022, Lu has seen how AI and new distribution platforms are changing the industry for the better.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Sign or veto: What’s next for California’s AI disaster bill, SB 1047?",
        "description": "The tech industry has responded with a resounding outcry against SB 1047.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "CrowdStrike faces onslaught of legal action from faulty software update",
        "description": "Even before Delta came forward, shareholders were looking for their pound of flesh, filing a class action lawsuit against CrowdStrike.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Want to branch out beyond Google? Here are some search engines worth checking out",
        "description": "If you have never considered a search engine beyond Google, you might be surprised to see what else is out there.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Customers of Indian crypto exchange WazirX unlikely to recover full funds",
        "description": "Customers of WazirX, the Indian cryptocurrency exchange that suffered a $234 million hack in July, are unlikely to recover their funds in full through the ongoing restructuring process, a company…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Validus, a Singapore-based digital SME lending platform, secures $50M debt financing to help enterprises in Indonesia",
        "description": "Validus, a Singapore-based digital lending platform for small and medium businesses, has secured $50 million in debt financing from HSBC under the ASEAN Growth Fund strategy. Validus will use the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Apple may ditch those old familiar USB-A ports in the new Mac mini",
        "description": "The Mac mini will be the next Apple device to say goodbye to USB-A, according to Bloomberg’s Mark Gurman. Apple customers have probably gotten used to seeing the familiar, rectangular…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "The case against AI art",
        "description": "No matter who powerful generative AI becomes, writer Ted Chiang says it will never create true art. Chiang is one of the most admired science fiction authors writing today, best…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Palantir’s CTO, and 13th employee, has become a secret weapon for Valley defense tech startups",
        "description": "Palantir CTO Shyam Sankar is determined to help Palantir become a driving force for defense tech startups.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "‘Emotion AI’ may be the next trend for business software, and that could be problematic",
        "description": "As businesses experiment with embedding AI everywhere, one area starting to gain more attention is Emotion AI.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Why do so many home robots still suck?",
        "description": "Home robots’ unfulfilled potential is neither because of lack of demand on the part of consumers nor lack of effort from manufacturers.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-03T07:21:31.374918"
    },
    {
        "title": "Ronaldo gets handsy in steamy scenes",
        "description": "Cristiano Ronaldo couldn’t help himself during some downtime with his glamorous girlfriend Georgina Rodriguez.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Club captaincy suits Socceroo",
        "description": "A Socceroo’s European career is on the rise after being made captain of his Belgian club.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Miracle return confirmed for Blues favourite",
        "description": "Just 180 days after he suffered a third ACL injury, Carlton will roll the dice and bring back Sam Docherty for an elimination final in Brisbane.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "‘Insulting’ detail of Bombers’ Stringer gamble",
        "description": "Essendon is reportedly “not budging” on its offer to Jake Stringer with new details emerging about a secret meeting behind the scenes.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Miracle return confirmed for Blues favourite",
        "description": "Just 180 days after he suffered a third ACL injury, Carlton will roll the dice and bring back Sam Docherty for an elimination final in Brisbane.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "‘Missed it’: Recalled Roo eager to please",
        "description": "A popular Socceroo has returned to the national team intent on playing a leading role helping Australia qualify for the 2026 FIFA World Cup.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "NRL teams: Fifita surgery, Broncos name Walsh amid carnage",
        "description": "The SuperCoach carnage continues with David Fifita the latest big gun to be ruled out of the final round, while the Broncos are dealing with their own big-name omissions. Every round 27 squad.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Cook prepares for emotional Souths farewell",
        "description": "Damien Cook always thought his last game for Souths would be his final match in the NRL, but things don’t always go to plan.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Aussies back in unlikely location",
        "description": "The packed cricket calendar has taken Australia to a new location for the first T20 since the World Cup with a raft of new faces set to play.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "‘Bazball’ opener No. 1 pick in BBL Draft",
        "description": "England opener Ben Duckett, a key member of the ‘Bazball’ set up, will join the Melbourne Stars for this summer’s Big Bash.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Popyrin concedes he ‘choked’ in push for first grand slam QF",
        "description": "America’s Frances Tiafoe has ended Alexei Popyrin’s chances at his first grand slam quarter final, with the Aussie conceding he ‘choked’ in a crucial game defining moment.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "‘Peeved’: Drama as de Minaur shows class",
        "description": "Alex de Minaur and Jordan Thompson were both hot under the collar after a dramatic moment in their US Open showdown.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "‘Was I a prick?’: Ricciardo apologises for race incident",
        "description": "Australian F1 star Daniel Ricciardo has reached out to Nico Hulkenberg to apologise for an opening lap incident that did damage to both their races.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Lewis Hamilton’s F1 replacement revealed",
        "description": "Mercedes have locked in their driver line up for the 2025 F1 season, with Lewis Hamilton’s replacement finally revealed.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Ronaldo gets handsy in steamy scenes",
        "description": "Cristiano Ronaldo couldn’t help himself during some downtime with his glamorous girlfriend Georgina Rodriguez.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Hero police officer breaks her silence",
        "description": "The police officer who shot dead the Bondi Westfield stabber has reflected on the tragedy after being honoured by the NRL.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "NFL star rookie shot over Rolex watch",
        "description": "Ricky Pearsall, a first-round draft pick by San Francisco, is in a serious but stable condition after being shot reportedly over a luxury watch.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Former AFL rookie wins NFL spot",
        "description": "There was a guarantee an Australian would be punting for the New Orleans Saints this NFL season and it was a former AFL draftee who took the spot.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Ronaldo gets handsy in steamy scenes",
        "description": "Cristiano Ronaldo couldn’t help himself during some downtime with his glamorous girlfriend Georgina Rodriguez.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Club captaincy suits Socceroo",
        "description": "A Socceroo’s European career is on the rise after being made captain of his Belgian club.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Goodman giving up mega payday to prep for Inoue",
        "description": "‘Mr Mandatory’ Sam Goodman isn’t taking any risks when it comes to his long-awaited world title shot. Even if it means giving up a spot on Tim Tszyu’s undercard.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Scott’s big Tiger call after Scheffler’s $80m stunner",
        "description": "Adam Scott played through the peak Tiger Woods era and says the dominance of Tour Championship winner Scottie Scheffler is pretty similar.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Cheapies watch list: Best SuperCoach NBL cash cows",
        "description": "Value players who can score above their price are the key to SuperCoach success. The gurus at the Basketball Blokes name the players to watch at every club.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "No flashbacks for Wallabies hero",
        "description": "Nearly two years after he fluffed a matchwinning kick against Italy, Ben Donaldson stepped up to the plate again and delivered for the Wallabies.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "History beckons for Wallabies great",
        "description": "The Wallabies are buzzing after ending a significant losing streak and there’s another historic milestone set to keep the good vibes rolling.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Melbourne Cup nominations: Record entries from Waller",
        "description": "A total of 123 horses have been nominated for the Melbourne Cup with champion trainer Chris Waller boasting an astonishing 21 entries. See the full list",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-09-03T07:21:32.405342"
    }
]