[
    {
        "title": "Trump moves to close down Voice of America",
        "description": "More than 1,300 staff placed on administrative leave as White House accuses VOA of being anti-Trump, \"radical\" and \"leftist\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Forever 21 files for bankruptcy in the US",
        "description": "US stores will remain open as Forever 21's operating company \"begins its process of \"winding down\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Musk says first mission to Mars will launch next year",
        "description": "The billionaire says an unmanned mission by his SpaceX \"Starship\" vehicle will be followed by human landings as early as 2029.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "It's not a competition! The collaborative video game loved by players",
        "description": "Josef Fares has found big success with co-operative two player games. Why aren't others doing the same?",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Forever 21 files for bankruptcy in the US",
        "description": "US stores will remain open as Forever 21's operating company \"begins its process of \"winding down\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Small electric cars were said to be the future – but SUVs now rule the road",
        "description": "Despite dire predictions of climate breakdown, more Sports Utility Vehicles are being spotted on, and off, the roads.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Are US tariffs bringing manufacturing back to Canada?",
        "description": "Canadian firms are having a growing conversation about the need for more homegrown production.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "US government shutdown averted as Senate passes spending bill",
        "description": "The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "The Japanese town turning cow manure into hydrogen",
        "description": "In Japan, a smelly waste product is being reimagined as a potential clean fuel of the future that is powering cars and tractors.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "The unexpected knock-on effect of Trump's minerals 'deal of the century'",
        "description": "The president once derided attempts to develop new green technology as a \"green new scam\" - but his deal could help boost the US's potential in the sector",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Clothes brand gets 100 complaints a day that models are 'too fat'",
        "description": "Snag clothing is cited in an online debate over whether adverts showing models who appear \"unhealthily fat\" should be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Germany is back, says Merz after historic spending deal",
        "description": "Germany's conservative leader clinches an major financial agreement ahead of a crunch vote in parliament.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Does cutting UK benefits work?",
        "description": "The government is to set out details of how it will save billions of pounds from the working welfare bill.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "How Britain's former top banker became Canada's prime minister",
        "description": "The former banker may not have been elected to office before, but his experience managing global economic crises will help.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Musk's Tesla raises concern over Trump tariffs",
        "description": "The electric carmaker’s warning about tariffs comes despite its boss's key position in the Trump administration.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Apple encrypted data row hearing begins in secret",
        "description": "The BBC - along with civil liberties groups and some US politicians - argue the case should be heard in public.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Gold price hits $3,000 as trade tensions mount",
        "description": "Demand for the precious metal has surged amid economic uncertainty over the impact of the global trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "UK economy shrank unexpectedly in January",
        "description": "A slowdown in manufacturing was one of the main reasons for the dip, the Office for National Statistics says.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Every McDonald's in UK warned over staff sexual abuse",
        "description": "The warning from the UK's equality watchdog comes after the \"extremely serious\" allegations uncovered by the BBC.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "The blunt-speaking Canadian taking his fight with Trump to Washington",
        "description": "Doug Ford meets Trump's top trade adviser as relations between the two countries hits a new low.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Car sharing switches to electric to boost appeal",
        "description": "Car sharing has not taken off, but will electric cars boost its appeal?",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Two judges order Trump administration to give fired workers their jobs back",
        "description": "The workers were laid off as part of the president's plan to scale back the size of the US government.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Trump threatens 200% tariff on alcohol from EU",
        "description": "Wine and spirits will be taxed, Trump says, if the EU does not remove tariffs on US whiskey.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "'Huawei lobbyists' held in Belgium raids over EU corruption",
        "description": "The prosecutor's office said it raided 21 addresses in Belgium, according to local media.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Donatella steps down as Versace creative director",
        "description": "Versace is facing a creative shift as Prada looks to potentially buy the Italian fashion house.",
        "source": "BBC Business",
        "fetched_date": "2025-03-17T07:25:54.228167"
    },
    {
        "title": "Playboi Carti’s New Album ‘Music’ Breaks Spotify Record",
        "description": "\"Carti’s MUSIC is already making history,\" the audio streaming giant wrote on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "President Trump Signs Order to Cut Staff at Voice of America",
        "description": "Other U.S. funded media organizations will be cut as well.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "PVRIS Releases 10-Year Anniversary Edition of Debut Album ‘White Noise’ Featuring Spiritbox’s Courtney LaPlante",
        "description": "Lynn Gunn, the band's frontwoman, is now touring the anniversary album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Metallica’s Robert Trujillo on New Apple Vision Pro Concert: “It’s Like You Can Almost Touch It”",
        "description": "The heavy metal legends released a new immersive concert on Friday on Apple's high-tech headset.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Marc Maron Calls Out Bill Maher for Agreeing With “Some of the Things That Trump Is Doing”",
        "description": "Maher, who hosts HBO's 'Real Time,' has called himself \"an old-school liberal\" for years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Who Will Be Handed Gene Hackman’s Estate Uncertain as Wills of Actor and Wife Are Revealed",
        "description": "The very private couple, who were found dead in their Santa Fe mansion in February, named each other as recipients of each other's wealth — with the actor not including his three kids.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Beyoncé, Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Bad Bunny, Blackpink, Katy Perry, Shakira and Ed Sheeran are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Louis C.K. Offers Tour Update After Two-Year Break From Stand-Up: “Happy to Be Lucky to Be Alive”",
        "description": "The Louis C.K. Ridiculous tour, which he describes as including a \"gargantuan amount of shows,\" kicks off April 17 and continues through 2026 with stops across the globe.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Kanye West Disses Kendrick Lamar Over Feature On New Playboi Carti Album",
        "description": "\"I don't like Kendrick Lamar's music,\" West tweeted after Carti dropped his new album on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Producer Joseph Di Palma Dies at 94",
        "description": "He also sponsored the syndicated program ‘Nightly Business Report’ for a decade and was behind a celebrity interview TV series.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Noah Cyrus Signs Management Deal With Range Music",
        "description": "Cyrus joins a roster at Range that includes Shaboozey, Jack Harlow and Saweetie.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Selena Gomez and Benny Blanco Release Sultry Single “Sunset Blvd”",
        "description": "The new track comes a week before the couple's upcoming collaborative album, 'I Said I Love You First.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-17T07:25:54.629029"
    },
    {
        "title": "Cornes hits back as fiery AFL feud erupts",
        "description": "Divisive media personality Kane Cornes has returned serve on a veteran journalist after he was torn to shreds on social media.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Storm star’s nervous wait ahead of GF rematch",
        "description": "The Storm’s hopes of unleashing Nelson Asofa-Solomona in the grand final rematch could hinge on whether he cops another ban after he was also forced to watch last year’s decider from the sidelines.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "‘Fearful for the game’: Ban divides AFL",
        "description": "Legends of the game have been left divided over the monster suspension handed down to a North Melbourne youngster.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Star’s dad puts heartless F1 boss to shame",
        "description": "A Red Bull rookie was in tears when his Australian GP ended in heartbreaking fashion, but his team boss had zero sympathy for the youngster.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Storm star’s nervous wait ahead of GF rematch",
        "description": "The Storm’s hopes of unleashing Nelson Asofa-Solomona in the grand final rematch could hinge on whether he cops another ban after he was also forced to watch last year’s decider from the sidelines.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Souths ramp up bid to sign Roosters star",
        "description": "Brandon Smith’s move from the Roosters to the Rabbitohs is gathering steam; however, South Sydney fans might have to wait longer than expected to get their man.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Cornes hits back as fiery AFL feud erupts",
        "description": "Divisive media personality Kane Cornes has returned serve on a veteran journalist after he was torn to shreds on social media.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Tassie AFL boss hits back at Macquarie Point doubters",
        "description": "Tasmania’s AFL arrival isn’t too far away, and with the club’s first birthday looming, chairman Grant O’Brien has been quick to shut down any suggestions their new home won’t be ready on time.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Batting miracle keeps final hopes alive",
        "description": "Bonus points could be the deciding factor in who faces South Australia in the Sheffield Shield final and a trio of Queenslanders helped their state rack up crucial ones.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Aussie Test star in Bradman zone",
        "description": "He notched up a massive 150 in Sri Lanka and amid the best batting form of his career, Test star Alex Carey has his eyes on a major prize.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Tennis loses it over teen’s savage ‘death note’",
        "description": "TV cameras have captured the brutal homework notes written by tennis’ newest teen phenom as she make made history against the world No. 1.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Tennis rocked by world No. 1’s putrid act",
        "description": "Tennis star Iga Swiatek has been booed by spectators after smashing a ball at a ball boy in an ugly act of sportsmanship.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "NRL great’s truth bomb for $13m blockbuster",
        "description": "Dylan Brown’s new $13 million NRL contract is the talk of rugby league, but there’s one part of the deal a legendary player isn’t a fan of.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Star’s dad puts heartless F1 boss to shame",
        "description": "A Red Bull rookie was in tears when his Australian GP ended in heartbreaking fashion, but his team boss had zero sympathy for the youngster.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Piastri dudded by ‘absolutely gutting’ call",
        "description": "The Australian Grand Prix turned into a nightmare for Oscar Piastri, and a McLaren team order has opened a can of worms.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "International manhunt for ex-Wallabies star",
        "description": "An international manhunt is underway after a former Wallabies captain was given a prison sentence while his location is unknown.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Wallabies star remains loyal to Reds",
        "description": "One of the world’s best flankers is staying with the Queensland Reds for another three years.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Australia’s highest paid athletes revealed",
        "description": "Some of Australia’s brighest young stars are set for some truly eyewatering paydays as the sporting rich list gets a whole new look.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "‘Honest’: Girlfriend defends ex-Socceroo",
        "description": "The former footballer’s girlfriend has taken the stand to give evidence in his rape trial, saying she didn’t believe he was capable of such a crime.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Latest blow leaves Ange fighting for life",
        "description": "Australian football coach Ange Postecoglou has ripped into his side after another defeat put his Tottenham future in serious doubt.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "UFC star’s embarrassing wardrobe blunder",
        "description": "UFC fighter Marvin Vettori infamously attended a photoshoot with his pants on backwards but Sunday’s wardrobe topped that.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Million-dollar mistakes cost Aussie gun",
        "description": "Min Woo Lee was leading the best players in the world and significant spoils were within his reach before the Aussie gun flailed with the world watching.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Tatum fumes as United pounce on Hawk’s injury to take game 3",
        "description": "It will go down as one of the great wins in Melbourne United history, but Illawarra coach Justin Tatum was left fuming after what he thought was the visitors preying on a Hawk’s injury.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Mitch Cohen’s Blackbook: Five to follow from Coolmore Classic day",
        "description": "Daily Telegraph racing expert Mitch Cohen has analysed all the action from Group 1 Coolmore Classic day at found a few horses worth following as we head deep into the Sydney Autumn Racing Carnival.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "Footy icon goes rogue at daughter’s wedding",
        "description": "AFL cult hero Billy Brownless was left “blubbering” at his daughter’s wedding with some of his “frightening” antics coming to light.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    },
    {
        "title": "14yo Sydney boy collapses during soccer, dies",
        "description": "A Sydney family has been left heartbroken after their 14-year-old son died suddenly after suffering a health event in the middle of a soccer match.",
        "source": "News AU",
        "fetched_date": "2025-03-17T07:25:55.921853"
    }
]