[
    {
        "title": "Stocks rise as investors await US presidential result",
        "description": "Investors are also focused on a US central bank rate decision and a key announcement on the Chinese economy.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Mystery fires were Russian 'test runs' to target cargo flights to US",
        "description": "The attacks targeted couriers in Poland, Germany and the UK, Polish prosecutors say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Elon Musk can keep giving $1m to voters, judge rules",
        "description": "The giveaway is not a lottery-like contest and the recipients are not chosen randomly, his lawyer said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Jantelagen: Why Swedes won't talk about wealth",
        "description": "In Sweden, a deep-rooted cultural code called Jantelagen stops many from talking about their wealth.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "French families sue TikTok over harmful content",
        "description": "The platform is accused of exposing seven children to videos promoting self-harm, and suicide.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Mystery fires were Russian 'test runs' to target cargo flights to US",
        "description": "The attacks targeted couriers in Poland, Germany and the UK, Polish prosecutors say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Netflix Europe offices raided in tax fraud probe",
        "description": "The raid is part of an investigation in France and the Netherlands that began in November 2022.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Shopping giant Temu removes copies of tiny firm's cards",
        "description": "A small business owner says identical versions of her products were copied without permission.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Boeing workers end 7-week strike on 38% pay rise deal",
        "description": "The damaging walkout by around 30,000 unionised Boeing workers started on 13 September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Elon Musk can keep giving $1m to voters, judge rules",
        "description": "The giveaway is not a lottery-like contest and the recipients are not chosen randomly, his lawyer said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Disinformation poses 'biggest risk in the US' - 5 Nov 2024",
        "description": "Global political risk expert says disinformation paired with a close outcome poses the biggest risk in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "US election bets surge, despite red flags and mixed record",
        "description": "Election bets have exploded in the US, as it barrels toward the polls next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "The environmental campaigners fighting against data centres",
        "description": "A growing global movement is seeing people object to data centres in their locality.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Hunt for Bitcoin's elusive creator hits another dead end",
        "description": "Why are we still no closer to unmasking the mysterious Satoshi Nakamoto?",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "'Lying talent agent left us in lurch without cash and hope'",
        "description": "A talent agent who supplied actors to shows on the BBC and Netflix withheld cash due to them, former clients claim.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "DNA-testing site 23andMe fights for survival",
        "description": "Once used by millions to discover their family histories, this week 23andMe was almost delisted. What went wrong?",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Weight-loss drug firm Wegovy invested £6bn in this town. So why is it not booming?",
        "description": "Europe's most valuable company has invested billions in Kalundborg on Denmark's coast - but it has many problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Living with Nigeria's blackouts - six weeks, no power",
        "description": "Large parts of Nigeria are experiencing power outages due to problems with the country's grid.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "US jobs growth slows sharply as election looms",
        "description": "Employers added 12,000 jobs in October, much lower than the 223,000 created in September, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Russia fines Google more money than there is in entire world",
        "description": "The mind-boggling figure has been levied due to the company restricting Russian state media on YouTube.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Investors' reaction to Budget 'very different' to Truss",
        "description": "Treasury secretary speaks out to reassure the markets after a rise in the cost of government borrowing.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "Canada has launched a tourist drive but will tensions with China doom it to fail?",
        "source": "BBC Business",
        "fetched_date": "2024-11-06T07:22:49.265276"
    },
    {
        "title": "Anne Hathaway Invokes Sabrina Carpenter, Asks Students to “Please Please Please” Stay in Line to Vote",
        "description": "\"Please, please, please stay on the line,\" sings to the tune of Carpenter's hit song. \"Voting is magic but also annoying.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Sabrina Carpenter Registered More Voters Than Any Other Artist Ahead of the 2024 Election",
        "description": "The artist has registered 35,814 voters, with an additional 263,087 voters engaged outside of registering.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Paul Rudd Hands Out Water to Voters Waiting in Line in Pennsylvania",
        "description": "\"It’s a wonderful thing that all these young people are out voting,\" Rudd said on an MSNBC broadcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "On Election Night, TV News Promises More Transparency. Will Viewers Care?",
        "description": "Wary of the drawn out 2020 election and the infamous early call for Arizona, channels want to explain to audiences how and why they are making calls.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Election Polls Are Increasingly Useless. Can We Get Rid of Them?",
        "description": "Presidential election polls are increasingly inaccurate, make the media look bad and stress everybody out. So do we really need hundreds of them before Election Day?",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Fox News to Pull Back Curtain on How It Makes Election Day State Calls",
        "description": "\"We're watching the news as it unfolds, we understand the importance of just pacing things for the viewers and taking them through it step by step,\" Martha MacCallum says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "AFM Kicks Off Amid Election Day Angst: “There’s Going to Be A Lot of Jitters”",
        "description": "The election is top of mind as dealmakers descend on Las Vegas, with anxiety about Trump's return: \"This is a man who unabashedly talks about vengeance, and Hollywood has not been kind to him.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Jimmy Kimmel Makes “Closing Argument” Ahead of 2024 Election: “Imagine a World in Which No One Says ‘Donald’ or ‘Trump'”",
        "description": "The ABC late-night host, who compared the anxiety around finding out who would be the next president to \"waiting to get the results of a biopsy,\" told viewers, \"Let’s remove this cancerous polyp from our collective national colon and move on already. And don’t forget to vote!\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Lady Gaga, Jon Bon Jovi, Katy Perry and More Perform at Kamala Harris Election Eve Concert",
        "description": "Gaga was joined byDJ Cassidy, Cedric the Entertainer, Fat Joe, Oprah Winfrey, will.i.am and more the night before Election Day in a get-out-the-vote final push from the Democratic campaign.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Celebratory Election Night Watch Parties on Ice as Anxiety and Action Sweeps Through Hollywood: “Mentally Preparing Myself for the Worst”",
        "description": "Two trends are emerging in Hollywood as the 2024 election winds down to its final hours: Hunkering down at home or hunting down every last vote as anxiety meets action in the race for the White House.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Seth Meyers’ Election ‘Closer Look’ Laments Tied Polls: “Trump Is Not Being Subtle About the Threat He Poses”",
        "description": "In his final episode before Tuesday's presidential election, the 'Late Night' host offered an summary of Trump's many blunders and lamented the tied polls.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Joe Rogan Endorses Donald Trump for President",
        "description": "The podcaster made the decision after recording an episode with Elon Musk.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-06T07:22:49.623247"
    },
    {
        "title": "Superstar goes nuclear on NBA reporter",
        "description": "An NBA superstar has been handed a three-game ban after a “physical” change room altercation over a reporter’s column.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Sydney stars still sidelined",
        "description": "Two of Sydney FC’s best players will again be absent when the Sky Blues host Japanese club Sanfrecce Hiroshima on Thursday night.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "‘Upsetting’: Raygun’s big Olympics call",
        "description": "Raygun has made a big call after her 2024 Olympics performance went viral, revealing she “didn’t have any control over how people saw (her)”.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "AFLW will ‘double down’ on fixture strategy",
        "description": "A controversial aspect of the AFLW schedule is here to remain – despite players and former coaches voicing their concerns.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "AFLW will ‘double down’ on fixture strategy",
        "description": "A controversial aspect of the AFLW schedule is here to remain – despite players and former coaches voicing their concerns.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "‘Dazzling spectacle’: AFLW makes GF move",
        "description": "The AFLW is overhauling the end of the finals series in a shift that the league says will help grow the game to new audiences.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Brigginshaw names her Jillaroos successor",
        "description": "Ali Brigginshaw learnt off the very best when she played alongside the legendary Karyn Murphy. Now she’s picked her likely successor for when she eventually retires.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Jillaroos rookie’s rapid recovery from injury",
        "description": "Olivia Higgins dislocated her wrist less than two weeks ago, but she’s ready to rip in for the Jillaroos after waiting years for her moment.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Warner: ’Squashed it as fast as they could’",
        "description": "David Warner has weighed in on a ball tampering controversy that engulfed India’s first tour match ahead of the Test summer.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Australia’s surprise choice as T20 skipper",
        "description": "Australian selectors have gone for a left-field choice to lead the team for the upcoming T20 series against Pakistan.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Demon ends 20-year drought with ‘incredible’ feat",
        "description": "Alex de Minaur has pulled out of an ATP Tour event after learning he will end an Australian drought that has stood since Lleyton Hewitt.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Australian No. 1 puts kids first in Tennis Australia initiative",
        "description": "The Demon is laying the foundation for the future of Aussie tennis, with the world No. 8 putting his time and effort into the next generation. Find out how he is helping our rising stars.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Hamilton’s three-word response says it all",
        "description": "A wide range of F1 drivers responded to Max Verstappen’s latest Grand Prix win that virtually sewed up this year’s world title.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Verstappen fuels rumour of bombshell move",
        "description": "Max Verstappen has thrown his weight behind a relatively unknown rookie who he believes can help steer a failing team out of the rubble.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "MJ responds as US election claim goes viral",
        "description": "Basketball icon Michael Jordan has been forced to shut down a wild rumour ahead of the US election on Wednesday.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Anger at $500 Welcome to Country, beach fee",
        "description": "Members of a surf club in a small town in northern NSW are angry after being forced to pay a fee for Welcome to Country ceremonies.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Superstar goes nuclear on NBA reporter",
        "description": "An NBA superstar has been handed a three-game ban after a “physical” change room altercation over a reporter’s column.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "$283m star erupts over ‘dead brother’ swipe",
        "description": "NBA superstar Joel Embiid has reportedly shoved a reporter in heated scene in the change rooms over an ugly swipe.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Sydney stars still sidelined",
        "description": "Two of Sydney FC’s best players will again be absent when the Sky Blues host Japanese club Sanfrecce Hiroshima on Thursday night.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Mariners buoyed by Champions League result",
        "description": "The Mariners believe they can build on their AFC Champions League Elite performance against Chinese Super League club Shanghai Shenhua.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "‘Unbelievable’: Terrifying Tyson video stuns",
        "description": "Mike Tyson looks like he’s 25 years old again with new footage showing even his own trainers are in disbelief watching the former world champ.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Smith in ‘good spot’ after Qld PGA",
        "description": "Despite a frustrating final round at the Queensland PGA, Cam Smith is pleased with the way his golf is trending.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Superstar goes nuclear on NBA reporter",
        "description": "An NBA superstar has been handed a three-game ban after a “physical” change room altercation over a reporter’s column.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Skelton seeks World Cup redemption",
        "description": "Will Skelton still feels the pain of the Wallabies’ poor 2023 Rugby World Cup campaign.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Kerevi’s promise ahead of Wallabies return",
        "description": "Samu Kerevi hasn’t played much rugby lately, but he’s determined to prove his critics wrong as he brings up a major milestone on the spring tour.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "How lucky mum of two landed $3.2m Melbourne Cup windfall",
        "description": "A Victorian mother of two has revealed how she picked the first four in the Melbourne Cup, which delivered a life-changing $3.2m payout.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-06T07:22:50.759830"
    }
]