[
    {
        "title": "Australians get 'right to disconnect' after hours",
        "description": "A new law has come into effect that allows employees to ignore communications from employers after hours.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Telegram says arrested CEO Durov has 'nothing to hide'",
        "description": "Telegram says it is \"absurd\" to claim a platform or its owner is responsible for abuse of that platform.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Astronauts to return on SpaceX flight after eight months stranded",
        "description": "Sunita Williams and Barry Wilmore were supposed to be on an eight-day mission, but will not return to Earth until 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Ex-Boeing staff claims electrical faults 'concealed'",
        "description": "A campaign group has accused Boeing of concealing information about electrical problems on a plane.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "TikTok blamed for hit to Iceland cucumber supply",
        "description": "One supermarket says demand has more than doubled, after viral videos promote unique recipes.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Telegram says arrested CEO Durov has 'nothing to hide'",
        "description": "Telegram says it is \"absurd\" to claim a platform or its owner is responsible for abuse of that platform.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Blockbuster Chinese video game tried to police players - and divided the internet",
        "description": "The hugely popular Black Myth: Wukong has attracted some press for the wrong reasons.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Have supermarkets in UK reached peak self-scan?",
        "description": "Supermarkets are beginning to question the divisive technology after years of criticism from shoppers.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Babe Ruth 'called shot' jersey sells for record £18.1m",
        "description": "Babe Ruth's jersey when he 'called the shot' during the 1932 World Series sells for record £18.1m at auction.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Astronauts to return on SpaceX flight after eight months stranded",
        "description": "Sunita Williams and Barry Wilmore were supposed to be on an eight-day mission, but will not return to Earth until 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Olympic legend Lindsey Vonn explains the mindset of a winner",
        "description": "The decorated US downhill skier opens up to Katty Kay about the mental state that led her to gold medal victory and the \"hole\" that's left when her mind isn't on winning anymore.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Should you have to pay for online privacy?",
        "description": "Some websites have started introducing paywalls which can be lifted with data rather than cash.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Indiana Jones-inspired man finds 748 historic coins",
        "description": "The coins are expected to fetch £75,000 at auction next month.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "US accuses software firm of driving rent hikes",
        "description": "The US has sued software firm RealPage, accusing it of allowing landlords to co-ordinate on pricing.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Canadian rail workers begin returning to work as stoppage partially ends",
        "description": "Workers at one of Canada's two main railways resume work on Friday, partially ending a lockout after government intervention.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Time has come for interest rate cut, says Fed chair",
        "description": "The remarks signal a new fight for the US central bank, after two years battling inflation.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Bolt acts to halt Nigeria-South Africa 'taxi-war'",
        "description": "People were booking and then cancelling rides in the other country as a prank.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Defence firms 'need reassuring' that big orders will be long-term",
        "description": "Western military production has ramped up due to Ukraine, but will it continue after the war ends?",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Fish and chips price rise tops UK takeaways",
        "description": "The deep fried delicacy has seen the biggest price increase of some of the UK’s most popular takeaways, according to new figures.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Charities fear double energy price hit for pensioners",
        "description": "Rising energy prices and the withdrawal of financial support will hit some hard, charities say.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Royal Mail fails to meet spring delivery targets",
        "description": "Royal Mail delivered less than 80% of first class post on time between April and the end of June.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Typical household energy bill up £149 a year in October",
        "description": "Energy regulator Ofgem announces price changes for 27 million households in England, Wales and Scotland.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Shein reveals child labour cases at suppliers",
        "description": "The Chinese fast fashion giant has been tightening scrutiny of firms that make the clothes it sells.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Starbucks' new boss under fire for 1,000-mile commute",
        "description": "Job offer which allows new boss to commute to and from work on corporate jet sparked criticism.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Plan to hike UK windfall tax sparks energy jobs warning",
        "description": "Firms across the supply chain to the oil and gas industry have warned that official plans threaten investment.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "Child benefit claims rise after income rule change",
        "description": "The number of new claims rose in April, after a rule change on how much parents can earn and still be eligible.",
        "source": "BBC Business",
        "fetched_date": "2024-08-26T07:21:21.655817"
    },
    {
        "title": "'In the midnight sun, slaloming through icebergs' - brothers on perilous Arctic voyage",
        "description": "Isak and Alex Rockström face freezing waters and icebergs as they sail the perilous Northwest Passage.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "The deceptive power of a category 1 hurricane",
        "description": "Don't be lured into a false sense of security by a category one hurricane – storm surge and flooding mean they can be as dangerous as a category five.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "A visit to one of Antarctica's stunning penguin colonies",
        "description": "Marc Cieslak finds out how gentoo penguins are adapting to a warming climate.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Homes in Wales have the most bins in the UK",
        "description": "Residents in Blaenau Gwent, Merthyr Tydfil and Neath Port Talbot are among those with the most waste to sort.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Berkshire's Big Picture: Monday's image of the county",
        "description": "Showcasing the best images sent to us from around Berkshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Dorset's Big Picture: Monday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Chalk stream project supported with £350k grant",
        "description": "The Not Bourne Yesterday project aims to conserve the rare rivers' environmental and cultural heritage.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Oxfordshire's Big Picture: Monday's image of the county",
        "description": "Showcasing the best images sent to us from around Oxfordshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Hampshire & Isle of Wight: Monday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "City recycles more than 2.3 million coffee pods",
        "description": "About 3,500 Oxford households contribute to the recycling of millions of used coffee pods.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Dorset's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "Hampshire & Isle of Wight: Sunday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-26T07:21:21.724161"
    },
    {
        "title": "‘We’re Here’ Star Queen Priyanka on Process of Making New Album ‘Devastatia,’ Upcoming Tour",
        "description": "Queen Priyanka, the inaugural winner of Canada’s Drag Race, has released a new album, Devastatia. The We’re Here star has been working hard at creating the hyper-pop album, which opens with a catchy and self-confident anthem, “I’m a Star,” that features the drag queen turned pop star telling the listener: “You are good enough / […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Chris Hemsworth Surprises 70,000 Fans in Romania Playing Drums at Ed Sheeran Concert",
        "description": "Nearly 70,000 fans inside Bucharest, Romania’s National Arena, got the surprise of a lifetime during a stop on Ed Sheeran’s The +–=÷× Tour (aka The Mathematics Tour) on Saturday night. Yes, that was Chris Hemsworth playing the drums on the track “Thinking Out Loud.” The unique moment, a first for Hemsworth, was captured for an […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Sally Field Says She Returned to Social Media Because of Kamala Harris’ Presidential Bid: “Hope Is Here”",
        "description": "Sally Field has returned to social media, thanks to Kamala Harris’ presidential bid. The Oscar-winning actress posted two separate posts on her Instagram, sharing that she is back on the platform following Harris running for president alongside Tim Walz as her vice president nominee. “I’ve not been on social media. Not since it became public […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Chappell Roan Says She’s “Scared and Tired” of Fans Trying to Normalize “Predatory Behavior”",
        "description": "Chappell Roan is addressing the ongoing concerning behavior she’s experienced from people who claim to be her fans. The “Good Luck, Babe!” singer, who climbed her way to fame within the past year, took to Instagram on Friday to share a lengthy note, pleading for people to “stop touching me,” “stop being weird to my […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Bill Maher Is Confused Why Charli XCX Labeled Kamala Harris “Brat”: “It Sounds Like Trump”",
        "description": "Bill Maher has realized he’s behind on current internet slang, namely “Brat Summer,” after being on a month-long hiatus from Real Time. While chatting with CNN anchor Kaitlan Collins on Friday’s episode, the host attempted to understand the viral phenomenon — which started after Charli XCX dropped her latest studio album titled Brat in June — that’s […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Girl Group KATSEYE Is Ready to Do It Their Own Way",
        "description": "Last year, K-pop giant Hybe and Geffen Records announced the six members selected to be part of their first global girl group KATSEYE. Billed as an international group, with final members hailing from America, the Philippines, South Korea and Switzerland, the group was created using K-pop artist development methodologies through the audition program The Debut: […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Cheryl Hines’ Enthusiasm for Donald Trump Could Not Be More Curbed",
        "description": "Cheryl Hines, who shot to fame playing the beleaguered wife of Larry David on Curb Your Enthusiasm, has faced her share of real-life headaches as the wife of Robert F. Kennedy Jr. But the actress is about to face her biggest challenge yet as her husband suspends his independent campaign for president and throws his […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "RFK Jr. Ends Campaign, Backs Trump as Wife Cheryl Hines Says “All Parties Are Truly Good People”",
        "description": "Robert F. Kennedy Jr. has called off his long-shot presidential campaign and has thrown his support behind Republican presidential nominee Donald Trump. The move is a stunning bit of political calculus from a scion of America’s most storied Democratic dynasty. Teased earlier this week by the candidate and his running mate, Nicole Shanahan, the news […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Would a Taylor Swift Endorsement Actually Impact the Presidential Race?",
        "description": "Bad blood appears to abound between supporters for Vice President Kamala Harris and former President Donald Trump heading into November’s tight presidential election. While both sides have enlisted varying degrees of star power at their respective national conventions, there appears to be one figure whose endorsement the two candidates seemingly covet: Taylor Swift. Trump took […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Ronda Rousey Apologizes for 2013 Sandy Hook Tweet: “I Should Have Been Canceled”",
        "description": "Ronda Rousey has apologized for her 2013 tweet about the Sandy Hook Elementary School shooting. The former MMA fighter shared a statement on social media, expressing her regret over sharing a conspiracy theory video that suggested that the shooting had been staged. “I can’t say how many times I’ve redrafted this apology over the last […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Nicole Avant Reflects on Resilience and Coping with Loss: “No One Is Exempt”",
        "description": "Nicole Avant spent much of her childhood summers in holiday enclaves like Oak Bluffs in Martha’s Vineyard and Sag Harbor in Long Island, vacation havens created by the Black middle-class elites as they were often denied entry elsewhere. “My parents took me there, and it was great for me growing up to see Black doctors, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Kamala Harris Is Campaigning as a Prosecutor. Popular Entertainment Has Long Favored Their Antagonist.",
        "description": "As she accepted the Democratic nomination Thursday night, Kamala Harris played up her attorney-general past. “As a prosecutor, when I had a case, I charged it not in the name of the victim, but in the name of the people,” she told the United Center crowd. This follows a strategy she has pursued since ramping up […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-26T07:21:21.854146"
    },
    {
        "title": "Loft Orbital forms joint venture with UAE-based firm to scale satellite production in the Middle East",
        "description": "A holding company affiliated with an Emirati royal family is injecting a new joint venture between Abu Dhabi-based Marlan Space and startup Loft Orbital with over $100 million to grow…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "In 2024, it really is better to run a startup in San Francisco, according to data and founders who’ve relocated",
        "description": "San Francisco’s AI startup boom is so big, even international founders who don’t run AI startups are relocating there to help their companies grow, according to several founders who recently…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Y Combinator backs its first defense startup, Ares Industries",
        "description": "The first defense startup to receive backing from Y Combinator, Ares Industries, launched earlier this week. In a post on the YC website, the startup outlined a vision to build…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Telegram founder Pavel Durov arrested in France",
        "description": "Pavel Durov, founder and CEO of messaging app Telegram, was arrested on Saturday evening while leaving his private jet at France’s Le Bourget airport, as initially reported by French television…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "The Port of Seattle and Sea-Tac Airport say they’ve been hit by ‘possible cyberattack’",
        "description": "The Port of Seattle, which also operates the Seattle-Tacoma International Airport, said it was hit with a “possible cyberattack” that appeared to affect websites and phone systems. The port first…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Travly lets travelers submit videos for a chance to earn a 5% commission from hotel bookings",
        "description": "Travly is a new social-first discovery and hotel booking platform designed to cater to the growing number of travelers who rely on short-form video content for trip ideas.  The platform…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Stephen Wolfram thinks we need philosophers working on big questions around AI",
        "description": "As AI developers and others start to think more deeply about how computers and people intersect, Stephan Wolfram says it is becoming a much more of a philosophical exercise",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "The 12 biggest take-private PE acquisitions so far this year in tech",
        "description": "A roundup of the year’s billion-dollar take-private deals in the technology sector.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "TPG nears $150M funding in India’s Eruditus at $2.3B valuation",
        "description": "Eruditus, an Indian edtech startup, is in advanced stages of talks to secure about $150 million in new funding, two sources familiar with the matter told TechCrunch, in what would…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Apple reportedly announcing iPhone 16 lineup and more on Sept. 10",
        "description": "Apple will be unveiling new products on September 10, with the announced phones going on sale on September 20, according to a report from Bloomberg’s Mark Gurman. That lineup will…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "The fallout after Bolt’s aggressive fundraising attempt has been wild",
        "description": "After fintech Bolt surprised the industry with a leaked term sheet that revealed it is trying to raise at a $14 billion valuation, things got weird.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Starliner will return to Earth uncrewed, astronauts staying on ISS until February",
        "description": "Boeing’s Starliner mission is coming back to Earth — empty. After months of data analysis and internal deliberation, NASA leadership announced today that Starliner will be coming back to Earth…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Do you know where your children are? Maybe on X",
        "description": "A surprising number of “iPad kids” — aka Generation Alpha’s 7- to 9-year-old demographic — are using X, according to new data from parental control software maker Qustodio. The firm…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Google just made a $250M deal with California to support journalism — here’s what it means",
        "description": "This week, Google joined a $250 million deal with the state of California to support California newsrooms. While the deal offers a much-needed cash infusion for an industry that’s seen…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "X shareholders as of June 2023 included funds tied to Bill Ackman, Binance, and Sean ‘Diddy’ Combs",
        "description": "A court order recently forced Elon Musk’s X to reveal its full list of shareholders, as of June 2023, to the public. Many of the recognizable tech industry names had…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "VCs are so eager for AI startups, they’re buying into each others’ SPVs at high prices",
        "description": "VCs are increasingly buying shares of late-stage startups on the secondary market as they try to get pieces of the hottest ones — especially AI companies. But they are also increasingly doing so through financial instruments called special purpose vehicles (SVPs). Some of those SPVs are becoming such hot commodities…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "The top AI deals in Europe this year",
        "description": "Cumulatively, there have been more than 1,700 funding rounds for AI startups in Europe so far in 2024.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "The founder building a wealth-management product her grandmother would have loved",
        "description": "After two years of building the company, the company quietly launched its beta in June and is officially announcing it today, right here, in TechCrunch.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "These 74 robotics companies are hiring",
        "description": "From the looks of things, companies in the category — including Agility Robotics and Formlogic — can’t hire quickly enough.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "TechCrunch Minute: Tech billionaires want to build a utopian city in California",
        "description": "A crew of tech billionaires have been trying to get the California Forever project off the ground, which would create a new, supposedly utopian city…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-26T07:21:22.004084"
    },
    {
        "title": "Bombers boot son of a legend",
        "description": "Two days after their season finished in disappointment Essendon have started shedding players including the son of a club legend.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Earned the right’: Storm defend resting plan",
        "description": "Team list Tuesday will look very different for the Storm this week, but one club veteran has confirmed he won’t be rested and will travel to Townsville to face the Cowboys.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Official dropped, Bunker faces ‘major review’",
        "description": "NRL powerbrokers have promised major reviews of the NRL’s football department following the Bunker’s weekend from hell.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Micky Hatton’s back’: Boxing villain reopens ugly Tszyu wound with infamous sledge",
        "description": "Michael Zerafa went there, again. Three years after delivering a jab that infuriated Tim Tszyu, he’s referenced the most painful memory in the proud Aussie boxing family’s history.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Bombers boot son of a legend",
        "description": "Two days after their season finished in disappointment Essendon have started shedding players including the son of a club legend.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Coleman winner’s extra special achievement",
        "description": "After being crowned Coleman medallist for the first time, there was something much simpler Jesse Hogan was super proud of.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Earned the right’: Storm defend resting plan",
        "description": "Team list Tuesday will look very different for the Storm this week, but one club veteran has confirmed he won’t be rested and will travel to Townsville to face the Cowboys.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Bunker official to pay price for blunder",
        "description": "The Bunker official who failed to send Stephen Crichton to the sin bin is set to be dropped this weekend as the NRL revealed an alarming trend ahead of the finals.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Star’s snubbing leaves Aussie captain ‘disappointed’",
        "description": "One of Australia’s top female cricketers won’t be going to the T20 Women’s World Cup.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Fan holding four pints takes a screamer",
        "description": "Watch as an England cricket fan pulls off the catch of the day with “four pints in hand”, leaving commentators stunned.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Federer’s iconic tennis coach dead at 59",
        "description": "The tennis world has paid tribute after the man who coached Swiss maestro Roger Federer to his first Wimbledon title died.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Aussies in 46-year US Open first",
        "description": "It’s been nearly half a century since there were as many Australians in the main draw of the US Open as there are now, with two seeded men leading the charge.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Star’s message pours fuel all over F1 feud",
        "description": "A Formula 1 star has poured fuel all over his ongoing feud with a rival as their championship battle looks set to go down to the wire.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Damning admission as F1 blown wide open",
        "description": "Red Bull’s run of dominance in F1 is crumbling around them as the team boss made a startling admission over one of their rivals.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Influencers go to war in heated feud",
        "description": "Two sporting social media influencers are engaged in an ugly online spat after one called out the other for stealing her content.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Should be cancelled’: Star’s shock admission",
        "description": "Former UFC and WWE star Ronda Rousey has delivered a stunning admission after sharing a conspiracy theory video online.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Sleazy’: Hawk Tuah girl’s latest act slammed",
        "description": "A legendary US sports broadcaster has savaged the Hawk Tuah girl after the viral star continued to milk her “15 minutes of fame”.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Patty Mills’ $5m NBA lifeline revealed",
        "description": "A standout Olympic performance from Patty Mills’ has seemingly landed the 36-year-old Aussie another lifeline to stay in the NBA.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Socceroos taste defeat in Bundesliga",
        "description": "It wasn’t the start to their German Bundesliga careers that a pair of Socceroos were hoping for.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Brazilian coup ‘on par’ with Del Piero feat",
        "description": "The A-League’s profile is set to grow following Sydney FC’s signing of a Brazilian star rated “on par” with one of the competition’s greats.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "‘Micky Hatton’s back’: Boxing villain reopens ugly Tszyu wound with infamous sledge",
        "description": "Michael Zerafa went there, again. Three years after delivering a jab that infuriated Tim Tszyu, he’s referenced the most painful memory in the proud Aussie boxing family’s history.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Playoffs heartbreak for Scott in $5m miss",
        "description": "Adam Scott’s four-year winning drought on the PGA Tour continued after an agonisingly close run in Colorado, but he still achieved a major goal.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "First SuperCoach NBL winner reveals secrets to success",
        "description": "Australia’s best fantasy basketball coach, SuperCoach NBL champion David van der Giessen, reveals how he did it – and some tips for this year.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Folau‘s bombshell claims on viral post",
        "description": "Israel Folau has opened up about the social media post that ended his Wallabies career, slamming the media and calling his treatment “unfair”.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Wallaby keen to build on ‘bittersweet’ comeback",
        "description": "Having finally made his return from injury, a Wallabies prop wants to take his game to the next level on Australia’s tour of Argentina.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Racing NSW’s Newmarket dream: 1000-horse training facility planned",
        "description": "Racing NSW has reiterated plans to develop a major Sydney training centre similar to England’s famous Newmarket complex as part of its draft strategic plan, released today.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-08-26T07:21:23.474624"
    }
]