[
    {
        "title": "Airbnb offers private chefs and massages as it revamps app",
        "description": "The short rental firm says it is aiming to offer a wider range of experiences for travellers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Trump pledges to lift Syria sanctions as he seals $142bn arms deal on Saudi visit",
        "description": "The US president gets a \"lavender-carpet\" reception on a whirlwind visit of Gulf countries mainly focused on shoring up investment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "'I can get my Christmas tree order' - firms give sigh of relief at tariff truce",
        "description": "Businesses are moving ahead with shipments, as the deal to reduce tariffs raises hopes over the economic outlook.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Nissan to cut 11,000 more jobs and shut seven factories",
        "description": "The planned layoffs mean the Japanese carmaker has now cut about 15% of its workforce in the past year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Trump pledges to lift Syria sanctions as he seals $142bn arms deal on Saudi visit",
        "description": "The US president gets a \"lavender-carpet\" reception on a whirlwind visit of Gulf countries mainly focused on shoring up investment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Is the US finally on track to build a high-speed rail network?",
        "description": "The US currently has no high-speed rail services, but two are under construction, and more planned.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "How can traditional British TV survive the US streaming giants?",
        "description": "Senior figures in the UK TV industry are contemplating how best to secure its future",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Canada's Carney unveils cabinet of familiar and fresh faces amid US trade war",
        "description": "Prime Minister Mark Carney's cabinet reshuffle includes changes to the core team overseeing the fraught US-Canada relationship.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Trump heads to Saudi Arabia eyeing more investment in US",
        "description": "As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "US and China are ready to talk tariffs - who will blink first?",
        "description": "The BBC's journalists in Washington DC and Singapore analyse US and China's moves ahead of the negotiation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu",
        "description": "Chinese online retailers had previously relied on the \"de minimis\" loophole to ship low-value items to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "M&S says customer data stolen in cyber attack",
        "description": "The retail giant is still not taking online orders following a cyber attack three weeks ago.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Trump's order on US drug prices: What's in it, and will it work?",
        "description": "The president promises sweeping price cuts \"almost immediately\", but experts say these are unlikely.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "UK jobs market continues to weaken",
        "description": "The number of workers on payrolls fell in the first three months of the year, official figures show.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Gold is booming - but investors lured in by the hype could lose out, warn experts",
        "description": "Trade wars and volatile markets have contributed to a gold rush, but investors shouldn't put all their eggs in this one basket, warn experts",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Fishing shouldn't block defence pact, says EU chief",
        "description": "The EU's foreign policy chief says talks over future fishing access should not block a defence deal.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Markets rise as US and China agree to slash tariffs",
        "description": "Shares jump as markets welcome news of a major de-escalation of the trade conflict between the two nations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "What does the US-China tariff deal mean?",
        "description": "The agreement marks a major de-escalation of the trade war between the world's two biggest economies.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Analysis: US and China step back from beyond brink",
        "description": "It is not an end to the trade war, but it is a significant truce, writes the BBC's economics editor.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "China has come to the table - but this fight is far from over",
        "description": "Beijing can claim its defiance has delivered a battle victory in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Trump defends plan to use Qatari luxury jet for Air Force One",
        "description": "Trump says he'd be \"stupid\" to not accept the aircraft \"free of charge\", after Qatar denied it amounted to a gift.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Along the Canada border, small-town America feels sting of Trump's trade war",
        "description": "Since the trade war began, crossings between the US and Canada are down some 17%. What has that cost towns such as Port Huron and Michigan?",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "The US and China are finally talking. Why now?",
        "description": "Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "Kwik Fit founder Sir Tom Farmer dies aged 84",
        "description": "The Edinburgh-born businessman built the firm into a £1bn business and also owned Hibernian FC.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "'I freaked out and spent $400 online': US consumers on cheap shipping changes",
        "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-14T07:26:58.693430"
    },
    {
        "title": "The Hollywood Reporter Lands 58 SoCal Journalism Noms, Including Best Website and Three Journalist of the Year Finalists",
        "description": "Gary Baum and James Hibberd are vying for two of the biggest awards, which will be handed out at a June 22 gala.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Christina Jennings to Receive The Hollywood Reporter’s Women in Entertainment Canada Honor",
        "description": "The founder and president of Shaftesbury, producer of ‘Murdoch Mysteries’ and ‘Hudson & Rex,' will pick up the Glass Ceiling Award May 29 in Toronto.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Kim Kardashian Recalls Thinking She Was “Going to Die,” Wanting to Make It Home to “Babies” as She Testifies in Paris Robbery Trial",
        "description": "The assailants, in the trial centered around the 2016 jewelry heist that the reality TV star says changed her life, face charges including armed robbery, kidnapping and membership in a criminal gang, offenses that carry the potential for life imprisonment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Mads Mikkelsen to Star in ‘Sirius,’ Directorial Debut From Christopher Nolan’s Editor Lee Smith",
        "description": "The action thriller will be released by Neon label Decal in the U.S., with the company selling international rights at Cannes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Yusuf/Cat Stevens Announces Memoir ‘Cat on the Road to Find Out’",
        "description": "Stevens' autobiography will release on September 15 in the U.K. and on October 7 in North America.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Capitol Music Group Launches Nashville Division, Hires Candice Watkins as President",
        "description": "The new division will be made up of Capitol Records Nashville and the Capitol Christian Music Group.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Janet Jackson Set to Receive Icon Award at 2025 American Music Awards",
        "description": "Celebrating 50 years in the music industry, the \"Someone to Call My Lover\" artist will also perform for the first time on TV since 2018.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "From Outlaws to Breakouts: Oldenburg Success Stories",
        "description": "With no red carpet attitude and no corporate agenda, Germany’s premium indie film festival is a platform and springboard for outsider art: “It’s the purest filmmaker’s festival in the world, no ego, just cinema.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Zach Bryan Removes Collaboration With John Moreland From Streaming Services Amid Feud",
        "description": "Bryan said he'd rerelease the song \"Memphis; The Blues\" without Moreland after the singer questioned Bryan's $350 million payday for selling his publishing catalog and signing a new record deal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Sean “Diddy” Combs’ Sex Trafficking and RICO Trial Began With Sex Worker, Hotel Security Testimony",
        "description": "On Monday, the fallen rap mogul's trial began in earnest with opening statements followed by testimony from two witnesses, with Cassie Ventura's testimony pushed to Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "NCT 127, Aespa, MonstaX and Key Among New Additions to KCON L.A. 2025 Lineup",
        "description": "The annual K-Pop festival returns to the Los Angeles Convention Center and the Crypto.com Arena for three days of programming during the day and performances at night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Defense Concedes That Sean “Diddy” Combs Had Violent Outbursts But Says It Wasn’t Sex Trafficking",
        "description": "Combs, who gave a thumbs-up to supporters ahead of opening arguments, pleaded not guilty to a five-count indictment that could land him in prison for at least 15 years if he is convicted on all charges.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-14T07:26:59.508820"
    },
    {
        "title": "Magpies clamp down on Schultz view",
        "description": "Collingwood’s executive general manager of football has had his say on the Lachie Schultz incident.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Wallabies rocked by $5m man’s injury",
        "description": "The most expensive signing in Rugby Australia history could be missing from the British and Irish Lions series after a serious injury revelation.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Wallabies rocked by $5m man’s injury",
        "description": "The most expensive signing in Rugby Australia history could be missing from the British and Irish Lions series after a serious injury revelation.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Wrexham eyes off A-League talent",
        "description": "Wrexham AFC will be keeping a close eye on A-League talent in pre-season matches against Melbourne Victory, Sydney FC and Wellington Phoenix.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Kelly’s wild ride towards Origin greatness",
        "description": "Women’s rugby league has changed a lot over the past decade, but the one constant has been Isabelle Kelly and her unrivalled performances for her beloved Blues.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘Weak as p***’: Outrage over Ch9 move",
        "description": "The NRL has been told to step in over damning accusations levelled at Channel 9 with claims the network has “bent over”.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Magpies clamp down on Schultz view",
        "description": "Collingwood’s executive general manager of football has had his say on the Lachie Schultz incident.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘Wanted to be myself:’ Why Indigenous great resisted VFL",
        "description": "Widely regarded as one of the best footballers to never play in the VFL, dual Sandover Medallist and 2025 Sir Doug Nicholls round honoree Stephen Michael knows he would’ve held his own.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Proteas fling more barbs, out to ‘topple’ Aussies",
        "description": "The one-off World Test Championship final between Australia and South Africa is firing up both sides, with a fast bowler’s drug ban the centre of attention.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘Not a finished product’: Aussies’ view on Konstas",
        "description": "The long-term future of emerging star Sam Konstas is front of mind for Australian selectors chair George Bailey.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘Call Roger’: Djoker’s shock coaching move",
        "description": "Just weeks out from the French Open and Wimbledon, Novak Djokovic has announced a shock moving in his coaching ranks.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Jelena Dokic’s heartbreaking confession",
        "description": "Australian tennis great turned commentator Jelena Dokic has lifted the lid on her feelings towards her estranged father in a raw interview.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘Hoodwinked’: Wayne Bennett sold a lemon",
        "description": "The South Sydney Rabbitohs were meant to turn things around in 2025, instead Wayne Bennett has been sold a lemon in his return to the club.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Oscar Piastri bullying drama erupts",
        "description": "Oscar Piastri’s F1 team have sensationally claimed the young Aussie was ‘bullied’ when he was signed to rival team Alpine.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Piastri topples Ricciardo in the one area we never thought possible",
        "description": "For the first time ever, Oscar Piastri is officially Australia’s most popular F1 driver. But there’s one area he still trails Daniel Ricciardo – even after torching the F1 circuit this year.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Wallabies rocked by $5m man’s injury",
        "description": "The most expensive signing in Rugby Australia history could be missing from the British and Irish Lions series after a serious injury revelation.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Wallabies rocked by $5m man’s injury",
        "description": "The most expensive signing in Rugby Australia history could be missing from the British and Irish Lions series after a serious injury revelation.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "America loses it over huge name in stands",
        "description": "Footage of a global leader making an under-the-radar public appearance is spreading across the internet with eagle-eyed fans spotting the figure.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "MJ’s shock new job leaves NBA in disbelief",
        "description": "Michael Jordan achieved it all on the basketball court but his latest career move has left NBA fans’ jaws on the floor.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Wrexham eyes off A-League talent",
        "description": "Wrexham AFC will be keeping a close eye on A-League talent in pre-season matches against Melbourne Victory, Sydney FC and Wellington Phoenix.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Nottingham Forest striker placed in induced coma",
        "description": "Rushed to hospital for urgent abdominal surgery on Monday, Nottingham Forest striker Taiwo Awoniyi has since been placed in an induced coma after a collision with a goalpost.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Aussie triggers UFC chaos as bombshell drops",
        "description": "UFC boss Dana White has confirmed his plans have been tossed out the window with Aussie champ Jack Della Maddalena sparking a radical move.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘One of the greats’: Major hopes for ex-child prodigy",
        "description": "The coach who took Jason Day to world No.1 has similar expectations for a former child prodigy and Your Tube star.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Opals lose star as Australia seals Trans-Tasman Challenge titles",
        "description": "Kings star Xavier Cooks has led the Boomers to the Trans-Tasman Challenge title as the Opals ensured Australia claimed both best of three series against New Zealand.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Hawkesbury Thursday preview: Doyle has Motive for milestone",
        "description": "Hidden Motive is a little unlucky to still be a maiden but that can change when he heads to Hawkesbury and take trainer Nathan Doyle a step closer to 300 career winners.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Dad’s devastating response to sentence",
        "description": "The devastated family of Olympic cyclist Melissa Hoskins delivered an emotional statement outside court after her husband and fellow Olympian Rohan Dennis was sentenced.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "‘Heart broken’: WWE legend dead at age 60",
        "description": "An icon of the wrestling world has died just weeks after his final match with stars of the industry left “heartbroken”.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    },
    {
        "title": "Brutal truth about Candice, David’s marriage",
        "description": "Candice Warner has opened up about her decade-long marriage to cricketer David Warner, saying the couple have faced their challenges.",
        "source": "News AU",
        "fetched_date": "2025-05-14T07:27:00.711284"
    }
]