[
    {
        "title": "Trump says he has 'no intention of firing' Fed boss",
        "description": "Trump also expressed optimism that trade relations with China can be improved and a deal can be reached.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Global growth forecast slashed by IMF over tariff impact",
        "description": "The US suffers the biggest downgrade to growth among advanced economies, in the influential International Monetary Fund's latest forecast.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
        "description": "Several Chinese solar companies with factories across the region could face steep new tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Vance calls for stronger India-US relations as trade talks progress",
        "description": "US Vice-President JD Vance is currently on a four-day visit to India with his wife and three children.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Global growth forecast slashed by IMF over tariff impact",
        "description": "The US suffers the biggest downgrade to growth among advanced economies, in the influential International Monetary Fund's latest forecast.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Why the IMF is worried about the economy - three things to know",
        "description": "The influential financial agency is projecting slower economic growth in the US due to uncertainty around President Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Musk to reduce Doge role after Tesla profits plunge",
        "description": "The tech boss says he intends to spend only one to two days a week on Trump administration matters.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Why should I care if the US dollar falls?",
        "description": "Why movements in the US dollar have a massive impact internationally - and how it could affect you.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "The record-breaking tunnel being built from Denmark to Germany",
        "description": "The rail and road link will slash journey times between much of Scandinavia and continental Europe.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Firms say Meta not helping them to recover hacked accounts",
        "description": "Businesses around the world say they are unable to get back into their Facebook and Instagram pages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "US stocks and dollar plunge as Trump attacks Fed chair Powell",
        "description": "The president amps up attack against US central bank boss calling him \"a major loser\" for not lowering interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "US FTC sues Uber, alleging deceptive subscription practices",
        "description": "The FTC accused Uber of charging people for its Uber One subscription service without getting their consent.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "China warns nations against 'appeasing' US in trade deals",
        "description": "Beijing was responding to reports that the US will pressure other nations to restrict trade with China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "'I was careful and followed instructions closely, but still lost my crypto'",
        "description": "A customer's experience highlights issues dealing with cryptocurrency, where many regular banking safeguards do not apply.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "DHL suspends high value US deliveries over tariffs",
        "description": "The postal giant will stop shipping packages to American consumers after a rise in red tape at customs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Inside the rural Texas town where Elon Musk is basing his business empire",
        "description": "The tycoon and Donald Trump adviser has moved his businesses from California to a mostly rural central Texas county.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Why everyone is suddenly so interested in US bond markets",
        "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Designed in US, made in China: Why Apple is stuck",
        "description": "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Anxiety at US colleges as foreign students are detained and visas revoked",
        "description": "High-profile detentions and visa revocations are putting students on edge, as Trump tightens his squeeze on US schools.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Starmer and Trump discuss 'productive' trade talks",
        "description": "The men held their first call since the US president imposed tariffs on UK goods earlier this month.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "What we know about US-Ukraine minerals deal",
        "description": "The US and Ukraine have taken the first step to finalising a deal that would set up an investment fund for Ukraine's reconstruction.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "US lays out plans to hit Chinese ships with port fees",
        "description": "The charges will start in 180 days and rise in the coming years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Nvidia: The AI chip giant caught between US and China",
        "description": "Led by Jensen Huang, dubbed the 'Taylor Swift of tech', the chip giant has become pivotal in the race for AI supremacy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "PM Modi and Elon Musk talk India-US tech collaboration",
        "description": "Modi said he discussed with Musk India's potential to collaborate with the US on technology.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Trump's tariffs leave China's neighbours with an impossible choice",
        "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-23T07:30:15.404125"
    },
    {
        "title": "Amrit Kaur to Receive The Hollywood Reporter’s Women in Entertainment Canada Honor",
        "description": "The 'Sex Lives of College Girls’ star will receive the Breakthrough Award on May 29 in Toronto.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Latin Grammys Returning to Las Vegas for 2025",
        "description": "The annual award show comes back to Sin City for the 15th time, and the first time since 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Kevin Hart to Host 2025 BET Awards",
        "description": "The actor, comedian and mogul will emcee the 25th anniversary celebration in June.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Tina Knowles Has Been the Brains Behind the Business of Beyoncé; Now It’s Her Turn to Shine",
        "description": "“It came at a time that I was open to writing my history down,” says the author of her new book, ‘Matriarch: A Memoir.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Harvey Weinstein’s Life Behind Bars: “He’s Still Running Sh**” (Exclusive)",
        "description": "On the eve of his New York retrial, the fallen mogul spends 23 hours a day alone in his cell, reading biographies and compulsively calling his \"prison consultant\" (who also looks out for Luigi Mangione). And he still manages to phone in the occasional Page Six item.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Maggie Baird Wants to Leave a Better World for Her Children (You Know, Billie Eilish and Finneas)",
        "description": "The Support+Feed founder — and mother of two Grammy winners — speaks with THR about plant-based eating and how the business can have a better eco footprint.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "The Dire Wolf’s Hollywood DNA",
        "description": "The industry’s pawprints are all over the buzzy de-extincted canine, with famous investors including Peter Jackson and George R.R. Martin. But was it all for show?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "I’ve Fought for the Climate Since the ’80s. All I’ve Worked for Is Being Undone",
        "description": "The current government's anti-science agenda threatens the accomplishments of all the organizations my husband, Chevy Chase, and I have supported over the decades.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "After the Fires, How Toxic Are L.A.’s Beaches?",
        "description": "Environmental advocates say the blaze’s runoff is cause for concern, in some spots more than others.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Is ‘Yellowstone’ Ruining Yellowstone?",
        "description": "The popularity of the spinoff-spawning Paramount+ hit has contributed to a massive influx of people who are already straining the ecosystems of an iconic national park: “These areas are being loved to death.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Shannon Sharpe Accused of Rape In Lawsuit",
        "description": "The lawsuit claims Sharpe assaulted a woman at her Las Vegas home. He's denied the allegations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "Hi Felicia: Ice Cube Talks‘Friday’ Return and Four Decades of Attitude",
        "description": "The legendary rapper and actor spoke with THR about the upcoming 'Friday' sequel, days after getting immortalized with a handprint ceremony outside the TCL Chinese Theatre last week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-23T07:30:16.696122"
    },
    {
        "title": "‘Gary Ablett territory’: Ultimate praise for star Dee",
        "description": "Kysaiah Pickett delivered a masterclass against Fremantle, earning praise usually reserved for one of the game’s greatest players.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Hardwick takes another swipe at Victoria’s premier",
        "description": "Gold Coast Suns coach Damien Hardwick wants ‘less talk, more action’ from politicians in being ‘tough on crime’.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "‘Bombshell’ theory behind AFL star’s sentence",
        "description": "Richmond and defender Noah Balta were reportedly “blindsided” by the terms of his sentencing with new claims now emerging.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "‘Lost his marbles’: Coach’s act hard to watch",
        "description": "Sydney were handed another brutal home-ground defeat and their struggling coach has now been pulled up over his behaviour on the sidelines.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "NSW to unleash four debutantes in new look Blues side",
        "description": "NSW women’s coach John Strange has named four debutantes in a new look Blues squad ahead of the State of Origin series opener against the Maroons on May 1.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "NRL great reignites feud with Knights star",
        "description": "Former NRL enforcer Willie Mason has reignited his feud with the  Knights playmaker, declaring he “doesn’t belong in first grade”.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "‘Gary Ablett territory’: Ultimate praise for star Dee",
        "description": "Kysaiah Pickett delivered a masterclass against Fremantle, earning praise usually reserved for one of the game’s greatest players.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "‘Less chest beating’: Hardwick doubles down on Premier criticism",
        "description": "Damien Hardwick has again gone after Victorian Premier Jacinta Allan’s comments about Noah Balta after the Tiger was sentenced on Tuesday. Follow the day’s news in AFL Now.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Aussie cricket ‘godfather’ dead at 84",
        "description": "The Australian cricket community is mourning the loss of a former opening batsman who died this week at aged 84.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Australian cricket icon Keith Stackpole dies",
        "description": "Cricket has lost one of its most colourful and forthright characters with the death of former Test opener Keith Stackpole at the age of 84.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Tennis world slams ‘creepy’ shower rule",
        "description": "Tennis players will have to abide by a new ‘creepy’ shower rule as the sport works to implement stricter doping measures.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "De Minaur powerless as Alcaraz curse extends",
        "description": "It’s the same old story for Alex de Minaur after the Aussie star got in the way of a red-hot Carlos Alcaraz on Saturday morning.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "World all says same thing about Piastri",
        "description": "Oscar Piastri is the talk of the Formula 1 world and there is one thing everybody has noticed about the Australian driver.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Red Bull submits evidence to strip Piastri",
        "description": "One of the sport’s most controversial figures caught the attention of millions with a frantic last-ditch attempt to steal Oscar Piastri’s race.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Reds winger targeting win, not tries",
        "description": "Having scored tries for fun last year, Queensland Reds winger Tim Ryan has focused on other aspects of his game this season.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Olympian’s World Cup dream is on",
        "description": "The Rugby World Cup dream for a couple of Olympians is alive after being picked in the Australian squad.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Hearts melt over $1.1bn star’s selfless act",
        "description": "It’s going to take a lot more than a $1.1 billion deal to make this global Major League superstar forget his roots.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Global superstar’s incredible family update",
        "description": "Las Angeles Dodgers superstar Shohei Ohtani has taken to Instagram to reveal a heartwarming family update.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Chelsea woes cast doubt on Kerr’s Matildas return",
        "description": "Star striker Sam Kerr’s chances of making a return for the Matildas next month appear very slim after another bleak update from her Chelsea manager.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Ange Postecoglou set to leave Tottenham",
        "description": "Ange Postecoglou is finally being put out of his misery with word leaking out the Australian manager is finished at his club.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Fans fear worst as clip of boxing icon swirls",
        "description": "Boxing icon Butterbean has won an army of fans with his recent weight loss and celebrity fights — but there are serious fears for the former champ.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Aussie gun’s plan to end major drought",
        "description": "No Australian has won the opening major of the women’s season since 2006 and a the world No.5 wants to end that drought this week.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Tamworth, Albury tips: Mount Bona ready to explode",
        "description": "The Paul Messara and Leah Gavranich-trained Mount Bona was a stylish winner at Scone before heading to Newcastle when fourth and can bounce back at Tamworth. BEST BETS, INSIDE MAIL.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Shaq forced to bolt from live TV",
        "description": "While analysing a compelling Nuggets-Clippers on “Inside the NBA” alongside the rest of the crew, O’Neal made a hurried, flustered exit.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    },
    {
        "title": "Politician’s outrageous netball rant backfires",
        "description": "A self-styled “America First nationalist” who recently called for the deportation of Selena Gomez has gone on another online tirade.",
        "source": "News AU",
        "fetched_date": "2025-04-23T07:30:18.305785"
    }
]