[
    {
        "title": "China has halted rare earth exports, can Australia step up?",
        "description": "Australia has proposed to create a strategic reserve of critical minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "US company bosses warn over tariffs impact",
        "description": "Several firms have cut their profit forecasts or withdrawn them citing economic uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "China tells Trump: If you want trade talks, cancel tariffs",
        "description": "China denies any trade talks with the US as it calls for sweeping tariffs to be cancelled.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Will Elon Musk really leave Doge and what happens when he does?",
        "description": "The Tesla boss says he will step back from government work - but exactly when and how is unclear.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "US company bosses warn over tariffs impact",
        "description": "Several firms have cut their profit forecasts or withdrawn them citing economic uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "California passes Japan as fourth largest economy",
        "description": "The US state expresses worries that President Donald Trump's tariffs could stunt future growth.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Who will win the race to develop a humanoid robot?",
        "description": "Humanoid robots are attracting a lot of investment but will China dominate the industry?",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Reeves says she understands Trump's trade concerns",
        "description": "The chancellor is set to meet her US counterpart to make the case for a bilateral trade deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Five cards China holds in a trade war with the US",
        "description": "From rare earths to billions in US debt, here's what China has in its arsenal - and how strong they are.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "The record-breaking tunnel being built from Denmark to Germany",
        "description": "The rail and road link will slash journey times between much of Scandinavia and continental Europe.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "'Economic uncertainty will lower investment' - 11 Apr 2025",
        "description": "Tech sector venture capitalist says the global economic uncertainty will mean less investment for private equity.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Trump crypto soars as president offers dinner to top holders",
        "description": "The meme coin's website says its 220 top investors will be invited to a gala event with the president.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "UK edges towards youth visa deal with EU",
        "description": "An agreement has emerged as a key European demand in ongoing negotiations for a post-Brexit \"reset\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "ANC U-turn over tax that threatened South Africa's government",
        "description": "The finance minister drops a planned VAT increase after one party in the coalition government goes to court.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "UK bans video game controller exports to Russia",
        "description": "The Foreign Office says Russia was \"buying harmless goods and turning them into tools of war\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "A dozen US states sue to halt Trump's tariffs",
        "description": "The lawsuit argues President Trump did not have the authority to enact the levies and start a global trade war",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Cyber attack causes further chaos for M&S shoppers",
        "description": "Customers have reported problems with click and collect orders as well as card and contactless payments.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Opportunity for big US-China trade deal, says Bessent",
        "description": "The comments from the US Treasury Secretary come as the trade war between the world's two biggest economies has escalated.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Shein and Temu tax-free parcels rule under review",
        "description": "UK retailers argue that cheap foreign rivals are undercutting business using a tax-free status on small parcels.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Nissan boss says building cars in UK too expensive",
        "description": "The Sunderland factory pays more for electricity than any other Nissan plant, says Alan Johnson.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "China sends Boeing planes back to US over tariffs",
        "description": "Boeing's boss says it's looking to sell 50 more planes China has on order to other countries.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "UK could lower US car tariffs in push for trade deal",
        "description": "UK negotiators are working \"flat out\" to get a trade deal with the US, Chancellor Rachel Reeves says.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Apple and Meta attack 'unfair' €700m EU fines",
        "description": "The tech giants have reacted with fury, accusing the EU of unfairly pursuing US companies.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Musk to reduce Doge role after Tesla profits plunge",
        "description": "The tech boss says he intends to spend only one to two days a week on Trump administration matters.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Trump hints at softening China tariffs and says no plan to sack Fed boss",
        "description": "His comments come amid a trade war with Beijing, and after his attacks on the US central bank's boss.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Pressure builds on UK finances as Reeves pushes for US trade deal",
        "description": "The government borrowed more than expected last year, placing more pressure on the public finances ahead of the full impact of US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-25T07:25:41.653861"
    },
    {
        "title": "Cornell University Cancels Kehlani Concert Over Singer’s Pro-Palestine Remarks",
        "description": "Selecting Kehlani to headline Cornell’s annual Slope Day “has injected division and discord” into the event, university president Michael I. Kotlikoff wrote in a letter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Lorde Releases Long-Awaited New Single “What Was That”",
        "description": "“This is gonna be crazy, you have no idea,” the Grammy previously told fans ahead of the track’s debut.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Metallica’s Kirk Hammett Says ‘Heck Yeah’ At Thought of Performing At the Sphere",
        "description": "The legendary guitarist sat down with THR after releasing a 400-page coffee table book showcasing his collection of instruments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "UMG Nashville Rebrands as Music Corporation of America",
        "description": "The rebrand comes two months after CEO Mike Harris and chief creative officer Dave Cobb came to the company following the exit of Cindy Mabe.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Usher’s ‘Rendezvous in Paris’ Concert Film to Stream on BET+ in May",
        "description": "“I’m happy to be partnering with BET+ to bring the celebration of my 30-year career to you, the fans, to enjoy from the comfort of your homes,” the eight-time Grammy Award winner said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Griff Is Stepping Out of Her Comfort Zone to Craft Her Next Hit",
        "description": "The Hollywood Reporter’s latest “Person of Interest” is the 24-year-old British singer-songwriter — a rising star in the pop scene — who fully leans into her creativity: “Let me just mess around for a bit and see what comes out.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Tribeca Festival Audio Storytelling Slate: ‘This American Life’ 30th Anniversary Celebration, Live Tapings With Sandra Oh, Allison Williams (Exclusive)",
        "description": "The official podcast selections include world premieres of 'Lead,' a scripted docudrama inspired by a true story featuring Merritt Wever, Alessandro Nivola and Cynthia Nixon as well as the customer service investigation podcast 'This Call May Be Recorded.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Imogen Heap Launches AI Music Tools With AI Platform Jen",
        "description": "\"We can't let only the people who want to do it for profit or want to do it for their own gain be making the decisions,\" Heap says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Billy McFarland Puts Fyre Brand Up for Sale After Fyre Festival 2 Postponed",
        "description": "\"After two years of rebuilding FYRE with honesty, creativity, and relentless effort, it’s time to pass the torch,\" he shared in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Setting the Stage for Hate: Kneecap and Coachella’s Collapse of Conscience (Opinion)",
        "description": "“Every link in the chain failed,” when the festival booked the controversial Irish hip hop group, writes veteran music executive Lee Trink.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "What Happened When ‘The Encampments’ Director and a Leading Pro-Israel Creator Debated Gaza",
        "description": "Much of the conversation about Israel's war in Gaza happens in silos. THR asked if pro-Israel influencer Hen Mazzig and 'The Encampments' director Kei Pritsker were open to talking at length to articulate their views. The results were illuminating.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Lorde Debuts New Single ‘What Was That’ at Washington Square Park",
        "description": "The superstar confirmed on social media the song will drop at Midnight April 24, marking the rollout for her first album since 2021.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-25T07:25:42.488056"
    },
    {
        "title": "Footy’s ‘response’ to Anzac Day booing",
        "description": "After booing marred a Welcome to Country ceremony earlier on Anzac Day, all eyes were on the MCG ahead of the big match.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Cool Cal ready for 150th AFL appearance",
        "description": "No longer burdened by the weight of expectation, Callum Ah Chee is playing the best football of his career for the Brisbane Lions.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Wanderers want Mata to stay",
        "description": "Juan Mata has attracted interest from a few A-League clubs despite his lack of game time this season with Western Sydney Wanderers.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Key Blues pair set for Cats",
        "description": "Carlton have only beaten the two teams on the bottom of the AFL ladder this season but coach Michael Voss is adamant the signs are good for something special.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Smith fools Gutho as Roosters extend lead in dramatic Anzac clash",
        "description": "Roosters star Sandon Smith put the exclamation mark on a dominant first half, fooling Dragons star Clint Gutherson to score his second try of the day. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "NRL star left traumatised after brutal prank",
        "description": "Melbourne Storm star Xavier Coates was left screaming in fear after he was the target of a merciless stitch up for a TV segment.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Footy’s ‘response’ to Anzac Day booing",
        "description": "After booing marred a Welcome to Country ceremony earlier on Anzac Day, all eyes were on the MCG ahead of the big match.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Cool Cal ready for 150th AFL appearance",
        "description": "No longer burdened by the weight of expectation, Callum Ah Chee is playing the best football of his career for the Brisbane Lions.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "‘Hazlegod’: $2.3 million Aussie paceman produces IPL masterclass",
        "description": "Australian paceman Josh Hazlewood starred with 4-33 in Royal Challengers Bengaluru’s 11-run IPL win at home against Rajasthan Royals, stunning with his bowling at the death.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Cricket world stunned as star walks off",
        "description": "The cricket world couldn’t quite believe what they were watching when a star walked off the field in a head-scratching moment.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Barty wiped from history by Aussie teen",
        "description": "Aussie teenager Maya Joint continues to make waves in the tennis world, this time by knocking off a longstanding record held by Ash Barty.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Tennis world slams ‘creepy’ shower rule",
        "description": "Tennis players will have to abide by a new ‘creepy’ shower rule as the sport works to implement stricter doping measures.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Max’s ‘disrespectful’ Piastri act causes stir",
        "description": "Max Verstappen has been called out for a cold act towards Oscar Piastri that has raised eyebrows after the Aussie’s Grand Prix win.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Formula 1 rocked by bombshell theory",
        "description": "A new storm is brewing after a year of internal warfare that threatened to up-end the contract of the sport’s most prized asset.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "McDermott tips Kiss to succeed as Wallabies coach",
        "description": "Queensland Reds mentor Les Kiss has been endorsed ahead of his expected elevation to the role of Wallabies coach.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Rivalry round shake up forecast. 1st Colts Rugby talking points",
        "description": "There’s nothing like a rivalry round to get the blood pumping and the adrenaline racing. And in 1st Colts, these grudge games could be extra significant. Round four news, injuries and talking points",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Hall of Fame icon loses tragic health battle",
        "description": "The NFL is mourning the loss of a Hall of Fame star who lost his battle with a debilitating disease.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Graphic texts exposed in NFL rape lawsuit",
        "description": "NFL legend turned TV star Shannon Sharpe has been accused of violently assaulting a woman and threatening to “kill” her.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Wanderers want Mata to stay",
        "description": "Juan Mata has attracted interest from a few A-League clubs despite his lack of game time this season with Western Sydney Wanderers.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Melbourne move a winner for Trewin",
        "description": "The impressive Kai Trewin made the right decision in leaving Brisbane Roar to join Melbourne City.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "World’s strongest man’s wild transformation",
        "description": "Eddie Hall has undergone a spectacular body transformation ahead of his first ever MMA fight this weekend.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Dan Andrews axed from prestigious golf club",
        "description": "Former Victorian Premier Dan Andrews has reportedly been kicked out of an elite club after he was sprung trying to enter with a sneaky move.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Aussie star snubbed for prestigious NBA award",
        "description": "History was always against Dyson Daniels and his hopes of claiming one of the NBA’s top awards, with the Aussie star denied by a Cleveland rival.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Hayes slams scan ‘madness’ for HK star Ka Ying Rising",
        "description": "David Hayes is eager to run Ka Ying Rising at Flemington if he wins The Everest, but Racing Victoria’s vet protocols could get in the way of that happening.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Model kicked out of Schumacher’s inner circle",
        "description": "The tight-knit inner circle of Fomula 1 legend Michael Schumacher’s has shrunk after his son and his model partner split.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    },
    {
        "title": "Shaq forced to bolt from live TV",
        "description": "While analysing a compelling Nuggets-Clippers on “Inside the NBA” alongside the rest of the crew, O’Neal made a hurried, flustered exit.",
        "source": "News AU",
        "fetched_date": "2025-04-25T07:25:43.082025"
    }
]