[
    {
        "title": "US government shutdown averted as Senate passes spending bill",
        "description": "The passage of the funding bill came hours before a shutdown, with Democrats under fierce pressure to oppose the measure.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Musk says first mission to Mars will launch next year",
        "description": "The billionaire says an unmanned mission by his SpaceX \"Starship\" vehicle will be followed by human landings as early as 2029.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Does cutting UK benefits work?",
        "description": "The government is to set out details of how it will save billions of pounds from the working welfare bill.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "How Britain's former top banker became Canada's prime minister",
        "description": "The former banker may not have been elected to office before, but his experience managing global economic crises will help.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Musk says first mission to Mars will launch next year",
        "description": "The billionaire says an unmanned mission by his SpaceX \"Starship\" vehicle will be followed by human landings as early as 2029.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Germany is back, says Merz after historic spending deal",
        "description": "Germany's conservative leader clinches an major financial agreement ahead of a crunch vote in parliament.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Clothes brand gets 100 complaints a day that models are 'too fat'",
        "description": "Snag clothing is cited in an online debate over whether adverts showing models who appear \"unhealthily fat\" should be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Teens capture 'untold stories' of India's labourers in pictures",
        "description": "The backbreaking work done by India's 400 million labourers has been showcased in an exhibition by students.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "The unexpected knock-on effect of Trump's minerals 'deal of the century'",
        "description": "The president once derided attempts to develop new green technology as a \"green new scam\" - but his deal could help boost the US's potential in the sector",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Donatella defied the doubters - what's next for her and Versace?",
        "description": "Versace took over the Italian fashion house after her brother's untimely death and made it her own.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Musk's Tesla raises concern over Trump tariffs",
        "description": "The electric carmaker’s warning about tariffs comes despite its boss's key position in the Trump administration.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Apple encrypted data row hearing begins in secret",
        "description": "The BBC - along with civil liberties groups and some US politicians - argue the case should be heard in public.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Gold price hits $3,000 as trade tensions mount",
        "description": "Demand for the precious metal has surged amid economic uncertainty over the impact of the global trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "UK economy shrank unexpectedly in January",
        "description": "A slowdown in manufacturing was one of the main reasons for the dip, the Office for National Statistics says.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Every McDonald's in UK warned over staff sexual abuse",
        "description": "The warning from the UK's equality watchdog comes after the \"extremely serious\" allegations uncovered by the BBC.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "The blunt-speaking Canadian taking his fight with Trump to Washington",
        "description": "Doug Ford meets Trump's top trade adviser as relations between the two countries hits a new low.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Car sharing switches to electric to boost appeal",
        "description": "Car sharing has not taken off, but will electric cars boost its appeal?",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Two judges order Trump administration to give fired workers their jobs back",
        "description": "The workers were laid off as part of the president's plan to scale back the size of the US government.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Trump threatens 200% tariff on alcohol from EU",
        "description": "Wine and spirits will be taxed, Trump says, if the EU does not remove tariffs on US whiskey.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "'Huawei lobbyists' held in Belgium raids over EU corruption",
        "description": "The prosecutor's office said it raided 21 addresses in Belgium, according to local media.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Donatella steps down as Versace creative director",
        "description": "Versace is facing a creative shift as Prada looks to potentially buy the Italian fashion house.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Abercombie & Fitch must pay for ex-CEO's criminal sex trafficking defence",
        "description": "Judge rules allegations against Mike Jeffries are tied to his former role at the fashion brand.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "US tariffs 'potentially devastating' for Irish whiskey",
        "description": "The Irish Whiskey Association urged the US and EU to engage in dialogue amidst an escalating trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Meta stops ex-director from promoting critical memoir",
        "description": "Social media company wins US emergency ruling preventing ex-director from publicising her book.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Keep kids off Roblox if you're worried, its CEO tells parents",
        "description": "The gaming platform is wildly popular, but has been rocked by allegations it exposes children to harmful content.",
        "source": "BBC Business",
        "fetched_date": "2025-03-16T07:21:53.221684"
    },
    {
        "title": "Metallica’s Robert Trujillo on New Apple Vision Pro Concert: “It’s Like You Can Almost Touch It”",
        "description": "The heavy metal legends released a new immersive concert on Friday on Apple's high-tech headset.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Marc Maron Calls Out Bill Maher for Agreeing With “Some of the Things That Trump Is Doing”",
        "description": "Maher, who hosts HBO's 'Real Time,' has called himself \"an old-school liberal\" for years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Who Will Be Handed Gene Hackman’s Estate Uncertain as Wills of Actor and Wife Are Revealed",
        "description": "The very private couple, who were found dead in their Santa Fe mansion in February, named each other as recipients of each other's wealth — with the actor not including his three kids.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Beyoncé, Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Bad Bunny, Blackpink, Katy Perry, Shakira and Ed Sheeran are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Louis C.K. Offers Tour Update After Two-Year Break From Stand-Up: “Happy to Be Lucky to Be Alive”",
        "description": "The Louis C.K. Ridiculous tour, which he describes as including a \"gargantuan amount of shows,\" kicks off April 17 and continues through 2026 with stops across the globe.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Kanye West Disses Kendrick Lamar Over Feature On New Playboi Carti Album",
        "description": "\"I don't like Kendrick Lamar's music,\" West tweeted after Carti dropped his new album on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Producer Joseph Di Palma Dies at 94",
        "description": "He also sponsored the syndicated program ‘Nightly Business Report’ for a decade and was behind a celebrity interview TV series.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Noah Cyrus Signs Management Deal With Range Music",
        "description": "Cyrus joins a roster at Range that includes Shaboozey, Jack Harlow and Saweetie.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Selena Gomez and Benny Blanco Release Sultry Single “Sunset Blvd”",
        "description": "The new track comes a week before the couple's upcoming collaborative album, 'I Said I Love You First.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Chappell Roan “Gets the Job Done” in Highly Anticipated Country Single “The Giver”",
        "description": "The new single, her first since 2024’s “Good Luck, Babe!,” was first performed on ‘Saturday Night Live’ in November.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "John Feinstein, Acclaimed Sports Columnist and Author, Dies at 69",
        "description": "The longtime Washington Post staffer wrote the best-sellers ‘A Season on the Brink’ and ‘A Good Walk Spoiled.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "En Vogue’s Dawn Robinson Reveals She’s Been Living in Her Car Since 2022",
        "description": "The singer, who was one of four funky divas who topped the charts in the 90s, says she took control of her own destiny and is proud of herself.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-16T07:21:53.931720"
    },
    {
        "title": "Aussie horror show: Norris survives after Piastri’s calamity",
        "description": "Melbourne’s weather has wreaked havoc on the Australian Grand Prix, and Oscar Piastri was withing striking distance of victory, before a moment of madness struck at Albert Park.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Piastri’s cruel ‘heartbreak’ in F1 chaos",
        "description": "Hometown hero Oscar Piastri’s Australian Grand Prix was ruined in devastating scenes as his teammate celebrated a perfect day.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘19.98’: Gout Gout rout in 200m demolition job",
        "description": "Australian sprint sensation Gout Gout has blown away his opposition as he sets a new record in a run that has to be seen to be believed.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "UFC star’s embarrassing wardrobe blunder",
        "description": "UFC fighter Marvin Vettori infamously attended a photoshoot with his pants on backwards but Sunday’s wardrobe topped that.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘Take a bow’: Razzle-dazzle Tigers produce try of year contender",
        "description": "The Wests Tigers’ new-look spine is singing. Maligned for their attack in recent times, Benji Marshall’s men have produced a stunning, length-of-the-field try.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Andrew Johns loses it over NRL hunk",
        "description": "Andrew Johns has divulged his latest man crush, with one hulk of a man catching the NRL great’s eye due to his mind boggling figure.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Dees, Giants go to wire, the SuperCoach rookie we all missed",
        "description": "Melbourne’s first-gamers have provided a huge spark on a wet MCG but a moment of Tom Green brilliance has set the stage for a heartstopper. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Swans belted over ‘horrific’ scenes",
        "description": "Swans great Ryan O’Keefe and a host of footy fans all said the same thing after Sydney’s loss to the Brisbane Lions.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Inside cricket legend’s fall from grace",
        "description": "The inside story of the drug deal Stuart MacGill was found to have been involved in can be revealed for the first time after the Australian cricketing great was this week found guilty by a jury.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘Millions of balls’: Spinner breaks silence after action test",
        "description": "Australian spinner Matt Kuhnemann says he has never bowled with more confidence despite the recent ICC investigation into his action.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Tennis rocked by world No. 1’s putrid act",
        "description": "Tennis star Iga Swiatek has been booed by spectators after smashing a ball at a ball boy in an ugly act of sportsmanship.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Star’s Wimbledon attire sparks backlash",
        "description": "One of tennis’ biggest stars has left members of the prestigious All England Club fuming after blatantly breaking a longstanding rule.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "NRL great’s truth bomb for $13m blockbuster",
        "description": "Dylan Brown’s new $13 million NRL contract is the talk of rugby league, but there’s one part of the deal a legendary player isn’t a fan of.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Aussie horror show: Norris survives after Piastri’s calamity",
        "description": "Melbourne’s weather has wreaked havoc on the Australian Grand Prix, and Oscar Piastri was withing striking distance of victory, before a moment of madness struck at Albert Park.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Piastri’s cruel ‘heartbreak’ in F1 chaos",
        "description": "Hometown hero Oscar Piastri’s Australian Grand Prix was ruined in devastating scenes as his teammate celebrated a perfect day.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "International manhunt for ex-Wallabies star",
        "description": "An international manhunt is underway after a former Wallabies captain was given a prison sentence while his location is unknown.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Wallabies star remains loyal to Reds",
        "description": "One of the world’s best flankers is staying with the Queensland Reds for another three years.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Australia’s highest paid athletes revealed",
        "description": "Some of Australia’s brighest young stars are set for some truly eyewatering paydays as the sporting rich list gets a whole new look.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘Have to do better than that’: Auckland coach’s blunt message following draw with Mariners",
        "description": "Auckland coach Steve Corica didn’t mince his words after a late defensive blunder cost his side victory over Central Coast on Sunday. Catch up on all the latest news from the latest round of A-League action.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘Heartbreaking’: Mary Fowler’s dream dashed",
        "description": "Matildas star Mary Fowler’s face said it all as she watched her dream turn to dust in a cruel moment with teammates.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "UFC star’s embarrassing wardrobe blunder",
        "description": "UFC fighter Marvin Vettori infamously attended a photoshoot with his pants on backwards but Sunday’s wardrobe topped that.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘Weapon’ helps Aussie to $40m Players lead",
        "description": "Aussie cult hero Min Woo Lee produced another brilliant round, while Justin Thomas blew a chance at Players Championship history.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Defensive star ruled out as United need White to fire",
        "description": "Melbourne United’s title hopes have been dealt a massive blow with a defensive star ruled out of Sunday’s crucial game three – and in doubt for the remainder of the series.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "‘I couldn’t see anything’: jockey feared for his safety",
        "description": "Apprentice jockey Cobi Vitler feared that his mount would clip heels when the lights went out during a race at Toowoomba on Saturday night.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "14yo Sydney boy collapses during soccer, dies",
        "description": "A Sydney family has been left heartbroken after their 14-year-old son died suddenly after suffering a health event in the middle of a soccer match.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    },
    {
        "title": "Death threats, slurs as baton bash case turns",
        "description": "The teen runner behind the baton attack that has rocked America has made startling new claims at a public rally where she burst into tears.",
        "source": "News AU",
        "fetched_date": "2025-03-16T07:21:55.387195"
    }
]