[
    {
        "title": "Boeing strike ends as workers back 38% pay rise deal",
        "description": "The damaging walkout by around 30,000 unionised Boeing workers started on 13 September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "The environmental campaigners fighting against data centres",
        "description": "A growing global movement is seeing people object to data centres in their locality.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Weight-loss drug firm Wegovy invested £6bn in this town. So why is it not booming?",
        "description": "Europe's most valuable company has invested billions in Kalundborg on Denmark's coast - but it has many problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Living with Nigeria's blackouts - six weeks, no power",
        "description": "Large parts of Nigeria are experiencing power outages due to problems with the country's grid.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "The environmental campaigners fighting against data centres",
        "description": "A growing global movement is seeing people object to data centres in their locality.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Hunt for Bitcoin's elusive creator hits another dead end",
        "description": "Why are we still no closer to unmasking the mysterious Satoshi Nakamoto?",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "'Lying talent agent left us in lurch without cash and hope'",
        "description": "A talent agent who supplied actors to shows on the BBC and Netflix withheld cash due to them, former clients claim.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "DNA-testing site 23andMe fights for survival",
        "description": "Once used by millions to discover their family histories, this week 23andMe was almost delisted. What went wrong?",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Weight-loss drug firm Wegovy invested £6bn in this town. So why is it not booming?",
        "description": "Europe's most valuable company has invested billions in Kalundborg on Denmark's coast - but it has many problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "US political divide 'stalls fiscal reforms' - 4 Nov 2024",
        "description": "Terry Haines of Pangaea Policy says the split US political scene makes it tricky to fix fiscal issues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "US election bets surge, despite red flags and mixed record",
        "description": "Election bets have exploded in the US, as it barrels toward the polls next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "US jobs growth slows sharply as election looms",
        "description": "Employers added 12,000 jobs in October, much lower than the 223,000 created in September, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Russia fines Google more money than there is in entire world",
        "description": "The mind-boggling figure has been levied due to the company restricting Russian state media on YouTube.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Investors' reaction to Budget 'very different' to Truss",
        "description": "Treasury secretary speaks out to reassure the markets after a rise in the cost of government borrowing.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "Canada has launched a tourist drive but will tensions with China doom it to fail?",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Hollywood stars grow Wrexham  empire with brewery",
        "description": "The football club's star co-owners grow their Wrexham by buying half of the Wrexham Lager brewery.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "UK Budget 2024: Key points at a glance",
        "description": "Chancellor Rachel Reeves has delivered Labour’s first Budget since 2010 – here’s what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "UK growth set to peak next year before slowing again",
        "description": "The government's official forecaster raises its prediction for UK growth in 2024 and 2025 but reduces it for later years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Why Wikipedia has landed in legal trouble in India",
        "description": "India’s largest newswire service ANI has filed a $237,874 defamation lawsuit against Wikimedia Foundation.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "UK-based stars support US video game strikes as row continues",
        "description": "Famous voices from releases such as The Witcher and Cyberpunk 2077 say they support the SAG-Aftra strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-11-05T07:22:08.808849"
    },
    {
        "title": "Joe Rogan Endorses Donald Trump for President",
        "description": "The podcaster made the decision after recording an episode with Elon Musk.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Ebony Magazine Names VP Kamala Harris Icon of the Year",
        "description": "The Democratic presidential candidate says she is “honored and humbled” by the award, to be presented at its Power 100 awards on Nov. 17. Usher, Cynthia Erivo and Da’Vine Joy Randolph will also get special honors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Anna Wintour Reveals How Baz Luhrmann Once Convinced Rihanna to Dance on a Met Gala Table",
        "description": "LACMA's Art + Film Gala, presented by Gucci, took place at the museum on Saturday night, raised a record-setting $6.4 million and hosted a who's who in Hollywood, art, business and beyond.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Barry Keoghan Talks Avoiding Weird Roles, Feeling “Sickened” By “Deadbeat Dad” Accusations",
        "description": "The Irish star told Louis Theroux on 'The Louis Theroux Podcast': \"I'm not an absent father. But people love to use my son as ammunition.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Sean “Diddy” Combs Heard in Call From Prison as Children Wish Him a Happy Birthday",
        "description": "In the video shared by his son Justin Dior Combs on Monday, the embattled hip-hop mogul could be heard on the phone talking with his kids in what's one of the first times the public has heard the elder Combs' voice since his arrest.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "He Helped Build Fox News’ Decision Desk. Now NewsNation Hopes He’ll Break Out On Election Day",
        "description": "Chris Stirewalt, the politics editor at the cable news startup, won't be issuing calls this time (the channel has partnered with Decision Desk HQ for that), but plans to show viewers more of the mechanics of how those forecasts are made.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Architect of Lil Jon’s Viral DNC Cameo To Help Celebs Boost Social and Political Impact",
        "description": "Former Rock the Vote mastermind Ashley Spillane has announced a new entertainment division to her civic engagement firm Impactual.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "How Quincy Jones Changed the Lives of Michael Jackson, Oprah Winfrey and More",
        "description": "The Grammy-, Emmy- and Tony-winning multi-hyphenate had a hand in everything from music to movies, lending his magic to a number of stars including Will Smith, Ray Charles, Frank Sinatra and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Oprah Winfrey, Lady Gaga, DJ Cassidy to Headline Kamala Harris Election Eve Concert",
        "description": "The lineup for the star-studded Philadelphia rally had been under wraps and was announced Monday as part of a series of rallies happening in seven battleground states.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Oprah Winfrey, Mariah Carey Among Stars Paying Tribute to Quincy Jones: “A Legend, a Titan, a Mentor”",
        "description": "Will Smith, Jamie Foxx, Ted Sarandos, Clive Davis, the Estate of Michael Jackson, Jeremy O. Harris and LL Cool J also paid their heartfelt respects to the music legend, who died Sunday at 91.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "Quincy Jones, Master of All Things Musical, Dies at 91",
        "description": "He played the trumpet with Lionel Hampton, produced albums ('Thriller'), songs (\"We Are the World,\" \"It's My Party\"), films ('The Color Purple') and TV shows ('Fresh Prince of Bel-Air'), scored movies ('In the Heat of the Night') and charmed the world.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "J-Pop Group Atarashii Gakko! on Bringing Their Music to a Global Audience and Why Normal Is “a Bit Boring”",
        "description": "The charismatic members of the four-piece group have had a busy year between attention-grabbing Coachella performances, a new album and a world tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-05T07:22:10.003857"
    },
    {
        "title": "‘Travesty’: Three-time Cup champ blows it",
        "description": "Three-time Melbourne Cup jockey Kerrin McEvoy has been accused of blowing up a chance at history with a bizarre ride.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Star jockeys face music after Melb Cup flops",
        "description": "Some of the best known jockeys in this year’s Melbourne Cup failed to fire. Read what they all said after Knight’s Choice’s boilover.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Punter’s monster $81,000 Melb Cup win",
        "description": "One of the Melbourne Cup’s most stunning upsets has left  punters reeling and bookies licking their wounds in the wake of the great race.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "‘Really?’: Ronan Keating divides Australia",
        "description": "Ronan Keating has warmed the crowd up for the Melbourne Cup but the choice of the early-2000s crooner has left a few noses out of joint.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Mock draft: Who your club could take in the draft",
        "description": "As in years gone past, our experts CHRIS CAVANAGH and DAN BATTEN will put themselves in the shoes of clubs and simulate how they would pick for each club.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Ump banned in fresh AFL costume scandal",
        "description": "An AFL official has been suspended following yet another investigation into offensive behaviour at an end-of-season function.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Meninga names Test rookie for Tonga showdown",
        "description": "Mal Meninga has made a major change to his side, with Cameron Murray’s injury opening the door for a premiership star to make his Kangaroos debut.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is already in overdrive with a host of big names led by Ben Hunt and Josh Addo-Carr on the move. Keep up to date with all the player movement in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Aussie opener’s vow after shaky start",
        "description": "Australia’s batters were criticised for being too aggressive in the first ODI, but Matt Short says he won’t change his approach when the series moves to Adelaide.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "‘Schoolyard bullies’: Aussie batters blasted",
        "description": "Australia may have won the first ODI against Pakistan, but former wicketkeeper Ian Healy wasn’t impressed with the batters as he let rip in a scathing review.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Australian No. 1 puts kids first in Tennis Australia initiative",
        "description": "The Demon is laying the foundation for the future of Aussie tennis, with the world No. 8 putting his time and effort into the next generation. Find out how he is helping our rising stars.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Jelena Dokic’s shock claim about abusive dad",
        "description": "Tennis great Jelena Dokic has made a shock claim about her relationship with her abusive father ahead of the release of her documentary.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Verstappen fuels rumour of bombshell move",
        "description": "Max Verstappen has thrown his weight behind a relatively unknown rookie who he believes can help steer a failing team out of the rubble.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Verstappen twists knife, drags entire country",
        "description": "Lando Norris says Max Verstappen “got lucky” by winning the the Brazilian Grand Prix, as his rival got the last laugh in a savage press conference.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Anger at $500 Welcome to Country, beach fee",
        "description": "Members of a surf club in a small town in northern NSW are angry after being forced to pay a fee for Welcome to Country ceremonies.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Raygun takes world by storm all over again",
        "description": "Aussie Olympic breakdancer Raygun has come clean on her true feelings after she once again took the world by storm.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "$283m star erupts over ‘dead brother’ swipe",
        "description": "NBA superstar Joel Embiid has reportedly shoved a reporter in heated scene in the change rooms over an ugly swipe.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Jason Kelce loses it over Taylor Swift slur",
        "description": "Footage is going viral of Jason Kelce responding to a man’s disgusting comment about his brother’s romance with Taylor Swift.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Chilling moment lightning kills soccer player",
        "description": "A football player has been killed by a lightning strike during a game in Peru, with eerie footage capturing the moment players were felled.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "EPL: Ange’s Spurs regroup, Man U start life after ten Hag with draw",
        "description": "Tottenham picked up a much-needed Premier League win with a second half demolition of Aston Villa, while Manchester United showed signs of improvement in a home clash with Chelsea.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Rival stunned as Tyson reveals physique",
        "description": "Mike Tyson has incredibly transformed his body in just one year ahead of his fight with Jake Paul and it’s even stunned his opponent.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Smith in ‘good spot’ after Qld PGA",
        "description": "Despite a frustrating final round at the Queensland PGA, Cam Smith is pleased with the way his golf is trending.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 8",
        "description": "It’s a short week between rounds in SuperCoach NBL and there are some spicy trade calls to make. Follow these moves to get your team ready to fire for round 8 in minutes.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Kerevi’s promise ahead of Wallabies return",
        "description": "Samu Kerevi hasn’t played much rugby lately, but he’s determined to prove his critics wrong as he brings up a major milestone on the spring tour.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "NRL great ‘disappointed’ by anthem stance",
        "description": "Players make their own decisions about singing the national anthem before matches and it doesn’t sit well with one NRL great.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "‘Travesty’: Three-time Cup champ blows it",
        "description": "Three-time Melbourne Cup jockey Kerrin McEvoy has been accused of blowing up a chance at history with a bizarre ride.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-05T07:22:11.984701"
    }
]