[
    {
        "title": "US says it may break up Google after landmark case",
        "description": "The measures could include \"structural requirements” to stop firm from dominating the internet searches.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Boeing withdraws 30% pay rise offer to striking staff",
        "description": "The aviation giant accused the union of not giving its proposals serious consideration.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "China hits back at EU with brandy tax",
        "description": "The tax on brandy imports is being seen by critics as a retaliatory move for recent EU tariffs on Chinese-made electric cars.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "The Scottish start-up making onion skin packaging to reduce waste",
        "description": "UK households throw away an estimated 90 billion pieces of plastic packaging annually. HUID wants to change that.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "TikTok sued for 'wreaking havoc' on teen mental health",
        "description": "A bipartisan group of 14 attorneys general accuse the company of using addictive features to hook children.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Boeing withdraws 30% pay rise offer to striking staff",
        "description": "The aviation giant accused the union of not giving its proposals serious consideration.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "7-Eleven shares jump as rival makes new buyout offer",
        "description": "Alimentation Couche-Tard reportedly offered to pay over $47bn for the Japanese-owned retail giant.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Amount UK's richest pay in income tax revealed",
        "description": "There is some concern tax rises in the Budget could prompt an exit of the super-rich, hurting UK finances.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Brazil lifts ban on Musk's X after it pays $5m fine",
        "description": "The country's Supreme Court made the order after the platform also blocked certain accounts.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "China hits back at EU with brandy tax",
        "description": "The tax on brandy imports is being seen by critics as a retaliatory move for recent EU tariffs on Chinese-made electric cars.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Uber boss: Chinese EVs good for environment - 8 Oct 2024",
        "description": "Uber CEO Dara Khosrowshahi says electric cars should be more affordable so that more drivers can switch to them.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Supreme Court signals openness to Biden's 'ghost gun' crackdown",
        "description": "The Biden administration has tried to crack down on the untraceable guns, linked to criminal activity.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "'We're barely scraping by': Gen Z says money matters in US election",
        "description": "The rising costs of groceries and rent are driving many young voters to the polls.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "eBay to ban private e-bike sales in UK over fire fears",
        "description": "The platform will clamp down on the sale of e-bikes and e-bike batteries in the UK from 31 October.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Wait a few more minutes for an electric Uber, says boss",
        "description": "The platform wants customers to go 'green' as it tries to boost the take-up of electric cars.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "UK annual deaths outnumbered births, figures show",
        "description": "The UK's population has still increased, with net migration the main contributor.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "China stock rally fizzles as stimulus news disappoints",
        "description": "Shares fell back after a news conference by economic planners gave little in the way of details.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "US judge orders Google to open app store to rivals",
        "description": "It is among several remedies ordered in a case brought against the firm by Fortnite-maker Epic Games.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Customers of failed crypto firm FTX set for refunds",
        "description": "The agreement will put an end to a saga that started when the firm went bankrupt in November 2022.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Northern Ireland’s private sector continues to grow",
        "description": "September’s survey suggests the service sector is the engine of growth and manufacturing is recovering.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Firms promised millions from UK's new gigafactory",
        "description": "An open day has been held for companies wanting to supply a huge electric car battery factory, being built in Somerset.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "HS2 may now run to central London, minister says",
        "description": "The Transport Secretary says it would make \"no sense\" to have the line terminate in west London.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "TGI Fridays: 1,000 UK jobs to go despite rescue deal",
        "description": "The deal to save the chain will see more than 30 of its restaurants close.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "House prices close to record high, says Halifax",
        "description": "Falling mortgage rates have helped to boost confidence among buyers, the lender says.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "ScotRail timetable returns to normal after pay row",
        "description": "A reduced service has been running since July but the normal schedule will resume after a pay dispute was resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "‘Perfect storm’ blocking thousands of desperately needed social homes",
        "description": "Housebuilders say they have thousands of social homes ready to be built but no customers to buy them.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Bankers 'neither villains nor rock stars', says Industry creator",
        "description": "The creators of BBC drama Industry discuss stereotypes of bankers - and what makes their series different.",
        "source": "BBC Business",
        "fetched_date": "2024-10-09T07:23:32.475458"
    },
    {
        "title": "Kamala Harris Wins Howard Stern’s Vote, Calls Out Donald Trump’s Lack of Empathy in Live Interviews",
        "description": "The VP visited Stern's SiriusXM show and 'The View' on Tuesday, and will later be interviewed by Stephen Colbert.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Nell Smith, Flaming Lips Collaborator, Dies at 17",
        "description": "\"We are reminded once again of the power of music and how encouraging it can be to be around people that you love,\" said The Flaming Lips' frontman Wayne Coyne.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Sydney Sweeney, Scarlett Johansson Among Top 10 Celebrities Used for Online Scams",
        "description": "McAfee's 2024 U.S. Celebrity Hacker Hotlist runs down the actors whose identities are the most often exploited by cybercriminals for online scams.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Jon Stewart Slams “Dark MAGA” Elon Musk’s Dangerous Trump Rally Comments: “Guns Don’t Protect Our Free Speech”",
        "description": "'The Daily Show' host excoriated the errant Tesla billionaire for his speech at Donald Trump's rally in Butler, Pennsylvania.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Sally Field Shares “Horrific” Story of Illegal Abortion as Reason to Support Kamala Harris: “We Can’t Go Back”",
        "description": "The two-time Oscar winner recalled having a family friend take her to Tijuana for the procedure when she found herself pregnant at the age of 17 roughly 60 years ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Cissy Houston, Whitney Houston’s Mother and Grammy-winning Singer, Dies at 91",
        "description": "The two-time Grammy winner was in the well-known vocal group, the Sweet Inspirations, with Doris Troy and her niece Dee Dee Warrick.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Luke Bryan Clarifies Comments About Beyoncé’s CMA Awards Snub, Says “Tone and Intentions” Were “Not Negative”",
        "description": "Bryan addressed the \"false narrative\" of him sharing his thoughts on Beyoncé's lack of CMA Awards nominations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Binge-Worthy True Crime: Wondery’s Most Thrilling Podcasts for October",
        "description": "The listeners are screaming their praises for the company’s award-winning true crime podcasts",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "White Collar Prison: The Musical Comedy Reflecting America’s Political Divide",
        "description": "This musical takes a sharp look at society’s double standards, where politics, crime and satire collide.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "13 Voices Speak Out on Oct. 7 Anniversary for 13 Women Still Held Hostage by Hamas",
        "description": "Andy Cohen, Ginnifer Goodwin, Debra Messing, Mayim Bialik and more appear in a video timed to the one-year anniversary of Israel's deadliest day since the Holocaust.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Tom Segura Sets 2025 Dates for Come Together Tour, Donates $100K to World Central Kitchen",
        "description": "The popular stand-up comedian has more than 40 new dates for his tour, with stops scheduled at New York's Madison Square Garden and London's OVO Arena Wembley.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "Celine Dion Appears in ‘Sunday Night Football’ Opening Segment Set to Her Song “It’s All Coming Back to Me Now”",
        "description": "\"I think my favorite thing about this game is its power to connect who we are, to who we were,\" she said in the video, which aired before the Dallas Cowboys and Pittsburgh Steelers matchup.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-09T07:23:32.740460"
    },
    {
        "title": "‘Dream come true’ for Irankunda",
        "description": "Former A-League prodigy Nestory Irankunda has added incentive to star for the Socceroos against China.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Exposed’: Axed team’s fight for $30m",
        "description": "After being shuttered by Rugby Australia and dumped from Super Rugby, the Melbourne Rebels have taken this action.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Star breaks silence after fleeing country",
        "description": "A former tennis star has spoken out as rumours continue to swirl over why she fled to America after announcing her shock retirement.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Just so hard’: Panthers defend WCC call",
        "description": "There’s only one trophy the Panthers haven’t picked up during their stunning run of NRL premierships, and there’s a reason why they won’t be trying to win it next year.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "AFLW players in ‘push’ for major change",
        "description": "A leading broadcaster says AFLW players are lobbying the league for a radical overhaul of the competition.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘No one trusts you’: Star torn to shreds",
        "description": "An AFL legend has applied the blowtorch to a wantaway Essendon star as he eyes a blockbuster trade to a third club.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Just so hard’: Panthers defend WCC call",
        "description": "There’s only one trophy the Panthers haven’t picked up during their stunning run of NRL premierships, and there’s a reason why they won’t be trying to win it next year.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Embarrassing’: Tiger’s bitter Benji swipe",
        "description": "A Wests Tigers outcast has given the club and coach Benji Marshall a brutal drive by after he was “hurt personally”.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Pretty ugly’: Low score worry at World Cup",
        "description": "Just two venues are being used for the T20 World Cup, which means a lot of used pitches in play and that’s making things hard for the reigning champs.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Quick’s big appeal for India series",
        "description": "Five Test matches is a big workload for Australia’s frontline fast bowlers and a regular back-up made a massive opening Sheffield Shield impression.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Tennis star goes nuclear in ugly tirade",
        "description": "An American tennis star has been widely condemned after he launched an expletive outburst at a chair umpire with video going viral.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Tennis star accidentally sparks racism storm",
        "description": "Spanish tennis star Paula Badosa has been slammed on social media after she was accused of making a racist pose in a restaurant.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Neurosurgeon dashes Schumacher hopes",
        "description": "A sad update on Michael Schumacher’s condition has dropped just days after wedding rumours that gave the world hope.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Aussies rage over F1 Grand Prix farce",
        "description": "Australian Formula One fans have taken to social media to vent their fury after being hit with a double blow ahead of the 2025 event.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Star breaks silence after fleeing country",
        "description": "A former tennis star has spoken out as rumours continue to swirl over why she fled to America after announcing her shock retirement.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Referee cops lifetime ban over sex tape",
        "description": "A female referee has been handed a lifetime ban – after allegedly featuring in a sex tape with an official almost three times her age.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Coach sacked, security called in wild scene",
        "description": "An NFL coach has been marched out by security in extraordinary scenes with details of the cruel termination leaking out.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Fans all make same joke about age gap pic",
        "description": "Fans have all been making the same joke over a photo detail shared by an NFL icon’s 24-year-old beauty pageant contestant girlfriend.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Dream come true’ for Irankunda",
        "description": "Former A-League prodigy Nestory Irankunda has added incentive to star for the Socceroos against China.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Star Aussie pair lauded by their peers",
        "description": "The performances of Jackson Irvine and Steph Catley for their clubs and Australia have earnt them award-winning recognition from their peers.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Watch: Incredible moment Tafa found out his opponent pulled out",
        "description": "Junior Tafa had spent the morning talking about how he was going to knock out Chris Barnett, without knowing a vicious cyclone had derailed his plans. Watch his exclusive reaction to the news here.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Smith’s cold reaction to rankings drop",
        "description": "Cameron Smith has stopped worrying about his world ranking as he rakes in massive cash and wins trophies on the LIV tour.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Reverse trades! Top SuperCoach target ruled out",
        "description": "The most traded player in SuperCoach NBL this week will miss both games of his team’s round 4 double with injury. Get the latest here plus expert trade advice.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "‘Exposed’: Axed team’s fight for $30m",
        "description": "After being shuttered by Rugby Australia and dumped from Super Rugby, the Melbourne Rebels have taken this action.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Rebels launch $30m case that could cripple Rugby Australia",
        "description": "The Melbourne Rebels have launched a $30 million court case against Rugby Australia to re-enter Super Rugby, leaving the under fire national body at serious financial risk.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Racing heavyweights endorse The Everest’s ‘deserved’ Group 1 status",
        "description": "The Everest and All-Star Mile have been announced as freshly-minted Group 1 races.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-09T07:23:33.957473"
    }
]