[
    {
        "title": "US proposes breakup of Google to end search monopoly",
        "description": "The technology giant could be forced to sell off Chrome to address its illegal monopoly in online search.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "US charges Indian billionaire Gautam Adani with fraud",
        "description": "The allegations of bribery and fraud are the latest blow for the tycoon, one of India's richest people.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Ford cuts 800 jobs, claiming weak demand for electric cars",
        "description": "The move is part of a wider restructuring programme, which will see 4,000 posts closed across Europe.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Are K-pop stars workers? South Korea says no",
        "description": "In a dispute involving band NewJeans, the government said celebrities were not entitled to the same rights as workers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "US charges Indian billionaire Gautam Adani with fraud",
        "description": "The allegations of bribery and fraud are the latest blow for the tycoon, one of India's richest people.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Archegos boss sentenced to prison over massive fraud",
        "description": "Hwang was found guilty of fraud in a case that cost Wall Street banks billions of dollars in losses.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "FBI charges man with alleged plot to bomb New York Stock Exchange",
        "description": "The Florida resident allegedly planned the attack around the Thanksgiving holiday next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Uncertainty after Australia foreign students bill hits opposition",
        "description": "Universities had already begun making changes, as the controversial bill was expected to easily pass.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Is nuclear power gaining new energy?",
        "description": "Countries around the world are building new nuclear power stations, as energy demand rises and the pressure to cut carbon emissions mounts.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Megaport opens up Latin America to Chinese trade as US looks on",
        "description": "A new China-backed megaport in Peru may create whole new trade routes that will bypass North America entirely.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Trump 'unlikely to make risky Treasury pick' - 20 Nov 2024",
        "description": "Expert says that Donald Trump will want to bring someone in as Treasury Secretary who can balance the budget.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Logan Paul accused of misleading fans over crypto investments",
        "description": "New evidence suggests the YouTuber promoted investments without revealing his financial interest in them.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Palestinian olive harvest under threat from Israeli attacks and restrictions",
        "description": "Harvesting olives is an economic necessity for many Palestinians, but it is increasingly precarious.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Al Fayed abuse ‘could be on scale of Savile’, says survivors’ advocate",
        "description": "Speaking about her new role, Dame Jasvinder Sanghera says Al Fayed's \"tentacles went far and wide\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Trump selects financier Howard Lutnick as commerce secretary",
        "description": "Trump said Lutnick would lead the administration's \"tariff and trade agenda\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "TV networks MSNBC and CNBC to be spun off by Comcast",
        "description": "Channels including USA, Oxygen, E! and Syfy will also be moved to the new media company.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Women plan UK legal action over talc cancer claims",
        "description": "Hundreds of women in the UK are taking legal action against Johnson and Johnson.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Jaguar unveils new logo ahead of electric relaunch",
        "description": "The luxury car manufacturer will launch three new electric cars in 2026 as part of its rebrand.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "What UK farmers' protest tells us about their argument with the government",
        "description": "Why has the inheritance tax for farmers argument got so noisy, so quickly?",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Thousands of postal workers in Canada strike over wages",
        "description": "The work stoppage has halted mail and parcel services across the country ahead of the busy holiday season.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Google reacts angrily to report it will have to sell Chrome",
        "description": "It's reported the US government wants the world's most popular web browser to be sold off to address monopoly concerns.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Popular weight-loss drug Wegovy goes on sale in China",
        "description": "There are 180 million people living with obesity in China, who will now be able to purchase the treatment.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Chocolate makers stoke boom for Indian cocoa beans",
        "description": "India produces only a tiny fraction of the world's cocoa beans, but that could be changing.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "Seven-year-old gets job offer from Russian IT firm",
        "description": "The software company's boss said Sergey, who teaches coding in online videos, was \"a kind of Mozart\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "British Airways says 'tech issue' resolved after delays",
        "description": "Passengers had reported delays, but the airline says flights were not cancelled.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "German manufacturers warn of the sector's 'formidable crash'",
        "description": "Germany's troubled manufacturing firms say they are facing a number of significant problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-21T07:24:03.244170"
    },
    {
        "title": "‘Cowboy Carter’ Collaborator Willie Jones Signs to Gravel Road Records (Exclusive)",
        "description": "The 30-year-old singer is featured on Beyoncé’s “Just for Fun” and blends country with hip-hop and soul.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Why Isn’t Your Agent Calling You Back? He’s Playing Pickleball",
        "description": "Plus, how to get married in the Brady Bunch house and why stars are getting pummeled for their presidential vote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Miley Cyrus Defends Chappell Roan Amid Transition to Fame, Call for Boundaries: “I Wish People Would Not Give Her a Hard Time”",
        "description": "Roan has praised Cyrus as being an artist she admires and has been a fan of.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Next Gen Talent 2024: The 10 Hottest Young Stars in Hollywood",
        "description": "From Netflix-turned-Broadway sensation Kit Connor to DC newcomer Aaron Pierre, meet the young stars climbing everyone’s call sheet.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Former One Direction Members Among Mourners at Liam Payne’s Private Funeral",
        "description": "The service was attended by Harry Styles, Niall Horan, Zayn Malik and Louis Tomlinson on Wednesday after Payne died on Oct. 16 from a hotel balcony fall in Buenos Aires, Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Michelle Yeoh Felt Like a “Failure” for Not Having Children, Says It Broke Her First Marriage",
        "description": "\"I think at some point you stop blaming yourself,\" the 'Wicked' actress said during a discussion on infertility.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Jay Leno Is Recovering After Falling Down a Hill and Hitting His “Head on a Rock”",
        "description": "The former 'Tonight Show' host was seen this week with a large bruise on his face and wearing an eye patch.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Trump Nominates Dr. Mehmet Oz to Run Centers for Medicare and Medicaid Services",
        "description": "The former TV talk show host unsuccessfully ran for a Senate seat in Pennsylvania in 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Shirley Halperin Named Co-Editor-in-Chief of The Hollywood Reporter, Joining Maer Roshan at the Editorial Helm",
        "description": "THR's onetime music editor will begin in her new role this month, replacing Nekesa Mumbi Moody.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Sia Performs Song for Nova Survivors, Eden Golan Sings “October Rain” at Ben Stiller-Hosted Anti-Defamation League Event",
        "description": "Music mogul Scooter Braun was also honored at the Kennedy Center Concert Against Hate on Monday in Washington, D.C.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Jennifer Lawrence to Lead Presentation of More Than $1M in Scholarships at The Hollywood Reporter’s Women in Entertainment Gala",
        "description": "She will present at the Dec. 4 event alongside Amanda Zurawski, the lead plaintiff in a Texas reproductive rights lawsuit spotlighted in the 2024 documentary 'Zurawski v Texas.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Menendez Brothers’ Possible Release Delayed Past Thanksgiving as Gov. Newsom Punts Clemency Decision",
        "description": "Los Angeles will have a new district attorney next month and California's governor has decided to wait for him to take office before moving ahead with the closely watched case.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-21T07:24:04.271374"
    },
    {
        "title": "Comment fuels Fowler, Cleary rumour mill",
        "description": "There is a persistent rumour about Mary Fowler and Nathan Cleary and the Penrith star’s dad has further stoked the flames.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "’Wherever he wants me’: Ready for Bevo’s plan",
        "description": "A powerfully built draftee with a family connection to Bulldogs coach Luke Beveridge is ready to show his flexibility on the field.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Bad blood’: Kyrgios swipes current stars",
        "description": "As he prepares to return to the court, Nick Kyrgios didn’t hold back in his assessment of the current crop of men’s stars.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Best mates’: New Tigers ecstatic with draft class",
        "description": "Richmond’s surprise No.12 pick has revealed his injury comeback plans as he says the Tigers’ draft haul “couldn’t be scripted any better”.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "’Wherever he wants me’: Ready for Bevo’s plan",
        "description": "A powerfully built draftee with a family connection to Bulldogs coach Luke Beveridge is ready to show his flexibility on the field.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Best mates’: New Tigers ecstatic with draft class",
        "description": "Richmond’s surprise No.12 pick has revealed his injury comeback plans as he says the Tigers’ draft haul “couldn’t be scripted any better”.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Comment fuels Fowler, Cleary rumour mill",
        "description": "There is a persistent rumour about Mary Fowler and Nathan Cleary and the Penrith star’s dad has further stoked the flames.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Storm hopes to keep both star fullbacks",
        "description": "Ryan Papenhuyzen is on the verge of re-signing with the Storm, with the club now trying to work out how they can also keep one of their rising stars.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Captain’s orders for newest Test batter",
        "description": "All eyes will be on Australia’s first Test newcomer in more than 18 months when Nathan McSweeney makes his debut in Perth and he’s under strict orders from his captain.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Bad blood’: Kyrgios swipes current stars",
        "description": "As he prepares to return to the court, Nick Kyrgios didn’t hold back in his assessment of the current crop of men’s stars.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Roger Federer’s letter to Nadal goes viral",
        "description": "Roger Federer has left the tennis world in tears after penning a heartfelt letter to longtime friend and on court rival Rafael Nadal.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Aussie champs broken up as star defects",
        "description": "Australia’s dominant SailGP team is being broken up, with a key member of their championship three-peat leaving on the eve of the new season.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Daniel Ricciardo is living his best life",
        "description": "Following his unceremonious exit from the F1 grid, Daniel Ricciardo has been keeping busy, including a wild day in Buffalo.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Ring girl reveals ‘big names’ in her DMs",
        "description": "Viral ring girl Sydney Thomas has revealed her new-found fame has seen her inbox become overran with big names hitting her up.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Surprising twist in violent pickleball scandal",
        "description": "The man who got kicked in the face in a moment of unthinkable violence has had a stunning response to his opponent’s behaviour.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "The stunning stat behind NFL’s new Super Bowl favourite",
        "description": "There’s one standout stat behind the NFL’s new Super Bowl favourite: will they continue to dominate heading into Week 12?",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘No notes’: Aussie’s nickname takes over NBA",
        "description": "Aussie youngster Dyson Daniels is taking over the NBA after he was bestowed arguably the greatest nickname ever.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Matildas chosen for big new test",
        "description": "February will be more than 12 months since Matildas captain Sam Kerr suffered her ACL injury and she’ll likely be ready to tackle the world No.1 after a special invitation.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Unacceptable’: Chelsea shocked by Kerr twist",
        "description": "Sam Kerr’s club have taken aim at social media trolls after her baby announcement was overshadowed in ugly scenes.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "New footage ignites Jake Paul conspiracy",
        "description": "The Jake Paul fight against Mike Tyson is under fire with fans convinced they’ve found the moment that exposes it as being rigged.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Superstars shine in Brisbane gloom",
        "description": "Tournament drawcards Jason Day and Cam Smith didn’t disappoint in the first round of the Australian PGA Championship but are chasing a tennis great’s son.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘Inappropriate grabbing’: Charges flow after spectator brawl",
        "description": "Big penalties loom for two NBL imports after being charged for grabbing at fans during an eye-popping incident in Melbourne last weekend.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘One that got away’ Wallabies stumbling block",
        "description": "The Wallabies are a man down in their quest to create a 40-year first with a former Junior Wallabies star now standing in their way.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "‘World class already’: Scots blown away by code-hopper",
        "description": "The rugby world is buzzing about code-hopper Joseph-Aukuso Suaalii ‘s Wallabies arrival but the real reason for two massive wins in the UK lies elsewhere.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Grafton preview: Easy does it for McColm",
        "description": "Kosciuszko-winning trainer David McColm will use Friday’s Grafton meeting to add some cash and all important benchmark ratings to his Championship bound contender.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-21T07:24:05.406595"
    }
]