[
    {
        "title": "US and UK to announce deal to reduce tariffs",
        "description": "The UK government has been seeking an agreement to lower tariffs since Trump imposed levies on almost every country in the world last month.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "iPhone maker announces plan to build Mitsubishi EVs",
        "description": "The Taiwan-made electric vehicle is expected to go on sale in Australia and New Zealand next year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "WeightWatchers files for bankruptcy as fat-loss jabs boom",
        "description": "The firm is struggling with debt and tough competition from weight-loss drugs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "US and China to start talks over trade war this week",
        "description": "Global trade experts have told the BBC they expect the negotiations to take several months.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "iPhone maker announces plan to build Mitsubishi EVs",
        "description": "The Taiwan-made electric vehicle is expected to go on sale in Australia and New Zealand next year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Watch: US and China are ready to talk tariffs - who will blink first?",
        "description": "The BBC's journalists in Washington DC and Singapore analyse US and China's moves ahead of the negotiation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Fed holds rates because of tariff 'uncertainty'",
        "description": "The Federal Reserve said Trump's barrage of tariffs were generating too much uncertainty to predict its next moves.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Disney to open theme park in the Middle East",
        "description": "The company's seventh park will be on Yas Island in Abu Dhabi.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "India worried about Chinese 'dumping' as trade tensions with Trump escalate",
        "description": "Experts warn that a flood of cheap Chinese goods could hurt the competitiveness of Indian exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Colombia's wind farms bring promise and pain for indigenous group",
        "description": "The South American country is turning to wind power, but some local people are unhappy.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Maker of Pegasus spyware told to pay $167m for WhatsApp hack",
        "description": "Journalists and activists say the software is used by authoritarian regimes to spy on them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Four things you need to know about UK-India trade deal",
        "description": "Here's a quick guide to what's been agreed and what it could mean for you.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "UK and India agree trade deal after three years of talks",
        "description": "The deal will improve access for UK whisky and cars to the Indian market, and cut taxes on India's clothing and footwear exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "EU plans to end Russian gas imports by end of 2027",
        "description": "The European Union vowed to end energy relations with Russia after Moscow launched its full-scale invasion of Ukraine in 2022.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "UK's Deliveroo to be bought by US firm DoorDash in £2.9bn deal",
        "description": "The deal is the latest example of a UK-listed company being taken over by a US rival.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Car giant Ford and Barbie maker Mattel warn over tariffs costs",
        "description": "The firms join a growing list of big businesses cautioning about the impact of Trump's import taxes.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Analysis: UK-India deal secured as Trump tariffs everywhere",
        "description": "The UK has secured its biggest post-Brexit deal at a tense time for global trade.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Deliveroo deal shows UK still can't hang on to big firms",
        "description": "The takeover by a US firm shows the differing fortunes and attractions of US and UK stock markets.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Trump considering 100% tariffs on movies not made in the US",
        "description": "The president blamed foreign-made movies for the American film industry's \"very fast death\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "OpenAI says non-profit will remain in control after backlash",
        "description": "The move follows a bitter power struggle over the business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Trump film tariffs to be part of UK-US trade talks",
        "description": "It comes as moviemakers worry the UK's thriving film industry could be hit by the new tariff threat.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "What impact might Trump's Hollywood tariffs plan have?",
        "description": "As Trump turns his attention to what he calls the \"dying\" US film industry, his solution has provoked strong reactions.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Elon Musk's Starbase in Texas will officially become a city",
        "description": "Residents approved incorporating a patch of land as the new municipality in an election on Saturday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "How Carney's election win will change direction of trade war",
        "description": "In his exclusive BBC interview, the Canadian Prime Minister indicates how he plans to tackle Trump.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "London's 'spiralling' housing crisis in numbers",
        "description": "Research sets out the challenges and solutions to tackle the growing housing need in the capital.",
        "source": "BBC Business",
        "fetched_date": "2025-05-08T07:27:12.700813"
    },
    {
        "title": "Kanye West Storms Off Piers Morgan After Dispute on How Many X Followers He Has",
        "description": "\"You're not going to take inches off my dick, bro,\" West told Morgan before walking off three minutes into his interview.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "What Happens to Hollywood When the U.S. Is No Longer the Good Guy?",
        "description": "For decades, the studios have churned out movies that celebrated truth, justice and the American way. Now, as Donald Trump attacks allies, tears down democratic institutions and cozies up to dictators, U.S. exceptionalism is a hard sell onscreen.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Chicago’s Michelada Fest Canceled Over “Uncertainty Around Artist Visas”",
        "description": "\"Michelada Fest will always be a safe place where our comunidad comes together, united by pride and love of our culture and music,\" the festival said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Smokey Robinson Sued by Four Women for Sexual Assault",
        "description": "Four former housekeepers claimed they were \"forced to resign\" due to Robinson’s \"repeated sexual assaults and sexual harassment.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Why Sean Penn Says Donald Trump “Might Try to Destroy the World”",
        "description": "The Oscar winner said, “We should consider worst-case scenarios,” given the current tense political climate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Sabrina Carpenter, Hozier, Doja Cat, Luke Combs Lead Austin City Limits 2025 Lineup",
        "description": "The Strokes, John Summit and Doechii will also headline the festival, which will take place in October.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Sean “Diddy” Combs’ Legal Team Called Out by Feds for Consulting With Celebrity Attorney in Open Court",
        "description": "Mark Geragos, who is not a listed attorney on the case and hosts a podcast, was seen speaking with the defense team on Monday inside the courtroom.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Andrea Bocelli Signs Global Live Performance Deal With AEG Presents",
        "description": "The concert promoter called the new partnership \"the most significant ever for a classical artist.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Kehlani Central Park Pride Show Canceled Over “Security Concerns” From Mayor’s Office",
        "description": "The decision comes after Cornell University canceled one of the singer's upcoming concerts, citing her stance on the Israel-Palestine conflict.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Donald Trump Wants to Reopen Alcatraz — After Watching ‘Escape From Alcatraz’ on TV",
        "description": "The president is apparently making decisions about America's penitentiary system based on a 46-year-old Clint Eastwood movie.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Jury Pool in Sean “Diddy” Combs Trial Will Be Asked These Questions by Judge During Voir Dire",
        "description": "The jury selection is expected to take several days, with the goal of finding 12 impartial jurors and six alternates for the trial, which is expected to go well into the summer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Who Are the Top Lawyers Sean “Diddy” Combs Hired For His Dream Defense Team?",
        "description": "The rap mogul has assembled a team of star attorneys who have spent most of their careers defending — and often winning — legal cases similar to his just-launched trial.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-08T07:27:13.473734"
    },
    {
        "title": "Coach calls out ‘unfair’ Bulldog ban",
        "description": "An act that would normally have drawn a fine ended with a four-match ban for Bulldogs back-rower Jacob Preston and his coach isn’t happy.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "FA boss makes shock decision to quit",
        "description": "James Johnson has made the shock decision to resign as Football Australia’s chief executive officer.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Fev, Guy under investigation over footy game",
        "description": "AFL legend Brendan Fevola and Australian music icon Guy Sebastian have been investigated over their part in a controversial football game.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘I will play’: Injury-plagued star plots return",
        "description": "Max King hasn’t been seen at AFL level since late in 2024, but the star forward who signed a monster contract has given an update on his return.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "WATCH: How Souths are breaking down barriers for women in league",
        "description": "It may be Women in League Round, but the reality is many young girls still don’t have access to the sport – see how South Sydney is helping to break down rugby league barriers.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Coach calls out ‘unfair’ Bulldog ban",
        "description": "An act that would normally have drawn a fine ended with a four-match ban for Bulldogs back-rower Jacob Preston and his coach isn’t happy.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "$1 million price tag could lure Freo boss to be Dillon’s right-hand man",
        "description": "The hunt for Andrew Dillon’s 2IC remains on with one of the top candidates confirming he has spoken to the AFL CEO, but there are circumstances standing in the way.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Fev, Guy under investigation over footy game",
        "description": "AFL legend Brendan Fevola and Australian music icon Guy Sebastian have been investigated over their part in a controversial football game.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Inspiration behind rising Aussie star",
        "description": "Fergus O’Neill is tearing through top orders at home and overseas – but the seam sensation is happy to bide his time for a Test call-up.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Cricket erupts as item appears out of thin air",
        "description": "A professional player has some questions to answer after a rogue act during a game left cricket commentators and fans gobsmacked.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Legend’s verdict on brutal Billy Slater call",
        "description": "A Queensland legend has given his verdict on a big headache facing Maroons coach Billy Slater ahead of the State of Origin opener.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Aussie icon’s defence of sacked son backfires",
        "description": "A motorsport legend has come out swinging in defence of his son after the Aussie young gun was unceremoniously axed from the F1 grid.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "F1 star doomed, Aussie has ‘got in his head’",
        "description": "F1 commentators have pointed out a clear difference in how Max Verstappen treats Oscar Piastri amid a worrying trend for Lando Norris.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Wallabies on poaching alert for new NRL team",
        "description": "Les Kiss starred on the wing for North Sydney, but the return of the Bears to the NRL in 2027 has the soon-to-be Wallabies coach cautious of a talent raid.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Reading secrets of master coaches revealed",
        "description": "Two of Australia’s leading coaches came together in Melbourne on Tuesday and with both men in similar positions when it comes to their future there was plenty to talk about.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘Chaos’: Football star arrested for murder",
        "description": "A former college football star is facing second-degree murder charges after allegedly opening fire in a bar in a chaotic scene.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘Unthinkable’: Simmons hits $252m crossroad",
        "description": "Ben Simmons is an NBA free agent and noises coming from around the NBA show he still has some lifelines left to save his career.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "FA boss makes shock decision to quit",
        "description": "James Johnson has made the shock decision to resign as Football Australia’s chief executive officer.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "PSG power past Arsenal to reach Champions League final",
        "description": "Paris Saint-Germain will play Inter Milan in the Champions League final – but defeated Arsenal boss Mikel Arteta remained defiant, arguing his side was the best side in the competition.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Former heavy world champ lashes SBW-Gallen fiasco",
        "description": "A former heavyweight world champion has joined cruiserweight king Jai Opetaia in calling out Paul Gallen and Sonny Bill Williams over their upcoming blockbuster fight.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘Going to happen’: Rory Open rumour takes off",
        "description": "Rory McIlroy loves Australian golf courses and the Australian Open and now there’s growing speculation about the Masters champ heading to play.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘One-off’: Giddey opens up on shock local league appearance",
        "description": "Chicago Bulls point guard Josh Giddey has opened up on his headline-grabbing turn as a fill-in on a mate’s Monday night domestic team, and made a call on if there will be a second game.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘Doubt I’ll run’: Dry weather no help to Caulfield favourite",
        "description": "Melbourne’s unusually dry autumn is giving trainer Scott Cameron a few headaches with talented wet-tracker Elouyou, who is a short-priced favourite at Caulfield.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "Aussie cycling star announces shock retirement",
        "description": "Australia’s five-time Tour de France stage winner Caleb Ewan has announced his retirement aged just 30, declaring the past two seasons had “taken a significant toll on my relationship with the sport”.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "New vision shows cause of ‘devastating’ fall",
        "description": "This is the moment it all went wrong for an American baseball fan who was left with a broken neck and back after falling 6m to the field.",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    },
    {
        "title": "‘Not a bikini?’: Anger over runner’s briefs",
        "description": "A 31-year-old who recently competed her first marathon has responded to critics of her outfit, asking: “Should I have worn a tracksuit?”",
        "source": "News AU",
        "fetched_date": "2025-05-08T07:27:14.863702"
    }
]