[
    {
        "title": "US trade court blocks Trump tariffs, saying president 'exceeded any authority'",
        "description": "The White House says it will appeal, adding \"it is not for unelected judges to decide how to properly address a national emergency\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "US trade court blocks Trump's sweeping tariffs. What happens now?",
        "description": "The Trump administration lodges an appeal against the ruling shortly after it was announced.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Nvidia revenues surge despite tariff uncertainty",
        "description": "AI chip demand lifted Nvidia's revenues and profits, despite restrictions on sales to China.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Musk 'disappointed' by Trump's tax and spending bill",
        "description": "As the former Doge chief, Musk had worked to reduce government spending which he says this bill contradicts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "US trade court blocks Trump's sweeping tariffs. What happens now?",
        "description": "The Trump administration lodges an appeal against the ruling shortly after it was announced.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Elon Musk leaves White House but says Doge will continue",
        "description": "Musk's exit comes after he criticised the legislative centrepiece of the president's agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Hailey Bieber's makeup brand sold to e.l.f. in $1bn deal",
        "description": "Buyer e.l.f. Beauty calls it a \"beautiful brand that we believe is ready for rocketship growth\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Chile's salmon farms hope for calmer waters",
        "description": "Chilean salmon producers are being criticised for operating in some of the country's national parks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Winemakers finding Trump's tariffs hard to swallow",
        "description": "Wine producers in both France and the US are unhappy at the US president's trade actions.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Cyber criminals contact BBC to claim hack on Co-op, M&S",
        "description": "Hackers reached out to the BBC's Joe Tidy on Telegram, frustrated that their ransom demands weren't being met.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Frugal tech: The start-ups working on cheap innovation",
        "description": "Indian start-ups are using local materials and innovative ideas to make useful and affordable products.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Telegram announces partnership with Musk's xAI",
        "description": "The $300m deal, which will last one year, will see xAI's assistant Grok integrated into Telegram.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Mars phases out controversial colour additive in Skittles",
        "description": "Confectionery giant Mars said it had stopped using titanium dioxide in its Skittles portfolio in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Temu's Chinese owner sees profits plunge as trade war bites",
        "description": "US-listed shares of PDD Holdings fell over 13% on Tuesday as the firm said its profit had almost halved.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "UK shoppers mock 'action replays' at self-checkouts",
        "description": "Tesco's latest use of technology to crack down on shoplifting has led to both jokes and complaints.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "'We make more money from weddings now than farming'",
        "description": "From falconry and helicopter rides to spas and solar farms, three quarters of farmers now have a side hustle.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Brazil sues China carmaker BYD over 'slave-like' conditions",
        "description": "The Public Labour Prosecutor's Office in the state of Bahia says 220 Chinese workers were rescued.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Trump administration seeks to pull estimated $100m in Harvard funding",
        "description": "Federal agencies will review their grants to the top university to decide whether they should be terminated.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Texas governor signs online safety law in blow to Apple and Google",
        "description": "Under the new law, minors will need parental approval before they can download apps or make in-app purchases.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Second suspect arrested in alleged crypto torture scheme",
        "description": "Police say the two men kidnapped an Italian businessman and tortured him with a gun, chainsaw and electrical wires for nearly three weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Chinese-owned Volvo Cars to cut 3,000 jobs",
        "description": "The firm's boss pointed to the \"challenging period\" faced by the industry as a reason for the layoffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Adidas says customer data stolen in cyber attack",
        "description": "The sportswear giant says criminals accessed its systems through a \"third-party customer service provider.\"",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Arrests over French cryptocurrency kidnapping plots",
        "description": "The arrests follow several kidnapping plots targeting cryptocurrency executives and their families.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "IMF raises UK growth forecast as it warns on tax and spending",
        "description": "In its annual health-check for the UK economy, the IMF predicted growth of 1.2%, a marginal upgrade to its previous forecast.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "KFC to create 7,000 jobs in UK and Irish growth push",
        "description": "The fried chicken firm will invest nearly £1.5bn over five years as rivals step up expansion.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Beef drives UK food inflation to highest in a year",
        "description": "The British Retail Consortium says the annual rate of food price rises hit 2.8% in May.",
        "source": "BBC Business",
        "fetched_date": "2025-05-29T07:27:44.986575"
    },
    {
        "title": "Ben Stiller Calls Out Pat McAfee for “Weird” Comments About Him and Timothée Chalamet at Knicks Game",
        "description": "The actor was sitting courtside at the fourth game of the Knicks vs. Pacers playoffs, alongside Chalamet and Spike Lee.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Smokey Robinson Files $500M Countersuit After Being Accused of Sexual Assault",
        "description": "The famed Motown singer accuses the four women of defamation, slander, intentional infliction of emotional distress, financial elder abuse and invasion of privacy in his cross-complaint.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Brian Avnet, Longtime Artist Manager and Music Executive, Dies at 82",
        "description": "He collaborated with Jon Voight, Bette Midler, Lou Adler, Josh Groban, David Foster, The Manhattan Transfer and many others during his long career.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Shaboozey Defends Megan Moroney Amid AMAs Backlash: “Let’s Not Twist the Message”",
        "description": "“She is amazing and someone who represents the country community in the highest light,” the five-time Grammy nominee said of Moroney.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Judge Quickly Rejects Mistrial Request at Sean “Diddy” Combs Trial",
        "description": "The defense claimed prosecutors tried to imply that the fallen mogul interfered with the investigation into Kid Cudi's firebombed Porsche.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Andrew Tate and Brother Tristan Charged With 21 U.K. Crimes, Including Rape and Human Trafficking",
        "description": "Britain's Crown Prosecution Service authorized the charges after it received a file of evidence from Bedfordshire Police about allegations made in the U.K.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Miley Cyrus Surprises Fans With Intimate ‘Something Beautiful’ Set At Chateau Marmont",
        "description": "TikTok hosted the event with Cyrus, hand-picking fans from the platform to come to a listening event days before ‘Something Beautiful's’ release this Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Barry Diller and the Twilight of the Hollywood Tell-All",
        "description": "The juicy 'Who Knew' reads like a last-of-the-Mohicans memoir for a business no longer defined by the big personalities and singular tastes of its iconoclasts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Edge of Seventeen: How the K-Pop Powerhouse Is Reinventing Itself",
        "description": "They fill more stadiums than Springsteen and sell as many albums as Taylor Swift. But the world’s most successful K-pop band still faces one last hurdle: growing up.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "How Reneé Rapp Says Her Mom Manifested Her Becoming a “Pop Star”",
        "description": "The singer-actress said her mother chose her specific name \"just in case she wants to be a pop star.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Nick Kroll Recalls Orchestrating John Mulaney’s 2020 Drug Intervention: “So Deeply Scared He Was Gonna Die”",
        "description": "The comedian said Mulaney \"was running around New York City like a true madman\" before rehab.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "Sass to Sobs, Diddy’s Ex-Assistant Testifies About Gunpoint Kidnapping But Changes Some Details",
        "description": "The longtime fixture in Sean \"Diddy\" Combs' professional and personal life took the stand Tuesday and went from sassing the defense team to sobbing while recalling her time with the mogul.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-29T07:27:45.329375"
    },
    {
        "title": "‘Game-changer’: F1 rule threatens McLaren",
        "description": "F1 is clamping down with a new rule this weekend, with teams hopeful it will be a “game changer” and help end McLaren’s dominance.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Ponga questions after Maroons mauling",
        "description": "The early mail suggests Kalyn Ponga wants to take his place in the Knights team on Friday night, but a potential three games in eight days could see the coaching staff play it safe.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Top AFL boss demoted, gets job cut in half",
        "description": "After heavy criticism for the AFL’s handling of several recent issues, the league’s chief executive has made some major changes.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "AFL boss moves amid league criticism",
        "description": "After heavy criticism for the AFL’s handling of several recent issues, the league’s chief executive has made some changes.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Ponga questions after Maroons mauling",
        "description": "The early mail suggests Kalyn Ponga wants to take his place in the Knights team on Friday night, but a potential three games in eight days could see the coaching staff play it safe.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Origin coach puts entire state on notice",
        "description": "NSW Blues coach Laurie Daley delivered a terrifying message to the Maroons in the wake of the State of Origin series opener.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Top AFL boss demoted, gets job cut in half",
        "description": "After heavy criticism for the AFL’s handling of several recent issues, the league’s chief executive has made some major changes.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "AFL boss moves amid league criticism",
        "description": "After heavy criticism for the AFL’s handling of several recent issues, the league’s chief executive has made some changes.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "‘Muddled mess’: Key factor in Marnus’ fate",
        "description": "Cameron Green looks a certainty to return to the Australian team, but a decision on who opens with Usman Khawaja could be determined by one thing.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Green’s third ton ups Marnus pressure",
        "description": "Who opens the batting for Australia in the World Test Championship final remains unclear, but there’s one red-hot batter selectors have to get back into the team.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "‘Beat anybody’: Aussie hopes rise despite more exits",
        "description": "After ending a six-year streak of first-round exits in Paris, Aussie Alexei Popyrin is riding a confidence wave but the female presence looks bleak.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Aussie launches into rant over tennis reality players ‘can’t stand’",
        "description": "Jordan Thompson has fired a broadside at tour scheduling, describing the demands placed on players as “s**t” while critical of changes to several Masters tier tournaments.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "‘Game-changer’: F1 rule threatens McLaren",
        "description": "F1 is clamping down with a new rule this weekend, with teams hopeful it will be a “game changer” and help end McLaren’s dominance.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Ricciardo move sends F1 world into frenzy",
        "description": "F1 fans are convinced Daniel Ricciardo is set to make a shock return to the grid – and it’s all to do with a single image.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Wallaby returns for Reds",
        "description": "The Queensland Reds will receive a welcome boost ahead of their important Super Rugby Pacific clash against Fijian Drua on Saturday night.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Reds their own worst enemy after falling short in nailbiter",
        "description": "Queensland Reds were shooting for a guaranteed spot in the Super Rugby playoffs and its first win over the Hurricanes since 2013, but were their own worst enemy in a nailbiting loss.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Aussie brutally axed in NFL cull",
        "description": "He went to two Super Bowls but after suffering a back injury an Aussie punter in the NFL has felt the axe.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Football star’s girlfriend killed by deer",
        "description": "A former college wide receiver’s girlfriend has been killed in a horrific freak crash that left the ex-football star with serious injuries.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "City star to welcome hostile atmosphere",
        "description": "Playing in a finals series has been something new for Melbourne City midfielder Andreas Kuen, who wants to celebrate his first A-League season with championship glory.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "‘Really positive’ update in Kerr recovery",
        "description": "She won’t play for the Matildas on Friday night in the friendly against Argentina, but it’s “really positive” signs for superstar skipper Sam Kerr.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "25yo star dies weeks after getting married",
        "description": "Tributes are flowing around the boxing world after a talented fighter died at the age of 25 in a heartbreaking tragedy.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "YouTube guide to conquer US Open beast",
        "description": "A baptism of fire awaits a rookie Australian pro at the US Open on a course that few of the field have ever laid eyes on other than through videos.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Unthinkable ‘choke’ turns NBA on its head",
        "description": "Tyrese Haliburton knocked down a ridiculous game-tying shot, sparking a truly extraordinary Indiana Pacers comeback win.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "What is Plan B? Rosehill sale decision a “missed opportunity”",
        "description": "Following the defeat of the $5 billion Rosehill sale proposal, what is the alternative funding model for the industry to combat a decline in wagering?",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Sports presenter quits in shock move",
        "description": "Just two months after being overlooked for a plum national TV role, a popular Channel 9 sports presenter has quit the network.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    },
    {
        "title": "Tragedy as WWE star killed in accident at 63",
        "description": "The WWE community is in mourning after a wrestling star was killed in a shocking accident at the age of 63.",
        "source": "News AU",
        "fetched_date": "2025-05-29T07:27:46.596045"
    }
]