[
    {
        "title": "Trump threatens Brazil with 50% tariff and demands Bolsonaro's trial end",
        "description": "Trump accused Brazil of \"attacks\" on US tech companies and conducting a \"witch hunt\" against its former president Jair Bolsonaro.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Kellogg shares soar on reports of Ferrero takeover talks",
        "description": "A $3bn deal for the US firm could reportedly be finalised this week, combining the two big food firms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Why Trump has invited five African leaders to the White House",
        "description": "The presidents of Gabon, Guinea-Bissau, Liberia, Mauritania and Senegal hope to be offered \"incredible\" deals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "EU hopes to agree US tariff deal 'in coming days'",
        "description": "The EU remains hopeful it will strike a deal to avoid steep levies Trump has threatened on its exports to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Kellogg shares soar on reports of Ferrero takeover talks",
        "description": "A $3bn deal for the US firm could reportedly be finalised this week, combining the two big food firms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Holidays from UK to Spain, Cyprus and Turkey soar in price",
        "description": "The cost of all-inclusive family package holidays to many popular destinations has risen this year.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "India and China strive to reset ties but with caution",
        "description": "Bilateral relations between India and China have improved since the 2020 clash - but larger challenges remain.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Linda Yaccarino departs as boss of Musk's X",
        "description": "Her exit comes at a difficult time for Musk who, in a brief reply, thanked her for her \"contributions.\"",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "How Trump's tariff chaos could reshape Asia's businesses",
        "description": "The US president's tough stance on global trade is shaking up the region's crucial supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Trump's mega-bill provides 'corporate clarity' - 9 Jul 2025",
        "description": "Expert says that the sprawling budget bill provides clarity and incentives for US businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Why little Lithuania has big plans for space tech",
        "description": "Lithuania has a promising space tech sector, but it wants more government support.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Nvidia becomes world's first $4tn company",
        "description": "Shares in the chip-maker have surged in value as investment in AI continues to gather pace.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Trump delays tariffs as the rest of the world plays hardball",
        "description": "The US president reveals his poker \"tell\" by showing he is open to delays to secure trade deals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Lesotho declares state of disaster amid US tariff uncertainty",
        "description": "Lesotho faces tariffs of 50% - higher than any other country because of its large trade surplus with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Musk's Grok chatbot praises Hitler and insults politicians",
        "description": "Anti-hate campaigners say the posts were \"irresponsible, dangerous and antisemitic\".",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Action urged to halt exodus of firms leaving UK",
        "description": "The boss of the CBI says he would support cutting the allowance on cash ISAs to encourage more people to invest in shares.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "US will hike tariffs on copper to 50%, Trump says",
        "description": "Similar threats are looming over pharmaceuticals, lumber and semiconductors.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Maternity brand worn by Kate enters administration",
        "description": "Consultancy firm Interpath confirmed that it had been appointed as administrators by maternity brand Seraphine.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Former UK PM Rishi Sunak takes job at Goldman Sachs",
        "description": "Sunak will take up the part-time role while remaining Conservative MP for Richmond and Northallerton.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "US delays higher tariffs but announces new taxes for some countries",
        "description": "Trump says the US will impose a raft of levies after pausing his Liberation Day tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Ramaphosa opposes Trump's 30% tariff on South Africa",
        "description": "US President Donald Trump announces a 30% tariff on South African imports starting from 1 August.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Trump threatens extra 10% tariff on nations siding with Brics",
        "description": "The president said the levy will apply to \"any country aligning themselves with the Anti-American policies of Brics\".",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Workplace misconduct and discrimination NDAs to be banned in the UK",
        "description": "The government plans to change the law to void confidentiality agreements that silence staff.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Trump calls Musk's new political party 'ridiculous'",
        "description": "The US president and Tesla boss were close allies before a dramatic falling out in recent weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "How tariffs are shifting global supply chains",
        "description": "Trump's 90-day pause on his sweeping tariffs plan is about to expire. But already some firms are radically changing how they work.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Not getting a summer job? Here are eight ways to change that",
        "description": "Grace Pickett, 18, says it's \"frustrating\" so many part-time jobs require previous experience.",
        "source": "BBC Business",
        "fetched_date": "2025-07-10T07:29:06.800982"
    },
    {
        "title": "Hopeless Records Acquires Fat Wreck Chords Catalog in New Partnership",
        "description": "As part of the acquisition, Fat Wreck Chords' roster's unrecouped balances will be waived, and Hopeless has agreed to a no-new-signings policy to keep focused on Fat Wreck's current roster.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Addison Rae, KATSEYE and Nikki Glaser Among Recording Academy’s 2025 New Member Invitees",
        "description": "The Recording Academy invited nearly 3,600 new members from a pool of musicians and industry professionals.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "The Creepy Parallels Between the Epstein and Diddy Cases Have Conspiracy Theorists Frothing",
        "description": "Sexual misconduct, allegations of abuse of power and a MacGuffin in the form of a notorious list are not the only shared elements in the stories of the two elite New York felons.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Christian Horner, Star of Netflix’s F1 Series ‘Drive to Survive,’ Fired as Red Bull Team Principal",
        "description": "It comes nearly a year and a half after a female employee accused Horner of sexual harassment and coercive, controlling behavior — claims he was later cleared of.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Nobody Understands KATSEYE Quite Like KATSEYE",
        "description": "The six-piece girl group is ready to unpack the ‘Beautiful Chaos’ of their whirlwind debut year: “As a group, we've experienced a lot of chatter and a lot of hate, so we're learning how to take a step back and not consume it as much.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Sarah Jessica Parker Defends Not Posting About Politics: “FDR Was Elected Without Social Media”",
        "description": "The 'And Just Like That' star also revealed how she educates herself during elections.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Andy Samberg Shares Update on His Mom’s Adoption Story After ‘Finding Your Roots’ Appearance",
        "description": "The 'Saturday Night Live' alum revealed his new \"theories\" about a photographic connection between his mother's birth parents during a Tuesday episode of Amy Poehler's 'Good Hang' podcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "ATEEZ’s In Your Fantasy Tour Is Starting This Week – Here’s How to Get Tickets",
        "description": "The eight-member boy group is returning to L.A.’s BMO stadium for two nights this August, along with stops in New York, Atlanta, Orlando and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Ayo Edebiri Recalls Confusion When She Joked About Being Irish",
        "description": "'The Bear' actress explained how her now-viral bit came to be during her appearance on 'Conan O’Brien Needs a Friend.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Oasis’ A-List Guests: Metallica’s Lars Ulrich, Sony Music’s Rob Stringer Among Industry Notables at Tour Opening",
        "description": "Anya Taylor-Joy, Louis Tomlinson, Matt Smith and Cara Delevingne were among the stars who made it out to Wales for the famed Britpop band's first show in 16 years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Peter Jackson Wants to Bring This 400-Pound Flightless Bird Back From Extinction",
        "description": "Along with Colossal Biosciences, the filmmaker is joining an indigenous-centered partnership to resurrect the 12-foot-tall moa, dead for centuries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    },
    {
        "title": "Will Apple Ever Air ‘Tehran’ Season 3?",
        "description": "A nearly two-year holdoff may — finally — be coming to an end.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-10T07:29:07.681131"
    }
]