[
    {
        "title": "China bets on kitchen appliances to boost economy",
        "description": "A list of subsidised household goods has been expanded as Beijing tries to increase domestic spending.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "'Trump 2.0' looms large over the global economy",
        "description": "Donald Trump's planned tariffs are expected to greatly impact international trade in 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "People smugglers to have finances targeted with sanctions",
        "description": "The planned measures will target the finances of illegal smuggling networks, the Home Office says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "ChatGPT creator denies sister's childhood rape claim",
        "description": "Ann Altman filed a lawsuit alleging her brother sexually abused her between 1997 and 2006.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "'Trump 2.0' looms large over the global economy",
        "description": "Donald Trump's planned tariffs are expected to greatly impact international trade in 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "H-1B: Visa row under Trump fuels anxiety for Indian dreamers",
        "description": "Visa woes and an immigration row are sparking uncertainty for Indians who want to work in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Pound falls as borrowing costs hit highest since 2008",
        "description": "Economists have warned the rise could mean further tax hikes or spending cuts, as Treasury seeks to reassure markets.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Huge problems with axing fact-checkers, Meta oversight board says",
        "description": "The body's co-chair says moving to community notes could have a big impact on gender rights and minority groups.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Why influencers are facing a pushback",
        "description": "Rejecting the \"haul\" culture of excessive shopping and promoting conscious consuming, the de-influencer movement is going mainstream – here's why.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Cryptocurrencies and personal AI: Tech to watch out for in 2025",
        "description": "Will 2025 be a hinge year for cryptocurrency and will personalised AI appear on your phone?",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Meta ending fact-checking 'a political play' - 8 Jan 2025",
        "description": "Expert says Meta's new policy to end third party fact-checking on its platforms is a political play.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Rolls-Royce to build bespoke cars for super-rich",
        "description": "The luxury carmaker will almost double the size of its factory to build more one-offs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Bezos-owned Washington Post cuts more jobs",
        "description": "Layoffs come at a time of growing losses and turmoil over editorial decisions at the US newspaper.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Musk's 'disinformation' endangering me, says UK MP",
        "description": "The tech billionaire and Trump adviser has fiercely criticised the safeguarding minister in recent days.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "'Music is back' as sales in UK hit a 20-year high",
        "description": "Albums by Billie Eilish, Taylor Swift and Coldplay pushed sales of recorded music to a record £2.4bn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Trump ramps up threats to gain control of Greenland and Panama Canal",
        "description": "The president-elect said he would not rule out the use of military force to seize control of the Panama Canal and Greenland.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "US launches probe of Tesla's 'smart summon' driverless tech",
        "description": "Safety regulators launched the investigation after reports of crashes involving the feature, which allows drivers to summon parked cars.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Europe leaders criticise Musk attacks",
        "description": "Although some of Europe's leaders have found favour with the billionaire, others are worried by his interventions.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Facebook and Instagram get rid of fact checkers",
        "description": "Meta says its platforms will instead rely on \"community notes\" from its users, an approach pioneered by X.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Andrew reported after 'false' business name claim",
        "description": "Prince Andrew has been accused of using a 'false name' in how a business was registered.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Bangladesh authorities seek Siddiq account details",
        "description": "It comes after the Treasury minister was named in an anti-corruption probe in the country.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Shein lawyer refuses to say if it uses Chinese cotton",
        "description": "Yinan Zhu declined to say whether it retailer's suppliers used Chinese cotton amid concerns over forced labour.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Apple urged to withdraw 'out of control' AI news alerts",
        "description": "Apple has pledged improvements to its news summarising tool, but critics say it is dangerous and needs to be withdrawn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "US designates Tencent a Chinese military company",
        "description": "China's embassy in Washington branded the move as an \"unreasonable suppression\" of its firms.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Nvidia unveils robot ambitions and powerful new gaming chips",
        "description": "The announcement was part of Mr Huang's address at CES, an annual technology show in Las Vegas.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "UFC boss to join board of Facebook owner Meta",
        "description": "It comes days after former UK deputy PM Sir Nick Clegg left his top job at the social media giant.",
        "source": "BBC Business",
        "fetched_date": "2025-01-09T07:24:49.647390"
    },
    {
        "title": "Fire Breaks Out in Hollywood Hills, Threatening Hollywood Bowl, Walk of Fame",
        "description": "A new blaze lit up near Runyon Canyon, which is in the vicinity of iconic Los Angeles locations and tourist destinations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "OpenAI CEO Sam Altman Accused of Years of Sexual Abuse by Younger Sister",
        "description": "The tech leader and his family denied Ann Altman's accusations in a statement that was posted online just as the lawsuit went public.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Paris Hilton Is “Heartbroken” After Losing Malibu Home in Wildfires: “The Devastation Is Unimaginable”",
        "description": "\"My heart and prayers are going out to every family affected by these fires. To all the people who have lost their homes, their memories, and their beloved pets,\" she wrote in a lengthy social media post.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Music Publisher Kobalt Appoints Rani Hancock EVP and Head of U.S. Creative",
        "description": "An A&R veteran, Hancock has previously worked at Columbia Records, RCA Records and Arista Records.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Billy Crystal and Wife Janice Confirm Pacific Palisades Fire Destroyed Home of 46 Years",
        "description": "\"Words cannot describe the enormity of the devastation we are witnessing and experiencing,\" Billy and Janice Crystal said. \"We ache for our friends and neighbors who have also lost their homes and businesses in this tragedy.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "“We Are Absolutely Not Out of Danger Yet”: 5 People Dead From L.A. Fires Amid Zero Containment",
        "description": "Officials say the worst has not yet been seen as apocalyptic blazes tear across Los Angeles County, sending celebrities and local residents fleeing for their lives.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Mandy Moore Says L.A. House Burned Down in Eaton Wildfire: “I’m Absolutely Numb”",
        "description": "“This is Altadena. Leveled. My sweet home,\" she wrote on her Instagram Story on Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Hollywood Consumed By Apocalypse Vibes as Wildfires Rage",
        "description": "Apocalyptic angst has swept Hollywood in recent years, but those fears became frighteningly real amid the devastating wildfires that have swept across the Southland. Is this time different, or does it just feel that way?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Iconic Malibu Eateries Destroyed in L.A. Wildfires",
        "description": "Malibu’s Reel Inn, Moonshadows and Cholada Thai are among the restaurants that have been destroyed in the Pacific Palisades fire.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Diane Warren Says the Beach House She’s Had for 30 Years Burned Down in L.A. Wildfires",
        "description": "The 15-time Oscar-nominated songwriter also wrote on Instagram that her \"animals and the rescue ranch are OK tho which is the most important thing.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "L.A. Wildfires: How to Help",
        "description": "Entertainment industry groups including the Screen Actors Guild and the Entertainment Industry Foundation (EIF) have launched wildfire relief efforts in Southern California geared toward helping first responders and members of the entertainment industry community.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Critics Choice Awards Postponed Amid Los Angeles Fires",
        "description": "The awards show was set for Sunday in Santa Monica, and has been rescheduled for Jan. 26.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-09T07:24:50.121020"
    },
    {
        "title": "Broncos hard man keen for starting spot",
        "description": "Michael Maguire could face a selection headache in round 1 after the man he fought so hard to keep declared he wants to start matches for the Broncos this year.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Cummins injury reveal as star’s return locked in",
        "description": "As the future of one Australian all-rounder hangs in the balance, another looks set to return just in time for the World Test Championship.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Healy fires early Ashes warning shot",
        "description": "Not even Sydney’s wet weather could stop Alyssa Healy from firing a warning shot to England on the eve of the Ashes, before rain stopped her from a return to a familiar role.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Kyrgios, Demon’s Aus Open paths revealed amid champ’s nightmare",
        "description": "The Australian Open draw landed some telling blows – including on the defending champions and an all-time great. See how it treated Australian stars Alex de Minaur and Nick Kyrgios.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Cummins injury reveal as star’s return locked in",
        "description": "As the future of one Australian all-rounder hangs in the balance, another looks set to return just in time for the World Test Championship.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Healy fires early Ashes warning shot",
        "description": "Not even Sydney’s wet weather could stop Alyssa Healy from firing a warning shot to England on the eve of the Ashes, before rain stopped her from a return to a familiar role.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Aussie seals emotional Open comeback",
        "description": "An Australian qualifier has overcome body-shaming online trolls and a gruelling schedule to seal a main draw berth at Melbourne Park.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Kyrgios, Demon’s Aus Open paths revealed amid champ’s nightmare",
        "description": "The Australian Open draw landed some telling blows – including on the defending champions and an all-time great. See how it treated Australian stars Alex de Minaur and Nick Kyrgios.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Tigers hand down huge ban to wayward star",
        "description": "The Richmond gun who signed a massive contract last season will miss the beginning of 2025 as he awaits a court date in NSW.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Lewd photo, sext scandal rocks AFL",
        "description": "The boss of one of the biggest football clubs in Australia says he was the victim of a hacking attack as a lewd photo spreads across cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Broncos hard man keen for starting spot",
        "description": "Michael Maguire could face a selection headache in round 1 after the man he fought so hard to keep declared he wants to start matches for the Broncos this year.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Fitness freak smashes club record",
        "description": "Their fitness standards were in the headlines for all the wrong reasons last year, but a young gun is helping the Wests Tigers make a splash in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Reporter comes clean on Messi affair rumour",
        "description": "A sports presenter has broken her silence on Lionel Messi and affair rumours after a “flirty look” between the pair went viral.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Futsal National Championships Hub: How to watch, live stream schedule",
        "description": "The National Futsal Championships continue on Thursday with a huge day of action ahead. Watch seven pitches LIVE. See the full schedule.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Liverpool enraged as Ange takes title step",
        "description": "Ange Postecoglou has taken down a Premier League giant to take a step towards another title, but the win was overshadowed by a scary moment.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Huge brawl breaks out at Aussie fight night",
        "description": "Ugly footage shows punches being thrown as a brawl erupted in the grandstand during Jai Opetaia’s fight on the Gold Coast.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 16",
        "description": "Round 16 of SuperCoach NBL starts Thursday night – and every team plays twice. Here are the top trades and everything you need to know.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Smith’s next-level Australian Open spray",
        "description": "Cam Smith has gone on the attack over the Australian Open format, saying exactly what he thinks about the dual-gender event.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Newcastle, Orange previews: Minervini filly looks the real deal",
        "description": "Trainer Mark Minervini could have a genuine 2025 Queensland Oaks contender in his barn in the shape of Alideel who steps out at her home track of Newcastle.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Sales pitch begins to keep Wallabies coach",
        "description": "Public lauding of Wallabies coach Joe Schmidt will be the players’ way of convincing him to stay rather than private urgings that could put unwanted pressure on him.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Reds star aiming for stellar Super season",
        "description": "Queensland Reds star Tom Lynagh knows his best chance of regaining a Wallabies jersey is to shine for the Queensland Reds this year.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-09T07:24:52.277331"
    }
]