[
    {
        "title": "Boeing plea deal over fatal Max crashes rejected",
        "description": "The deal undermines the court and involves \"contradictory\" diversity requirements, a judge ruled.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Trump tariff threat puts a strain on Canada-Mexico ties",
        "description": "Canadian officials have suggested striking their own trade agreements with the US - and Mexico has taken notice.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "What we know about Musk's cost-cutting mission",
        "description": "Elon Musk and Vivek Ramaswamy are on Capitol Hill to discuss their new advisory body. So what will it do?",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Illegal Ghana gold mining causing widespread disruption",
        "description": "Illegal gold mining in Ghana picked up this year following an almost 30% rise in global gold prices, despite military operations to shut them down.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Trump tariff threat puts a strain on Canada-Mexico ties",
        "description": "Canadian officials have suggested striking their own trade agreements with the US - and Mexico has taken notice.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "New photos released as NYPD hunt insurance boss killer",
        "description": "Police are still working to determine a motive in the slaying of insurance executive Brian Thompson.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Who was Brian Thompson, healthcare CEO gunned down in New York?",
        "description": "Police are still searching for the suspect who shot dead the UnitedHealthcare CEO in Manhattan on Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "What next for Bitcoin after bursting $100k barrier?",
        "description": "The rapid increase in price has been attributed to Donald Trump's election victory - can it continue?",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Why are doctors wary of wearables?",
        "description": "Wearable tech claims to help monitor our health, but many doctors remain sceptical.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Why is vintage audio equipment booming?",
        "description": "Music lovers are buying up old cassette, CD and record players and getting them fixed.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Markets react to Trump's pick to run SEC - 5 Dec 2024",
        "description": "Markets react to crypto advocate Paul Atkins' nomination to lead the SEC, the US financial regulator.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Mattel sued over porn site misprint on Wicked dolls",
        "description": "A South Carolina mother claims her daughter visited the adult website on the doll's packaging.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Shell and Equinor to combine forces in North Sea",
        "description": "The energy firms say the deal will see the creation of the North Sea's biggest oil and gas producer.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Selling sex for gold in the Amazon's illegal mines",
        "description": "Life for women among the Amazon’s illegal gold miners is harsh, violent, and can be deadly.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "NYPD hunts gun-wielding assailant who killed UnitedHealthcare CEO outside hotel",
        "description": "Brian Thompson was \"targeted\" by a masked suspect who fled first on foot before grabbing an e-bike and heading towards Central Park.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Airbus cuts nearly 500 UK jobs to reduce costs",
        "description": "It has made the cuts mostly to its space division and says there are no \"compulsory\" losses planned.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Guinness supplies in UK being limited after demand soars",
        "description": "Guinness-maker Diageo has placed limits on wholesale distribution of the stout to pubs in Great Britain after \"exceptional demand\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Why are people in UK pouring milk down the drain over a cow feed additive?",
        "description": "The new additive aims to cut down on methane emissions from cows, but some have raised safety concerns.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Sweden’s ‘soft girl’ trend that celebrates women quitting work",
        "description": "Sweden has a reputation for strong gender equality, but some young women are giving up their jobs.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Niger junta takes control of French uranium mine",
        "description": "Since the coup last year, the junta has been trying to reduce French influence in the country.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "India police seek Starlink help over $4.25bn drug haul",
        "description": "Police say this is the first known case of the device's use to navigate and reach Indian waters.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Telegram U-turns and joins child safety scheme",
        "description": "It is the latest in a series of changes announced by the platform since its founder Pavel Durov was arrested.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Guardian and Observer journalists go on strike",
        "description": "Their first strike in more than 50 years concerns the proposed sale of the Sunday title to Tortoise.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "India taxi service sorry for driver's gunpoint robbery",
        "description": "A 30-year-old woman said she was travelling with her six-year-old son when the driver pulled out a gun.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Bank boss takes pay cut after employee 'tried to kill clients'",
        "description": "The bank apologised after the former worker was charged with robbery of clients, attempted murder and arson.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Bitcoin miner sues over £600m 'lost in tip'",
        "description": "James Howells believes the hard drive is now worth about £600m since the recent Bitcoin surge.",
        "source": "BBC Business",
        "fetched_date": "2024-12-06T07:26:39.279921"
    },
    {
        "title": "Natasha Lyonne Says Jennifer Coolidge Once Mistook Her for Hilary Duff",
        "description": "The 'Poker Face' star recalled seeing Coolidge at the Chateau Marmont when Coolidge though she was Duff: \"I was so confused.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Jake Paul Joins ‘Undisputed’ Boxing Video Game, While Mike Tyson Does Not",
        "description": "The influencer turned fighter is part of a downloadable player pack available Dec. 12.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Brandi Carlile on Writing Elton John Doc Song: “I Wanted People to Understand What I See in Elton” (Exclusive Video)",
        "description": "\"Never Too Late\" plays over the credits of the documentary of the same name, which streams on Disney+ on Dec. 13.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Has Sky Ferreira Finally Been Freed?",
        "description": "On Thursday, the musical cult hero puts our her first song away from nemesis Capitol Records in more than a decade, a cut from the 'Babygirl' soundtrack. It only deepens the mystery.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Taylor Swift ‘Eras’ Tie-in Book Sells More Than 800,000 Copies in First Weekend",
        "description": "The only bigger nonfiction launch was the first volume of Barack Obama’s presidential memoirs, 'A Promised Land.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Bob Dylan Is Sure Timothée Chalamet Will Be “Completely Believable as Me” in ‘A Complete Unknown’",
        "description": "Chalamet plays the music legend in a biopic set for release on Christmas Day.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "JonBenét Ramsey’s Father Says There’s a “Really Good Chance” Her Murder Could Be Solved",
        "description": "The father of the child beauty queen hopes that the latest DNA technology and familial genealogy research can help solve the cold case that is re-captivating the nation 28 years later.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Marvin Laird, Broadway and Film Composer and Musical Director for Bernadette Peters, Dies at 85",
        "description": "His credits in Hollywood included ‘Hello, Dolly!,’ ‘New York, New York,' ‘Maude,’ ‘Dynasty’ and ‘The Love Boat.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Nicole Kidman Honors Her Mother, Daughters and Female Mentors Who Have “Shown Up” at THR’s Women in Entertainment Gala",
        "description": "“Even though I don't have my mom anymore, I have my daughters. Faith was my mentor, my guide,” said the Oscar-winning actress while accepting the Sherry Lansing Leadership Award at The Hollywood Reporter's annual event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Shareholders at Rome’s Cinecittà Studios to Approve Restated Financial Records",
        "description": "The move comes following the discovery of errors in the iconic studio's 2023 accounts under former CEO Nicola Maccanico.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Jennifer Lawrence, Kerry Washington, Amanda Zurawski Present $1M in College Scholarships to High School Seniors at THR Women in Entertainment Gala",
        "description": "Scholarships were presented to mentees in the WIE Mentorship Program during Wednesday's star-studded event at the Beverly Hills Hotel.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Nikki Glaser Skewers Hollywood Beauty Standards, Jokes About Focus on Colin Farrell’s ‘Penguin’ Transformation at THR Women in Entertainment Gala",
        "description": "\"That’s how long it takes me every day to make sure I don't look like The Penguin,\" the comedian said of the actor's reported three hours in the makeup chair for his role as the Batman villain, now the subject of an HBO series.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-06T07:26:40.265905"
    },
    {
        "title": "Gout obliterates record books all over again",
        "description": "The legend of teenage sensation Gout Gout is continuing to grow after the prodigy once again rewrote the record books.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘FLAT TRACK BULLY’: Fans turn on Indian batting superstar",
        "description": "Just when India was looking settled in the second Test, three quick wickets had fans turning on the Indian batting line up.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Wayne Bennett alpha move is pure savagery",
        "description": "Wayne Bennett has produced a masterclass in savagery, bringing South Sydney’s star signing down to earth with a classic alpha move.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘Totally wild’: Raygun item says it all",
        "description": "Aussie cult figure Rachael “Raygun” Gunn has done it again with a crazy trend emerging about the much-maligned Olympian.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘Best fit’: Saints stick with great in key role",
        "description": "St Kilda says its AFLW program is heading in the right direction under a club great – urging fans to stay the course.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Eddie’s unthinkable move as secret revealed",
        "description": "If viewers ever thought Eddie McGuire’s days of being a media mogul were done, think again. The star presenter’s new move has shocked many.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Origin star set for new home in 2026",
        "description": "The Cowboys have lost a key player to a rival club, with the representative star joining the Roosters in 2026.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Munster’s warning to NSW over Bellamy move",
        "description": "Craig Bellamy has often said how much he hated coaching against his Storm players when he was at the Blues, but it’s something he’ll have to get used to.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘FLAT TRACK BULLY’: Fans turn on Indian batting superstar",
        "description": "Just when India was looking settled in the second Test, three quick wickets had fans turning on the Indian batting line up.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Runs for Inglis after surprise Shield dash",
        "description": "Cricket Australia found a way to get Josh Inglis time in the middle as a South Australian recruit made an impressive Shield ton.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Path to Aus Open return clears for Kyrgios",
        "description": "A key question has been answered over Nick Kyrgios’ Australian Open comeback plans as the tournament released the full list of entrants.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Brisbane options limited for Tomic",
        "description": "If Bernard Tomic wants to try to qualify for the Brisbane International, he will need some help from tournament organisers.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "F1 photo goes viral as feud goes nuclear",
        "description": "A photo of the F1 grid has sent fans into meltdown, as George Russell hit back at Max Verstappen and their feud went nuclear.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "F1 photo goes viral for worst reason possible",
        "description": "A photo featuring Aussie Oscar Piastri has gone viral in F1 circles this week as a team’s brutal transformation stunned commentators.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘Totally wild’: Raygun item says it all",
        "description": "Aussie cult figure Rachael “Raygun” Gunn has done it again with a crazy trend emerging about the much-maligned Olympian.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Jess Fox quietly splits from longtime partner",
        "description": "Australia’s Olympic golden girl Jessica Fox has reportedly split from her longtime partner at the end of a career best year.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "‘Dude is ridiculous’: Aussie wins NBA gong",
        "description": "Aussie guard Dyson Daniels has claimed a huge NBA award and earned massive plaudits from his Atlanta Hawks teammates.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Who’s the new NFL MVP frontrunner with the superstar fiancée?",
        "description": "It was a Thanksgiving Week for the ages for the new MVP frontrunner, and can anyone outside the top 4 contend for the Super Bowl?",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Legend to start in Matildas farewell game",
        "description": "The Matildas’ all-time games record holder will get a surprise bonus farewell appearance as intrigue remains over the search for a new coach.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Coach’s plea to A-League clubs",
        "description": "An international coach has urged A-League Women clubs to back in talented Taiwanese players who briefly threatened a boilover in Melbourne.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "The UFC fighter channelling the spirit of Elvis",
        "description": "At 57kg wringing wet – there’s little comparison between the physiques of the late Elvis Presley, and UFC pocket-rocket Alexandre Pantoja. But they share one bizarre dietary trait.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "How Cameron Smith could help golf cult hero to first pro win",
        "description": "He went toe to toe with Cameron Smith for the biggest moment of his young professional career, and now cult hero Corey Lamb is using it as motivation for his first professional win.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Basketball Australia Schools Championships HUB",
        "description": "Champions will be crowned on what promises to be a huge final day at the BA Schools Championships. Watch three courts LIVE. Click on the links below to go through to the day four action.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Rugby moves to secure Wallabies stars as NRL poachers circle",
        "description": "Rugby Australia has moved to secure the futures of several off-contract Wallabies as the NRL considers salary cap concessions to raid the 15-man code’s biggest stars. Find out more inside.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Wallaby gut punch as star makes NFL move",
        "description": "One of the Wallabies’ most exciting players has announced he is gambling everything to chase his dream in the United States.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Corey Brown gets pain relief after back surgery",
        "description": "Former champion jockey Corey Brown feels almost back to normal after back surgery to remove rods and screws that were inserted after a race fall that ended his career.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    },
    {
        "title": "Olympian ‘deathly pale’ after ugly crash",
        "description": "A double Olympic road cycling champ suffered horror injuries after a postal van worker opened their car door in front of him on a ride.",
        "source": "News AU",
        "fetched_date": "2024-12-06T07:26:41.171045"
    }
]