[
    {
        "title": "US jobs growth slows sharply as election looms",
        "description": "Employers added 12,000 jobs in October, much lower than the 223,000 created in September, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Musk election cash giveaways can continue as judge mulls case",
        "description": "Prosecutors say the case will now move to a federal court, following a request from Musk's lawyers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Russia fines Google more money than there is in entire world",
        "description": "The mind-boggling figure has been levied due to the company restricting Russian state media on YouTube.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "US election bets surge, despite red flags and mixed record",
        "description": "Election bets have exploded in the US, as it barrels toward the polls next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Musk election cash giveaways can continue as judge mulls case",
        "description": "Prosecutors say the case will now move to a federal court, following a request from Musk's lawyers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Energy CEO says fracking still 'necessary' - 1 Nov 2024",
        "description": "Energy CEO Lorenzo Simonelli wants to work with either candidate to help meet the energy demands in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Jeff Bezos defends Washington Post's end to election endorsements",
        "description": "The newspaper owner's comments follow the reported loss of subscribers and editorial staff resignations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Investors' reaction to Budget 'very different' to Truss",
        "description": "Treasury secretary speaks out to reassure the markets after a rise in the cost of government borrowing.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "Canada has launched a tourist drive but will tensions with China doom it to fail?",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Hollywood stars grow Wrexham  empire with brewery",
        "description": "The football club's star co-owners grow their Wrexham by buying half of the Wrexham Lager brewery.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "UK Budget 2024: Key points at a glance",
        "description": "Chancellor Rachel Reeves has delivered Labour’s first Budget since 2010 – here’s what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "UK growth set to peak next year before slowing again",
        "description": "The government's official forecaster raises its prediction for UK growth in 2024 and 2025 but reduces it for later years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Why Wikipedia has landed in legal trouble in India",
        "description": "India’s largest newswire service ANI has filed a $237,874 defamation lawsuit against Wikimedia Foundation.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "UK-based stars support US video game strikes as row continues",
        "description": "Famous voices from releases such as The Witcher and Cyberpunk 2077 say they support the SAG-Aftra strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "TikTok founder becomes China's richest man",
        "description": "Zhang Yiming's fortune has leapt to almost $50bn, according to a newly published rich list.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Adidas ends 'fight' with Kanye West over antisemitism",
        "description": "The two collaborated on the Yeezy collection but cut ties due to the rapper's controversial comments.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "McDonald's apologises for E. coli as sales slide",
        "description": "Boss Chris Kempczinski says sorry for the outbreak as the burger giant faces flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "HSBC profits jump as bank set for major shakeup",
        "description": "Pre-tax profits rose to $8.5bn in the three months to the end of September, beating analysts' expectations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-02T07:22:17.974842"
    },
    {
        "title": "Jamie Foxx Netflix Special About Mystery Illness to Release in December",
        "description": "“I said, ‘If I can stay funny, I can stay alive,’” the Oscar-winning actor says in a trailer for ‘Jamie Foxx: What Had Happened Was…,' set to bow globally on Dec. 10.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Fat Joe on New Starz Series, Rappers Endorsing Trump and Why Hip-Hop Artists Don’t Want to Talk to Journalists",
        "description": "“Who can you trust more than a rapper?” says the host of 'Fat Joe Talks.' And no, he's not joking.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "NBC News and MSNBC’s Election Day Gameplan: Data Is the Star of the Show",
        "description": "MSNBC's studio will have a virtual White House behind Steve Kornacki, while NBC's coverage will feature a virtual recreation of Rockefeller Plaza.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Jennifer Lopez Rallies Kamala Harris Supporters After Hinchcliffe Jibe: “It Wasn’t Just Puerto Ricans Offended That Day”",
        "description": "The actor-singer also described Republican candidate Donald Trump as someone \"who has constantly worked to divide us\" ahead of election day.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Shonda Rhimes to Join Debbie Allen, ‘Grey’s Anatomy’ and ‘Private Practice’ Cast for Get Out the Vote Trivia Livestream (Exclusive)",
        "description": "The acclaimed producer will compete alongside actors from two of her hit shows as well as Florida rep. Maxwell Frost.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "‘The Avengers’ Stars Reunite to Brainstorm a Catchphrase for Kamala Harris Ahead of Election",
        "description": "Scarlett Johansson helped organize the new get-out-the-vote video with fellow Marvel stars Robert Downey Jr., Chris Evans, Mark Ruffalo, Don Cheadle, Danai Gurira and Paul Bettany.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Stevie Nicks on Waiting Until 70 to Vote: “I Regret That, and I Don’t Have Very Many Regrets”",
        "description": "“The Lighthouse” singer is using her platform to advocate for reproductive rights.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Menendez Brothers Attorney Wants Them Released Before Holidays as DA Gascón Supports Clemency Bid",
        "description": "Another route to freedom for the incarcerated brothers has opened up and it will come down to Gov. Gavin Newsom, potentially before Thanksgiving.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Megan Thee Stallion Holds Back Tears at Documentary Premiere: “I Started to Watch a Lot of People Dehumanize Me”",
        "description": "'Megan Thee Stallion: In Her Words' will introduce people to Megan Pete — the woman behind the entertainment persona — for the first time, says the Houston rapper.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "How Pop Stars Are Gaming the Grammy Ballot",
        "description": "Sabrina Carpenter is competing in country, Megan Thee Stallion is competing in rock, and Jelly Roll is competing against himself. THR’s music editor Mesfin Fekadu looks behind this year’s ballot machinations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "John Legend’s Manager Pens New York Times Op-Ed on Predatory, “Toxic” Music Industry Amid Diddy Allegations: “We Can Clean It Up”",
        "description": "Emmy-winning producer Ty Stiklorius describes a Sean Combs yacht party she attended 27 years ago and says: \"We have an opportunity to turn the page on an archaic, sometimes predatory model of doing business.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "Japan Celebrates as Shohei Ohtani, Yoshinobu Yamamoto Win World Series with Dodgers",
        "description": "Baseball fans in Japan sought out special newspaper editions that rolled off the presses Thursday that paid tribute to Ohtani and Yamamoto.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-02T07:22:19.220921"
    },
    {
        "title": "AFL club’s wild bid to poach swimming star",
        "description": "Olympic swimming great and former footy player Kyle Chalmers has made an eye-popping reveal over an approach from an AFL club.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Watch out Pakistan: Wild Thing rockets into Aussie ODI squad",
        "description": "WA speed demon Lance Morris is in the frame to play his first international game since February after being a late inclusion into Australia’s ODI squad to face Pakistan.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Victory’s shot at Cup revenge",
        "description": "Fresh off a memorable Melbourne derby win, the Victory are full of confidence heading to Sunday’s meeting with Macarthur FC.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Jelena Dokic’s shock claim about abusive dad",
        "description": "Tennis great Jelena Dokic has made a shock claim about her relationship with her abusive father ahead of the release of her documentary.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "AFL club’s wild bid to poach swimming star",
        "description": "Olympic swimming great and former footy player Kyle Chalmers has made an eye-popping reveal over an approach from an AFL club.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Star’s wild claim about coach, ‘biscuit-gate’",
        "description": "Irish AFL great Zach Tuohy has turned the flamethrower on his former coach Brendon Bolton in an explosive excerpt from his new book.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "In-demand NRL half decides his future",
        "description": "The first major domino in NRL free agency has fallen after in-demand Sharks half Braydon Trindall decided his future.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is already in overdrive with a host of big names led by Ben Hunt on the move. Keep up to date with all the player movement as it happens in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Watch out Pakistan: Wild Thing rockets into Aussie ODI squad",
        "description": "WA speed demon Lance Morris is in the frame to play his first international game since February after being a late inclusion into Australia’s ODI squad to face Pakistan.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Khawaja, Hazlewood square off in Shield",
        "description": "Australian star Josh Hazlewood has returned to red-ball cricket in an intriguing battle against Queensland’s seasoned openers.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Jelena Dokic’s shock claim about abusive dad",
        "description": "Tennis great Jelena Dokic has made a shock claim about her relationship with her abusive father ahead of the release of her documentary.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Aussie Demon set for 20-year first",
        "description": "Alex de Minaur was supposed to be battling with a hip injury, but the Australian star’s fight has put him on the verge of a 20-year-first.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Piastri takes Brazil sprint pole but wary of team orders for Norris",
        "description": "Oscar Piastri grabbed pole position for the sprint race at the Brazilian Grand Prix and said he will race to win — but conceded that team-mate Lando Norris has a greater need of points.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "‘Horrible’: Wild Verstappen conspiracy theory",
        "description": "The man who penalised Max Verstappen for his tactics against Lando Norris as blasted the F1 champion’s “horrible mindset”.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Raygun takes world by storm all over again",
        "description": "Aussie Olympic breakdancer Raygun has come clean on her true feelings after she once again took the world by storm.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Cleary pic proves truth about relationship",
        "description": "Nathan Cleary has been making the most of the NRL off-season, with the latest pic proving his relationship with Mary Fowler has never been better.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "‘Greatest I’ve ever seen’: US stunned",
        "description": "New York Jets wide receiver Garrett Wilson has made one of the greatest plays of all-time that has left Americans with their jaws on the floor.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Travis’ racy reveal in Taylor Swift romance",
        "description": "Travis Kelce has made some telling comments about his high-profile relationship with Taylor Swift as engagement rumours swirl.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Victory’s shot at Cup revenge",
        "description": "Fresh off a memorable Melbourne derby win, the Victory are full of confidence heading to Sunday’s meeting with Macarthur FC.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Amorim handed challenge of restoring glory days to Man Utd",
        "description": "Ruben Amorim has signed a deal to be Manchester United manager, becoming the sixth permanent boss since Alex Ferguson retired in 2013.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Rival stunned as Tyson reveals physique",
        "description": "Mike Tyson has incredibly transformed his body in just one year ahead of his fight with Jake Paul and it’s even stunned his opponent.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "‘Old guy’ Smith lurking at Qld PGA",
        "description": "Tournament drawcard Cam Smith hung tough in the second round of the Queensland PGA despite having a `cold’ putter.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Phoenix rise from ashes to shock JackJumpers in comeback",
        "description": "Matt Hurt starred as South East Melbourne handed new coach Josh King a win in his NBL debut, with a come-from-behind win against the defending champion JackJumpers.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "NRL great ‘disappointed’ by anthem stance",
        "description": "Players make their own decisions about singing the national anthem before matches and it doesn’t sit well with one NRL great.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Aussie Olympians’ $100k pay day blocked",
        "description": "Rugby Australia are standing in the way of a plan for two of Australia’s biggest Rugby Sevens stars to maximise their earning potential.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Kingston Charm causes upset in Four Pillars",
        "description": "Kingston Charm races in famous colours and she did them proud with an exciting victory in the Four Pillars Midway at Rosehill courtesy of a brilliant ride from Zac Lloyd.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-02T07:22:20.785432"
    }
]