[
    {
        "title": "Stellantis boss abruptly quits in boardroom clash",
        "description": "Carlos Tavares will leave immediately, days after announcing plans to close a Vauxhall plant in Luton",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Trump threatens 100% tariff on Brics nations if they try to replace dollar",
        "description": "The president-elect warned the group of nine nations against moving away from the dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Five ways to persuade more people to buy electric cars",
        "description": "Demand for electric cars is lower than expected, the industry says. What might help to boost sales?",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Belgium's sex workers get maternity leave and pensions under world-first law",
        "description": "They will be entitled to official employment contracts, health insurance and sick days.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Trump threatens 100% tariff on Brics nations if they try to replace dollar",
        "description": "The president-elect warned the group of nine nations against moving away from the dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Cyber Monday: How to spot a deal and not get ripped off",
        "description": "Experts tell us how to work out if a deal is a genuine bargain or could leave you out of pocket.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "‘Italian’ purees likely to contain Chinese forced-labour tomatoes, BBC finds",
        "description": "Some products described as “Italian” appear to contain Chinese tomatoes, BBC investigation suggests.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Why Canada’s Christmas presents may not be delivered on time this year",
        "description": "Small businesses are fretting as negotiations stall between Canada's postal service and its unionised workers.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Specialty coffee wins over tea lovers in small-town India",
        "description": "Once restricted to only big cities, high-end specialty coffee chains are finding new customers across India.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Why so many games are failing right now - and why others are breakout hits",
        "description": "Making games is hard and, in 2024, getting people to buy them is another challenge.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "'Trump tariffs may backfire on US auto firms' - Nov 27, 2024",
        "description": "Expert says Trump's tariffs could hurt US firms as much as their Canadian counterparts in the auto industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Canada’s oil patch rattled by Trump's tariff threat",
        "description": "The proposed tariffs, if applied to oil and gas, could hammer Canada's economy and hike prices at the pump for Americans, analysts say.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Al Fayed tried to control me with envelopes of cash, says ex-Harrods director",
        "description": "Harrods boss manipulated and controlled managers to conceal his crimes, ex-director tells the BBC.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Major Canadian news outlets sue OpenAI",
        "description": "The suit, a first for Canada, alleges OpenAI's chatbot was illegally scraping news articles, which the firm denies.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Capturing the scent of Palestinian life in a bottle",
        "description": "Palestinian perfumers try to evoke memories of a better time with \"ingredients\" of their heritage.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Uniqlo faces China backlash over cotton comments",
        "description": "Commentators call for a boycott of the chain in China after it told the BBC it does not use Xinjiang cotton.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Rupert Grint to pay £1.8m after losing tax battle",
        "description": "The former Harry Potter star is ordered to pay the sum after losing a tax appeal.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Crypto entrepreneur eats banana artwork bought for $6.2m",
        "description": "Justin Sun described Maurizio Cattelan's infamous 2019 work as \"much better than other bananas\".",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Indian airlines hit by nearly 1,000 hoax bomb threats",
        "description": "More than 500 of the year's bomb threats were received just in the last two weeks of October.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Canada watchdog sues Google over alleged anti-competitive conduct",
        "description": "The suit is the latest regulatory headache for Google, which is facing similar action in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Australia approves social media ban on under-16s",
        "description": "The ban aims to reduce \"harms\" on children and will take at least a year to implement, the PM says.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "A fatal car crash in India sparks concerns over Google Maps",
        "description": "Three men allegedly using Google Maps for directions died after their car fell off an unfinished bridge.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Mark Zuckerberg dines with Donald Trump at Mar-a-Lago",
        "description": "Relations appear to have improved markedly from Trump's threat earlier this year to throw the Meta boss in jail.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Uniqlo does not use Xinjiang cotton, boss says",
        "description": "It is the first time the CEO of the chain's owner, Fast Retailing, has directly addressed the issue.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "UK electric car production drops with firms 'under pressure'",
        "description": "The trade body for the sector says these are \"deeply concerning times\" for the UK's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Uber probed by US regulator over subscription plan",
        "description": "The ride-hailing giant says it received inquiries from the FTC about Uber One cancellation procedures.",
        "source": "BBC Business",
        "fetched_date": "2024-12-02T07:27:52.900438"
    },
    {
        "title": "Hailee Steinfeld Engaged to Buffalo Bills Quarterback Josh Allen",
        "description": "Allen and Steinfeld were first linked in the spring of 2023.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Super Bowl Pregame Performers: Jon Batiste, Lauren Daigle, Trombone Shorty and Ledisi",
        "description": "The Grammy-winning musicians will be part of the pregame entertainment ahead of Kendrick Lamar's halftime performance on Feb. 9 in New Orleans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Rainy Macy’s Thanksgiving Day Parade Boasts Balloons and Stars in New York",
        "description": "Jennifer Hudson, Idina Menzel and Kylie Minogue were among those who performed at this year's edition of the Turkey Day spectacle.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "21 Pro-Palestinian Demonstrators Arrested at Macy’s Thanksgiving Day Parade",
        "description": "The group, which blocked a Ronald McDonald balloon, carried Palestinian flags and banners and chanted, \"Free, free Palestine!\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Sean “Diddy” Combs Denied Bail After Third Try",
        "description": "The court stressed rap mogul's propensity for violence in addition to evidence indicating his \"willingness to skirt\" rules during his stay in prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Sharon Stone Says “Ignorant” and “Uneducated” Americans to Blame for Trump Re-Election",
        "description": "The actress had some strong words about America when discussing politics at the Turin Film Festival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "The Weeknd Pairs New Album Release With One-Night-Only Concert at Rose Bowl",
        "description": "'Hurry Up Tomorrow' will drop on Jan. 24, and a day after the pop star will hold at special concert at the famed stadium.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Kamala Harris’ Team Says ‘Hot Ones’ Turned Her Down and Clarifies Joe Rogan Decision",
        "description": "Campaign staffers explain some of their podcast decisions — including not going on Joe Rogan's podcast — and how some shows rejected the candidate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Marilyn Manson Drops Defamation Lawsuit Against Evan Rachel Wood",
        "description": "The two sides reached the settlement for Manson to pay Wood's legal fees after the court last year dismissed defamation claims.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Jason Kelce Says It’s an “Immediate No” When People Ask for Taylor Swift Tickets",
        "description": "Kelce says the superstar singer has told him \"she will take care of anybody\" he asks for but that he \"doesn't want it to be that kind of dynamic.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Zach Bryan Scolds Concertgoer From Stage: “Don’t Throw Sh**”",
        "description": "The tense moment during the country singer's Washington gig over the weekend comes after ex-girlfriend Brianna \"Chickenfry\" LaPaglia claimed he was emotionally abusive.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Drake Claims UMG, Spotify “Artificially Inflated” Kendrick Lamar’s Diss Track “Not Like Us”",
        "description": "UMG says the allegations about \"Not Like Us\" — one of the biggest hits of the year — are “offensive and untrue.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-02T07:27:53.263713"
    },
    {
        "title": "Bombshell details behind F1 blackmail plot",
        "description": "Eye-opening details behind the plot to blackmail F1 legend Michael Schumacher and his family have been revealed.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Former NRL bad boy’s shock new role",
        "description": "Todd Carney, who was sacked by two clubs in his NRL career, has made a surprise return to the top tier of rugby league.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Wife speaks out after $422m star KO’d",
        "description": "The wife of an NFL superstar has taken to social media after her husband was knocked out in one of the ugliest late hits ever seen.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Two ex-coaches return in shock appointment",
        "description": "NSW has made a bold choice to replace Michael Maguire, with two former coaches returning to the Blues in a surprise appointment.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Suns swing axe on coach after review",
        "description": "Gold Coast has brought an abrupt end to its AFLW senior coach’s tenure despite two years remaining on his contract.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Downside of AFLW grand final timeslot",
        "description": "North Melbourne’s chief executive says there’s a reason the AFL has to carefully consider whether to pursue more night-time grand finals.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Former NRL bad boy’s shock new role",
        "description": "Todd Carney, who was sacked by two clubs in his NRL career, has made a surprise return to the top tier of rugby league.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Teammate’s pitch to keep off-contract stars",
        "description": "The Broncos are feeling the salary cap squeeze as they try to re-sign a couple of star outside backs who are off contract at the end of the 2025 season.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Former NRL boss to be unveiled as new cricket chief",
        "description": "Cricket Australia is set to announce a former NRL chief as its new CEO, as outgoing boss Nick Hockley prepares to hand over in early 2025.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘No bad blood’: Head quashes rift talk",
        "description": "Australia’s most in-form batter denies there is any tension between their struggling top order and the “big four” bowling attack.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Djokovic to headline blockbuster week",
        "description": "Novak Djokovic and some of the best players in the world will light up Rod Laver Arena in a big win for fans and charities a week before the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Our sport is cooked’: Kyrgios blasts No. 1s",
        "description": "Aussie tennis star Nick Kyrgios has remained consistent after it was revealed former world No. 1 Iga Swiatek tested positive for a banned substance.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Lost all respect’: Max gives rival both barrels",
        "description": "Max Verstappen has torn strips off an F1 rival in a blistering spray as details emerged about a fiery confrontation between the drivers.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "F1 star quits on spot, Aussie gets early debut",
        "description": "An Australian young gun is set to make his F1 debut early after a driver walked out on his team with one race still remaining in the season.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "McGregor’s fiancee says the unthinkable",
        "description": "Conor McGregor’s partner has spoken out after the civil court findings and her response is horrifying.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Ring girl’s fame reaches absurd heights",
        "description": "Boxing’s latest viral sensation continues to take the internet by storm with Sydney Thomas left overwhelmed by her new-found fame.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Insane’ Aussie receives enormous praise",
        "description": "Dyson Daniels’ star continues to soar, with the young Aussie drawing huge praise from one of the best players in NBA history.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Insanity’: Pepper spray act rocks America",
        "description": "Ugly scenes have shocked America with police investigating a post-game brawl that is going viral for all the wrong reasons.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Interim Matildas coach unsure about future",
        "description": "Matildas interim coach Tom Sermanni is unsure if his temporary tenure will extend beyond this week’s two-game series against Chinese Taipei.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Liverpool deepen Man City crisis to extend Premier League lead",
        "description": "Liverpool has opened up a nine-point lead at the top of the Premier League after beating Manchester City 2-0, while Ange Postecoglou’s Tottenham have come back to earth. EPL WRAP",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘Most fixed thing ever’: Boxing farce stuns",
        "description": "Boxing fans have been left bewildered and horrified after an utter debacle of a fight finished in farcical scenes that many believe was fixed.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Legend survives scare in big Aus Open win",
        "description": "A day that started with high hopes for a decade-long winning drought coming to an end finished with something completely different.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 11",
        "description": "The biggest star in SuperCoach NBL is smashing records and one of the best picks of the year is back on the trade radar. Here’s how to maximise your score for round 11.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "World stunned by ‘craziest injury ever’",
        "description": "A rugby player has suffered a seriously nasty injury after copping a blow in one of the craziest incidents ever seen on a sporting field.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "‘On the verge of tears’: Star’s late heroics",
        "description": "Australia’s heartbreak at the Olympics feels like a distant memory after they produced some late magic against New Zealand.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Taree preview: Highway prospect has Golden Slipper-winning connections",
        "description": "Trainer Wayne Wilkes is hoping his lightly-raced mare Sheila’s Fanta Sea can keep on her upward trajectory when he steps out at Taree on Tuesday.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    },
    {
        "title": "Australia bans Olympic medallist for life",
        "description": "Australian cycling has thrown the book at Olympic medallist Matthew Richardson, slamming the door shut after his shock defection.",
        "source": "News AU",
        "fetched_date": "2024-12-02T07:27:54.877570"
    }
]