[
    {
        "title": "The secretive US factory that lays bare the contradiction in Trump's America First plan",
        "description": "An exclusive look inside the closely guarded factory the president wants to become a foundation stone for a US golden age.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "The world's most dangerous country for trade unionists",
        "description": "More trade union members are murdered in the South American nation than anywhere else.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "What one of America's most lively sporting events says about the economy",
        "description": "The Preakness horse race is also famous for its party atmosphere - so what was the mood at a time of tariffs and market turmoil?",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Ros Atkins on... Trump's deals in the Gulf",
        "description": "The BBC's Analysis Editor Ros Atkins examines President Trump's trip to the Gulf.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "The world's most dangerous country for trade unionists",
        "description": "More trade union members are murdered in the South American nation than anywhere else.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "UK driverless cars unlikely until 2027 - but Uber says it's ready now",
        "description": "The previous government had said autonomous vehicles were \"set to be on the road\" by 2026.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "New buy now, pay later rules aim to protect shoppers",
        "description": "Lenders will have to carry out affordability checks and shoppers will have faster access to refunds under the plans.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Defence deals and palace invites: UK and EU haggle before first summit since Brexit",
        "description": "Defence deals, fishing rights and closer economic ties among the talking points at Downing Street.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Week in Markets - 16 May 2025",
        "description": "A weekly summary of the big stories from financial markets around the world.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "India’s electric car future",
        "description": "Tesla is rolling out in India, Asia’s third-largest economy where EV sales grew 2000% over the last five years.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "US loses last perfect credit rating amid rising debt",
        "description": "Moody's said successive US administrations had failed to reverse ballooning deficits and interest costs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Why youth mobility and fishing are key issues ahead of UK-EU summit",
        "description": "Youth mobility and fishing rights are key negotiating points between the UK and the EU as PM Keir Starmer attempts a post-Brexit \"reset\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Five House Republicans stall Trump's 'big, beautiful' tax bill",
        "description": "Lawmakers from the president's own party  joined all Democrats to reject a key domestic bill, demanding deeper budget cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Four obstacles for Republican rebels in Trump's tax bill",
        "description": "Government-funded welfare programmes have become a major point of contention in Trump's tax bill.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Doom: One of gaming's oldest series reckons with the challenges of 2025",
        "description": "Doom is one of the most well-known series in gaming but it still has to work to find new players.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "US proposes dropping Boeing criminal charge",
        "description": "Families criticised the move, which would avoid a trial that is due to begin in June.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Billionaires fall as King rises in latest Sunday Times Rich List",
        "description": "The King's personal wealth is now equal to former prime minister Rishi Sunak and his wife at £640m.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Wegovy firm unexpectedly forces boss to step down",
        "description": "The decision, described as a response to market challenges and a slide in its share price, was unexpected.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Nissan says it could share global plants with Chinese state firm",
        "description": "Nissan announced this week that it would lay off another 11,000 workers and shut seven factories.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Is Britain really inching back towards the EU?",
        "description": "The summit between the UK and EU on 19 May will be the first since Brexit - the very idea of it has polarised opinions",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "UK needs more nuclear to power AI, says Amazon boss",
        "description": "The world's largest cloud computing company plans to spend £8bn on new data centres in the UK over the next four years.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Walmart says higher prices could hit this month due to tariffs",
        "description": "The retailer says it isn't able to absorb all the pressure from tariffs, even at the reduced levels announced.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "India disputes Trump claim it is ready to charge US 'no tariffs'",
        "description": "India's foreign minister countered Trump saying \"nothing is decided till everything is\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Seventeen arrest warrants issued over Bangkok skyscraper collapse",
        "description": "The State Audit Office tower collapsed when Bangkok felt tremors of a massive earthquake in Myanmar.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Leading crypto firm Coinbase faces up to $400m hit from cyber attack",
        "description": "The firm says hackers have obtained customer information by paying off employees.",
        "source": "BBC Business",
        "fetched_date": "2025-05-19T07:28:09.292452"
    },
    {
        "title": "Eurovision 2025: Austria Wins Song Contest With Johannes Pietsch, Israel Places Second",
        "description": "The Grand Final was overshadowed by a failed stage invasion during a performance by Israeli singer and entrant Yuval Raphael.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Bob Dylan and Willie Nelson Charm Hollywood Bowl With Favorites, Deep Cuts at Outlaw Music Festival Tour Stop",
        "description": "The tenth anniversary of Nelson’s touring festival came to the Bowl Friday night and also featured Sierra Hull and Billy Strings.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Paula Beer on ‘Mirrors No. 3,’ Her Fourth Film With Christian Petzold and His Ensemble Approach",
        "description": "The German star discusses the movie, premiering in the Directors’ Fortnight in Cannes, early career comparisons with Romy Schneider, and why making movies is about \"being ready at the right time.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "John Mellencamp Honors Republic Records at Grammy Hall of Fame Gala",
        "description": "Cat Stevens’ \"Tea for the Tillerman,\" Santana’s \"Supernatural\" and Jay-Z’s \"Reasonable Doubt\" were among the 13 records inducted at the ceremony on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Jewish Rapper and Comedian Kosha Dillz Says His Film’s Canceled Screening Has Been Reinstated",
        "description": "“Bring the Family Home” will play its Chicago theater playdate in the coming weeks",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "How Simple Minds’ Gen X Anthem, “Don’t You (Forget About Me),” Almost Didn’t Come to Be",
        "description": "Ahead of a U.S. tour, and 40 years after the song hit No. 1, frontman Jim Kerr talks to THR about the band’s legacy and the power of Pasadena’s Cruel World festival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Sean “Diddy” Combs’ Ex Cassie Ventura Tells Court She Doesn’t Hate Him Despite Decade of Abuse",
        "description": "The heavily pregnant R&B singer detailed their violent and tumultuous relationship in grave detail in federal court this week as the prosecution's star witness.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Hours After Release, Morgan Wallen’s ‘I’m The Problem’ Is Already Spotify’s Most-Streamed Country Album of 2025",
        "description": "Spotify confirmed Wallen's fourth album is the platform's most-streamed country album of the year just over half a day after it released on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Foo Fighters Part Ways With Drummer Josh Freese",
        "description": "\"I'm not angry, just a bit shocked and disappointed,\" said Freese, who replaced the late Taylor Hawkins two years ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Justin Bieber Denies Being One of Diddy’s Victims: “There Are Individuals Who Were Genuinely Harmed By Him”",
        "description": "Bieber has long been speculated to be one of Combs’ victims after a clip of the hip-hop mogul hanging out with the then-15-year-old singer resurfaced online after Combs’ arrest.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Donald Trump Puts Bruce Springsteen on Notice Upon Return From European Tour: “We’ll See How It Goes for Him”",
        "description": "In another unfiltered rant, the president’s missive included a veiled threat concerning the rocker’s re-entry to the U.S.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Chris Brown Denied Bail After U.K. Arrest on Assault Charge",
        "description": "The controversial singer was ordered to be held until his next hearing on June 13, the same day he's set to take the stage in Frankfurt, Germany, on the third date of his world tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-19T07:28:09.553877"
    },
    {
        "title": "Huge twist in race for football’s biggest prize",
        "description": "FIFA’s Club World Cup has a new home in Australia, and the tournament could have a big bearing on who wins football’s highest honour.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "AFL melts over star’s Selwood tribute",
        "description": "AFL great Chris Judd has delivered a heartfelt tribute to Adam Selwood as the football community continues to mourn his loss.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Victory defender suffers serious knee injury",
        "description": "A Melbourne Victory defender’s worst injury fears have been realised following his side’s weekend loss to Auckland FC.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Insane jockey incident blows minds",
        "description": "Footage of a jockey performing an insane act has forced commentators to come up with a new word for the English language.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "‘Pub footballer’: King’s remarkable journey",
        "description": "Max King looked at all the predicted Origin sides and couldn’t see his name anywhere, but he’ll make his Blues debut next week after he was picked in the only squad that matters.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Slater gives journo a lesson in blunt exchange",
        "description": "There was one particular question that irked Billy Slater as the Queensland coach explained his controversial selection gamble.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "AFL melts over star’s Selwood tribute",
        "description": "AFL great Chris Judd has delivered a heartfelt tribute to Adam Selwood as the football community continues to mourn his loss.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Grim reality behind AFL’s most tragic team",
        "description": "The West Coast Eagles were soaring high in 2006, but less than two decades later they’re being remembered for all the wrong reasons.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Khawaja stays at Bulls despite feud",
        "description": "Despite his anger with Queensland’s head of elite cricket Joe Dawes, Test star Usman Khawaja is staying with the Bulls for another season.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "5.6 million reasons for Aussies to win WTC final",
        "description": "Taking the mantle as the world’s best Test team is motivation for Australia to win the World Test Championship final, but a massive new carrot has been dangled.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Jelena Dokic drops huge baby news",
        "description": "Tennis star Jelena Dokic, who survived horrific abuse at her father’s hands, has spoken about her own plans to start a family.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "‘Call Roger’: Djoker’s shock coaching move",
        "description": "Just weeks out from the French Open and Wimbledon, Novak Djokovic has announced a shock moving in his coaching ranks.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Massive gamble to blow up in AFL club’s face",
        "description": "A fallen AFL dynasty has suddenly turned its fortunes around as a massive gamble looks set to blow up in a rival club’s face.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "‘F***ing Piastri’: Aussie brutally tormented",
        "description": "Oscar Piastri was forced to endure a cruel moment with Max Verstappen with a radio message saying it all after a dramatic race.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "‘They’re weak’: F1 champ torches McLaren",
        "description": "Oscar Piastri was “caught sleeping” by Max Verstappen in a stunning move on the Aussie, as a world champ labelled McLaren “weak”.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Combined Aussie-Kiwi team coach named",
        "description": "The next coach of the Wallabies will lead a combined Australia-New Zealand outfit against the British and Irish Lions in July.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "American facing huge ban for stomping Aussie",
        "description": "An American rugby sevens star is facing a mammoth ban for brutally stomping on the head of an Australian player in an act of “thuggery” on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Baseball world rocked by Aussie icon’s death",
        "description": "A massive ‘outpouring of shock and loss’ has swept through the Australian sporting world after the unexpected death of an Aussie Olympian.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Huge twist in race for football’s biggest prize",
        "description": "FIFA’s Club World Cup has a new home in Australia, and the tournament could have a big bearing on who wins football’s highest honour.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Victory defender suffers serious knee injury",
        "description": "A Melbourne Victory defender’s worst injury fears have been realised following his side’s weekend loss to Auckland FC.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "‘This is sad’: Horror ref attack rocks boxing",
        "description": "A boxing referee has been punched out of the ring after a fight had finished in shameful scenes that left the sport horrified.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Scheffler outlasts Rahm to claim third major at PGA Championship",
        "description": "World number one Scottie Scheffler has captured his third major title, seeing off Spain’s Jon Rahm down the back nine in the final round to win the PGA Championship.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Celebrities lose it after huge NBA victory",
        "description": "The stars were out in force as the New York Knicks sealed a drought-breaking NBA win, sparking wild celebrations across the city.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Insane jockey incident blows minds",
        "description": "Footage of a jockey performing an insane act has forced commentators to come up with a new word for the English language.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Aussie’s epic solo escape to claim maiden Grand Tour stage win",
        "description": "Aussie cyclist Luke Plapp held a bottle of bubbly as he revealed the emotional roller coaster of his season so far after taking out his maiden Grand Tour stage win.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "Olympian’s apology will break your heart",
        "description": "Rohan Dennis’s heartwrenching apology letter to his late wife has emerged after the Olympic cyclist was sentenced for his role in her death.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    },
    {
        "title": "‘Heart broken’: WWE legend dead at age 60",
        "description": "An icon of the wrestling world has died just weeks after his final match with stars of the industry left “heartbroken”.",
        "source": "News AU",
        "fetched_date": "2025-05-19T07:28:10.241289"
    }
]