[
    {
        "title": "Trump says US economy in 'transition' as trade war escalates",
        "description": "New retaliatory tariffs from China targeting some US farm products came into effect on Monday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Canada's next PM Mark Carney vows to win trade war with Trump",
        "description": "The 59-year-old political newcomer says he will keep tariffs on US imports \"until the Americans show us respect\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Luxury lounges: Credit card perks we are all paying for",
        "description": "Why credit card providers are opening lavish customer lounges in airports and cities.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Bourbon is out, patriotism is in: How Canadians are facing Trump threats head on",
        "description": "Across the country, Canadians are defiant in boycotting American goods and travel even as Trump promises another temporary reprieve.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Canada's next PM Mark Carney vows to win trade war with Trump",
        "description": "The 59-year-old political newcomer says he will keep tariffs on US imports \"until the Americans show us respect\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "How Britain's former top banker became Canada's next prime minister",
        "description": "The former banker may not have been elected to office before, but his experience managing global economic crises will help.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "'We go from dinner service to dealing with a corpse': What happens when an air passenger dies",
        "description": "Crews will try to shield passengers from the body by using empty aisles, blankets and dim lighting.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "North Korean hackers cash out hundreds of millions from $1.5bn ByBit hack",
        "description": "Hackers from the infamous Lazarus Group are in a cat-and-mouse game to launder their stolen funds from the ByBit heist.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Deep-sea mining tech advances but doubts remain",
        "description": "Despite opposition investors are still looking at deep-sea mining technology.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "As US and Canada trade barbs, it's so far so good for Mexico's Sheinbaum",
        "description": "Donald Trump and Justin Trudeau's clear tensions are a stark contrast to the Mexican leader's approach to the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "What will be in the chancellor's Spring Statement?",
        "description": "Chancellor Rachel Reeves will give more detail about the government's plans for the UK economy.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Data, waves and wind to be counted in the economy",
        "description": "Wind and wave power is set to be included in calculations of the size of countries' economies for the first time, as part of changes approved at the United Nations.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Is Trump reining in Musk after a cabinet showdown with secretaries?",
        "description": "The president intervenes in a cost-cutting row after a reported clash at the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "US job growth stable as government cuts start",
        "description": "Employers added 151,000 jobs in February but there was a drop in federal employment.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Trump 'strongly considering' large-scale sanctions and tariffs on Russia",
        "description": "The president has reversed US policy and says he trusts Putin and finds dealing with Ukraine difficult.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Boots gets new US owner in multi-billion dollar deal",
        "description": "There have been reports the Boots chain could be sold off separately by its new owner.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Trump team hits pause on tariffs - but still sees them as vital tool",
        "description": "The White House sees levies as a means to reshape America's relationship with its global partners.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Trump pulls $400m from Columbia University, saying it failed to protect Jewish students",
        "description": "The Trump administration accuses the college of \"appalling inaction\" in the wake of student rallies.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "'A pig in lipstick': Trump's strategic Bitcoin reserve criticised",
        "description": "The reserve will hold cryptocurrency forfeited to the government in criminal or civil proceedings, said the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "SpaceX rocket explodes, raining debris from sky for second time in a row",
        "description": "It grounded flights in Orlando, Miami and Palm Beach after debris concerns from Starship's failed launch.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Trump expands exemptions from Canada and Mexico tariffs",
        "description": "Trump said he was granting the two US neighbours a temporary exemption on tariffs that he imposed two days ago.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Jack Daniel's hits out at Canada pulling US alcohol",
        "description": "Some Canadian provinces have removed US-made alcohol from shelves in response to US tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "European Central Bank cuts interest rates again",
        "description": "The bank cuts rates to 2.5% but faces pressures from threatened US tariffs and plans to boost military funding.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Carmakers win break from Trump's tariffs on Canada and Mexico",
        "description": "Trump says he will exempt cars from the new import taxes, while continuing his criticism of Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "Sweden is 'no longer a country that cannot be trusted'",
        "description": "Sweden and Finland's defence sectors are benefiting from their countries joining Nato.",
        "source": "BBC Business",
        "fetched_date": "2025-03-10T07:22:25.699093"
    },
    {
        "title": "The Ruby Experience Gives L.A. Crowd a Chance to Rock With Jennie",
        "description": "The 29-year-old K-Pop star brought her debut solo album, ‘Ruby,’ to L.A.’s Peacock Theater for a night full of experimental and cinematic production, a range of genres and immense gratitude to her fans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Buffy Sainte-Marie to Lose Juno Award Honors Following Indigenous Ancestry Investigation",
        "description": "The Oscar winner is also set to lose two Polaris music prizes after a 2023 CBC program claimed the Sainte-Marie had been fraudulently posing as Native.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Why So Many Recording Artists Struggle to Get Health Insurance",
        "description": "In most label deals, artists sign as independent contractors. And while SAG-AFTRA counts around 3,500 recording musicians among its ranks, a $27,540 annual earnings threshold is one hurdle.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Trump’s Kennedy Center Pushes Back On Idea of Politically Motivated Show Cancellations",
        "description": "The organization, which has seen a shift in leadership, said recent show cancellations have either been due to “lack of sales or artist availability.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Justice on Computer Malfunctions, Stage Fright and Owing a Debt to Daft Punk",
        "description": "Currently on an epic world tour, the Grammy-winning techno duo snuck into L.A. for a revealing chat about secret inspirations and terrifying moments of man vs. machine.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "California’s Gavin Newsom Opposes Trans Athletes in Women’s Sports, Splitting With Progressives",
        "description": "Newsom made his declaration in an extended conversation with conservative activist Charlie Kirk.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Lady Gaga Says Alter Ego Jo Calderone Was a Way to Explore What She “Was Looking for in Men”",
        "description": "\"[Jo was] also what I was maybe lacking in myself,\" Gaga said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Jack Schlossberg Calls Out Cousin RFK Jr.’s Wife Cheryl Hines Over Child’s Death From Measles",
        "description": "“Almost every single case of measles is in someone who’s not vaccinated. I think you’re the perfect person to say sorry,\" the outspoken Democratic advocate said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Sean “Diddy” Combs Accused of Forced Labor in Superseding Indictment",
        "description": "Prosecutors also say that he forced an employee to have sex with him. Combs has denied the allegations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "King Charles Partners With Apple Music to Release His Playlist, Featuring Kylie Minogue, Raye and More",
        "description": "In an extraordinarily personal insight into Charles III's music taste, 'The King's Music Room' was recorded at Buckingham Palace in his private office.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Pamela Bach, ‘Baywatch’ Actress and David Hasselhoff’s Ex-Wife, Dies at 62",
        "description": "They were married for 17 years and share two daughters.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "The Future of Reggae and Dancehall Discussed at Island Music Conference in Jamaica",
        "description": "“I would really like for the artists to come in and make connections and understand the game and not get fucked like the old ones did,” said Shaggy of the third annual confab.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-10T07:22:25.915429"
    },
    {
        "title": "Alarming footage exposes Collingwood stars",
        "description": "Collingwood fans had little to cheer as the Giants demolished them in the opening round and alarming foorage from the game will do little to ease concerns.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Kyrgios’ cryptic message ignites rumour mill",
        "description": "Nick Kyrgios’ tennis career has been up in the air since retiring hurt at Indian Wells on Friday and he has now seemingly made up his mind.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Surgery avoided but star Hawk to miss a month",
        "description": "Fears of a serious ankle injury to a star Hawk were allayed as a forgotten defender ticked a big box in his push to return.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "NRL billionaire hits back at Las Vegas claims",
        "description": "The Sydney Roosters’ $2.4 billion supremo has hit out after he and Mark Bouris came under investigation over a Las Vegas incident.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Crucial NRL program axed for 2025",
        "description": "Graham Annesley has spent the past seven years answering questions about contentious calls in games, but that won’t happen in 2025 after his weekly media briefing was axed.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "NRL billionaire hits back at Las Vegas claims",
        "description": "The Sydney Roosters’ $2.4 billion supremo has hit out after he and Mark Bouris came under investigation over a Las Vegas incident.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Alarming footage exposes Collingwood stars",
        "description": "Collingwood fans had little to cheer as the Giants demolished them in the opening round and alarming foorage from the game will do little to ease concerns.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Surgery avoided but star Hawk to miss a month",
        "description": "Fears of a serious ankle injury to a star Hawk were allayed as a forgotten defender ticked a big box in his push to return.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Cricket furore over ‘most meaningless win’",
        "description": "There has been more heartbreak for New Zealand after defeat in the Champions Trophy final with many fans saying the same thing.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Bold plan for Shield final in between AFL games",
        "description": "The change to drop-in pitches in Adelaide could help a move to play the year’s biggest domestic cricket game day after an AFL match at the same ground.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Kyrgios’ cryptic message ignites rumour mill",
        "description": "Nick Kyrgios’ tennis career has been up in the air since retiring hurt at Indian Wells on Friday and he has now seemingly made up his mind.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "‘Tough to watch’: Djokovic hits sad new low",
        "description": "Tennis great Novak Djokovic’s career continues to take a sad turn, with the Serbian’s age appearing to be taking a serious toll on his game.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Storm legend goes rogue, exposes Bellamy",
        "description": "Melbourne Storm players have revealed the nightmare door knock they received from “crazy lunatic” coach Craig Bellamy.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "‘Vulnerable’ Ricciardo reveals sad F1 truth",
        "description": "As Daniel Ricciardo said farewell to Formula One for the final time, he made a confession that suggested he was ready to retire.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "‘Feel sick’: World erupts at shock F1 footage",
        "description": "Cameras have captured a star F1 driver in a seriously vulnerable state that’s left fans questioning whether he should have been filmed.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "‘Disappointing’ Reds produce horror show against Crusaders",
        "description": "The Queensland Reds were their own “worst enemies” after suffering a heavy loss at the hands of the Crusaders on Sunday afternoon. Here’s where it went wrong and the one major positive.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Tahs title contenders? NSW off to best Super Rugby start in 15 years",
        "description": "Don’t say it too loud because the Waratahs have a nasty habit of letting their most loyal fans down, but this current team really could be a contender for another Super Rugby title.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Star inks historic half-a-billion dollar deal",
        "description": "The record books have been rewritten after an NFL quarterback put pen to paper on a brand new, eye-watering contract.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Woman’s X-rated photo act caught on TV",
        "description": "Two unsuspecting women have been caught out on live TV with video of a private photo pose spreading across cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Spurs saved from embarrassing defeat, Arsenal stumble again",
        "description": "Ange Postecoglou’s Tottenham salvaged a point as Spurs’ winless run continued while Arsenal’s fading title hopes suffered a fresh blow and Chelsea bounced back. PREMIER LEAGUE WRAP",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Red card, stunning solo goal cap entertaining Auckland, Jets draw",
        "description": "A controversial red card to an Auckland substitute was just one of several key moments in an entertaining draw between the league leaders and Newcastle. Catch up on all the latest news from the round.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Fans all say same thing after UFC robbery",
        "description": "UFC great Alex Pereira has every right to feel hard done by after bizarre scorecards saw his belt taken away from him.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "‘Surreal’: Aussie child prodigy now a champ",
        "description": "Tiger Woods recognised the talent in Aussie prodigy Karl Vilips and a message from the 15-time major winner was waiting after his PGA Tour breakthrough in just his fourth start.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "LeBron in heated confrontation about his son",
        "description": "US sports personality Stephen A. Smith has lifted the lid on what made LeBron James confront him on the sidelines during a Lakers game.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Goulburn preview: Quinton’s sister act on show",
        "description": "Ron Quinton heads to Goulburn on Tuesday with a couple of handy fillies that just happen to be full sisters bred by the Hall Of Famer himself.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "Woman’s X-rated photo act caught on TV",
        "description": "Two unsuspecting women have been caught out on live TV with video of a private photo pose spreading across cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    },
    {
        "title": "‘First baby of two champs’: Aussie’s big news",
        "description": "Controversial boxing star Ebanie Bridges has dropped a series of photos of her new baby boy with fellow world champ Kell Brook.",
        "source": "News AU",
        "fetched_date": "2025-03-10T07:22:28.522827"
    }
]