[
    {
        "title": "Reeves suggests UK trade with EU more important than US",
        "description": "The chancellor indicates that moving closer to the EU on trade is a bigger priority than the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "How much has Elon Musk's Doge cut from US government spending?",
        "description": "BBC Verify has looked at the agency's biggest claimed savings, examining the figures and speaking to experts.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "'My bananas were seized and destroyed' - Malawi-Tanzania trade row escalates",
        "description": "Following the crackdown, some traders have resorted to selling their goods in secret, the BBC hears.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "M&S stops online orders and issues refunds after cyber attack",
        "description": "The firm has stopped taking orders on its website and apps, including for food and clothes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "How much has Elon Musk's Doge cut from US government spending?",
        "description": "BBC Verify has looked at the agency's biggest claimed savings, examining the figures and speaking to experts.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Why Trump keeps attacking the US central bank",
        "description": "The US central bank is one of Trump's favourite punching bags. But how serious is the threat?",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Mangione pleads not guilty to federal murder charge over CEO's killing",
        "description": "The 26-year-old is charged with murder and stalking, in addition to other state charges.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "China has halted rare earth exports. Can Australia step up?",
        "description": "Australia has proposed to create a strategic reserve of critical minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Could South America benefit from Trump's trade tariffs?",
        "description": "Countries in the continent may see exports rise as both the US and China need new suppliers.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Lilly Sabri talks after two-year silence on social media",
        "description": "The fitness influencer went silent after a story about her fiancee allegedly cheating went viral.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "BBC licence fee 'unenforceable', says UK culture secretary",
        "description": "Lisa Nandy tells the Telegraph \"no options are off the table\" when it comes to its review into the broadcaster's charter.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Company bosses warn over tariffs impact",
        "description": "Several firms have cut their profit forecasts or withdrawn them citing economic uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "California passes Japan as fourth largest economy",
        "description": "The US state expresses worries that President Donald Trump's tariffs could stunt future growth.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "UK Chancellor: There is a deal to be done with the US",
        "description": "Rachel Reeves speaks to the BBC ahead of talks with her US counterpart in Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Who will win the race to develop a humanoid robot?",
        "description": "Humanoid robots are attracting a lot of investment but will China dominate the industry?",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "China tells Trump: If you want trade talks, cancel tariffs",
        "description": "China denies any trade talks with the US as it calls for sweeping tariffs to be cancelled.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Will Elon Musk really leave Doge and what happens when he does?",
        "description": "The Tesla boss says he will step back from government work - but exactly when and how is unclear.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Trump crypto soars as president offers dinner to top holders",
        "description": "The meme coin's website says its 220 top investors will be invited to a gala event with the president.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "UK edges towards youth visa deal with EU",
        "description": "An agreement has emerged as a key European demand in ongoing negotiations for a post-Brexit \"reset\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "ANC U-turn over tax that threatened South Africa's government",
        "description": "The finance minister drops a planned VAT increase after one party in the coalition government goes to court.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "UK bans video game controller exports to Russia",
        "description": "The Foreign Office says Russia was \"buying harmless goods and turning them into tools of war\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "A dozen US states sue to halt Trump's tariffs",
        "description": "The lawsuit argues President Trump did not have the authority to enact the levies and start a global trade war",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Five cards China holds in a trade war with the US",
        "description": "From rare earths to billions in US debt, here's what China has in its arsenal - and how strong they are.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Cyber attack causes further chaos for M&S shoppers",
        "description": "Customers have reported problems with click and collect orders as well as card and contactless payments.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Opportunity for big US-China trade deal, says Bessent",
        "description": "The comments from the US Treasury Secretary come as the trade war between the world's two biggest economies has escalated.",
        "source": "BBC Business",
        "fetched_date": "2025-04-26T07:23:08.815075"
    },
    {
        "title": "Justin Bieber Heading Abroad to Finish Long-Awaited Album (Exclusive)",
        "description": "The pop superstar is hard at work on the follow-up to 2021’s ‘Justice.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "George Santos Sentenced to Over 7 Years in Prison for Fraud and Identity Theft",
        "description": "“I offer my deepest apologies,” said disgraced former U.S. Rep. Santos, adding: “I cannot rewrite the past, but I can control the road ahead.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Controversial Group Kneecap Parts Ways With Booking Agency, Putting Work Visas in Question (Exclusive)",
        "description": "The band, which made headlines for its pro-Palestine, anti-Israel pronouncements during the Coachella Music Festival, is no longer represented by IAG.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Bill Maher Reacts to Larry David’s “Insulting” “My Dinner With Adolf” Essay: “It’s an Argument You Lost Just to Start It”",
        "description": "“Look, maybe it’s not completely logically fair, but Hitler has really kind of got to stay in his own place,” Maher said during a sit-down with Piers Morgan.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Rainn Wilson Says “Left-Leaning News” Has a “Passion” Against Trump Administration",
        "description": "“A large majority of people who have a problem with the current immigration crisis are not racist but [are] often kind of tarred as racist by the liberal left,” the actor said on an episode of his podcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Harvey Weinstein to Remain at Bellevue Hospital for Now",
        "description": "A civil court judge postponed making a more permanent decision on the stay Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Cornell University Cancels Kehlani Concert Over Singer’s Pro-Palestine Remarks",
        "description": "Selecting Kehlani to headline Cornell’s annual Slope Day “has injected division and discord” into the event, university president Michael I. Kotlikoff wrote in a letter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Lorde Releases Long-Awaited New Single “What Was That”",
        "description": "“This is gonna be crazy, you have no idea,” the Grammy previously told fans ahead of the track’s debut.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Metallica’s Kirk Hammett Says ‘Heck Yeah’ At Thought of Performing At the Sphere",
        "description": "The legendary guitarist sat down with THR after releasing a 400-page coffee table book showcasing his collection of instruments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "UMG Nashville Rebrands as Music Corporation of America",
        "description": "The rebrand comes two months after CEO Mike Harris and chief creative officer Dave Cobb came to the company following the exit of Cindy Mabe.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Usher’s ‘Rendezvous in Paris’ Concert Film to Stream on BET+ in May",
        "description": "“I’m happy to be partnering with BET+ to bring the celebration of my 30-year career to you, the fans, to enjoy from the comfort of your homes,” the eight-time Grammy Award winner said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Griff Is Stepping Out of Her Comfort Zone to Craft Her Next Hit",
        "description": "The Hollywood Reporter’s latest “Person of Interest” is the 24-year-old British singer-songwriter — a rising star in the pop scene — who fully leans into her creativity: “Let me just mess around for a bit and see what comes out.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-26T07:23:09.770561"
    },
    {
        "title": "Freddie reveals horror pix for the first time",
        "description": "England cricket great Freddie Flintoff has revealed the horror photos from his infamous Top Gear crash for the first time.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "‘Why would I care?’: Benji Marshall snaps",
        "description": "Benji Marshall has clearly had enough of Lachlan Galvin talk, refusing to explain why he recalled the wantaway Tigers playmaker.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Sydney FC in ‘transition’ mode",
        "description": "Sydney FC coach Ufuk Talay has been trying to strike the right balance of giving younger players a chance while still bidding to win silverware.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Donald Trump erupts over shock NFL snub",
        "description": "United States President Donald Trump has delivered a scathing rant on social media after NFL owners snubbed a young star.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "‘Why would I care?’: Benji Marshall snaps",
        "description": "Benji Marshall has clearly had enough of Lachlan Galvin talk, refusing to explain why he recalled the wantaway Tigers playmaker.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Smith’s stunning message amid DCE rumours",
        "description": "The Roosters will always be linked to rival playmakers when they become available, but they might not need to go to market after what Sandon Smith showed them on the big stage.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Coach speaks out over Ugle-Hagan saga",
        "description": "Western Bulldogs coach Luke Beveridge has opened up as the situation surrounding Jamarra Ugle-Hagan continues to drag on.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Crows star’s delivers ugly ‘uppercut’",
        "description": "An Adelaide Crows star appears set to come under heavy scrutiny after delivering a “left uppercut” to an opponent on Friday night.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Freddie reveals horror pix for the first time",
        "description": "England cricket great Freddie Flintoff has revealed the horror photos from his infamous Top Gear crash for the first time.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "‘Dog’: Slater’s abusive text before attack",
        "description": "Disgraced cricket great Michael Slater’s horrifying tirade towards a woman – where he assaulted and threatened to kill her – has been laid bare in court.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Barty wiped from history by Aussie teen",
        "description": "Aussie teenager Maya Joint continues to make waves in the tennis world, this time by knocking off a longstanding record held by Ash Barty.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Tennis world slams ‘creepy’ shower rule",
        "description": "Tennis players will have to abide by a new ‘creepy’ shower rule as the sport works to implement stricter doping measures.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Max’s ‘disrespectful’ Piastri act causes stir",
        "description": "Max Verstappen has been called out for a cold act towards Oscar Piastri that has raised eyebrows after the Aussie’s Grand Prix win.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Formula 1 rocked by bombshell theory",
        "description": "A new storm is brewing after a year of internal warfare that threatened to up-end the contract of the sport’s most prized asset.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Lynagh’s early double sets up Reds’ big win over Blues",
        "description": "The Queensland Reds flexed considerable championship muscle in its 35-21 thwarting of the Auckland Blues, capitalising on a hot start fuelled by Tom Lynagh’s early double.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "McDermott tips Kiss to succeed as Wallabies coach",
        "description": "Queensland Reds mentor Les Kiss has been endorsed ahead of his expected elevation to the role of Wallabies coach.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Donald Trump erupts over shock NFL snub",
        "description": "United States President Donald Trump has delivered a scathing rant on social media after NFL owners snubbed a young star.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Eddie McGuire’s son puts his dad to shame",
        "description": "Eddie McGuire has seemingly done it all, but his son has got one over his famous father after meeting with US President Donald Trump.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Sydney FC in ‘transition’ mode",
        "description": "Sydney FC coach Ufuk Talay has been trying to strike the right balance of giving younger players a chance while still bidding to win silverware.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Victory party after locking in A-League finals berth",
        "description": "Melbourne Victory pulled out party tricks on a night where they celebrated securing finals football thanks to a win over Macarthur FC, which ended the Bulls’ own post-season hopes.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Fans fear for champ over ‘horrific’ footage",
        "description": "Boxing fans have raised serious concerns after an alarming video of a fighter attempting to cut weight spread across social media.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Smith finds form on LIV tour",
        "description": "Cameron Smith has found some form in the opening round of LIV Golf’s Mexico City event.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Aussie star snubbed for prestigious NBA award",
        "description": "History was always against Dyson Daniels and his hopes of claiming one of the NBA’s top awards, with the Aussie star denied by a Cleveland rival.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Port Macquarie tips, preview: Golden chance at ideal trip",
        "description": "It has taken a little longer than planned but trainer Glen Milligan finally has Golden Honour up to his ideal trip at Port Macquarie on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Model kicked out of Schumacher’s inner circle",
        "description": "The tight-knit inner circle of Fomula 1 legend Michael Schumacher’s has shrunk after his son and his model partner split.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    },
    {
        "title": "Shaq forced to bolt from live TV",
        "description": "While analysing a compelling Nuggets-Clippers on “Inside the NBA” alongside the rest of the crew, O’Neal made a hurried, flustered exit.",
        "source": "News AU",
        "fetched_date": "2025-04-26T07:23:11.010987"
    }
]