[
    {
        "title": "OpenAI boss denies sister's allegations of childhood rape",
        "description": "Ann Altman filed a lawsuit alleging her brother sexually abused her between 1997 and 2006.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Bezos-owned Washington Post cuts more jobs, reports say",
        "description": "Layoffs come at a time of growing losses and turmoil over editorial decisions at the US newspaper.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Facebook and Instagram get rid of fact checkers",
        "description": "Meta says its platforms will instead rely on \"community notes\" from its users, an approach pioneered by X.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Europe leaders criticise Musk attacks",
        "description": "Although some of Europe's leaders have found favour with the billionaire, others are worried by his interventions.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Bezos-owned Washington Post cuts more jobs, reports say",
        "description": "Layoffs come at a time of growing losses and turmoil over editorial decisions at the US newspaper.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "US launches probe of Tesla's 'smart summon' driverless tech",
        "description": "Safety regulators launched the investigation after reports of crashes involving the feature, which allows drivers to summon parked cars.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Rolls-Royce factory to expand for more bespoke cars",
        "description": "The luxury carmaker will almost double the size of its factory to build more one-offs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Trump ramps up threats to gain control of Greenland and Panama Canal",
        "description": "The president-elect said he would not rule out the use of military force to seize control of the Panama Canal and Greenland.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Cryptocurrencies and personal AI: Tech to watch out for in 2025",
        "description": "Will 2025 be a hinge year for cryptocurrency and will personalised AI appear on your phone?",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "China's overqualified youth taking jobs as drivers, labourers and film extras",
        "description": "With high youth unemployment rates, Chinese graduates are resorting to working as waiters, cleaners and movie extras.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Report says Trump plans less aggressive tariffs - 6 Jan 2025",
        "description": "President-elect Donald Trump has called reports that he could adopt pared-back tariffs as 'fake news'.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Andrew reported after 'false' business name claim",
        "description": "Prince Andrew has been accused of using a 'false name' in how a business was registered.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Bangladesh authorities seek Siddiq account details",
        "description": "It comes after the Treasury minister was named in an anti-corruption probe in the country.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Shein lawyer refuses to say if it uses Chinese cotton",
        "description": "Yinan Zhu declined to say whether it retailer's suppliers used Chinese cotton amid concerns over forced labour.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Apple urged to withdraw 'out of control' AI news alerts",
        "description": "Apple has pledged improvements to its news summarising tool, but critics say it is dangerous and needs to be withdrawn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "US designates Tencent a Chinese military company",
        "description": "China's embassy in Washington branded the move as an \"unreasonable suppression\" of its firms.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Nvidia unveils robot ambitions and powerful new gaming chips",
        "description": "The announcement was part of Mr Huang's address at CES, an annual technology show in Las Vegas.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "UFC boss to join board of Facebook owner Meta",
        "description": "It comes days after former UK deputy PM Sir Nick Clegg left his top job at the social media giant.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Farage aims to 'mend fences' with Elon Musk in US",
        "description": "It comes after the tech billionaire called for Farage to be replaced as Reform UK leader.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Managers 'touch up' staff: McDonald's faces fresh abuse claims",
        "description": "Workers at the fast-food chain tell the BBC they still face sexual abuse despite pledges to improve safeguarding.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Bet365 boss takes big pay cut but still makes £158m",
        "description": "Denise Coates has been credited with the rapid rise of the online gambling firm.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Bank regulator resigns before Trump term citing 'risk of dispute'",
        "description": "Michael Barr had been a target of Republicans for his call for stricter oversight of banks.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Nippon and US Steel sue government over blocked deal",
        "description": "The companies allege President Biden \"ignored the rule of law to gain favor\" with trade unions.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Trump's eyeing Greenland - but other Arctic investment is frozen",
        "description": "While Trump eyes Greenland, Norway and Russia have put the brakes on their polar region investments.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Musk says Farage 'doesn't have what it takes' to be Reform UK leader",
        "description": "Nigel Farage claims Musk's call is due to a disagreement over support for far-right activist Tommy Robinson.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Motorbike-sized tuna sold to Tokyo sushi restaurateurs for $1.3m",
        "description": "The huge bluefin, which was auctioned in Tokyo, will be served at restaurants across Japan.",
        "source": "BBC Business",
        "fetched_date": "2025-01-08T07:22:54.052918"
    },
    {
        "title": "Wildfires Burn Through Pacific Palisades (Photos)",
        "description": "Among the residents who call the area home are Jennifer Aniston, Bradley Cooper, Eugene Levy, Tom Hanks and Rita Wilson, Reese Witherspoon, Adam Sandler, Michael Keaton and Miles Teller.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Author Liz Pelly on Spotify Book, Ghost Artists and Speaking Up for Indie Musicians",
        "description": "'Mood Machine,' a mix of investigative reporting and cultural criticism, focuses on how Spotify has reshaped how we listen to music: \"This is a book that’s about music, but it’s also a book about surveillance, politics and labor.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Peter Yarrow, One-Third of Folk Music Trio Peter, Paul and Mary, Dies at 86",
        "description": "The singer-songwriter, who co-wrote \"Puff the Magic Dragon,\" had bladder cancer for the past four years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Tragedy in New Orleans: “Music Is What’s Going to Bring the City Back,” Says Preservation Hall Chief",
        "description": "Ben Jaffe, director of the hallowed jazz institution in the heart of the French Quarter, grapples with a massacre that targeted the city’s cultural essence.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "“Jump In and Learn How to Swim After”: Robbie Williams, Andra Day and the Songwriter Roundtable",
        "description": "Andrew Watt, Camille and Andrew Wyatt also discuss their dream collaborators, spirit animals and whether writing film music is more like a battle or a surreal experience.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "French Far-Right Firebrand Jean-Marie Le Pen Dies at 96",
        "description": "The founder of France's National Rally party, and father of Marine Le Pen, pioneered Trump-style populist, anti-immigrant politics.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Elon Musk’s “Lies and Misinformation”: U.K. Prime Minister Criticizes That “A Line Has Been Crossed”",
        "description": "Labour Party leader Keir Starmer took aim at the tech mogul on Monday, saying that \"the poison of the far-right leads to serious threats\" to his ministers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Golden Globes: ‘Emilia Peréz’ Star Karla Sofía Gascón Says “Light Always Wins Over Darkness” in Emotional Acceptance Speech",
        "description": "The film won in four categories, including the final award of the evening, for best comedy or musical motion picture.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Mike Rinder, Scientology Whistleblower Who Won an Emmy Exposing Organization, Dies at 69",
        "description": "With Leah Remini, Rinder co-hosted the A&E docuseries 'Leah Remini: Scientology and the Aftermath' and the podcast 'Scientology: Fair Game.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Brenton Wood, ‘The Oogum Boogum Song’ Singer, Dies at 83",
        "description": "The musician passed away from natural causes, according to his manager and assistant.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Carol Burnett Shouts “I Love You” to Ted Danson as He Receives Golden Globes Award in Her Honor",
        "description": "Viola Davis was also presented with the Cecil B. DeMille Award by Meryl Streep at the inaugural Golden Gala on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Biden to Award Medal of Freedom to Denzel Washington, Michael J. Fox, Anna Wintour and Bono",
        "description": "Hillary Clinton, Ralph Lauren, Magic Johnson, Bill Nye and José Andrés will also be awarded the nation's highest civilian honor Saturday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-08T07:22:55.307153"
    },
    {
        "title": "Musk tied to bombshell $8.6bn EPL bid",
        "description": "The Tesla and X chief, who has ties to the area, has been linked with a huge splash on the iconic Premier League giants.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "SCG ‘stinker’ official pitch rating revealed",
        "description": "The best Test series in years was played on the best pitches according to official ratings with even the spicy SCG deck Australia beat India in three days on getting the tick.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "‘Been so successful’: Aussie gun’s call for Ashes love",
        "description": "The Australian women’s cricket team is arguably the most successful of any sport and going into a blockbuster series players want their time in the spotlight.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Unthinkable image rocks tennis pre-Aus Open",
        "description": "The tennis world has been left with their jaws on the floor with images from inside Melbourne Park sending social media into a spin.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "SCG ‘stinker’ official pitch rating revealed",
        "description": "The best Test series in years was played on the best pitches according to official ratings with even the spicy SCG deck Australia beat India in three days on getting the tick.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "‘Feels like a novelty’: Rivals united over change to Ashes format",
        "description": "Australia and England’s women may be preparing to battle it out for the Ashes, but they are united in their call to make future series three Tests to avoid the one-off match become a ‘novelty’.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "How Aus Open bolter regained confidence",
        "description": "Maddison Inglis has credited a landmark win by a fellow Australian with fuelling her surge towards an Aus Open comeback.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "‘Perfect opportunity’: Barty pumps up teen",
        "description": "Ash Barty has some sage advice for the teenage star who has drawn excited comparisons to the Aussie former world No.1.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "AFL star’s alleged gross public act",
        "description": "A young West Coast Eagles star has been charged by WA Police after being caught allegedly committing a gross act in public.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "AFL player charged with public urination",
        "description": "A 20-year-old elite sportsman will face court for allegedly urinating in public and not giving police his name.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "‘My way’: How Luai can save the Tigers",
        "description": "Jarome Luai has often spoken about wanting to be Batman. He now gets the chance at the Wests Tigers as he steps out of Nathan Cleary’s shadow.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Controversial sighting at Broncos training",
        "description": "A banned NRL star has made a controversial return to the paddock in the wake of being charged over a horror incident.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Reporter comes clean on Messi affair rumour",
        "description": "A sports presenter has broken her silence on Lionel Messi and affair rumours after a “flirty look” between the pair went viral.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Musk tied to bombshell $8.6bn EPL bid",
        "description": "The Tesla and X chief, who has ties to the area, has been linked with a huge splash on the iconic Premier League giants.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Roar’s horror season continues",
        "description": "One of Brisbane’s best players is set to leave the club as the Roar’s shocking season goes from bad to worse.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "‘He has everything I want’: Why Opetaia has a target on his back",
        "description": "He’s Australia’s only current male world champion – and that’s not the only reason he’s got a target on his back. But Jai Opetaia is risking the lot in tonight’s title fight. Follow it live here.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Aussie legend’s stunning NBA milestone",
        "description": "An Australian Olympic hero has just reached a jaw-dropping milestone in the NBA.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Trump tune-up for Smith’s Masters bid",
        "description": "It’s been nearly two years since talks of a LIV merger with the PGA Tour were first raised, but the breakaway tour has confirmed its own big plans for 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Grimson stable recruit steps up for open class test",
        "description": "While one of his stars chases a $1m bonus on the NSW country scene, Jason Grimson will also go bush in Victoria with an exciting stable recruit.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Reds star aiming for stellar Super season",
        "description": "Queensland Reds star Tom Lynagh knows his best chance of regaining a Wallabies jersey is to shine for the Queensland Reds this year.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "David Pocock reveals major life update",
        "description": "It’s the first glimpse fans have been given of the Pocock family’s newest member since their pregnancy announcement earlier this year.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-08T07:22:57.519884"
    }
]