[
    {
        "title": "US-Boeing deal over crashes 'repugnant' - lawyer for victims' families",
        "description": "The plane maker has agreed to pay $1.1bn to avoid prosecution over two fatal crashes that killed 346 people.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "How airline fees have turned baggage into billions",
        "description": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Analysis: Tariff relief for UK but new clock ticking on US deal",
        "description": "If the UK's deal with the US is not finalised by 9 July, the UK's tariff on steel will go back up to 50%.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "UK chancellor announces £15bn for transport projects",
        "description": "Money will be spent on tram, train and bus projects in England across the Midlands, North and West Country.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "How airline fees have turned baggage into billions",
        "description": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Stores open at midnight as fans rush to buy Nintendo Switch 2",
        "description": "One retailer says it's the \"biggest gaming pre-order ever\" - but there questions over whether high prices will dent sales.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Musk turns on Republicans - and gives Trump's big bill a harder path",
        "description": "The billionaire's criticism could embolden Republicans who are considering voting against the tax and spending bill.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Musk urges Americans to tell lawmakers to 'kill the bill'",
        "description": "Billionaire says the bill, which faces a key test in the Senate, undercuts efforts to slash federal spending.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "US green energy firms brace for federal funding cuts",
        "description": "Billions of dollars of US federal funding for green energy projects hangs in the balance.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Winemakers finding Trump's tariffs hard to swallow",
        "description": "Wine producers in both France and the US are unhappy at the US president's trade actions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Trump tax bill can have 'good and bad' effects - 22 May 2025",
        "description": "Investment Strategist Guy LeBas says the tax bill passed by the House has good and bad impacts on growth.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "The British jet engine that failed in the 'Valley of Death'",
        "description": "Workers at Reaction Engines felt they were close to completing a revolutionary jet engine.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Trump's 50% tariffs on metals come into effect",
        "description": "Trump doubles down on his tariffs, while sparing the UK from the latest duties.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "UK temporarily spared from Trump's 50% steel tariffs",
        "description": "The executive order raises import taxes for US firms buying from other countries - but the levy remains at 25% for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Oreo maker sues Aldi in US over 'copycat' packaging",
        "description": "The discount supermarket is being sued in a US court, accused of imitating the American biscuit brand.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Debt and trade issues weaken UK growth, OECD says",
        "description": "The policy group lowers its UK economy forecast due to trade barriers and Britain's \"very thin\" financial buffer.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Pornhub pulls out of France over age verification law",
        "description": "It's the latest setback for the world's most popular porn site, which is also under investigation by the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Tesla is 'not interested' in producing cars in India - minister",
        "description": "This is the first time India has publicly admitted that it has not been able to lure investment dollars from Musk.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Defamation trial begins for MyPillow boss Mike Lindell over election claims",
        "description": "The MyPillow boss is being sued by a former Dominion Voting Systems employee who says his reputation was \"irreparably tarnished\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "UK threatens to sue Abramovich over Chelsea sale",
        "description": "The proceeds have been frozen since the UK government forced the club's sale following Russia's invasion of Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Thames Water's future in doubt after investor pulls out",
        "description": "The setback increases the possibility that the company will collapse into a government-supervised administration.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "North Face and Cartier customer data stolen in cyber attacks",
        "description": "They are the latest in a string of high-profile companies publicly reporting being hacked.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Disney makes hundreds more layoffs as it cuts costs",
        "description": "The media giant has been under pressure as viewers move away from cable TV to streaming platforms.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "TikTok Shop food listings in UK 'putting people at risk'",
        "description": "The BBC finds food listed on TikTok shop without ingredient and allergen information.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Tulsa plans $105m in reparations for America's 'hidden' massacre",
        "description": "A century ago, a white mob burned down part of the Oklahoma city known as \"Black Wall Street\", killing hundreds.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Bill Gates to give most of his $200bn fortune to Africa",
        "description": "The Microsoft founder urges young innovators to use Artificial Intelligence to improve health services.",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "China says US has 'severely violated' tariffs truce",
        "description": "The comments come after Trump said on Friday that China had \"totally violated its agreement with us\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-05T07:27:34.691109"
    },
    {
        "title": "Jessie J Reveals Early Breast Cancer Diagnosis",
        "description": "The Grammy nominee took to Instagram to share the news because she \"wanted to be open and share it” partly “because selfishly I do not talk about it enough.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Aging CEOs, Ambitious Nepo Babies and a Tech Revolution: Succession in the Music Biz",
        "description": "Meet the new boss… same as the old boss? As the industry prepares for the AI takeover, insiders question who’s next in line at the major labels.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Billy Joel Tells Howard Stern: “I’m Not Dying”",
        "description": "The music icon discussed his brain disorder issues with Stern after canceling his tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "ABBA’s Björn Ulvaeus on Writing a Musical Assisted by AI and Those Kiss Avatars: SXSW London",
        "description": "\"The Future of Entertainment\" was the topic in focus for the Swedish singer, songwriter, producer and co-founder of Pophouse Entertainment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Death of “Grassroots” Live, Electronic Music Venues Gets U.K. Parliament Review: SXSW London",
        "description": "With input from fans, the goal is to support \"a thriving grassroots music scene and building a sustainable talent pipeline that ensures the U.K. music industry remains one of the U.K.’s global success stories.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Former Celebrity Lawyer Tom Girardi Gets 7 Years in Prison for Stealing Millions From Clients",
        "description": "A jury in August found him guilty of four counts of wire fraud, and he could have been sentenced to up to 80 years in prison.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Diddy Trial Sees Heckler Disrupt Court as Judge Learns Anonymous Witness’ Name Leaked Online",
        "description": "The eight-week federal trial is steadily moving along and on time, with several witnesses testifying, but some bumps in the road came on Tuesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Heart Band Members Report Stolen Instruments, Offer Reward for Their Return",
        "description": "The news comes after the rock band was set to perform at the Hard Rock Hotel & Casino in Atlantic City this past Saturday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Vinyl Me, Please Finds New Ownership to Get Saved From Bankruptcy",
        "description": "\"We have big plans to grow this community and welcome a new generation of collectors. But first, we have to do right by the customers who built it,\" CEO Nick Alt said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Sabrina Carpenter Summer? Singer Announces New Single ‘Manchild’ Ahead of Primavera Sound Set",
        "description": "“This one’s about you!!” the two-time Grammy Award winner wrote in an Instagram post sharing the news of the new song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "Sean “Diddy” Combs Paid to Hide Cassie Beating Video Because He Feared Career Ruin, Witness Says",
        "description": "A security guard testified Tuesday that the fallen mogul gave him a brown paper bag stuffed with cash in order to buy what he hoped was the only copy of surveillance footage of the assault.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    },
    {
        "title": "The 13 Commandments of Being a Background Actor",
        "description": "From enduring bad haircuts to avoiding stunt people, the author of 'Unfortunately, I Was Available' details the dos and don'ts of life as a film and TV extra.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-05T07:27:35.566236"
    }
]