[
    {
        "title": "Shein and Temu warn tariffs will raise prices in US",
        "description": "The firms said operating expenses have risen \"due to recent changes in global trade rules and tariffs\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Why China curbing rare earth exports is a blow to the US",
        "description": "As the trade war continues to escalate, China has hit back at Trump by suspending exports of rare earth minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Aboard the 'silver trains', China's retirees do their bit to offset Trump's tariffs",
        "description": "A new initiative aims to boost the local economy by attracting elderly travellers to remote parts of the country.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "'Getting Instagram to fix my account was almost traumatising'",
        "description": "Small businesses say Meta is not helping them recover their hacked Instagram and Facebook accounts.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Why China curbing rare earth exports is a blow to the US",
        "description": "As the trade war continues to escalate, China has hit back at Trump by suspending exports of rare earth minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Gold hits new record over US-China trade war fears",
        "description": "Prices rose after the US Fed's chair warned tariffs could hit economic growth and fuel inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Vance to visit India as Trump intensifies tariff war with China",
        "description": "The visit comes as India and US continue high-stakes talks to finalise a bilateral trade deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Tesla whistleblower wins legal battle against Elon Musk",
        "description": "Engineer Cristina Balan raised a safety concern about a design flaw which could affect the cars' braking in 2014.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Malaysian trade minister on US tariffs",
        "description": "Malaysia's minister Zafrul Aziz will be representing the ASEAN bloc in its negotiations with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Finland's bid to win Europe's start-up crown",
        "description": "Helsinki wants to become a top European start-up hub, but can it challenge London and Stockholm?",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Tariffs will hit US economy and raise prices, Fed boss warns",
        "description": "Jerome Powell, chair of the Federal Reserve, said Donald Trump's new import taxes were larger than expected.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "US tariffs will make global trade shrink, says WTO",
        "description": "The Geneva-based institution says American tariffs will send international trade into reverse.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Viral videos claim luxury bags are made in China - is it true?",
        "description": "BBC Verify's Jake Horton looks into the truth behind the claims, and what we know about how luxury goods are made.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "California becomes first state to sue over Trump tariffs",
        "description": "The state - the 5th largest world economic power - says it is being disproportionately impacted by the tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Nvidia shares plunge amid $5.5bn hit over export rules to China",
        "description": "The chip manufacturing giant will require licences to export its H20 AI chip to China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Racially charged row between Musk and South Africa over Starlink",
        "description": "The tech billionaire is embroiled in a row with the government over black empowerment legislation.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "UK bans EU cheese and meat to stop disease spreading",
        "description": "People coming into Great Britain can no longer bring cured meats or cheese from the EU following an outbreak of foot-and-mouth disease.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "The perils of Trump's chips strategy: The US will struggle to take on Asia",
        "description": "America is trying to create a chip industry through isolation and protectionism, when what allowed it to emerge in Asia is the opposite: collaboration.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "China appoints new trade envoy in face of tariff turmoil",
        "description": "The shift comes as Beijing refuses to back down in an escalating trade war with Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "UK inflation rate has fallen. Here's why it won't last long",
        "description": "Economic uncertainty globally and in the UK means there are conflicting forces at play with prices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Falling petrol prices push UK inflation down",
        "description": "Inflation falls in the year to March as the price of petrol drops.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "India's Gandhis charged in money laundering case amid opposition outcry",
        "description": "India's financial crimes agency has accused the Gandhis of illegally acquiring properties of a newspaper.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "'This is so hard': The Chinese small businesses brought to a standstill by Trump's tariffs",
        "description": "Stock is piling up in warehouses as exporters grapple with new levies that total up to 145%, reports the BBC's China correspondent Laura Bicker.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Zuckerberg defends Instagram purchase in Meta monopoly trial",
        "description": "The FTC is trying to prove that Meta unfairly dominated the market through its acquisitions of Instagram and WhatsApp.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "'A number of businesses in limbo' in China after US tariffs on imports",
        "description": "BBC China correspondent Laura Bicker has been speaking to companies at the world's longest running import-export fair.",
        "source": "BBC Business",
        "fetched_date": "2025-04-17T07:26:40.444285"
    },
    {
        "title": "Michelle Trachtenberg’s Cause of Death Revealed",
        "description": "The 'Gossip Girl' and 'Buffy the Vampire Slayer' actress died in February at age 39.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Role Model Parts Ways With Best Friends Music Management (Exclusive)",
        "description": "The buzzing Interscope act had been represented by Danny Rukasin.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "The Who Parts Ways With Ringo Starr’s Son, Zak Starkey, as Drummer",
        "description": "The musician has been with the band since 1996.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Why Joe Rogan’s Recent Tilt Is So Dangerous",
        "description": "With guests like Ian Carroll, Darryl Cooper and a major vax denialist, the world's biggest podcaster is slowly moving from conspiracy-curious to a launderer of antisemitic and anti-scientific ideas right before our eyes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Harvey Weinstein’s Health Is the Elephant in the Room at His New Trial",
        "description": "The former mogul's legal team has stressed that, if accommodations aren't met, his medical conditions could \"even lead to death\" as they maneuver for him to move from Rikers to Bellevue Hospital.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Gayle King Responds to “Haters” Questioning Blue Origin Flight: “I Wish People Would Do More Due Diligence”",
        "description": "“My question is, ‘Have y’all been to space?’ Go to Blue Origin and see what they do and then come back and say, ‘This is a terrible thing,’” the TV host said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Justin Bieber’s Crisis of Faith?",
        "description": "A bitter management shake-up. Angry public outbursts. A “narcissistic” pastor whose word is gospel. What in God’s name is happening to the once-mighty pop icon? “Whatever he’s going through, I pray for him” a longtime collaborator says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "How a Little-Known Movie About Trump’s Football Fiasco Explains His Tariff Tantrums",
        "description": "The key to the President's mercurial economic policies may be found ... in a 2009 sports doc quietly streaming on ESPN+ about a one-time NFL rival.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Despite a Court Order, White House Barred AP From Oval Office Event",
        "description": "Last week's federal court decision forbidding the Trump administration from punishing the AP for refusing to rename the Gulf of Mexico was to take effect Monday, the same day Trump met  El Salvador President Nayib Bukele.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Emily Ratajkowski Slams All-Female Blue Origin Space Flight: “Privilege Is Not an Accomplishment”",
        "description": "\"I think we’re in a place in the world where we need to be able to discern what real progress looks like, and what happened yesterday was nothing like that,\" the model-actress said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Seth Rogen’s Criticism of Silicon Valley’s Support for Trump Was Cut From the “Full” Stream of Breakthrough Prize",
        "description": "While presenting an award at the event known as the Oscars of Science, 'The Studio' star pointed out the irony of tech titans' support for the Trump administration's defunding of science. The potentially embarrassing comments were edited out.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Lil Nas X Hospitalized After He “Lost Control of the Right Side” of His Face",
        "description": "“Imma look funny for a lil bit but that’s it,” the Grammy winner wrote on Instagram after revealing the medical condition sent him to the hospital.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-17T07:26:41.071590"
    },
    {
        "title": "Luai hits out as ‘disrespect’ goes way too far",
        "description": "Jarome Luai has lifted the lid on the ‘messy’ Tigers situation amid a major revelation about his exiled halves partner Lachlan Galvin.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Coach shuts down club swap rumours",
        "description": "Western Bulldogs coach Luke Beveridge has responded to reports of a potential move to Melbourne should the Demons sack Simon Goodwin.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Power’s Rozee experiment set for extension",
        "description": "He cut up the Hawks to close Gather Round, now the Swans will be in the sights of Power skipper Connor Rozee, with his stint playing down back to roll on. Follow the day’s news live.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Luai hits out as ‘disrespect’ goes way too far",
        "description": "Jarome Luai has lifted the lid on the ‘messy’ Tigers situation amid a major revelation about his exiled halves partner Lachlan Galvin.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Bellamy knows decision clock is ticking",
        "description": "The ball is in Craig Bellamy’s court when it comes to coaching on in 2026 and the master mentor has revealed when he’ll make a call.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Coach shuts down club swap rumours",
        "description": "Western Bulldogs coach Luke Beveridge has responded to reports of a potential move to Melbourne should the Demons sack Simon Goodwin.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Power’s Rozee experiment set for extension",
        "description": "He cut up the Hawks to close Gather Round, now the Swans will be in the sights of Power skipper Connor Rozee, with his stint playing down back to roll on. Follow the day’s news live.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "World Cup winner loses CA contract",
        "description": "A six-time World Cup winner who for a long time was the world’s No.1 T20 bowler couldn’t make her way onto Cricket Australia’s contract list.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Spin star’s injury blow",
        "description": "As Australia’s leading white-ball spinner went down with an injury another World Cup winner continued a poor run with the bat as his team made IPL history.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Serena comes clean on Super Bowl furore",
        "description": "Serena Williams has opened up about her decision to be part of Kendrick Lamar’s Super Bowl half time show and the rumours about Drake.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Sports power couple split in marriage shock",
        "description": "One of the world’s biggest sporting power couples appear to have split up and are living apart after nearly a decade of marriage.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Michael Schumacher spotted in helicopter",
        "description": "Days after a rare public act, Formula 1 legend Michael Schumacher has been spotted flying from Majorca to Switzerland.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "F1 erupts over ‘disrespectful’ move to Piastri",
        "description": "Comedian Dave Hughes has led outrage from Aussie F1 fans after Oscar Piastri was snubbed in a “disrespectful” act amid claims of bias.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Country stars, sons of guns, a surprise show of power in Aussie rugby U20s squad",
        "description": "Country stars, sons of guns, a Sevens speedster and standouts from the battle with Eddie Jones’ Japan side make up the touring Australian U20s about to tackle the best young talent in rugby.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Rugby cops heavy $38m loss",
        "description": "Hopes are high for a financial windfall for Australian rugby this year and officials need it after revealing a massive deficit.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "‘Misogyny alive and well’: On-air act slammed",
        "description": "A TV segment showing a reporter interacting with female fans has come under fire, highlighting a troubling double standard.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Arsenal make Champions League statement amid penalty drama",
        "description": "In a game that saw one penalty overturned and another missed, Arsenal stormed Real Madrid’s Bernebau fortress to secure their spot in the Champions League semi-finals.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Sports power couple split in marriage shock",
        "description": "One of the world’s biggest sporting power couples appear to have split up and are living apart after nearly a decade of marriage.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Aussie breaks UFC curse, makes shock reveal",
        "description": "Aussie Alex Volkanovski has rewritten the UFC record books, winning an epic title fight to reclaim his belt and become champ again.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Grand slam dream on Aussie star’s radar",
        "description": "After watching Rory McIlroy complete the career grand slam at the Masters an Aussie major champion has put the feat on her agenda.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Archard eyes double on big day at home track",
        "description": "Echuca trainer Rhys Archard says there is a lot of excitement around town heading into the Good Friday meeting and wants to strike for the locals.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "Sports power couple split in marriage shock",
        "description": "One of the world’s biggest sporting power couples appear to have split up and are living apart after nearly a decade of marriage.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    },
    {
        "title": "72yo’s romance with 24yo gets really weird",
        "description": "Incredible new details of how Jordon Hudson is intertwining herself in Bill Belichick’s professional life are fascinating America.",
        "source": "News AU",
        "fetched_date": "2025-04-17T07:26:42.558953"
    }
]