[
    {
        "title": "Trump set to ease tariff impact on US car makers",
        "description": "The president is due to hold a rally in Michigan, which is home to Ford, General Motors and Stellantis.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Prince Andrew's firm linked to controversial PPE millionaire",
        "description": "Documents show Doug Barrowman-linked company owned the prince's start-up competition for two years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "DHL lifts suspension of high-value deliveries to US",
        "description": "The delivery giant is resuming deliveries worth more than $800 after negotiating \"adjustments\" to customs rules.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "How Armenia is trying to build a Silicon Valley in the Caucasus",
        "description": "The country is aiming to boost its technology sector by training children in tech from a young age.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Prince Andrew's firm linked to controversial PPE millionaire",
        "description": "Documents show Doug Barrowman-linked company owned the prince's start-up competition for two years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Australian PM dismisses warning over AAA credit rating",
        "description": "High public spending puts the country's rating at risk if savings are not found, analysts have said.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "There are signs Trump could be ready to retreat on tariffs",
        "description": "BBC economics editor Faisal Islam on what comes next for the US president's central economic policy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "ChatGPT AI bot adds shopping to its powers",
        "description": "The move is a challenge to tech rivals such as Google as well as other websites offering product reviews.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Could South America benefit from Trump's trade tariffs?",
        "description": "Countries in the continent may see exports rise as both the US and China need new suppliers.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Lilly Sabri talks after two-year silence on social media",
        "description": "The fitness influencer went silent after a story about her fiancee allegedly cheating went viral.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Why might public sector workers in UK go on strike again?",
        "description": "BBC Verify examines why political pressure over public sector pay and industrial action has re-emerged.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Reeves suggests UK trade with EU more important than US",
        "description": "The chancellor indicates that moving closer to the EU on trade is a bigger priority than the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "'Tech entrepreneur took our money but failed to deliver our start-up dreams'",
        "description": "One client of Josh Adler re-mortgaged their home, another spent life savings to pay for websites and apps.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "'Kicking butt' or 'going too fast'? Trump voters reflect on 100 days",
        "description": "Five Trump supporters say his first 100 days have met their expectations - with a few surprises and some warning signs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Titanic survivor's letter sold for £300,000 at auction",
        "description": "Colonel Archibald Gracie's letter from onboard the ill-fated ocean liner has been described as \"prophetic\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "How much has Elon Musk's Doge cut from US government spending?",
        "description": "BBC Verify has looked at the agency's biggest claimed savings, examining the figures and speaking to experts.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Why Trump keeps attacking the US central bank",
        "description": "The US central bank is one of Trump's favourite punching bags. But how serious is the threat?",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Mangione pleads not guilty to federal murder charge over CEO's killing",
        "description": "The 26-year-old is charged with murder and stalking, in addition to other state charges.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "China has halted rare earth exports. Can Australia step up?",
        "description": "Australia has proposed to create a strategic reserve of critical minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "'My bananas were seized and destroyed' - Malawi-Tanzania trade row escalates",
        "description": "Following the crackdown, some traders have resorted to selling their goods in secret, the BBC hears.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "M&S stops online orders and issues refunds after cyber attack",
        "description": "The firm has stopped taking orders on its website and apps, including for food and clothes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "BBC licence fee 'unenforceable', says UK culture secretary",
        "description": "Lisa Nandy tells the Telegraph \"no options are off the table\" when it comes to its review into the broadcaster's charter.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Company bosses warn over tariffs impact",
        "description": "Several firms have cut their profit forecasts or withdrawn them citing economic uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "California passes Japan as fourth largest economy",
        "description": "The US state expresses worries that President Donald Trump's tariffs could stunt future growth.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "UK Chancellor: There is a deal to be done with the US",
        "description": "Rachel Reeves speaks to the BBC ahead of talks with her US counterpart in Washington.",
        "source": "BBC Business",
        "fetched_date": "2025-04-29T07:27:26.819527"
    },
    {
        "title": "Hollywood’s Most Notable Deaths of 2025",
        "description": "Val Kilmer, Gene Hackman, Michelle Trachtenberg, David Lynch, Irv Gotti and Jeff Baena are among several entertainment legends the industry lost has this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Bad Company, Cyndi Lauper, Outkast, The White Stripes Lead Rock & Roll Hall of Fame Class of 2025",
        "description": "Chubby Checker, Joe Cocker and Soundgarden round out this year's inductees, set to be honored in November at the induction show in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Bruce Springsteen Performs With Smokey Robinson, John Fogerty at 2025 American Music Honors Event",
        "description": "Robinson, Fogerty, Emmylou Harris, Tom Morello and Joe Ely were recognized at this year's annual ceremony in New Jersey.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "At WHCD Weekend, Glam With a (Small) Dash of Dystopia",
        "description": "Many of the Capital's parties went on per the crowded usual, with just a slightly uneasy undercurrent",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Lana Del Rey Joins Jelly Roll at Stagecoach to Perform ‘Save Me’",
        "description": "Del Rey joined Jelly Roll during his headlining set a day after she performed at the country festival Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Mike Myers Explains Origins of Recent Canadian Political Activism",
        "description": "The 'Saturday Night Live' alum, who's returned to the sketch show to play Elon Musk, has used his time on the air to also support his native country and starred in an ad for Canada's Liberal Party.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "White House Correspondents’ Dinner Focuses on Awards, Journalism as Trump Snubs Comic-Free Soirée",
        "description": "As the current administration is tightening its grip on the White House press corps, the governing body's \"nerd prom\" saw fewer A-list celebrities and more attention on reporters' work.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "LAPD Releases Footage From Shooting Involving Weezer Bassist’s Wife Jillian Lauren",
        "description": "The police released body camera and surveillance video as well as audio from the 911 dispatch conversation from the incident earlier this month.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Global DJ Alok Is Keeping Art Human and Bringing His True Self to the Desert",
        "description": "The Hollywood Reporter’s latest “Person of Interest” is the Brazilian DJ who just made his Coachella debut with a strong message about artificial intelligence and art: “You just cannot replicate it with codes.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Virginia Giuffre, Who Accused Britain’s Prince Andrew in Epstein Sex Trafficking Scandal, Dies at 41",
        "description": "She died by suicide Friday at her farm in Western Australia, her publicist confirmed.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Sammy Hagar Releases Song Inspired by Dream Reunion With Eddie Van Halen",
        "description": "“It’s not meant to be anything more than a thank you — with love, with respect and with one hell of a guitar solo,” the Rock and Roll Hall of Famer shared.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Gayle King Is “Not Focusing” on Blue Origin Backlash and Would “Consider” Going Back to Space: “I’m Definitely Open to It”",
        "description": "At the Time 100 Gala, King told The Hollywood Reporter she \"felt safe\" in space and isn't ruling out the opportunity to return, although she thinks it won't be \"anytime soon.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-29T07:27:27.071679"
    },
    {
        "title": "Roos’ young gun patient in slow rebuild",
        "description": "North Melbourne is prioritising progress over end results, highlighting its positive finish to its clash with Port Adelaide last weekend.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Origin star axed in Magic Round stunner",
        "description": "A former State of Origin star has been sensationally dropped for Magic Round, while the disappearing act at the Rabbitohs continues.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Former Origin star dropped in Magic Round stunner",
        "description": "David Fifita has been sensationally dropped by the Titans, while there’s a disappearing act at Souths with a high-profile recruit overlooked for Magic Round.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Aussie tennis star cops monster drugs ban",
        "description": "After revelations he was facing an anti-doping charge last December, an Australian grand slam winner has been handed a heavy penalty.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Magic Round teams: Hasler axes David Fifita",
        "description": "Gold Coast coach Des Hasler has dropped a bombshell on the terrible Titans, axing Queensland Origin star David Fifita for Magic Round.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Origin star axed in Magic Round stunner",
        "description": "A former State of Origin star has been sensationally dropped for Magic Round, while the disappearing act at the Rabbitohs continues.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Troubled Bulldogs star takes indefinite leave",
        "description": "The future of Jamarra Ugle-Hangan at the Western Bulldogs is looking bleak after the troubled forward’s latest move.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Tigers seek to protect Balta from ‘hostile reception’ after sentencing",
        "description": "Richmond will seek to protect defender Noah Balta from any hostile reception in his first return to AFL since facing court to be sanctioned on an assault charge.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "14yo freak blows minds as record smashed",
        "description": "Cricket commentators around the world, including Indian legend Sachin Tendulkar, have been left in awe after a teen phenom’s history-making feat.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Watch: 14-year-old sensation blasts 35-ball IPL ton",
        "description": "Vaibhav Suryavanshi only turned 14 last month. He’s just made history as the youngest player to ever score a men’s T20 century, and he’s done it on the cutthroat stage of the IPL.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Aussie tennis star cops monster drugs ban",
        "description": "After revelations he was facing an anti-doping charge last December, an Australian grand slam winner has been handed a heavy penalty.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Djokovic’s shock retirement admission",
        "description": "Tennis legend Novak Djokovic made the shocking admission after being bundled out in the first round of back-to-back tournaments.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Heartbreaking photo shows devastating twist",
        "description": "The fiancee of a motocross star killed in a horror crash has revealed her pregnancy in a heart breaking post mourning his death.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Elite motocross rider dies in horror crash",
        "description": "A world renowned motocross rider has died after crashing at a speedway in Adelaide.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Lynagh ‘in the hunt’ for Wallabies recall",
        "description": "Queensland Reds flyhalf Tom Lynagh seems on track in his bid to be recalled to the Wallabies squad.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Caslick edging closer to World Cup dream",
        "description": "Sevens great Charlotte Caslick could make her Test debut for the Wallaroos on Saturday in Suva.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Crowd loses it after Trump’s Taylor Swift act",
        "description": "Donald Trump has proven he does not forgive or forget with the US President taking a swipe at Taylor Swift from out of nowhere.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Prank call rocks NFL Draft, caller revealed",
        "description": "A prank call to Shedeur Sanders during the 2025 NFL Draft left fans gobsmacked, with the perpetrator coming forward to apologise for the dumb and impactful move.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Major concession as Kerr mystery deepens",
        "description": "More than 14 months after suffering an ACL injury, the mystery surrounding Matildas star Sam Kerr is just getting deeper.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Apology rejected, commentary storm erupts",
        "description": "Ian Wright has condemned Eni Aluko’s comments about the struggles of females in the sports broadcasting world, which was quickly met with swift backlash.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Renee Gracie fumes at farcical boxing debut",
        "description": "Former Supercars driver-turned-OnlyFans star Renee Gracie has been left seeing red after her boxing debut quickly went pear-shaped.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Smith’s struggles again as teammate nets $3m",
        "description": "Lucas Herbert picked up $3 million for coming second but it’s the ongoing struggles of his LIV teammate Cam Smith which are setting tongues wagging.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Aussie star snubbed for prestigious NBA award",
        "description": "History was always against Dyson Daniels and his hopes of claiming one of the NBA’s top awards, with the Aussie star denied by a Cleveland rival.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Bobbin making big leaps with Galleywood success",
        "description": "Andrew Bobbin didn’t know the difference between a hurdle and a steeple, but he has added another major jumps success at the Warrnambool carnival in the Brierly Steeplechase.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Model kicked out of Schumacher’s inner circle",
        "description": "The tight-knit inner circle of Fomula 1 legend Michael Schumacher’s has shrunk after his son and his model partner split.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    },
    {
        "title": "Shaq forced to bolt from live TV",
        "description": "While analysing a compelling Nuggets-Clippers on “Inside the NBA” alongside the rest of the crew, O’Neal made a hurried, flustered exit.",
        "source": "News AU",
        "fetched_date": "2025-04-29T07:27:28.022765"
    }
]