[
    {
        "title": "Is the US really heading into a recession?",
        "description": "Stock market falls, tariffs and other changes are reigniting fear of economic downturn in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Trump halts plan for 50% steel and aluminium tariffs on Canada",
        "description": "It comes after the Canadian province of Ontario said it would suspend a 25% surcharge on US-bound electricity.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Google Chromecast users' fury at second day of TV streaming issue",
        "description": "Google says it is aware of an issue impacting some Chromecast devices and is working to fix.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Why people are cutting back their online profile",
        "description": "A new wave of AI has spurred some to think more carefully about their online presence.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Trump halts plan for 50% steel and aluminium tariffs on Canada",
        "description": "It comes after the Canadian province of Ontario said it would suspend a 25% surcharge on US-bound electricity.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Trump is no longer swayed by the stock markets",
        "description": "The assumption that the US president would row back on policies if shares fell no longer holds true.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Global smartwatch sales fall for first time",
        "description": "Market researchers say the slumping popularity of the market-leading Apple Watch was to blame",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Trump says he will buy a Tesla after stock slump",
        "description": "The US president blames \"radical left lunatics\" but analysts point to Tesla sales slump.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "From chatbots to intelligent toys: How AI is booming in China",
        "description": "China plans to invest more than a trillion dollars as it races against the US to rule advanced tech.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "How Britain's former top banker became Canada's next prime minister",
        "description": "The former banker may not have been elected to office before, but his experience managing global economic crises will help.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "European stocks steady after US markets plunge",
        "description": "The global sell-off eases in Europe after US shares are hit by President Trump saying the economy is in \"transition\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "How Trump's stock market rhetoric has shifted over the years",
        "description": "From boastful to distanced - a look back at the president's changing confidence in the performance of the US stock market.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Facebook 'worked hand in glove' with China on censor tools, claims ex-director",
        "description": "Social media company considered letting Beijing control content for access to its lucrative market, BBC told.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Starmer says UK benefit system unfair and indefensible",
        "description": "Some Labour MPs urge ministers to tackle the \"crisis of economic inactivity\", while others oppose cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Man Utd plan to build 'iconic' £2bn 100,000-capacity stadium",
        "description": "Manchester United announce plans to build the biggest stadium in the UK - an \"iconic\" new £2bn 100,000-seater ground close to Old Trafford.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Illegal working in UK was unbearable, migrant says",
        "description": "A migrant who returned home after working in a Cannabis farm in the UK is warning other Albanians.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "'Garbage' to blame Ukraine for massive X outage, experts say",
        "description": "The claim has been made by the platform's owner Elon Musk, a vocal critic of Ukraine and its president.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Ontario says it will slap a 25% surcharge on US-bound electricity",
        "description": "The move is in retaliation to Trump's tariff threats on Canada, and is expected to raise energy costs for 1.5 million US homes.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "The 'anti-Trump' numbers man who may force the UK to take a side",
        "description": "The incoming Canadian PM has made standing up to his US counterpart a big part of his campaign.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Musk's Tesla facilities in US face 'Takedown' protests",
        "description": "It is part of an effort to protest the role Tesla's billionaire owner, Elon Musk, has played in the Trump administration.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "'We go from dinner service to dealing with a corpse': What happens when an air passenger dies",
        "description": "Crews will try to shield passengers from the body by using empty aisles, blankets and dim lighting.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "North Korean hackers cash out hundreds of millions from $1.5bn ByBit hack",
        "description": "Hackers from the infamous Lazarus Group are in a cat-and-mouse game to launder their stolen funds from the ByBit heist.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Luxury lounges: Credit card perks 'we are all paying for'",
        "description": "Why credit card providers are opening lavish customer lounges in airports and cities.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "Canada's next PM Mark Carney vows to win trade war with Trump",
        "description": "The 59-year-old political newcomer says he will keep tariffs on US imports \"until the Americans show us respect\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "What will be in the chancellor's Spring Statement?",
        "description": "Chancellor Rachel Reeves will give more detail about the government's plans for the UK economy.",
        "source": "BBC Business",
        "fetched_date": "2025-03-12T07:25:39.085573"
    },
    {
        "title": "How to Watch ‘Tom Petty: Heartbreakers Beach Party’ Online",
        "description": "Over 40 years after being pulled from MTV for being \"too experimental,\" Cameron Crowe has released an extended version of his documentary with new 16mm film footage of the late musician.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "With ‘Deli Boys,’ Jenni Konner Is Hoping to Strike a Chord",
        "description": "The 'Girls' and 'Single Drunk Female' executive producer talks about launching her fresh, inclusive new Hulu comedy during a tumultuous time: \"This is the first noisy show I've been on since 'Girls.' People are talking about it.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "Billy Joel Postpones Tour Dates Due to Medical Condition: “My Health Must Come First”",
        "description": "Joel rescheduled eight concerts, with his tour pushed back four months.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "DOJ Attorney Claims She Was Fired for Refusing to Approve Mel Gibson’s Gun Rights",
        "description": "Gibson, a high-profile supporter of Donald Trump and one of his \"special ambassadors\" to Hollywood, lost his right to purchase or own a handgun after a 2011 domestic violence misdemeanor conviction.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "Wheesung, Veteran Korean Singer, Dies at 43",
        "description": "The k-pop star, who suffered a precipitous decline in his career after being caught illegally using anesthetics in 2021, was discovered unresponsive in his Seoul apartment Monday evening.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "Clemency Process Introduced for Menendez Case Now Floated as New Statewide Policy",
        "description": "Gavin Newsom's office hopes the state permanently moves to the streamlined process of assessing an inmate's risk to society.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "L.A. District Attorney Withdraws Support for Resentencing Lyle and Erik Menendez",
        "description": "The move from Nathan Hochman, who campaigned for L.A. district attorney on a tough-on-crime platform, means the brothers' fate now essentially lies with Gov. Gavin Newsom.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "Ariana Grande Announces ‘Eternal Sunshine’ Deluxe Album",
        "description": "The recent Oscar nominee will release ‘Eternal Sunshine Deluxe: Brighter Days Ahead’ on March 28.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "The Heavy Metal Ties That Bind: Singer Encourages Israeli Hostage to “Hold on to Memories” (Guest Column)",
        "description": "David Draiman, frontman of the band Disturbed, writes about Yarden Bibas and his family, who have come to symbolize loss and resilience.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "The Ruby Experience Gives L.A. Crowd a Chance to Rock With Jennie",
        "description": "The 29-year-old K-Pop star brought her debut solo album, ‘Ruby,’ to L.A.’s Peacock Theater for a night full of experimental and cinematic production, a range of genres and immense gratitude to her fans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "D’Wayne Wiggins, Founding Member of the R&B Group Tony! Toni! Tone!, Dies at 64",
        "description": "The group was behind the songs “Anniversary,” “It Never Rains (In Southern California)” and \"(Lay Your Head on My) Pillow.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "Video Shows Kimberly Burch Jumping From ’80s Cruise; Faster Pussycat Performances Canceled Onboard",
        "description": "Sources reveal that singer Taime Downe, Burch's fiancé, was cleared of any wrongdoing.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-12T07:25:39.531603"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Reds star to miss battle with NSW",
        "description": "Queensland co-captain Liam Wright has again been sidelined ahead of the Reds’ weekend battle with the Waratahs.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Saints’ ‘commitment to long-term success’",
        "description": "St Kilda has backed coach Ross Lyon with a contract extension as the club resolves to “stay the course” of a “substantial” rebuild.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Coach’s frosty response after record signing",
        "description": "Dylan Brown spoke for more than 11 minutes about his impending move to the Knights, but his coach next year was in no mood to answer questions.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Forgotten challenge to Penrith’s quest for glory",
        "description": "They’ve managed to keep winning despite losing so many stars over the years, but the Panthers face a new challenge in 2025.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Coach’s frosty response after record signing",
        "description": "Dylan Brown spoke for more than 11 minutes about his impending move to the Knights, but his coach next year was in no mood to answer questions.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Jay Clark named Herald Sun chief football writer",
        "description": "Award-winning journalist Jay Clark is set to take over the reins as the new chief football writer of the Herald Sun, following in the footsteps of Mike Sheahan and Mark Robinson.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Saints’ ‘commitment to long-term success’",
        "description": "St Kilda has backed coach Ross Lyon with a contract extension as the club resolves to “stay the course” of a “substantial” rebuild.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "‘Galling’: Premier blows up at AFL cash grab",
        "description": "An AFL club has been called out for asking for a cash incentive to allow the Sheffield Shield final to be played at the Adelaide Oval.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Cricket legend’s beer company goes bust",
        "description": "Another Australian beer company has gone bust despite its celebrity owners, as the tough retail environment continues to put pressure on small businesses.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Star’s Wimbledon attire sparks backlash",
        "description": "One of tennis’ biggest stars has left members of the prestigious All England Club fuming after blatantly breaking a longstanding rule.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Kyrgios’ cryptic message ignites rumour mill",
        "description": "Nick Kyrgios’ tennis career has been up in the air since retiring hurt at Indian Wells on Friday and he has now seemingly made up his mind.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Storm legend goes rogue, exposes Bellamy",
        "description": "Melbourne Storm players have revealed the nightmare door knock they received from “crazy lunatic” coach Craig Bellamy.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "‘Abuse’ slammed as F1 showdown turns ugly",
        "description": "Aussie Jack Doohan is under huge pressure before the F1 season has even begun, and the showdown with the man tipped to replace him has turned nasty.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Piastri lands massive contract upgrade in huge F1 coup",
        "description": "Oscar Piastri’s future has been locked in long-term, with the Australian superstar landing a massive new Formula 1 deal.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Reds star to miss battle with NSW",
        "description": "Queensland co-captain Liam Wright has again been sidelined ahead of the Reds’ weekend battle with the Waratahs.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "‘Disappointing’ Reds produce horror show against Crusaders",
        "description": "The Queensland Reds were their own “worst enemies” after suffering a heavy loss at the hands of the Crusaders on Sunday afternoon. Here’s where it went wrong and the one major positive.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Australia’s highest paid athletes revealed",
        "description": "Some of Australia’s brighest young stars are set for some truly eyewatering paydays as the sporting rich list gets a whole new look.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Ex-Socceroo bragged about sex: court",
        "description": "A former Socceroo and his friend are accused of bragging on social media after allegedly sexually assaulting a woman.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Liverpool set for MCG blockbuster",
        "description": "One of the world’s biggest football clubs seems to be heading to Melbourne in May for a game against the A-League All-Stars.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Tszyu delivers KO verdict in Thurman-Jarvis showdown",
        "description": "Whoever takes the glory in the battle between Australia’s Brock Jarvis and Keith Thurman, the winner will set up a Tszyu showdown. See who the brothers think has the edge tonight.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "‘The ultimate’: Prodigy joins field in $40m chase",
        "description": "Adam Scott has never met Karl Vilips but he knows the journey of the former child prodigy turned PGA Tour winner and wants to catch up with his fellow Aussie.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Giddey in line for truly eyewatering payday",
        "description": "Australia’s Josh Giddey is set for a massive payday in the off-season after producing hot streak that could earn him an absolute fortune.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Kensington, Wagga previews: Wonder out to deliver a city win",
        "description": "Blessed with her fair share of talent, trainers Gerald Ryan and Sterling Alexiou hope It’s A Wonder can pick up a third career when she heads to the Kensington.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "Woman’s X-rated photo act caught on TV",
        "description": "Two unsuspecting women have been caught out on live TV with video of a private photo pose spreading across cyberspace.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    },
    {
        "title": "‘First baby of two champs’: Aussie’s big news",
        "description": "Controversial boxing star Ebanie Bridges has dropped a series of photos of her new baby boy with fellow world champ Kell Brook.",
        "source": "News AU",
        "fetched_date": "2025-03-12T07:25:40.888742"
    }
]