[
    {
        "title": "Bitcoin hits new record high of more than $106,000",
        "description": "The world's largest cryptocurrency has risen by more than 50% since Donald Trump's election victory.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "In from the cold: Scandi wines hope to win over drinkers",
        "description": "Thanks to climate change and tougher vines, Denmark and Sweden have a growing number of wineries.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Founder of fashion chain Mango dies in cave accident",
        "description": "The 71-year-old is remembered for his fashion leadership after the accident in caves near Barcelona.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "West African bloc pins hopes on ambitious superhighway from Ivory Coast to Nigeria",
        "description": "The road could breathe new life into West Africa's regional bloc, Ecowas.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "In from the cold: Scandi wines hope to win over drinkers",
        "description": "Thanks to climate change and tougher vines, Denmark and Sweden have a growing number of wineries.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Christmas dinner in the UK set to cost less this year",
        "description": "The BBC digs into which bits of the festive feast have gone up and down in price.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Royal Mail takeover by Czech billionaire approved",
        "description": "The £3.6 billion takeover by Daniel Kretinsky's EP Group will be announced on Monday morning, the BBC understands.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Trump gets $15m in ABC News defamation case",
        "description": "The network also publishes a statement expressing \"regret\" for statements by George Stephanopoulos.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Trump rings bell on record stock market - but will it last?",
        "description": "The US president-elect comes into office with a strong economy, but investors hope for more and current highs may be difficult to sustain.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Is India's economic boom fading?",
        "description": "The rate of India’s economic growth is still robust, but the latest GDP figures signal a slowdown.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Nasdaq rally expected 'to continue in 2025' - 13 Dec 2024",
        "description": "Wealth consultancy expert, Jimmy Lee, predicts the stock market rally will continue throughout next year.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "OpenAI whistleblower found dead in San Francisco apartment",
        "description": "The San Francisco medical examiner's office determined Suchir Balaji's death to be suicide and police found no evidence of foul play.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Tracing the powerful family roots of suspected killer Luigi Mangione",
        "description": "In his home city, the accused shooter's family name has meant wealth, power, prominence and philanthropy for decades.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Canadian government moves to end weeks-long postal strike",
        "description": "Around 55,000 postal workers began striking on 15 November over pay and working conditions.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "UK 'doesn't have enough builders' for Labour's 1.5m homes",
        "description": "Builders and developers say reforms are needed to recruit more tradespeople to build the homes being promised.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Milei, Musk and Maga: Is Argentina influencing the US?",
        "description": "As Argentina's libertarian President Javier Milei marks one year in office, his policies are keenly observed in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "BBC complains to Apple over misleading shooting headline",
        "description": "Apple's new artificial intelligence features falsely made it seem the BBC reported Luigi Mangione had shot himself.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Influencer's brand faces backlash over bullying claims",
        "description": "Fans are outraged by allegations of body-shaming and a toxic workplace at fashion company Djerf Avenue.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "N Korea made millions from remote work scheme, US says",
        "description": "Fourteen North Koreans have been charged with fraud in the US over an alleged long-running conspiracy.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "UK economy shrinks for second month in a row",
        "description": "The economy had been expected to return to growth but it contracted by 0.1%.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Why 'digital twins' could speed up drug discovery",
        "description": "AI can create digital humans and digital organs that can be used in clinical trials.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Some businesses suspend NI sales due to new trade rules",
        "description": "Rules come into force that will make it harder for some GB firms to sell goods to NI and the EU.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "The YouTuber who swapped air-traffic control for videos with Mbappé",
        "description": "John Nellis has won millions of subscribers, and a TikTok award, for his online football videos.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "Star luxury property brokers charged with sex trafficking in US",
        "description": "The Alexander brothers are accused of drugging, assaulting and raping dozens of women over more than a decade.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "British trader found guilty of £1bn fraud",
        "description": "He was sentenced to 12 years in prison - the heaviest penalty ever for a Danish fraud case.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "UK unveils new powers to approve large wind farms",
        "description": "The change is part of the government's new action plan for meeting its 2030 clean power target.",
        "source": "BBC Business",
        "fetched_date": "2024-12-16T07:27:29.238605"
    },
    {
        "title": "ABC News to Apologize and Pay $15M to Settle Defamation Suit Brought By Trump",
        "description": "The money will be donated to \"a Presidential foundation and museum\" established by Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Will Smith Shuts Down Rumored Connection to Sean “Diddy” Combs: “I Ain’t Been Nowhere Near That Man”",
        "description": "The rapper said he doesn't typically address rumors or memes, but he felt the need to clarify this particular one.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Jay-Z Attorney Seeks to Dismiss Rape Accuser’s Suit After Jane Doe Admits to Inconsistencies in Her Recollection",
        "description": "The Alabama woman sat for an interview with NBC News prompting the rapper to respond.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Pete Davidson Doesn’t Want to Be Known in Hollywood as the “F***ing Loser Who Just Dates People”",
        "description": "The 'Saturday Night Live' alum says he's also realized over time that \"people have to miss you\" to be successful in the film and TV business.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Paula Abdul Settles Sexual Assault Lawsuit Against ‘American Idol’ Producer Nigel Lythgoe",
        "description": "The lawsuit accused Lythgoe of assaulting Abdul during one of the early seasons of 'American Idol' and years later, when she was a judge on 'So You Think You Can Dance.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Dear Elton John: Lighten Up, and Maybe Light One Up (Guest Column)",
        "description": "The EGOT once sang a different tune about cannabis.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Sabrina Carpenter Compares Meeting Paul McCartney to the Upside Down “But a Lot Happier Than ‘Stranger Things'”",
        "description": "The singer-songwriter had been a fan of the Beatle since she was a child.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "‘The Kings of Tupelo’ Directors on Weaving a Tale of Elvis Impersonators, Black Market Conspiracy Theories and War Crimes Into One Docuseries",
        "description": "Chapman Way and Maclain Way broke down their filmmaking process during a 'THR Frontrunners' FYC panel in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Linkin Park Close Out the 2024 Billboard Music Awards With Effervescent Duet",
        "description": "The band, which recently returned with a new co-vocalist, won two trophies during Thursday night's event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Michelle Buteau Says “Music Is Damn Magic” in Her 2024 Billboard Music Awards Opening",
        "description": "\"Why would you get all this freckle-face magic? In a plus-size sequined suit for this amazing music award show?' Because just like all of y'all, I love me some music,\" she said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Here’s Are All of the Billboard Music Awards Taylor Swift Won Thursday Night",
        "description": "She broke her tie with Drake for most wins during the Dec. 12 ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "Coldplay Makes Their Billboard Music Awards Performance Debut From Australia With “All My Love”",
        "description": "Dick Van Dyke stars in the music video, which premieres on his 99th birthday on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-16T07:27:30.030136"
    },
    {
        "title": "‘Rubbing on me’: Disturbing twist to scandal",
        "description": "Australian athlete Amanda Bisk has come forward with disturbing allegations against a prominent coach in the latest horrific twist.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Gillespie reveals brutal details, why he quit",
        "description": "Australian cricket great Jason Gillespie has come clean about his decision to quit as Pakistan coach, saying he was “utterly blindsided”.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "‘Sensational’ act sparks telling celebration",
        "description": "Australia is destroying India at the Gabba, and one player had a hand in two wickets that came about in eerily similar fashion.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Bulldogs basking in superstar’s signature",
        "description": "Christmas has come early for Western Bulldogs fans, with one of the best young talents in the AFL signing a bumper long-term deal.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Bulldogs basking in superstar’s signature",
        "description": "Christmas has come early for Western Bulldogs fans, with one of the best young talents in the AFL signing a bumper long-term deal.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "AFLW Draft: Everything you need to know ahead of bumper draft",
        "description": "The first fully national AFLW Draft is here! Tonight, history will be made and dreams realised. See every club’s picks and all the late mail as the countdown begins.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "‘No place’: NRL star pleads guilty, punished",
        "description": "Broncos star Ezra Mam has been given a tongue lashing after pleading guilty to two charges resulting from a car crash.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Footy club’s shock Welcome to Country call",
        "description": "One of the NRL’s biggest clubs has made a massive call when it comes to Welcome to Country ceremonies before their games.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Rain clears as Aussies target short, late burst at India",
        "description": "The problematic Brisbane weather is wreaking havoc on day 3 – but it has cleared to allow Australia’s bowlers one late chance to inflict more damage on a shellshocked India. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Gillespie reveals brutal details, why he quit",
        "description": "Australian cricket great Jason Gillespie has come clean about his decision to quit as Pakistan coach, saying he was “utterly blindsided”.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "‘Absolute riot’: Kyrgios’ plan for world No.1",
        "description": "Even before he’s played his first comeback match, Nick Kyrgios has laid down a challenge to the world No.1 after clashing over the Italian’s failed drug tests.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Shock names among Aus Open wildcards",
        "description": "Rising stars and a three-time major champ were among those given Australian open wildcards with one particular name not yet included.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Aussie trio about to shock the fight world",
        "description": "In just a month, three Aussie boxers can call themselves world champion and bring Australia to the top of the sport after Tim Tszyu’s loss.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Ricciardo comes clean on bombshell rumour",
        "description": "Daniel Ricciardo has finally responded to a bombshell rumour regarding his next move that’s sending the Formula One world wild.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "‘Get tested’: F1 legend’s desperate plea",
        "description": "Formula 1 legend Eddie Jordan has a strong message after the former team owner detailed his own “aggressive” health battle.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "‘Kick in the guts’: Barty, Ricciardo lose jobs",
        "description": "A simple social media update has exposed the truth as Daniel Ricciardo and Ash Barty were quietly released.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Dawn Fraser’s family shocked by question",
        "description": "As Dawn Fraser was undergoing emergency surgery after her horror fall, one question from medical staff stunned her daughter.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "$63m Ben Simmons question in NBA tank job",
        "description": "The Brooklyn Nets are in a race to the bottom in the 2024/25 NBA season but will Ben Simmons be part of a mass exodus?",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "US city’s $828m move puts Aus to shame",
        "description": "The bumbling organisation of the Brisbane 2032 Olympics so far has shown Australia has plenty to learn about hosting a worldwide event.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Where Socceroos will play Japan revealed",
        "description": "A venue has been chosen for what looms as a crucial FIFA World Cup qualifier for the Socceroos against Japan.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Spurs run riot, crazy United comeback win deepens City crisis",
        "description": "Manchester United scored twice in the final three minutes to pile the pain on Pep Guardiola, while Ange Postecoglou’s Spurs bounced back to form in stunning style. EPL WRAP",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Bitter family feud on agenda as Tszyu eyes March blockbuster",
        "description": "Nikita Tszyu will be back in the ring early next year – with a domestic pay per view blockbuster on the cards. And it could be a chance to settle a bitter family feud.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Breaking superstition helps secure emotional Gippsland Super 6 win",
        "description": "Ben Henkel started the week wondering whether he should wear a glove for the first time in almost seven years – and the decision would land him his first win on the PGA Tour of Australasia.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Comeback keeps Sydney’s top-two NBL hopes alive",
        "description": "Sydney has launched an incredible fourth quarter comeback to knock off Brisbane and keep its top-two hopes alive in a Sunday afternoon NBL thriller. Get the latest news and results from NBL round 12 here.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "NRL star’s heartwarming baby joy",
        "description": "An NRL star has stunned with a huge announcement – revealing a new addition to his family in a heartwarming Instagram post.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Aussie star’s big World Cup move",
        "description": "After being crowned the best Rugby Sevens player in the world an Australian try-scoring machine is taking a big step towards possibly earning a World Cup spot.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Scone preview: Northam ready to cash in with red-hot bargains",
        "description": "Scone trainer Rodney Northam can make an instant return with two bargain buys who are red-hot favourites at Scone on Tuesday.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-16T07:27:32.859033"
    }
]