[
    {
        "title": "China growth beats expectations as Trump tariffs loom",
        "description": "The world's second largest economy grew by 5.2% in the three months to the end of June, official figures show.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Nvidia says it will restart AI chip sales to China",
        "description": "The move would reverse a US ban on sales of the high-end chip to the world's second largest economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Musk's Grok signs $200m deal with Pentagon days after antisemitism row",
        "description": "The deal is part of the Trump administration's push for more aggressive adoption of artificial intelligence in the government.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Starbucks staff must work in the office four days a week",
        "description": "The coffees shop firm is offering one-time payments to staff who decide to leave rather than comply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Nvidia says it will restart AI chip sales to China",
        "description": "The move would reverse a US ban on sales of the high-end chip to the world's second largest economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Meta to spend hundreds of billions to build AI data centres",
        "description": "The founder of the social media giant said one of the sites would cover an area nearly the size of Manhattan.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Trump threatens Russia with tariffs while unveiling Ukraine weapons plan",
        "description": "Under the new plan, the US will sell weapons to Nato countries who will send them to Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Analysis: Russia more relieved than rattled by US tariff threat",
        "description": "The US is threatening Moscow with financial consequences if a deal to end the Ukraine war is not reached within 50 days.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "The deepening water shortage row between the US and Mexico",
        "description": "The US is accusing its southern neighbour of breaking a long-held water sharing agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "'I can't drink the water': Life next to a US data centre",
        "description": "Residents in rural Georgia say the data centre next door has disrupted their water supply.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Markets 'betting' tariffs resolve by fall - 11 Jul 2025",
        "description": "Expert says markets are betting that Trump will not want to cause a recession before the US midterms.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Heat pump makers are ready for a rush: Will customers come?",
        "description": "Heat pump makers are ready to raise output, but demand is still sluggish.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Boeing fuel switches safe, regulator says after Air India crash",
        "description": "A preliminary investigation found the switches had been turned off in June's fatal Air India crash.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Bank boss ready to cut rates if job market slows",
        "description": "Andrew Bailey tells the Times he believes \"the path is downward\" on interest rates.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "EU delays retaliatory trade tariffs against US",
        "description": "The countermeasures were set to start on Tuesday but have been pushed back to early August.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Post Office could be owned by its postmasters, UK government says",
        "description": "The service could be turned into an employee-owned business, under options set out by the government.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Trump's tariffs are looming large over the UK’s last surviving steel towns",
        "description": "The future of industrial towns like Scunthorpe and Port Talbot may rest on the wider fate of the UK's steel industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Electric cars will be cheaper to buy, pledges minister",
        "description": "The Transport Secretary says she will announce measures to cut the cost of buying an electric car.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Inside the Congolese mine vital to mobile phones, as rebels give BBC rare access",
        "description": "The US wants rights to DR Congo's minerals, but one vital mine is still in rebel hands.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Al Fayed-owned London penthouse has 'leaky roofs and noisy lifts'",
        "description": "An exclusive Park Lane address owned by the Fayed family is at the centre of an eight-year dispute.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Analysis: The UK is heading for significant tax rises",
        "description": "Repeatedly borrowing more is not a long-term solution to rising day-to-day spending pressures.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "A bridge too far? Prague railway project draws criticism",
        "description": "The 123-year-old Vysehrad railway bridge is set to be replaced but conservationists say it should stay.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "US federal judge says voiceover artists' AI lawsuit can move forward",
        "description": "The two voice over artists allege their voices were stolen by an AI voice startup.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "More than 1,000 people laid off at US State Department",
        "description": "The involuntary staff reductions are part of the Trump administration's efforts to reduce the federal workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Canada's Carney talked tough on Trump - now some say he's backing down",
        "description": "Canada has made concessions to win goodwill with the White House. Trump, in return, has threatened steeper tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "'Sour taste': Jellycat pulls supply, leaving UK independent shop owners confused",
        "description": "Jellycat has stopped supplying its plush toys to around 100 independent stores in the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Trade trumps geopolitics as Australia PM visits China",
        "description": "Anthony Albanese's visit comes as countries around the world navigate US President Trump's \"America First\" policies.",
        "source": "BBC Business",
        "fetched_date": "2025-07-15T07:31:12.613392"
    },
    {
        "title": "Tears, Spaceships and Nostalgia: How Backstreet Boys “Pushed the Limits” of Las Vegas’ Sphere With “Mind-Boggling” Residency Launch",
        "description": "The group launched their Into the Millennium shows with a slew of emotions: \"I started breaking down and crying because it was so emotional and surreal.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "Son of Hollywood Producer Suspected in Triple Murder Found Dead in L.A. Jail Ahead of Hearing",
        "description": "Samuel Haskell Jr. is accused of the 2023 killings of Mei Haskell and her parents, Yanxiang Wang and Gaoshan Li, in the Tarzana home they all shared.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "THR’s 2025 Top Music Lawyers: Nominations Are Now Open",
        "description": "Submit your pick in the link below. Submissions are due by Aug. 8.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "New York Comedy Festival to Feature Louis C.K., Margaret Cho and ‘Strangers With Candy’ Reunion",
        "description": "The lineup features Alex Edelman, the Basement Yard, Hannah Berner, Michael Blackson, Chris Fleming, Pete Holmes, Morgan Jay, Ismo, Ryan Long, Nurse John, Yohay Sponder, Trevor Wallace and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "HBO’s ‘Harry Potter’ Reveals First Costumed Photo; Casts Neville and Dudley",
        "description": "HBO just confirmed additional cast for its upcoming Harry Potter TV series adaptation, plus released the first look of young Dominic McLaughlin as Potter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "Kanye “Ye” West Struggles Through Chaotic, Rain-Soaked Shanghai Concert",
        "description": "Attendees at the July 12 gig at the Shanghai Stadium were chanting for a refund after Ye appeared over 40 minutes late and the event was mired in technical problems and poor weather.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "‘Jaws’ Star Richard Dreyfuss Cancels SharkCon Appearance After Being Hospitalized With Viral Bronchitis",
        "description": "The actor recorded a video apologizing to fans and noting that he is in \"a lot of pain.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "Will Justin Bieber Land a No. 1 Debut With ‘Swag?’",
        "description": "The pop star holds the number one slot on both Spotify and Apple Music's daily charts this weekend.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "Rosie O’Donnell Calls Trump a “Bad Joke” After He Threatens to Revoke Her U.S. Citizenship",
        "description": "\"You lie, you steal, you degrade —\u2028I nurture, I create, I persist,\" she wrote on Instagram. \"You are everything that is wrong with America.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "Jeff Lynne Cancels Final ELO Show Due to Health Issues",
        "description": "The frontman was on his “Over and Out\" farewell tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "Scooter Braun Calls ‘Swag’ the “Most Authentically Justin Bieber Album to Date”",
        "description": "The longtime manager and the superstar parted ways in 2023.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    },
    {
        "title": "‘South Park’ Removed From Paramount+ Outside the U.S.",
        "description": "Amid a streaming rights battle, the platform's license to stream the series internationally has expired, sources tell The Hollywood Reporter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-15T07:31:13.103296"
    }
]