[
    {
        "title": "Boeing strikers to vote on 35% pay rise offer",
        "description": "About 33,000 unionised workers, mostly in Seattle, will decide this coming week whether to accept the deal.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Much of Cuba remains without power - 24 hours after main power plant fails",
        "description": "Millions of people are still without power, with food rotting in fridges and no water supply in many homes.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Meet the TikTokers buying up Japan’s empty homes",
        "description": "Content creators are going viral for renovating abandoned Japanese homes for low prices - but is all as it seems?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "China's economic slowdown deepens",
        "description": "Gross domestic product rose by 4.6% on a yearly basis, below Beijing's \"around 5%\" annual target.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Tax threshold freeze not a pledge-breaker - Labour sources",
        "description": "UK government sources insist the move would not constitute a breach of Labour's manifesto tax pledge.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Much of Cuba remains without power - 24 hours after main power plant fails",
        "description": "Millions of people are still without power, with food rotting in fridges and no water supply in many homes.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Can UK fine dining weather the financial storm?",
        "description": "After Purnell's closes in Birmingham, other top chefs describe how they are tackling tough times.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Why is England building homes when so many are standing empty?",
        "description": "Bringing empty homes back into use can be tricky, but campaigners say a lot more could be done to help.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "US probing Elon Musk's Tesla over self-driving systems",
        "description": "The National Highway Traffic Safety Administration's evaluation is the first step toward a potential recall of 2.4 million Tesla vehicles",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Meet the TikTokers buying up Japan’s empty homes",
        "description": "Content creators are going viral for renovating abandoned Japanese homes for low prices - but is all as it seems?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Pound falls as UK inflation declines - 16 Oct 2024",
        "description": "The British currency fell greater than expected and came up against a very strong dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "What could happen if Donald Trump drastically increases tariffs as he has promised to do?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "NHS consultant who lost £39k among 100 Revolut customers contacting BBC over scams",
        "description": "People say they have been poorly treated by the firm after being tricked out of cash while using app.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Trump says Apple boss called him to complain about EU",
        "description": "The EU ordered Apple to pay Ireland billions in unpaid taxes in September.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Is esports a viable career path for young Africans?",
        "description": "With esports on the rise across the continent, could more young Africans make a career as professional gamers?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Boohoo considers break-up as sales slide",
        "description": "The online fashion firm is mulling whether to offload its brands as sales remain under pressure.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Tobacco firms to pay $23.6bn in proposed Canada settlement",
        "description": "The deal includes up to C$100,000 in compensation for some smokers and would resolve a decades-long legal fight with cigarette-makers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "What to know about London Stansted Airport's £1bn expansion",
        "description": "It is set to become the UK's second-busiest airport, behind Heathrow.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Planners reject plans for M5 services solar panels",
        "description": "Solar panels have been banned from Exeter's M5 Services' roof because they could dazzle drivers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Meta fires staff for buying toothpaste, not lunch",
        "description": "Meta workers reportedly used vouchers that should have been spent on meals to buy household goods.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Who has to pay inheritance tax?",
        "description": "Inheritance tax is again creating political debate so how does it work and who pays?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "UK Treasury hints it will spend billions on infrastructure",
        "description": "Government claims the move contrasts with former PM Liz Truss's controversial mini-Budget.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Fraudsters steal more than £3m a day as cases rise",
        "description": "Fraud cases rise by 16% in the first half of the year, but total losses are down slightly, new data shows.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Ministers complain to Starmer over spending cuts",
        "description": "Some Cabinet members are alarmed at the scale of cuts being sought to plug a rumoured £40bn gap.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "US 'click to cancel' rule to ban subscription traps",
        "description": "New rule requires businesses to make subscribing and cancelling subscriptions equally simple.",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as WhatsApp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-20T07:22:28.199531"
    },
    {
        "title": "Simon Cowell, Who First Formed and Signed One Direction, on Liam Payne’s Death: “I Feel Empty”",
        "description": "The globally successful band that included Payne, Harry Styles, Louis Tomlinson, Niall Horan and Zayn Malik were first formed on Cowell's reality show, 'The X-Factor', in 2010.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Marc Anthony Endorses Kamala Harris: “This Election Goes Way Beyond Political Parties”",
        "description": "The artist's support for the vice president came in an ad titled \"Recuerdo.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Donald Trump Says He’ll Ask Rupert Murdoch to Direct Fox News to Halt Negative Ads Against Him",
        "description": "The former president and White House hopeful also referred to himself as \"the most stable human being\" in a lengthy appearance on 'Fox & Friends,' where he got the seat on the curvy couch.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Kamala Harris Campaign Targets Taylor Swift Concertgoers in Snapchat Push",
        "description": "Swifties in Miami for the next Eras Tour stop will see ads and filters promoting their \"Kamala era.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Niall Horan Rounds Out One Direction Tributes to Liam Payne: “The Bond We Had Doesn’t Happen Often in a Lifetime”",
        "description": "The Irishman wrote on his Instagram on Friday after Payne, who died from a hotel balcony fall in Buenos Aires Wednesday night, had attended Horan's concert in South America just two weeks ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Former NBC Exec Regrets Helping Market ‘The Apprentice’ in Op-Ed: “We Created a Monster”",
        "description": "\"I want to apologize to America,\" John D. Miller wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Molly Shannon’s Mary Katherine Gallagher Interrupts Kamala Harris’ Virtual Speech at Al Smith Charity Dinner",
        "description": "\"I just want to say that I'm Catholic and tonight is one of the biggest dinners next to the Last Supper,\" Gallagher tells the vice president.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "One Direction Speaks Out on Liam Payne’s Death: “The Memories We Shared With Him Will Be Treasured Forever”",
        "description": "Harry Styles, Niall Horan, Louis Tomlinson and Zayn Malik released a joint statement to address the tragic passing of their former bandmate: \"In time, and when everyone is able to, there will be more to say. But for now, we will take some time to grieve and process the loss of our brother, who we loved dearly.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Liam Payne Died of Trauma, Internal and External Bleeding, Autopsy Shows",
        "description": "Substances believed to be narcotics were found in the room of the former One Direction band member, who plummeted to his death from the balcony of a hotel room in Buenos Aires on Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Amazon Reveals Brian Williams Election Night Special in Big News Experiment",
        "description": "'Election Night Live with Brian Williams' will be produced and directed by live event veteran Glenn Weiss.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "“We Are Heartbroken”: Liam Payne’s Family Mourns “Funny, Brave Soul” Following His Death at 31",
        "description": "\"Liam will forever live in our hearts and we'll remember him for his kind, funny and brave soul,\" said a family statement, released Thursday, after the One Direction star fell from a hotel balcony in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "Backstreet Boys, Steve Aoki, Rita Ora, Charlie Puth Among Those Paying Tribute to Liam Payne: “He Had the Kindest Soul”",
        "description": "The former One Director member died Wednesday after falling from a hotel balcony in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-20T07:22:29.143318"
    },
    {
        "title": "‘One-sided beatdown’: Tim Tszyu obliterated",
        "description": "Aussie Tim Tszyu’s career hangs by a thread after he was “obliterated” in scenes that have rocked the boxing world.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "‘Arrogant’ Tim Tszyu act torn to shreds",
        "description": "Tim Tszyu has made a brutal admission after his crushing world title fight loss, as his tactics in the fight come under serious fire.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Formula 1 great tears Kiwi rookie to shreds",
        "description": "Two-time F1 champ Fernando Alonso has delivered a scathing takedown of New Zealand driver Liam Lawson after one incident.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Champ’s savage Tszyu troll after demolition",
        "description": "Russian Bakhram Murtazaliev poured salt into Tim Tszyu’s wounds with a brutal remark after retaining his championship belt.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Why David Noble would have canned ‘bulls***’ Crows camp",
        "description": "In the latest SACKED podcast, David Noble had left the Adelaide Crows by the time of their infamous camp in 2018 and says he would never have let it happen. LISTEN NOW.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Eddie McGuire ‘in awe’ of lookalike son",
        "description": "Joe McGuire is taking massive steps to emerge from his famous dad’s imposing shadow in the cutthroat US college football system.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Video emerges as NRL star in two-car crash",
        "description": "The NRL is investigating after Brisbane Broncos star Ezra Mam was hospitalised following a car crash in Brisbane on Friday.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Massive boilover as PNG rout Fiji",
        "description": "Papua New Guinea has shocked heavy favourite Fiji with a stunning performance in their Pacific Championships clash in Suva.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Cricket world erupts over mega England fail",
        "description": "England captain Ben Stokes was stumped as his bat flew through the air to sum up a horrible Test match effort against Pakistan.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "‘Bit different’: Aussie bowlers watch India implode",
        "description": "Mitchell Starc and Scott Boland have weighed in after India was routed for 46 on the eve of the Border-Gavaskar series.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Demon’s bid to recreate United Cup magic",
        "description": "Alex de Minaur will lead Australia’s team in a star-studded Australian Open warm-up event that includes seven of the women’s world top 10.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Kyrgios reveals only motivation for comeback",
        "description": "Australian tennis star Nick Kyrgios has revealed when he will be returning to the court this summer in news that will delight tennis fans.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Vintage Marquez produces stunning Aus MotoGP victory",
        "description": "A stunning ride from eight-time world champion Marc Marquez has delivered him a brilliant victory at the Australian MotoGP despite a dramatic start off the grid, while Aussie Jack Miller came home strong.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Norris investigated after sprint disaster",
        "description": "Ferrari lobbed an accusation at Lando Norris after the United States Grand Prix sprint race, which ended with the McLaren driver under investigation.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Olympic legend given only years to live",
        "description": "A British Olympic champion has opened up on the heartbreaking diagnosis and the short time frame doctors have given him to live.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "WAG ‘files for divorce’ over love child scandal",
        "description": "A wife whose famous sports star husband fathered not one, but two children with another woman, has reportedly taken action.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Clip shows star arrested in ‘dumbest way’",
        "description": "Extraordinary police footage has been released of the moment an officer had the perfect response after arresting an NBA player.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Eddie McGuire ‘in awe’ of lookalike son",
        "description": "Joe McGuire is taking massive steps to emerge from his famous dad’s imposing shadow in the cutthroat US college football system.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "New United skipper seeking right mix",
        "description": "Western United’s new captain expects his players to produce a ‘high level’ of performance.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Auckland silence Roar in dream debut",
        "description": "A-League life has started on a winning note for expansion outfit Auckland FC.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "‘One-sided beatdown’: Tim Tszyu obliterated",
        "description": "Aussie Tim Tszyu’s career hangs by a thread after he was “obliterated” in scenes that have rocked the boxing world.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "‘I was getting angry’: Clutch turnaround as Aussie golf star closes in on big win",
        "description": "Major winner Hannah Green took a two-shot lead into the final day of the LPGA BMW Ladies Championship in South Korea on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Stunning derby win kicks off new Phoenix era with a bang",
        "description": "Melbourne United were stunned on Sunday afternoon by their local rivals marking the dawn of a new era for the Phoenix, as the Kings moved to the top of the NBL ladder with a dramatic win against Tasmania.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "‘I held my breath the whole way’: Austy on Harry’s Caulfield Cup triumph",
        "description": "No danger of Harry Coffey getting a big head with the Caulfield Cup winner straight back to work on Sunday, riding four horses at Echuca for his proud father Austy.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-20T07:22:31.160236"
    }
]