[
    {
        "title": "Bank of Japan raises rates to highest in 17 years",
        "description": "The move comes hours after economic data showed prices rose last month at the fastest pace in 16 months.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "US doesn't need Canadian energy or cars, says Trump",
        "description": "Speaking to business leaders in Davos, Trump also repeated his jibe that Canada could become a US state and would avoid tariffs if it did.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "US government workers told to report DEI efforts or face 'consequences'",
        "description": "Government employees received emails threatening \"consequences\" if they did not report DEI work to the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Purdue and Sackler family agree $7.4bn opioid settlement",
        "description": "Under the terms, the opioid maker agreed to pay $900m, and the family behind it agreed to pay up to $6.5bn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "US doesn't need Canadian energy or cars, says Trump",
        "description": "Speaking to business leaders in Davos, Trump also repeated his jibe that Canada could become a US state and would avoid tariffs if it did.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "UK has not ruled out EU food trade deal, says minister",
        "description": "Jonathan Reynolds told the BBC doing a deal to ease UK exports of food would not cross the government's red lines",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "UnitedHealthcare names new boss after former CEO killed",
        "description": "The company's former chief executive Brian Thompson was shot and killed in December.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Rolls-Royce strikes £9bn nuclear submarine deal",
        "description": "A deal for nuclear submarine reactors is agreed between the Ministry of Defence and Rolls-Royce.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "'A mockery': Trump's new meme-coin sparks anger in crypto world",
        "description": "The president's meme-coin launch is being criticised as a stunt, while impatience grows for deregulation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Does China 'operate' Panama Canal, as Trump says?",
        "description": "The US president says the US should \"take back\" the famous waterway because China runs it now.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Expert optimistic about UK economy - 22 Jan 2025",
        "description": "The Europe boss of JP Morgan, Patrick Thomson, says he's very optimistic about the UK economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Trump urges Opec countries to slash oil prices",
        "description": "The president says he wants Opec and Saudi Arabia to bring down the price of oil which he says is fuelling the Russia-Ukraine war.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "EU 'could consider' UK joining pan-Europe customs scheme",
        "description": "The UK joining the Pan-Euro-Mediterranean Convention is up for discussion in reset talks, says Maros Sefcovic.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Meta denies forcing users to follow Trump accounts",
        "description": "The Facebook and Instagram owner says the official profiles were updated to reflect the new position holders.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Canada offers to help Trump as it scrambles to avert tariff war",
        "description": "Prime Minister Justin Trudeau has threatened the stick against proposed US tariffs. Now he's trying a different approach.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "LinkedIn accused of using private messages to train AI",
        "description": "The lawsuit alleges LinkedIn tried to conceal its actions but the firm says the claims are false.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Trump puts all US government diversity staff on paid leave 'immediately'",
        "description": "A new executive order signed on Tuesday calls for an end to DEI practices in the federal government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Tesco, Aldi and Lidl hit back at UK farm inheritance tax",
        "description": "Tesco, Aldi and Lidl call for rethink of inheritance levy announced in Budget",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Sun owner to pay Prince Harry 'substantial' damages",
        "description": "News Group Newspapers offers an \"unequivocal apology\" to the Duke of Sussex for \"serious intrusion\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Tech giants are putting $500bn into 'Stargate' to build up AI in US",
        "description": "Trump has extolled the project as an important investment, but Elon Musk is throwing shade on it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Netflix to raise prices as new subscribers soar",
        "description": "Squid Game 2 and live sports, including the Jake Paul v Mike Tyson fight, fuelled new memberships.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Reeves optimistic despite surprise rise in UK borrowing",
        "description": "Borrowing - the difference between spending and tax revenue - hit its highest December level for four years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "TikTokers offered $5,000 to join Facebook and Instagram",
        "description": "Meta's attempt to lure creators to its platforms comes as questions remain over the future of its main rival in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Trump considers 10% tariff on China from February",
        "description": "The new president accused Beijing of sending fentanyl to Mexico and Canada which ends up in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Trump pardons Silk Road dark web market creator Ross Ulbricht",
        "description": "Trump said he had called Ulbricht's mother to let her know he had granted her son a full pardon.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "Ukraine's chief army psychiatrist arrested on $1m corruption charge",
        "description": "The man owned several properties as well as four BMW luxury cars, the Ukrainian security service said.",
        "source": "BBC Business",
        "fetched_date": "2025-01-24T07:23:20.609156"
    },
    {
        "title": "An Intimacy Coordinator’s Take on That Awkward ‘It Ends With Us’ Video",
        "description": "Justin Baldoni's team claims the video, in which he and Blake Lively's characters dance in a bar, is proof he behaved appropriately, while her team says it validates her allegations of sexual harassment. An experienced intimacy coordinator sees a more complex conflict — one that could have been prevented.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "The Gear Lost in the Fires: As NAMM Arrives in Anaheim, Manufacturers Step Up to Aid Musicians",
        "description": "Greg Wells, Bob Clearmountain, Madlib and Mark “Spike” Stent are among the producers impacted by the devastation in Pacific Palisades and Altadena, along with scores of session and touring players.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "Trace Cyrus Begs Dad Billy Ray Cyrus to Seek Help: “I Barely Recognize You Now”",
        "description": "The country singer's son wrote a heartfelt open letter on Instagram after that viral inauguration performance: \"You’re not healthy Dad and everyone is noticing it.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "Chris Pratt Says House Is “Still Standing” Amid L.A. Fires",
        "description": "“By the grace of God, we have four walls and a roof,” a relieved ‘Guardians of the Galaxy’ star revealed on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "Alexander Brothers Held in Same NYC Jail as Diddy, Luigi Mangione and Awaiting Trial",
        "description": "Two Miami luxury realtors and their brother indicted on sex-trafficking charges have reached the Brooklyn lockup that also once held Sam Bankman-Fried, Ghislaine Maxwell and R. Kelly, according to the Federal Bureau of Prisons.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "L.A. Fires: Sepulveda Blaze, Ignited Near Bel-Air, Stops Spreading",
        "description": "Moraga Bel Air Vineyards, owned by media mogul Rupert Murdoch, was understood to be among the properties that received evacuation warnings that were later lifted due to the fire near the Getty Center.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "GLAAD Scolds Trump, Musk LGBTQ+ Policies: “Billionaires Targeting the Most Marginalized”",
        "description": "Sarah Kate Ellis spoke at the World Economic Forum in Davos, Switzerland, on Thursday: \"It's a distraction — they're grabbing more power.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "L.A. Kings Hosting Celebrity Hockey Game to Benefit Wildfire Victims",
        "description": "Former NHL players are also set to participate in the event at Crypto.com Arena on Feb. 23.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "Survivor of Nova Music Festival Massacre to Represent Israel at Eurovision Song Contest",
        "description": "The 24-year-old was selected after performing winning versions of ABBA’s “Dancing Queen” and Sam Smith’s “Writing’s on The Wall.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "‘RHOBH’ Star Bozoma Saint John Lost Malibu House in Palisades Fire: “I Felt So Helpless”",
        "description": "The former Netflix exec said she learned of the loss on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "Sean “Diddy” Combs Files $50M Defamation Lawsuit Against Grand Jury Witness",
        "description": "The lawsuit, which also names Nexstar, targets assertions from Courtney Burgess that he possesses videos depicting sexual encounters involving Combs and other celebrities.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "Arnold Schwarzenegger Announces $1M Donation to Los Angeles Fire Relief",
        "description": "\"I don’t like when companies or rich people ask their fans to make their donations for them,\" the actor wrote on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-24T07:23:21.279296"
    },
    {
        "title": "AFL star’s mark of the year goes viral",
        "description": "Hawthorn livewire forward Nick Watson has produced arguably the best mark of 2025 and he did it during a match simulation.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘Worst scenario’: $800 reason Novak booed",
        "description": "Fans who paid hundreds of dollars and flew hours to see Novak Djokovic have been left shattered by his shock Aus Open retirement.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘THERE IS A CHANCE’: Djoker drops bomb after shock AO retirement",
        "description": "Novak Djokovic shocked the tennis world after withdrawing from his semi-final, now he’s dropped a bombshell on the Australian Open.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘Please’: Legend goes nuclear at Djoker scenes",
        "description": "Australian tennis fans have been torn to shreds after Novak Djokovic succumbed to injury in the Australian Open semi-final.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "New man in charge of Australia’s bowling future",
        "description": "With retirements looming among Australia’s national teams a new man has been charged with guiding in the next batch of fast bowlers.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Thunder dealt another injury blow ahead of all-Sydney blockbuster",
        "description": "One of the stars of Sydney Thunder’s Knockout final victory has been ruled out of Friday’s historic Sydney Smash final.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘THERE IS A CHANCE’: Djoker drops bomb after shock AO retirement",
        "description": "Novak Djokovic shocked the tennis world after withdrawing from his semi-final, now he’s dropped a bombshell on the Australian Open.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘Please’: Legend goes nuclear at Djoker scenes",
        "description": "Australian tennis fans have been torn to shreds after Novak Djokovic succumbed to injury in the Australian Open semi-final.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Hawthorn ‘wizard’ pulls off epic hanger",
        "description": "Hawthorn livewire forward Nick Watson has produced arguably the best mark of 2025 and he did it during a match simulation.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Scary thing about Lions for AFL rivals",
        "description": "Draft picks Levi Ashcroft and Sam Marshall are set to “drive the standards” in Brisbane’s bid for back-to-back AFL premierships.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Wally Lewis wedding turmoil over family rift",
        "description": "Rugby league icon Wally Lewis’ wedding day may turn into a day of anguish with rumours surrounding the family’s falling out.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Bullet fired through NRL coach’s home",
        "description": "Manly Sea Eagles coach Anthony Seibold was relieved no one was hurt after a bullet was fired through the garage of his house.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Aussie GOAT makes shock career call",
        "description": "She took last year off competition and still spent the year surfing, and now Steph Gilmore has decided what she’ll be doing in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘Pit of piranhas’: World title chase stirs Sally",
        "description": "Sally Fitzgibbons has been close to a world title in a rollercoaster career and the energetic Aussie can’t get enough of the ride as a 16th campaign begins.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Huge snub as NBA All-Star starters named",
        "description": "Teams for the NBA’s new-look All-Star Game have been announced and some big-name players have been overlooked.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Insane double knockout in basketball fight",
        "description": "A high school basketball player is facing police charges after he knocked out an opponent and punched another in wild scenes.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘Really poor’: Socceroos coach blasts prodigy",
        "description": "Socceroos coach Tony Popovic hasn’t held back in his assessment of the standard of Australian players, including a one-time prodigy.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Socceroos coach takes aim at one-time prodigy",
        "description": "Socceroos coach Tony Popovic hasn’t held back in his assessment of the standard of Australian players, including Daniel Arzani.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘Poison in my heart’: Adesanya’s final call on Whittaker trilogy",
        "description": "After a bitter rivalry which spawned two cracking UFC bouts, Israel Adesanya and Robert Whittaker have become an unlikely pair of mates – even if a cup of coffee threatened to ruin it all.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "F1 world in meltdown over Hamilton photo",
        "description": "Seven-time world champion Lewis Hamilton has sent the F1 world into a spin over a simple photo he shared on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Insane double knockout in basketball fight",
        "description": "A high school basketball player is facing police charges after he knocked out an opponent and punched another in wild scenes.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Dutton hits back at lunch scheme dig",
        "description": "Peter Dutton has hit back at recent criticism of an Opposition election pledge to give small businesses $20,000 of tax-deductible lunches.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Viking over setback for Randwick raid",
        "description": "Trainer John Sargent says Nordic Viking can make an impression at Randwick after patiently waiting an extra two weeks for his debut.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Wallabies skipper warns of ‘massive risk’",
        "description": "The Wallabies captain has urged Australian players to think about the 2027 Rugby World Cup when deciding about their future.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-01-24T07:23:22.315299"
    }
]