[
    {
        "title": "Hunt for Bitcoin's elusive creator hits another dead end",
        "description": "Why are we still no closer to unmasking the mysterious Satoshi Nakamoto?",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "How DNA testing website 23andMe went downhill",
        "description": "Once used by millions to discover their family histories, this week 23andMe was almost delisted. What went wrong?",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "US election bets surge, despite red flags and mixed record",
        "description": "Election bets have exploded in the US, as it barrels toward the polls next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "How DNA testing website 23andMe went downhill",
        "description": "Once used by millions to discover their family histories, this week 23andMe was almost delisted. What went wrong?",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Weight-loss drug firm Wegovy invested £6bn in this town. So why is it not booming?",
        "description": "Europe's most valuable company has invested billions in Kalundborg on Denmark's coast - but it has many problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Living with Nigeria's blackouts - six weeks, no power",
        "description": "Large parts of Nigeria are experiencing power outages due to problems with the country's grid.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "US jobs growth slows sharply as election looms",
        "description": "Employers added 12,000 jobs in October, much lower than the 223,000 created in September, figures show.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Energy CEO says fracking still 'necessary' - 1 Nov 2024",
        "description": "Energy CEO Lorenzo Simonelli wants to work with either candidate to help meet the energy demands in the US.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Jeff Bezos defends Washington Post's end to election endorsements",
        "description": "The newspaper owner's comments follow the reported loss of subscribers and editorial staff resignations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Musk election cash giveaways can continue as judge mulls case",
        "description": "Prosecutors say the case will now move to a federal court, following a request from Musk's lawyers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Russia fines Google more money than there is in entire world",
        "description": "The mind-boggling figure has been levied due to the company restricting Russian state media on YouTube.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Investors' reaction to Budget 'very different' to Truss",
        "description": "Treasury secretary speaks out to reassure the markets after a rise in the cost of government borrowing.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "Canada has launched a tourist drive but will tensions with China doom it to fail?",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Hollywood stars grow Wrexham  empire with brewery",
        "description": "The football club's star co-owners grow their Wrexham by buying half of the Wrexham Lager brewery.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "UK Budget 2024: Key points at a glance",
        "description": "Chancellor Rachel Reeves has delivered Labour’s first Budget since 2010 – here’s what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "UK growth set to peak next year before slowing again",
        "description": "The government's official forecaster raises its prediction for UK growth in 2024 and 2025 but reduces it for later years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Why Wikipedia has landed in legal trouble in India",
        "description": "India’s largest newswire service ANI has filed a $237,874 defamation lawsuit against Wikimedia Foundation.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "UK-based stars support US video game strikes as row continues",
        "description": "Famous voices from releases such as The Witcher and Cyberpunk 2077 say they support the SAG-Aftra strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "TikTok founder becomes China's richest man",
        "description": "Zhang Yiming's fortune has leapt to almost $50bn, according to a newly published rich list.",
        "source": "BBC Business",
        "fetched_date": "2024-11-03T07:25:17.542545"
    },
    {
        "title": "Martha Stewart Thinks Neighbor Ryan Reynolds Is “Not So Funny in Real Life”",
        "description": "\"He can act funny, but he isn’t funny,\" the celebrity chef and businesswoman said about the 'Deadpool & Wolverine' star.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "K-Pop Star Kang Daniel Is Ready for His Next ‘Act’",
        "description": "As The Hollywood Reporter's latest \"Person of Interest,\" the once K-pop boy group Wanna One member opens up about \"restarting\" with his latest solo album 'Act.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Lin-Manuel Miranda, Martin Short, Rosie Perez Set for “Stars in the House” Election Day Vote-A-Thon",
        "description": "Wayne Brady, Jessie Mueller, Shoshana Bean and Judy Kuhn, among others, will join hosts Seth Rudetsky and James Wesley Jackson.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Jamie Foxx Netflix Special About Mystery Illness to Release in December",
        "description": "“I said, ‘If I can stay funny, I can stay alive,’” the Oscar-winning actor says in a trailer for ‘Jamie Foxx: What Had Happened Was…,' set to bow globally on Dec. 10.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Fat Joe on New Starz Series, Rappers Endorsing Trump and Why Hip-Hop Artists Don’t Want to Talk to Journalists",
        "description": "“Who can you trust more than a rapper?” says the host of 'Fat Joe Talks.' And no, he's not joking.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "NBC News and MSNBC’s Election Day Gameplan: Data Is the Star of the Show",
        "description": "MSNBC's studio will have a virtual White House behind Steve Kornacki, while NBC's coverage will feature a virtual recreation of Rockefeller Plaza.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Jennifer Lopez Rallies Kamala Harris Supporters After Hinchcliffe Jibe: “It Wasn’t Just Puerto Ricans Offended That Day”",
        "description": "The actor-singer also described Republican candidate Donald Trump as someone \"who has constantly worked to divide us\" ahead of election day.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Shonda Rhimes to Join Debbie Allen, ‘Grey’s Anatomy’ and ‘Private Practice’ Cast for Get Out the Vote Trivia Livestream (Exclusive)",
        "description": "The acclaimed producer will compete alongside actors from two of her hit shows as well as Florida rep. Maxwell Frost.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "‘The Avengers’ Stars Reunite to Brainstorm a Catchphrase for Kamala Harris Ahead of Election",
        "description": "Scarlett Johansson helped organize the new get-out-the-vote video with fellow Marvel stars Robert Downey Jr., Chris Evans, Mark Ruffalo, Don Cheadle, Danai Gurira and Paul Bettany.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Stevie Nicks on Waiting Until 70 to Vote: “I Regret That, and I Don’t Have Very Many Regrets”",
        "description": "“The Lighthouse” singer is using her platform to advocate for reproductive rights.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Menendez Brothers Attorney Wants Them Released Before Holidays as DA Gascón Supports Clemency Bid",
        "description": "Another route to freedom for the incarcerated brothers has opened up and it will come down to Gov. Gavin Newsom, potentially before Thanksgiving.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Megan Thee Stallion Holds Back Tears at Documentary Premiere: “I Started to Watch a Lot of People Dehumanize Me”",
        "description": "'Megan Thee Stallion: In Her Words' will introduce people to Megan Pete — the woman behind the entertainment persona — for the first time, says the Houston rapper.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-03T07:25:17.796336"
    },
    {
        "title": "Langer comes clean on shock Broncos move",
        "description": "Broncos legend Allan Langer has set the record straight after the shock decision to transition into a new role at the club.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "‘Crossed the line’: NBA star shoves reporter",
        "description": "NBA superstar Joel Embiid has reportedly shoved a reporter in heated scene in the change rooms over an ugly swipe.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Wild ball tampering cricket ‘drama’ erupts",
        "description": "A ball tampering controversy has overshadowed the end of the tour match between Australia and India, with one player rebuked by the umpire.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Star unveils new romance while pregnant",
        "description": "Sophie Cachia has addressed “invasive” speculation surrounding her third pregnancy that saw fans claim her ex was her unborn baby’s dad.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Hawks break Tigers to claim million dollar prize, home final",
        "description": "Brisbane had one hand on the $1 million McClelland Trophy when Richmond led Hawthorn early in the final term. Then the Hawks put their foot down. Follow as the AFLW finals take shape.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Star unveils new romance while pregnant",
        "description": "Sophie Cachia has addressed “invasive” speculation surrounding her third pregnancy that saw fans claim her ex was her unborn baby’s dad.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Langer comes clean on shock Broncos move",
        "description": "Broncos legend Allan Langer has set the record straight after the shock decision to transition into a new role at the club.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "‘Tough’: Footage of axed NRL star says it all",
        "description": "Josh Addo-Carr has revealed his new job days after being sacked by the Bulldogs, but the speedster is adamant his NRL career isn’t over.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Warner’s message for Fraser-McGurk to crack 50-over code",
        "description": "Jake Fraser-McGurk has only started in two ODIs since being anointed David Warner’s successor at the top of the Australian order, but he is set to get a big swing at nailing down a spot.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Wild ball tampering cricket ‘drama’ erupts",
        "description": "A ball tampering controversy has overshadowed the end of the tour match between Australia and India, with one player rebuked by the umpire.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Jelena Dokic’s shock claim about abusive dad",
        "description": "Tennis great Jelena Dokic has made a shock claim about her relationship with her abusive father ahead of the release of her documentary.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Aussie Demon set for 20-year first",
        "description": "Alex de Minaur was supposed to be battling with a hip injury, but the Australian star’s fight has put him on the verge of a 20-year-first.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Piastri gifts Norris Brazil victory as qualifying postponed",
        "description": "Oscar Piastri has handed Lando Norris victory in the Brazil Grand Prix Sprint as McLaren delivered a one-two result ahead of Max Verstappen to trim his F1 championship lead.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "‘Horrible’: Wild Verstappen conspiracy theory",
        "description": "The man who penalised Max Verstappen for his tactics against Lando Norris as blasted the F1 champion’s “horrible mindset”.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Raygun takes world by storm all over again",
        "description": "Aussie Olympic breakdancer Raygun has come clean on her true feelings after she once again took the world by storm.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Cleary pic proves truth about relationship",
        "description": "Nathan Cleary has been making the most of the NRL off-season, with the latest pic proving his relationship with Mary Fowler has never been better.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "‘Crossed the line’: NBA star shoves reporter",
        "description": "NBA superstar Joel Embiid has reportedly shoved a reporter in heated scene in the change rooms over an ugly swipe.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Jason Kelce loses it over Taylor Swift slur",
        "description": "Footage is going viral of Jason Kelce responding to a man’s disgusting comment about his brother’s romance with Taylor Swift.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Liverpool go top as Man City, Arsenal stunned in Premier League",
        "description": "Manchester City’s 32-match unbeaten run in the Premier League came to an shuddering end in a 2-1 defeat at Bournemouth as Liverpool took full advantage. FULL EPL WRAP",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Victory’s shot at Cup revenge",
        "description": "Fresh off a memorable Melbourne derby win, the Victory are full of confidence heading to Sunday’s meeting with Macarthur FC.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Rival stunned as Tyson reveals physique",
        "description": "Mike Tyson has incredibly transformed his body in just one year ahead of his fight with Jake Paul and it’s even stunned his opponent.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Top European contingent set for Aussie ‘majors’",
        "description": "Several winners from the DP World Tour have committed to playing in the Australian PGA and Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Phoenix continue rising from the ashes after taming Wildcats",
        "description": "The South-East Melbourne Phoenix has its fourth win in five games and – after being in all sorts early doors in the NBL season – are back in the top six hunt.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "NRL great ‘disappointed’ by anthem stance",
        "description": "Players make their own decisions about singing the national anthem before matches and it doesn’t sit well with one NRL great.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Aussie Olympians’ $100k pay day blocked",
        "description": "Rugby Australia are standing in the way of a plan for two of Australia’s biggest Rugby Sevens stars to maximise their earning potential.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "EXCLUSIVE: Williams chasing Cup redemption on ‘Dunaden v2.0’",
        "description": "Champion jockey Craig Williams has likened his 2024 Melbourne Cup contender to former winner Dunaden, who he was famously suspended from riding in the Cup.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-03T07:25:19.560293"
    }
]