[
    {
        "title": "Have supermarkets in UK reached peak self-scan?",
        "description": "Supermarket are beginning to question the divisive technology after years of criticism from shoppers.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Blockbuster Chinese video game tried to police players - and divided the internet",
        "description": "The hugely popular Black Myth: Wukong has attracted some press for the wrong reasons.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "TikTok blamed for hit to Iceland cucumber supply",
        "description": "One supermarket says demand has more than doubled, after viral videos promote unique recipes.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Jeremy Clarkson's pub opening attracts huge crowds",
        "description": "The former Top Gear presenter says he paid \"less than £1 million\" for the Cotswolds pub.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Should you have to pay for online privacy?",
        "description": "Some websites have started introducing paywalls which can be lifted with data rather than cash.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Blockbuster Chinese video game tried to police players - and divided the internet",
        "description": "The hugely popular Black Myth: Wukong has attracted some press for the wrong reasons.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Telegram CEO Pavel Durov arrested at French airport",
        "description": "The 39-year-old was detained after his private jet landed at Le Bourget Airport in northern Paris.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "SpaceX will return stranded astronauts next year",
        "description": "Sunita Williams and Barry Wilmore were supposed to be on an eight-day mission, but will not return to Earth until 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Ex-Boeing staff claims electrical faults 'concealed'",
        "description": "A campaign group has accused Boeing of concealing information about electrical problems on a plane.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "TikTok blamed for hit to Iceland cucumber supply",
        "description": "One supermarket says demand has more than doubled, after viral videos promote unique recipes.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Olympic legend Lindsey Vonn explains the mindset of a winner",
        "description": "The decorated US downhill skier opens up to Katty Kay about the mental state that led her to gold medal victory and the \"hole\" that's left when her mind isn't on winning anymore.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "US accuses software firm of driving rent hikes",
        "description": "The US has sued software firm RealPage, accusing it of allowing landlords to co-ordinate on pricing.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Canadian rail workers begin returning to work as stoppage partially ends",
        "description": "Workers at one of Canada's two main railways resume work on Friday, partially ending a lockout after government intervention.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Time has come for interest rate cut, says Fed chair",
        "description": "The remarks signal a new fight for the US central bank, after two years battling inflation.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Bolt acts to halt Nigeria-South Africa 'taxi-war'",
        "description": "People were booking and then cancelling rides in the other country as a prank.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Moment Botswana's president feels weight of giant diamond",
        "description": "Botswana's president, Mokgweetsi Masisi, couldn't hide his surprise as he held the world's second largest diamond.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Chinese scammers cheated victims from Isle of Man base",
        "description": "A seaside hotel and office block were used by scam artists who tricked people out of millions of dollars.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Charities fear double energy price hit for pensioners",
        "description": "Rising energy prices and the withdrawal of financial support will hit some hard, charities say.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Royal Mail fails to meet spring delivery targets",
        "description": "Royal Mail delivered less than 80% of first class post on time between April and the end of June.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Typical household energy bill up £149 a year in October",
        "description": "Energy regulator Ofgem announces price changes for 27 million households in England, Wales and Scotland.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Shein reveals child labour cases at suppliers",
        "description": "The Chinese fast fashion giant has been tightening scrutiny of firms that make the clothes it sells.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Starbucks' new boss under fire for 1,000-mile commute",
        "description": "Job offer which allows new boss to commute to and from work on corporate jet sparked criticism.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Plan to hike UK windfall tax sparks energy jobs warning",
        "description": "Firms across the supply chain to the oil and gas industry have warned that official plans threaten investment.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Child benefit claims rise after income rule change",
        "description": "The number of new claims rose in April, after a rule change on how much parents can earn and still be eligible.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "Bangladesh to raise rates, says new bank chief",
        "description": "Soaring prices have been a major concern for the country as its currency comes under pressure.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "McDonald's to open 200 new restaurants in growth drive",
        "description": "'Drive to' sites - with a small seating area and no drive-through - will be tested as part of the offer.",
        "source": "BBC Business",
        "fetched_date": "2024-08-25T07:20:04.465343"
    },
    {
        "title": "'Why I cycled 1,500km to avoid a flight'",
        "description": "Looking for alternatives to flying, Matilda Welin decided to embark on a long-distance cycle from London to Sweden. Here's what she learned.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "The deceptive power of a category 1 hurricane",
        "description": "Don't be lured into a false sense of security by a category one hurricane – storm surge and flooding mean they can be as dangerous as a category five.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "A visit to one of Antarctica's stunning penguin colonies",
        "description": "Marc Cieslak finds out how gentoo penguins are adapting to a warming climate.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Dorset's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Hampshire & Isle of Wight: Sunday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Oxfordshire's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Oxfordshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Your pictures across the West Midlands",
        "description": "Photos sent in by BBC Weather Watchers show the beauty of the West Midlands.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Berkshire's Big Picture: Sunday's image of the county",
        "description": "Showcasing the best images sent to us from around Berkshire.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Owners of evacuated homes say they remain in limbo",
        "description": "Seven years since an evacuation order, owners say they remain in a state of uncertainty.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Wallaby in Cornwall dies after vehicle collision",
        "description": "Officers who found the wallaby hit by a vehicle on the A39 said it sadly died on Friday night.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Dorset's Big Picture: Saturday's image of the county",
        "description": "Showcasing the best images sent to us from around Dorset.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Hampshire & Isle of Wight: Saturday's Big Picture",
        "description": "Showcasing the best images sent to us from around Hampshire & Isle of Wight.",
        "source": "BBC Earth",
        "fetched_date": "2024-08-25T07:20:04.529639"
    },
    {
        "title": "Chappell Roan Says She’s “Scared and Tired” of Fans Trying to Normalize “Predatory Behavior”",
        "description": "Chappell Roan is addressing the ongoing concerning behavior she’s experienced from people who claim to be her fans. The “Good Luck, Babe!” singer, who climbed her way to fame within the past year, took to Instagram on Friday to share a lengthy note, pleading for people to “stop touching me,” “stop being weird to my […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Bill Maher Is Confused Why Charli XCX Labeled Kamala Harris “Brat”: “It Sounds Like Trump”",
        "description": "Bill Maher has realized he’s behind on current internet slang, namely “Brat Summer,” after being on a month-long hiatus from Real Time. While chatting with CNN anchor Kaitlan Collins on Friday’s episode, the host attempted to understand the viral phenomenon — which started after Charli XCX dropped her latest studio album titled Brat in June — that’s […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Girl Group KATSEYE Is Ready to Do It Their Own Way",
        "description": "Last year, K-pop giant Hybe and Geffen Records announced the six members selected to be part of their first global girl group KATSEYE. Billed as an international group, with final members hailing from America, the Philippines, South Korea and Switzerland, the group was created using K-pop artist development methodologies through the audition program The Debut: […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Cheryl Hines’ Enthusiasm for Donald Trump Could Not Be More Curbed",
        "description": "Cheryl Hines, who shot to fame playing the beleaguered wife of Larry David on Curb Your Enthusiasm, has faced her share of real-life headaches as the wife of Robert F. Kennedy Jr. But the actress is about to face her biggest challenge yet as her husband suspends his independent campaign for president and throws his […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "RFK Jr. Ends Campaign, Backs Trump as Wife Cheryl Hines Says “All Parties Are Truly Good People”",
        "description": "Robert F. Kennedy Jr. has called off his long-shot presidential campaign and has thrown his support behind Republican presidential nominee Donald Trump. The move is a stunning bit of political calculus from a scion of America’s most storied Democratic dynasty. Teased earlier this week by the candidate and his running mate, Nicole Shanahan, the news […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Would a Taylor Swift Endorsement Actually Impact the Presidential Race?",
        "description": "Bad blood appears to abound between supporters for Vice President Kamala Harris and former President Donald Trump heading into November’s tight presidential election. While both sides have enlisted varying degrees of star power at their respective national conventions, there appears to be one figure whose endorsement the two candidates seemingly covet: Taylor Swift. Trump took […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Ronda Rousey Apologizes for 2013 Sandy Hook Tweet: “I Should Have Been Canceled”",
        "description": "Ronda Rousey has apologized for her 2013 tweet about the Sandy Hook Elementary School shooting. The former MMA fighter shared a statement on social media, expressing her regret over sharing a conspiracy theory video that suggested that the shooting had been staged. “I can’t say how many times I’ve redrafted this apology over the last […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Nicole Avant Reflects on Resilience and Coping with Loss: “No One Is Exempt”",
        "description": "Nicole Avant spent much of her childhood summers in holiday enclaves like Oak Bluffs in Martha’s Vineyard and Sag Harbor in Long Island, vacation havens created by the Black middle-class elites as they were often denied entry elsewhere. “My parents took me there, and it was great for me growing up to see Black doctors, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Kamala Harris Is Campaigning as a Prosecutor. Popular Entertainment Has Long Favored Their Antagonist.",
        "description": "As she accepted the Democratic nomination Thursday night, Kamala Harris played up her attorney-general past. “As a prosecutor, when I had a case, I charged it not in the name of the victim, but in the name of the people,” she told the United Center crowd. This follows a strategy she has pursued since ramping up […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "DNC Day 4: Kamala Harris Accepts Nomination, Capping Four-Night Reintroduction to Voters",
        "description": "Vice President Kamala Harris strode onto the DNC stage at 10:30 p.m. on the convention’s closing night, just after her beloved sister laid a firm foundation for her reintroduction to America — something dozens of the most powerful people in the Democratic party also spent the past four nights doing. Harris presented herself to the […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Kerry Washington Invokes Olivia Pope at DNC, Has ‘Scandal’ Reunion With Tony Goldwyn Onstage",
        "description": "The Democratic National Convention delighted Scandal fans everywhere when it announced that Kerry Washington and Tony Goldwyn would be among the week’s lineup of nightly Hollywood hosts. The pair played out having proximity to the White House onscreen when they starred opposite each other as Washington, D.C., fixer Olivia Pope and President Fitzgerald “Fitz” Grant […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "Rep: Beyoncé Is Not Performing at DNC; “Was Never Scheduled” to Attend (Exclusive)",
        "description": "A representative for Beyoncé says the singer will not attend the 2024 Democratic National Convention. “Beyoncé was never scheduled to be there,” the Grammy-winning star’s rep tells The Hollywood Reporter. “The report of a performance is untrue.” Rumors about the pop star attending and performing at this year’s DNC, celebrating Vice President Kamala Harris’ historic […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-08-25T07:20:04.722168"
    },
    {
        "title": "TPG nears $150M funding in India’s Eruditus at $2.3B valuation",
        "description": "Eruditus, an Indian edtech startup, is in advanced stages of talks to secure about $150 million in new funding, two sources familiar with the matter told TechCrunch, in what would…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Telegram founder Pavel Durov reportedly arrested in France",
        "description": "Pavel Durov, founder and CEO of messaging app Telegram, was arrested on Saturday evening while leaving his private jet at France’s Bourget airport, according to French television network TF1. Reports…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Apple reportedly announcing iPhone 16 lineup and more on Sept. 10",
        "description": "Apple will be unveiling new products on September 10, with the announced phones going on sale on September 20, according to a report from Bloomberg’s Mark Gurman. That lineup will…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "The fallout after Bolt’s aggressive fundraising attempt has been wild",
        "description": "After fintech Bolt surprised the industry with a leaked term sheet that revealed it is trying to raise at a $14 billion valuation, things got weird.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Starliner will return to Earth uncrewed, astronauts staying on ISS until February",
        "description": "Boeing’s Starliner mission is coming back to Earth — empty. After months of data analysis and internal deliberation, NASA leadership announced today that Starliner will be coming back to Earth…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Do you know where your children are? Maybe on X",
        "description": "A surprising number of “iPad kids” — aka Generation Alpha’s 7- to 9-year-old demographic — are using X, according to new data from parental control software maker Qustodio. The firm…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Google just made a $250M deal with California to support journalism — here’s what it means",
        "description": "This week, Google joined a $250 million deal with the state of California to support California newsrooms. While the deal offers a much-needed cash infusion for an industry that’s seen…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "X shareholders as of June 2023 included funds tied to Bill Ackman, Binance, and Sean ‘Diddy’ Combs",
        "description": "A court order recently forced Elon Musk’s X to reveal its full list of shareholders, as of June 2023, to the public. Many of the recognizable tech industry names had…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "VCs are so eager for AI startups, they’re buying into each others’ SPVs at high prices",
        "description": "VCs are increasingly buying shares of late-stage startups on the secondary market as they try to get pieces of the hottest ones — especially AI companies. But they are also increasingly doing so through financial instruments called special purpose vehicles (SVPs). Some of those SPVs are becoming such hot commodities…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "The top AI deals in Europe this year",
        "description": "Cumulatively, there have been more than 1,700 funding rounds for AI startups in Europe so far in 2024.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "The founder building a wealth-management product her grandmother would have loved",
        "description": "After two years of building the company, the company quietly launched its beta in June and is officially announcing it today, right here, in TechCrunch.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "These 74 robotics companies are hiring",
        "description": "From the looks of things, companies in the category — including Agility Robotics and Formlogic — can’t hire quickly enough.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "TechCrunch Minute: Tech billionaires want to build a utopian city in California",
        "description": "A crew of tech billionaires have been trying to get the California Forever project off the ground, which would create a new, supposedly utopian city…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Threads confirms it is experimenting with ephemeral posts",
        "description": "Automatically disappearing posts on social networks could be handy for users who have a habit of deleting their posts through third-party tools, or if the context of those posts is…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "‘Disappointed but not surprised’: Former employees speak on OpenAI’s opposition to SB 1047",
        "description": "Two former OpenAI researchers who resigned this year over safety concerns say they are disappointed but not surprised by OpenAI’s decision to oppose California’s bill to prevent AI disasters, SB…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "VC Neil Mehta, who’s quietly nabbing prized SF property, plans a “Y Combinator for restaurants”",
        "description": "Neil Mehta, the VC behind the acquisition of a string of properties on San Francisco’s tony Fillmore Street, made waves earlier this week for reportedly throwing long-established local restaurants to…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Justice Department sues RealPage over allegedly helping landlords collude to drive up rents",
        "description": "RealPage, which makes property management software, was sued Friday by the U.S. Justice Department and eight attorneys general for allegedly helping apartment and building managers around the country collude to…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Colorful Capital will stop trying to raise for a fund",
        "description": "Colorful Capital’s co-founders, William Burckart and Megan Kashner, declined to comment.",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Andrew Ng steps back at Landing AI after announcing new fund",
        "description": "Andrew Ng is stepping down from his role as CEO at Landing AI, the computer vision platform he founded in 2017. Dan Maloney, formerly the COO, will take the reins…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "Piramidal’s foundation model for brainwaves could supercharge EEGs",
        "description": "AI models are being applied to every dataset under the sun, but are inconsistent in their outcomes. This is as true in the medical world as anywhere else, but a…",
        "source": "TechCrunch",
        "fetched_date": "2024-08-25T07:20:05.092625"
    },
    {
        "title": "‘Lifetime ban’: Shock as AFL umpire struck",
        "description": "An AFL umpire was left bloodied and had to be replaced after being struck by an object thrown from the crowd in a cowardly act.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Fan holding four pints takes a screamer",
        "description": "Watch as an England cricket fan pulls off the catch of the day with “four pints in hand”, leaving commentators stunned.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘We had to’: GWS’ swipe at Collingwood",
        "description": "Prior to the Giants’ defeat against the Western Bulldogs in a huge clash in Ballarat, another AFL club was firmly on GWS’ mind.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Ex-AFL star hospitalised by coward punch",
        "description": "A former AFL star spent overnight in hospital after getting coward punched with the shocking footage surfacing on Sunday.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘Lifetime ban’: Shock as AFL umpire struck",
        "description": "An AFL umpire was left bloodied and had to be replaced after being struck by an object thrown from the crowd in a cowardly act.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘We had to’: GWS’ swipe at Collingwood",
        "description": "Prior to the Giants’ defeat against the Western Bulldogs in a huge clash in Ballarat, another AFL club was firmly on GWS’ mind.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "NRL live: Sin bin, cheap shot light up derby",
        "description": "There is plenty of feeling between local rivals the Sharks and Dragons, with a number of flare-ups and Jesse Ramien binned for a high shot.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "NRL star rushed to hospital for ‘shark bite’",
        "description": "Knights backrower Kai Pearce-Paul was rushed for emergency surgery for a horror injury likened to “a shark bite”. WARNING: Graphic.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Fan holding four pints takes a screamer",
        "description": "Watch as an England cricket fan pulls off the catch of the day with “four pints in hand”, leaving commentators stunned.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "World Cup shift after Aussie skipper’s fears",
        "description": "As trouble continues to make Bangladesh unsafe for travel, the ICC has heeded player wishes and moved October’s T20 World Cup.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Federer’s iconic tennis coach dead at 59",
        "description": "The tennis world has paid tribute after the man who coached Swiss maestro Roger Federer to his first Wimbledon title died.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Aussies in 46-year US Open first",
        "description": "It’s been nearly half a century since there were as many Australians in the main draw of the US Open as there are now, with two seeded men leading the charge.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Ricciardo’s F1 nightmare gets even worse",
        "description": "Australian Formula 1 star Daniel Ricciardo had a chance to prove Red Bull bosses wrong, but it all went pear-shaped on Sunday.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘Not up to scratch’: Ricciardo pins ‘sh***y’ qualifying on car defects",
        "description": "Bundled out of qualifying at the first hurdle, Daniel Ricciardo has suggested there were underlying issues with his car in the Netherlands.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Influencers go to war in heated feud",
        "description": "Two sporting social media influencers are engaged in an ugly online spat after one called out the other for stealing her content.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘Should be cancelled’: Star’s shock admission",
        "description": "Former UFC and WWE star Ronda Rousey has delivered a stunning admission after sharing a conspiracy theory video online.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "‘Sleazy’: Hawk Tuah girl’s latest act slammed",
        "description": "A legendary US sports broadcaster has savaged the Hawk Tuah girl after the viral star continued to milk her “15 minutes of fame”.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Patty Mills’ $5m NBA lifeline revealed",
        "description": "A standout Olympic performance from Patty Mills’ has seemingly landed the 36-year-old Aussie another lifeline to stay in the NBA.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Absurd star blowing football world away",
        "description": "Ronaldo and Messi are considered two of the greatest players of all time, but this 24-year-old is closing the gap on the duo.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Ex-Socceroo returns to A-League",
        "description": "Central Coast Mariners’ A-League title defence will be boosted by the return of a former Socceroo.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Potions and witchcraft: Tszyu’s otherworldly fight tune-up",
        "description": "Nikita Tszyu has opened up on his left-field preparation techniques, while shutting down talk about a fight with Michael Zerafa.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Scott’s 390m monster in $30m surge",
        "description": "Playing at high altitude in Colorado, the world’s best golfers are smacking the ball a mile and the Aussie star didn’t miss out.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "A SuperCoach NRL fan’s quick guide to SuperCoach NBL",
        "description": "If you love playing SuperCoach NRL, you’re going to have a blast with SuperCoach NBL. Check out all the features you know and love – and what’s new.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Folau‘s bombshell claims on viral post",
        "description": "Israel Folau has opened up about the social media post that ended his Wallabies career, slamming the media and calling his treatment “unfair”.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Wallaby keen to build on ‘bittersweet’ comeback",
        "description": "Having finally made his return from injury, a Wallabies prop wants to take his game to the next level on Australia’s tour of Argentina.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Tips, inside mail for Wagga, Taree on Monday: $2.50 best bet",
        "description": "A Wagga specialist who wasn’t disgraced in town last time out can get the cash for punters on Monday. Get Shayne O’Cass’s best bets, value picks and quaddie selections for Wagga and Taree.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-08-25T07:20:06.347953"
    }
]