[
    {
        "title": "Markets slide as Nvidia shares plunge almost 10%",
        "description": "The artificial intelligence chip giant saw $279bn wiped off its stock market value in New York.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Salvage operation for oil tanker in Red Sea not safe, EU mission says",
        "description": "The ship carrying one million barrels of oil was abandoned after an attack by Yemen's Houthis.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Sony takes new game offline two weeks after release",
        "description": "Concord reportedly spent eight years being made but it is being taken offline soon after launch.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "China hits back at Canada EV tariffs with canola probe",
        "description": "The move could lead to tariffs on a key Canadian export and escalates a trade fight between the two countries.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Salvage operation for oil tanker in Red Sea not safe, EU mission says",
        "description": "The ship carrying one million barrels of oil was abandoned after an attack by Yemen's Houthis.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Sanctioned Russian oligarchs take stake in largest UK oil firm",
        "description": "Petr Aven and Mikhail Fridman become minority shareholders after Harbour Energy buys German firm.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Cathay Pacific grounds planes after engine problem",
        "description": "The Airbus A350-1000's Trent XWB-97 engines were made by UK-based engineering giant Rolls-Royce.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Today's political mood more 'anxious' than when I came to power, says Blair",
        "description": "The former Prime Minister says today's political mood is \"more anxious\" than when he came to power.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Sony takes new game offline two weeks after release",
        "description": "Concord reportedly spent eight years being made but it is being taken offline soon after launch.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Why Zoom wants you to go back to the office",
        "description": "Zoom chief product officer Smita Hashim explains why even video-chat innovators need the physical space – with a little help from AI.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Is US economy better or worse now than under Trump?",
        "description": "BBC Verify looks at jobs, inflation, stocks and other indicators to compare the Trump and Biden economies.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Trial of former VW boss begins over 'dieselgate' scandal",
        "description": "Martin Winterkorn, who was head of the German carmaker in 2015, appeared in court on Tuesday.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Spain’s 'pineapple-gate' sparks hopes of romance and shop chaos",
        "description": "The fruit-based flirting code has caused rowdy scenes at the Mercadona supermarket chain.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Horn of Africa airlink, once symbolic of peace, suspended",
        "description": "The airlink was re-instated only six years ago after a long period of tension between the neighbours.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "China's mission to win African hearts with satellite TV",
        "description": "China pledged to install satellite dishes in some 10,000 villages across Africa, aiming to generate goodwill.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "US seizes Venezuelan President Maduro's plane",
        "description": "US officials say the aircraft was recovered in the Dominican Republic after having been purchased illegally.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "‘Four-day week saves me £350 a month on childcare’",
        "description": "The BBC hears from people who work compressed weeks with mixed views on the pros and cons.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "State pension to be boosted by over £400 next year",
        "description": "This will take the full state pension for men who have retired since 1951 and women since 1953 to around £12,000 in 2025/26.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Back-to-work scam warning after complaints hit peak",
        "description": "Post-summer life admin leaves some exposed to scams, campaigners say, as fraud and fears grow.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Nine offshore wind farm projects awarded in UK auction",
        "description": "The green energy deals follow last year's auction when no companies bid to build offshore wind farms.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Will Labour’s plan make train tickets cheaper?",
        "description": "What impact will Labour's pledge to nationalise the railways have?",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "How much is child benefit worth and who can claim it?",
        "description": "Changes announced in the Budget mean people earning up to £80,000 can get the benefit.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Top Brazil court upholds ban of Musk's X",
        "description": "A majority of justices has voted in favour of upholding the suspension which has seen X blocked in Brazil.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Pontins says sorry to Travellers over discrimination",
        "description": "The apology is the first step in a company plan to tackle discrimination against Irish Travellers.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "Fears over UK energy tax rises as business confidence falls",
        "description": "Investment will be cut and thousands of jobs put at risk if the windfall tax is raised, an industry body says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-04T07:22:26.869347"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "'Why I cycled 1,500km to avoid a flight'",
        "description": "Looking for alternatives to flying, Matilda Welin decided to embark on a long-distance cycle from London to Sweden. Here's what she learned.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "Honey, not marmalade, is saving the real 'Paddington Bear'",
        "description": "Drought and conflict with farmers are threatening Bolivia's Andean bear – the real-life Paddington Bear. Now a beekeeping project is helping protect this endangered species.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The flawed way we rank hurricanes",
        "description": "Scientists are racing to update the imperfect system we rely on to warn just how deadly a storm will be.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The deceptive power of a category 1 hurricane",
        "description": "Don't be lured into a false sense of security by a category one hurricane – storm surge and flooding mean they can be as dangerous as a category five.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "The tornadoes spinning over Europe’s waters",
        "description": "Spinning over water and land, these terrifying phenomena are more common than we might think",
        "source": "BBC Earth",
        "fetched_date": "2024-09-04T07:22:26.940120"
    },
    {
        "title": "‘Short N’ Sweet’ Is Officially Sabrina Carpenter’s First No. 1 Album",
        "description": "Sabrina Carpenter officially has her first No. 1 on the Billboard 200 chart. On Tuesday, Billboard announced that the 25-year-old singer’s latest release, Short N’ Sweet, had debuted at No. 1 on this week’s chart. The accomplishment marks Carpenter’s first No. 1 album of her career. Carpenter’s latest single “Taste” debuted at No. 2 on […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Telluride: Angelina Jolie and Pablo Larraín on Reactions to ‘Maria,’ Singing Opera and Celebrity",
        "description": "On Sunday, less than 24 hours after the Telluride Film Festival’s North American premiere of Maria, a drama about the rollercoaster life of the legendary opera singer Maria Callas, The Hollywood Reporter sat down with its star, Angelina Jolie, and director, Pablo Larraín, for a wide-ranging conversation. Jolie said of playing Callas, in a performance for […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Linda Deutsch, AP Trial Writer Who Had Front Row to Courtroom History, Dies at 80",
        "description": "Linda Deutsch, a special correspondent for The Associated Press who for nearly 50 years wrote glittering first drafts of history for many of the nation’s most significant criminal and civil trials — Charles Manson, O.J. Simpson, Michael Jackson, among many others — died Sunday. She was 80. Deutsch was diagnosed with pancreatic cancer in 2022 […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Justin Baldoni Pens Letter to Domestic Violence Survivors: “You Are Never Alone in This Fight”",
        "description": "It Ends With Us director and star Justin Baldoni is continuing to speak out in support of domestic violence survivors. Baldoni took to Instagram to share a lengthy love letter he wrote to survivors, praising them for everything they do to thrive, even in the darkest situations. “You embody resilience and courage, qualities that shine […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Telluride: Hillary Clinton Talks ‘Handmaid’s Tale’-Style Abortion Policy at Doc Premiere",
        "description": "Hillary Clinton encouraged a film festival audience in Telluride, Colorado, to “get back to a time when your government is not determining what your choices for your family would be, which is just so Handmaid’s Tale.” Clinton was in Telluride on Saturday for the premiere of Zurawski v Texas, a documentary she produced about a […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Ketanji Brown Jackson Recalls Being Scene Partners With Matt Damon in Harvard Drama Class",
        "description": "Ketanji Brown Jackson and Matt Damon once shared the stage together — and she did better than he did. In an interview with CBS Sunday Morning, the Supreme Court justice recalled being in a drama class with the Oscar winner when they were both attending Harvard University. She explained that the two never did an […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Venice Diary Day 5: A Bicycle in the Gala Theatre, Harmony Korine’s Cigar and Late Night Libations on the Lido",
        "description": "A Bicycle in the Gala Theatre Saturday kicks off with an accredited guest casually attempting to enter the Sala Grande on a bicycle. Security immediately stops him, but he retorts: “But there’s so much unused space in the foyer.” Harmony Korine’s Lighted Cigar Harmony Korine shows up at his press conference for his delirious Baby […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Family Confirms Death of Israeli-American Hostage Hersh Goldberg-Polin",
        "description": "The family of Israeli-American hostage Hersh Goldberg-Polin announced the young man’s death early Sunday, ending a relentless campaign by his parents to rescue him that included meetings with world leaders and an address to the Democratic convention last month. Goldberg-Polin, 23, was seized by militants at a music festival in southern Israel on Oct. 7. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Telluride: ‘Nickel Boys,’ Adapted from Colson Whitehead’s Book, Will Challenge Oscar Voters",
        "description": "Nickel Boys, RaMell Ross’ big screen interpretation of Colson Whitehead’s Pulitzer Prize-winning book The Nickel Boys, had its world premiere at the Telluride Film Festival’s Herzog Theatre on Friday night. Reactions among attendees, including numerous Academy members, have been strongly divided — many were impressed and deeply moved by the film, while others were left […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Venice Diary Day 3: Sex and Controversy, A Pizza for Matteo, Diapers on the Red Carpet",
        "description": "Some Like it Hot (Some Don’t) Friday was supposed to be all about eroticism. Or so they say. Halina Reijn’s Babygirl centers around a middle-aged, successful woman who, married with children, embarks on an intense sexual relationship with a young intern. She jeopardizes her career and family, but everything resolves itself in the end. Nothing […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Missy Elliott, Questlove, Ludacris and More Remember Fatman Scoop: “His Impact Is Huge”",
        "description": "Missy Elliott, Questlove and Ludacris are some of the music legends to pay tribute to Fatman Scoop, the Grammy-winning DJ and hype man who died after collapsing during a performance on Friday. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing in Connecticut. His family announced his death on Saturday morning, but […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Fatman Scoop Dead After Collapsing Onstage: DJ Was 56",
        "description": "Fatman Scoop, the Grammy-winning DJ, hype man and radio personality, died after collapsing onstage this weekend. He was 56. Fatman Scoop, real name Isaac Freeman III, collapsed on Friday while performing at Town Center Park in Hamden, Connecticut, per video obtained by TMZ. His family announced his death on Saturday morning, but gave no cause. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-04T07:22:27.293904"
    },
    {
        "title": "Impact investors FMO and BlueOrchard back Ghana’s digital lender Fido in $30M Series B round",
        "description": "Digital lending platforms have become an easy and swift alternative source of credit for microenterprises and individuals overlooked by traditional banking institutions. These platforms have turned into a lifeline for…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "PharmEasy still 92% below its peak $5.6 billion valuation, investor estimates",
        "description": "Indian online pharmacy startup PharmEasy, once valued at $5.6 billion, is still about 92% below its peak valuation, according to new estimates by its investor Janus Henderson. According to the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "From their experiences at Uber and PayPal, Palm founders want to make moving cash easier for big companies",
        "description": "Palm launched in 2023 with the goal of making cash management for enterprise treasury teams easier.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Canva has increased prices for its Teams product",
        "description": "Canva, the design platform, is increasing prices steeply for some customers. And it’s blaming the move in part on generative AI. In the U.S., some Canva Teams subscribers on older…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Apple Event 2024: iPhone 16, Apple Intelligence and all the other expected ‘Glowtime’ reveals",
        "description": "Apple’s Glowtime iPhone event will include the iPhone 16, but may also feature new AirPods, a new Apple Watch and possibly even new Macs.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Snap CEO says the company is testing a ‘simplified’  Snapchat",
        "description": "Snap is testing a “simplified version of Snapchat,” CEO Evan Spiegel wrote in a letter to employees published on Snap’s website Tuesday. The CEO says the simplified version aims to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Neko Health, the body-scanning AI health startup from Spotify’s Daniel Ek, opens in London",
        "description": "Prevention is better than cure, as the saying goes. Today, a splashy startup that has taken that concept to heart — literally and figuratively — is expanding. Neko Health was…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Bitcoin ATMs are a hotbed for scams, FTC says",
        "description": "The Federal Trade Commission (FTC) published a report about increasing fraud at Bitcoin ATMs. These ATMs allow people to turn their cash into crypto, but they’ve become a tool for…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Volkswagen is rolling out its ChatGPT assistant to the US",
        "description": "Volkswagen is taking its ChatGPT voice assistant experiment on the road. Or more specifically, to vehicles it sells in the United States.  The German automaker announced in January at CES…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Learn startup best practices with MongoDB, Venture Backed, InterSystems and others at Disrupt 2024",
        "description": "From idea to IPO, Disrupt charts startups at every stage on the roadmap to their next breakthrough. TechCrunch will gather some of the startup world’s leading companies — but our…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Android 15 will be available on supported Pixel devices in the coming weeks",
        "description": "Google announced on Tuesday it’s releasing Android 15 and making its source code available ahead of the coming consumer launch, which will bring the new mobile operating system to supported…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Android’s latest update improves text-to-speech, Circle to Search, earthquake alerts and more",
        "description": "Android introduced five updates on Tuesday as part of its latest release of the mobile operating system. Available for smartphones, tablets and Wear OS watches, the new features include audio…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Bluesky continues to soar, adding 2M more new users in a matter of days",
        "description": "As new users downloaded the app, Bluesky jumped to becoming the app to No. 1 in Brazil over the weekend, ahead of Meta’s X competitor, Instagram Threads.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Sarah Paiji Yoo is working to clean up our macro-microplastic mess",
        "description": "Microplastics are everywhere. Everywhere.  They are in our waters, in our food and even crossing blood barriers to enter our brains.  Sarah Paiji Yoo launched…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "The flat-rate real estate startup that’s got big players worried and BNPL’s turning a corner",
        "description": "Welcome to TechCrunch Fintech! This week, we’re looking at a new real estate startup that’s making big waves with its offering, Klarna and Affirm’s financials, a neobank focused on immigrants…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "As more Instagram users engage with Stories, the app adds a comments feature",
        "description": "Instagram’s latest feature aims to boost user interaction within Stories. The social media platform now allows followers to comment on each other’s Stories, making the experience more community-focused, akin to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Dragonfly Capital, Galaxy Ventures and NFX share insights on crypto scaling and strategy at TechCrunch Disrupt 2024",
        "description": "Curious about how top venture capitalists are positioning themselves for the next wave in the crypto market?  Dragonfly Capital’s Haseeb Qureshi, Galaxy Ventures’ Will Nuelle, and NFX’s Morgan Beller will…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Announcing the final agenda for the Builders Stage at TechCrunch Disrupt 2024",
        "description": "Get ready for TechCrunch Disrupt 2024, our signature event for startups of all stages, happening at Moscone West in San Francisco from October 28-30. This year, we’re expecting a massive…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Spotter launches AI tools to help YouTubers brainstorm video ideas, thumbnails and more",
        "description": "Spotter, the startup that provides financial solutions to content creators, announced Tuesday the launch of its new AI-powered creative suite. Dubbed Spotter Studio, the solution aims to support YouTubers throughout the…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Former Citi, Battery VC has new $378M fund to back financial services and enterprise startups",
        "description": "This second fund is significant because Gupta expanded it beyond a corporate fund with one main LP — Prudential Financial — into one supported by a number of financial and…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-04T07:22:27.471579"
    },
    {
        "title": "Travis Kelce hits back over ‘break-up contract’",
        "description": "Travis Kelce has hit back after a break-up “contract” that surfaced online apppeared to show he and Taylor Swift are set to call it quits.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "NRL Grand Final entertainment revealed",
        "description": "The NRL have announced its entertainment for the 2024 grand final, which ticks the box of both a global superstar and Aussie star.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Wallabies hit back over fake injury claims",
        "description": "The next Wallabies clash with South Africa could explode after allegations the Australians faked head injuries in their fiery game in Perth.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Big Irankunda question facing Socceroos",
        "description": "Whether he plays from the opening whistle or comes off the bench, Nestory Irankunda seems certain to have an influence against Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "‘Extremely disappointed’: Dee’s season over",
        "description": "Fresh scans have revealed grim news for an important Melbourne player only one week into the AFLW season.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Dogs’ triple towers in Hawks sights",
        "description": "Reinforcements are on the way next season, but Hawthorn’s undersized defence is confident it can withstand the Bulldogs on Friday night.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "NRL Grand Final entertainment revealed",
        "description": "The NRL have announced its entertainment for the 2024 grand final, which ticks the box of both a global superstar and Aussie star.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "NRL make call on Latrell ‘loophole’ bid",
        "description": "The NRL has come to a decision on whether a push for Latrell Mitchell to serve a one-game suspension on Friday night will be allowed.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "No ‘reset’ for new-look Aussies",
        "description": "Australia is playing in Scotland for the first time in a decade without a host of stars but the skipper says the team is not going through massive change.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Aussies back in unlikely location",
        "description": "The packed cricket calendar has taken Australia to a new location for the first T20 since the World Cup with a raft of new faces set to play.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Demon takes on Brit with career-first on the line",
        "description": "Looking to make the semi-finals of a grand slam event for the first time in his career, Australia’s Alex de Minaur takes on Britain’s Jack Draper. Follow the action live!",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Kids humiliate reigning US Open champion",
        "description": "Defending US Open champion Coco Gauff crashed out of the tournament in brutal circumstances but not before a cruel blow.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Schumacher wife’s rare public outburst",
        "description": "Corinna Schumacher has caused a scene in front of the Formula 1 world in a confrontation with a long-time friend surrounding her family.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "‘Was I a prick?’: Ricciardo apologises for race incident",
        "description": "Australian F1 star Daniel Ricciardo has reached out to Nico Hulkenberg to apologise for an opening lap incident that did damage to both their races.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Aussies in near ‘catastrophic’ lightning strike",
        "description": "Aussie sailor Jimmy Spithill was caught up in a terrifying lightning episode that struck in the middle of a competition.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Ronaldo gets handsy in steamy scenes",
        "description": "Cristiano Ronaldo couldn’t help himself during some downtime with his glamorous girlfriend Georgina Rodriguez.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Travis Kelce hits back over ‘break-up contract’",
        "description": "Travis Kelce has hit back after a break-up “contract” that surfaced online apppeared to show he and Taylor Swift are set to call it quits.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "‘Absolute mayhem’: WWE challenger bringing wrestling to Brisbane",
        "description": "Wrestler the “Big Show” has no regrets about making the switch from WWE to AEW, which is expecting a crowd of more than 40,000 for its first Australian event. TICKET INFO HERE",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Big Irankunda question facing Socceroos",
        "description": "Whether he plays from the opening whistle or comes off the bench, Nestory Irankunda seems certain to have an influence against Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Ronaldo gets handsy in steamy scenes",
        "description": "Cristiano Ronaldo couldn’t help himself during some downtime with his glamorous girlfriend Georgina Rodriguez.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Tszyu makes history with US fight confirmed",
        "description": "Tim Tszyu’s next opponent has been confirmed — and the world title fight is set to make American boxing history.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "‘Ambitious’: Huge LIV Adelaide move",
        "description": "The success of the LIV event in Adelaide will gets it first test in 2025 with a change in the schedule.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "One trick that will help you dominate SuperCoach NBL",
        "description": "Getting a big score in SuperCoach NBL can be as easy as looking at the schedule. Here’s a quick guide on how to use it to your advantage – and the players to pick in your team.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Wallabies hit back over fake injury claims",
        "description": "The next Wallabies clash with South Africa could explode after allegations the Australians faked head injuries in their fiery game in Perth.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "No flashbacks for Wallabies hero",
        "description": "Nearly two years after he fluffed a matchwinning kick against Italy, Ben Donaldson stepped up to the plate again and delivered for the Wallabies.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Pharari takes express lane to near-record Sandown win",
        "description": "Fast filly Pharari went close to breaking the 1000m Sandown track record which has stood for 15 years in a soft win on Wednesday.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    },
    {
        "title": "Ex-Aussie comes clean on shock defection",
        "description": "Three-time Olympic medallist Matthew Richardson has spoken out after he turned his back on Australia weeks after the Olympics finished.",
        "source": "News AU",
        "fetched_date": "2024-09-04T07:22:28.773946"
    }
]