[
    {
        "title": "China stock rally fizzles as stimulus news disappoints",
        "description": "Shares fell back after a news conference by economic planners gave little in the way of details.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "US judge orders Google to open app store to rivals",
        "description": "It is among several remedies ordered in a case brought against the firm by Fortnite-maker Epic Games.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Can selling off homes for $1 solve urban blight?",
        "description": "Baltimore is allowing people to buy homes for next to nothing to try to improve neighbourhoods.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "TGI Fridays: 1,000 UK jobs to go despite rescue deal",
        "description": "The deal to save the chain will see more than 30 of its restaurants close.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Food rating lies exposed by BBC secret recording",
        "description": "A BBC investigation has exposed widespread deception in food hygiene ratings across east London.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "US judge orders Google to open app store to rivals",
        "description": "It is among several remedies ordered in a case brought against the firm by Fortnite-maker Epic Games.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "For Gen Z, US election is all about the economy",
        "description": "The rising costs of groceries and rent are driving many young voters to the polls.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Customers of failed crypto firm FTX set for refunds",
        "description": "The agreement will put an end to a saga that started when the firm went bankrupt in November 2022.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "You might have the skills that cyber-security wants",
        "description": "8 hrs ago",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Can selling off homes for $1 solve urban blight?",
        "description": "Baltimore is allowing people to buy homes for next to nothing to try to improve neighbourhoods.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "'Higher interest rates mean US should cut debt' - 7 Oct 2024",
        "description": "Expert says says Committee for a Responsible Federal Budget is right to draw attention to the government debt.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "US debt would increase under Harris and soar under Trump - study",
        "description": "Both candidates would add trillions to the national debt if their proposals were enacted, according to a new analysis.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Migrants with criminal records - what new US data shows",
        "description": "BBC Verify looks into Donald Trump's claim that Kamala Harris “allowed” 13,000 non-citizens convicted of homicide to enter the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Maldives president in Delhi to seek aid and reboot ties",
        "description": "Mohamed Muizzu is expected to seek a bailout worth hundreds of millions of dollars during his India visit.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "'Rightmove is my porn' - the addiction to online property search",
        "description": "Why are we so obsessed with looking at houses for sale online?",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Ex-cabinet secretary says £200,000 job is underpaid",
        "description": "Lord O'Donnell tells the BBC the \"incredibly demanding job\" of a top civil servant in Britain should have a higher salary.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Bankers 'neither villains nor rock stars', says Industry creator",
        "description": "The creators of BBC drama Industry discuss stereotypes of bankers - and what makes their series different.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Surprise surge in new US jobs in September",
        "description": "The jump in hiring will ease fears of a downturn but raises questions over the path for interest rates.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Will return fees stop you clothes shopping online?",
        "description": "Frequent returners are being hit with fees but people say it is changing how we shop.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Wait longer for an electric taxi, says Uber boss",
        "description": "The platform wants customers to go 'green' as it tries to boost the take-up of electric cars.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "When is the Budget and what might be in it?",
        "description": "Chancellor Rachel Reeves will set out the government's financial plans for the next year.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "House prices close to record high, says Halifax",
        "description": "Falling mortgage rates have helped to boost confidence among buyers, the lender says.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "ScotRail timetable returns to normal after pay row",
        "description": "A reduced service has been running since July but the normal schedule will resume after a pay dispute was resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "‘Perfect storm’ blocking thousands of desperately needed social homes",
        "description": "Housebuilders say they have thousands of social homes ready to be built but no customers to buy them.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Should you tip even if the service wasn't worth it?",
        "description": "There are no set rules when it comes to tipping, but here's what hospitality staff, customers and experts in the UK have to say.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Ex-Harrods exec: I lost my job due to Al Fayed",
        "description": "Nigel Blow claims that Fenwick withdrew offer to become chief executive due to his time at Harrods",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "How worried should I be about rising oil prices?",
        "description": "As the conflict across the Middle East widens, rising oil prices are being closely watched.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "EU hits China with big taxes in electric car sales battle",
        "description": "The vote risks sparking a trade war as the EU looks to protect its own car makers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-08T07:24:04.585911"
    },
    {
        "title": "Binge-Worthy True Crime: Wondery’s Most Thrilling Podcasts for October",
        "description": "The listeners are screaming their praises for the company’s award-winning true crime podcasts",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "White Collar Prison: The Musical Comedy Reflecting America’s Political Divide",
        "description": "This musical takes a sharp look at society’s double standards, where politics, crime and satire collide.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "13 Voices Speak Out on Oct. 7 Anniversary for 13 Women Still Held Hostage by Hamas",
        "description": "Andy Cohen, Ginnifer Goodwin, Debra Messing, Mayim Bialik and more appear in a video timed to the one-year anniversary of Israel's deadliest day since the Holocaust.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Tom Segura Sets 2025 Dates for Come Together Tour, Donates $100K to World Central Kitchen",
        "description": "The popular stand-up comedian has more than 40 new dates for his tour, with stops scheduled at New York's Madison Square Garden and London's OVO Arena Wembley.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Celine Dion Appears in ‘Sunday Night Football’ Opening Segment Set to Her Song “It’s All Coming Back to Me Now”",
        "description": "\"I think my favorite thing about this game is its power to connect who we are, to who we were,\" she said in the video, which aired before the Dallas Cowboys and Pittsburgh Steelers matchup.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Sean “Diddy” Combs’ Mother Defends Music Mogul Amid Sex Crime Allegations: “My Son Is Not the Monster They Have Painted Him to Be”",
        "description": "Janice Combs said Combs is not perfect and has made mistakes, including lying about physically assaulting ex-girlfriend Cassie, but argued that he \"deserves the chance to tell his side\" amid a new wave of accusations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Jussie Smollett Says He’s Spent $3M Fighting Hoax Case: “I Don’t Want to Have a Felony on My Record for Something I Didn’t Do”",
        "description": "The 'Empire' alum also revealed he regrets his high-profile sit-down with 'Good Morning America's' Robin Roberts shortly after the attack and said he was told he \"couldn't\" go to rehab to deal with \"substance abuse\" issues.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "A Month From Election Day, Kamala Harris Readies Media Blitz",
        "description": "The vice president and Democratic nominee has set a slew of media appearances this week, including a live interview with 'The View' and sit-downs with Howard Stern and Stephen Colbert.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Al Pacino Reveals He “Didn’t Have a Pulse” During Near-Death Experience Due to COVID-19",
        "description": "The legendary actor contracted coronavirus in 2020.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Donald Glover Cancels Remainder of Childish Gambino Tour Dates Due to Health Issues",
        "description": "The artist had previously postponed some dates on his tour to focus on his well-being.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "John Amos’ Cause of Death Revealed as Feud Between ‘Good Times’ Star’s Children Continues",
        "description": "The actor died August of congestive heart failure, his death certificate reportedly revealed this week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Will Smith Is Finding Self-Discovery Through Music: “A More Honest Place for Me”",
        "description": "At a Grammy Museum event on Thursday, Smith spoke about the \"well of authenticity that I’m trying to tap into\" when creating new music.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-08T07:24:05.049370"
    },
    {
        "title": "Bombshell NRL rejection breaks fans’ hearts",
        "description": "Peter V’landys has dropped an NRL expansion bombshell which is bad news for long-suffering fans of the North Sydney Bears.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "‘Scandalous’: Shocking twist in Aussie snub",
        "description": "The Jillaroos coach is under fire after his explanation for dropping the NRLW’s best player from the Aussie squad was questioned.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Striker targeting maiden Socceroos goal",
        "description": "Adelaide Oval looms as the perfect place for a proud South Australian to score his first goal for the Socceroos on Thursday night.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Test hopeful and teen star set Shield alight",
        "description": "The national selection chief was in Sydney to watch a rising star carve out a maiden century as Victorian Test hopeful also opened the Sheffield Shield season in style.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "AFL rival’s bold plan to poach Swans star",
        "description": "While an AFL rival expects a star Swans midfielder to see out his contract at Sydney, the club says it will “certainly monitor the situation”.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "‘Embarrassing’: AFL legend torches club",
        "description": "Garry Lyon has turned a flamethrower on an AFL club over a “dog’s breakfast” situation that has blown up in its face.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Bombshell NRL rejection breaks fans’ hearts",
        "description": "Peter V’landys has dropped an NRL expansion bombshell which is bad news for long-suffering fans of the North Sydney Bears.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "‘Scandalous’: Shocking twist in Aussie snub",
        "description": "The Jillaroos coach is under fire after his explanation for dropping the NRLW’s best player from the Aussie squad was questioned.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Test hopeful and teen star set Shield alight",
        "description": "The national selection chief was in Sydney to watch a rising star carve out a maiden century as Victorian Test hopeful also opened the Sheffield Shield season in style.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Convicted rapist set to play cricket in Aus",
        "description": "A cricketer who has been banned from playing cricket in England and Wales for 10 years will be allowed to play in Western Australia.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Aussie Ajla ends winning drought",
        "description": "There are now two Aussie women in the world’s top 100 after Ajla Tomljanovic snared a title in Hong Kong.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Tennis world floored by ‘chilling’ Dokic reveal",
        "description": "Australian tennis champion Jelena Dokic has a new documentary out and fans have labelled the glimpse into her career raw and chilling.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Everything you need to know about the 2024 Bathurst 1000",
        "description": "Start your engines. It’s time for the biggest race of the Supercars season – the Bathurst 1000 at Mount Panorama. Here is your ultimate guide to the 2024 edition of the Great Race.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "F1 stars at centre of race love triangle",
        "description": "A budding Formula 1 star has become caught up in a love triangle as his girlfriend appears to rekindle a romance with a rival driver.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Ch 9 host looks all loved up with NRL star",
        "description": "The NRL off-season is about to kick into full swing, and a rugby league couple looked all loved up as they took things to the next level.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "‘Total loss’: Legend’s $1.4m home in ruins",
        "description": "American golf legend John Daly has been left broken hearted after his life-long home was completely ruined by Hurricane Helene.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Fans all make same joke about age gap pic",
        "description": "Fans have all been making the same joke over a photo detail shared by an NFL icon’s 24-year-old beauty pageant contestant girlfriend.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "$11m Aussie star creates NFL history",
        "description": "Australia’s $11 million NFL star Mitch Wishnowsky already has a booming resume as one of the best punters in the NFL – but he’s added another first in a remarkable turn of events.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Striker targeting maiden Socceroos goal",
        "description": "Adelaide Oval looms as the perfect place for a proud South Australian to score his first goal for the Socceroos on Thursday night.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Victory reacts to shareholder’s collapse",
        "description": "Melbourne Victory isn’t concerned by the collapse of one of the A-League club’s shareholders.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "‘Finally’: 11-year Tszyu first looms at world title showdown after selfless Nikita act",
        "description": "Kostya Tszyu is readying to reunite with his sons for the first time in 11 years – with plans underway to have the Australian boxing legend ringside for Tim’s world title blockbuster.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Smith’s cold reaction to rankings drop",
        "description": "Cameron Smith has stopped worrying about his world ranking as he rakes in massive cash and wins trophies on the LIV tour.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 4",
        "description": "One player should be at the top of the shopping list for your SuperCoach NBL team this week. See the moves to make to get your team firing for round 4 in minutes.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "‘Gutted’: Aussie legend brutally sacked",
        "description": "Wallabies legend Matt Burke has been handed a brutal blow after making a successful career after his playing days.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Wallabies veteran’s shock move",
        "description": "A Wallabies veteran has made a surprise move to one of New Zealand’s Super Rugby teams.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Ottobre gives Jenni’s Cox Plate lead-up wish",
        "description": "Ciaron Maher has plenty of options with star mare Pride Of Jenni but owner Tony Ottobre has given his preference for her last lead-up run before the Cox Plate.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-08T07:24:06.154967"
    }
]