[
    {
        "title": "What have tariffs really done to the US economy?",
        "description": "As President Trump weighs tariff plans, he will have one eye on the US economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Congress passes Trump's 'big, beautiful bill' cutting taxes and spending",
        "description": "The US president wins over sparring factions within his own party to get the bill passed after months of wrangling.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "'I'm being paid to fix issues caused by AI'",
        "description": "Businesses that rush to use AI to write content or computer code, often have to pay humans to fix it.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "What will Trump's tax and spending bill do to the US national debt?",
        "description": "US President Donald Trump's tax and spending bill has sparked intense debate. BBC Verify's policy and analysis correspondent Ben Chu has been looking at what the bill could do to the US national debt.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Congress passes Trump's 'big, beautiful bill' cutting taxes and spending",
        "description": "The US president wins over sparring factions within his own party to get the bill passed after months of wrangling.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Ryanair increases size limits for free cabin bags",
        "description": "The increase comes as the EU mandates a universal minimum size for free underseat bags.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Trump gets major win now - but it comes with risks down the road",
        "description": "The mega-bill helps the president deliver on promises, but also contains the seeds of political peril, writes Anthony Zurcher.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "The sale of illegal cigarettes signals a deeper problem with UK high streets",
        "description": "Some black market cigarettes have been found to contain dead flies and asbestos. But the trade nods to a wider issue, a BBC investigation has found",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Why the world's superyachts are getting bigger and bigger",
        "description": "Billionaires and multimillionaires around the globe are trading up for more space and luxury.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "The bridge changing lives and boosting business",
        "description": "The Öresund bridge, which connects Denmark and Sweden, is celebrating 25 years since its opening.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Markets mixed ahead of US jobs data - 2 July 2025",
        "description": "Chief Investment Officer at Hamilton Capital Partners says markets are in a 'wait and see' mode over tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Should we be letting flies eat our food waste?",
        "description": "In Lithuania and Australia, hungry fly larvae are used to process food waste into useful protein.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "A look at the key items in Trump's sprawling budget bill",
        "description": "The tax and spending bill, which is set to become law, includes sweeping changes to taxes, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Strong jump in US jobs as economy defies expectations",
        "description": "Hiring in the US defied expectations with 147,000 jobs added last month, official figures show.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Ryanair cancels flights for 30,000 passengers due to French strike",
        "description": "Airlines and France's transport minister has condemned the strikes as unacceptable, at the start of summer holidays.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Microsoft to cut up to 9,000 more jobs as it invests in AI",
        "description": "The US tech giant will axe 4% of its global workforce and plough money into artificial intelligence.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "UK borrowing costs fall as investors' nerves ease",
        "description": "The cost of UK government borrowing falls and the pound rallies as the PM says he works \"in lockstep\" with Rachel Reeves.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Trump calls on US central bank head to quit immediately",
        "description": "The president has repeatedly criticised Jerome Powell for not cutting rates but has sent mixed signals about removing him from the role.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Trump announces trade deal with Vietnam",
        "description": "The US plans to charge 20% tariffs on Vietnamese goods - less than half the rate set to go into effect next week.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Tesla deliveries fall for second quarter in a row",
        "description": "Elon Musk's controversial role in the Trump administration has been blamed for the collapse in sales.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Qantas data breach exposes up to six million customer profiles",
        "description": "The airline was hit by a cyber attack on a platform storing names, email addresses and phone numbers.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Trump threatens Japan with tariff up to 35% as deadline looms",
        "description": "It would be well above the 24% tariff imposed on Japan as part of the so-called \"Liberation Day\" in April.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Heathrow considering legal action against National Grid over fire",
        "description": "An investigation finds National Grid had been aware of a problem at a substation since 2018.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Paramount to pay Trump $16m to settle 60 Minutes lawsuit",
        "description": "The media company noted the settlement does not include a statement of apology or regret.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "How 'blood gold' is fuelling conflict in West Africa",
        "description": "Gold appears to be a lifeline for military juntas and jihadist groups in the Sahel region, analysts say.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Bank of England seeks public's help to redesign banknotes",
        "description": "The first facelift in more than 50 years signals the possible end of historical figures on notes.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Facing intense pressure, House must now decide if Trump's bill is good enough",
        "description": "The president has said he views the legislation as an integral part of his political legacy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-04T07:30:08.963165"
    },
    {
        "title": "Tennis Star Taylor Fritz Is Eyeing His First Grand Slam — and He Really Hates to Lose",
        "description": "With Wimbledon underway, the U.S. sports star catches up with The Hollywood Reporter about life inside and outside of tennis: \"I always need to have something I'm working towards.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "Former World Champion Boxer Arrested by ICE Days After Fighting Jake Paul In Anaheim",
        "description": "Julio César Chávez Jr. will be deported to Mexico, the Department of Homeland Security says.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "Sukeban, Japanese Female Pro-Wrestling Brand, Strikes NTT Docomo Studio & Live Deal",
        "description": "\"Sukeban is a treasure trove of pop culture, bringing together manga, anime, fashion, music, and beauty — all through the powerful lens of women’s professional wrestling.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "U.K. Streaming Levy Officially Rejected by Government: “We Support a Mixed Ecology”",
        "description": "The government response, published Thursday, cited the more than $400 million contribution 'Barbie' and 'Bridgerton' made to the U.K. economy over the last five years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "BBC Deemed Bob Vylan “High Risk” Before Glastonbury Set, Moves Staff Off Live Events Team",
        "description": "After punk duo Bob Vylan chanted \"death to the IDF\" live on air, the BBC has vowed to take action to \"ensure proper accountability\" for those found to be responsible for the broadcast.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "Foo Fighters Are Back With First Song Since 2023 to Celebrate 30th Anniversary",
        "description": "\"Over the years, we’ve had moments of unbridled joy, and moments of devastating heartbreak,\" Grohl wrote in a letter to fans as the band released 'Today's Song' on Wednesday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "What the Hell Happened With the Sean “Diddy” Combs Verdict?",
        "description": "A split decision that saw the fallen rapper and mogul escape being convicted of the more serious charges left observers stumped and ponderous — and looking for answers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "50 Cent, Kesha, Aubrey O’Day and More Stars React to “Diddy” Verdict: “The Cultural Weight of This Decision Is Immeasurable”",
        "description": "The hip-hop mogul was found guilty of transportation to engage in prostitution but acquitted of sex trafficking and racketeering conspiracy Wednesday after a six-week trial.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "Sean “Diddy” Combs Denied Release on Bail After Mogul Was Acquitted of Most Serious Charges",
        "description": "Judge Arun Subramanian denied Combs' request to leave a Brooklyn lockup after he was found guilty of two counts of transportation to engage in prostitution.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "Bob Vylan Dropped From Europe Music Festivals in Wake of “Death to the IDF” Controversy",
        "description": "The rap duo were set to headline a Manchester music festival and play Kave Fest in France, but will no longer be appearing following the fallout from their Glastonbury set.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "In Split Verdict, Sean “Diddy” Combs Found Guilty on 2 Counts, Not Guilty of Sex Trafficking, Racketeering",
        "description": "The fallen mogul was found guilty of transportation to engage in prostitution but not guilty on sex trafficking and racketeering charges.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    },
    {
        "title": "Cate Blanchett to Receive Freedom of the City of London Honor",
        "description": "The ancient tradition, a symbolic honor, is believed to have been in action since 1237.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-04T07:30:09.312542"
    }
]