[
    {
        "title": "European markets open higher after days of losses as China vows to fight Trump tariffs",
        "description": "The UK's FTSE 100 opens up 1% and major Asian markets make gains following market turmoil in the wake of Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Trump threatens new 50% tariffs on China",
        "description": "The US president warns of the extra tax unless China withdraws its own 34% counter-tariff on US goods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Stocks, tariffs and pensions - your questions answered",
        "description": "Experts answer your questions on how the stock market index works, whether the markets will recover and more.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Is the world heading into recession?",
        "description": "The US president has rattled stock markets but that doesn't automatically lead to an economic downturn.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Trump threatens new 50% tariffs on China",
        "description": "The US president warns of the extra tax unless China withdraws its own 34% counter-tariff on US goods.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Trump's game of chicken over tariffs leaves world guessing",
        "description": "The US president is pressing ahead with his global tariffs, as even some allies wonder if he is going too far.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "A revolution is under way in India's trainer industry",
        "description": "India wants to boost the domestic trainer industry but will small domestic makers suffer?",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Wild market swings as tariffs rattle US economy",
        "description": "Stocks swung sharply in the US, as Trump offered mixed signals about appetite for trade talks.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Spain ‘social emergency’ as rents double in a decade",
        "description": "This is despite the fact that its economy has been performing well in other areas.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Spain tackles housing 'social emergency' as rents double in a decade",
        "description": "The Spanish government is moving to make renting more affordable and boost the supply of homes.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Billionaire Trump backer warns of 'economic nuclear winter' over tariffs",
        "description": "Bill Ackman says the US president should pause his planned import taxes - or risk shattering investors' confidence.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "How worried should we be about tumbling stock markets?",
        "description": "Workers are right to fear for their pensions, but the greater worry is the here and now - the economy they live in.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Asian stocks see their worst drop in decades after Trump tariffs",
        "description": "Asian markets from Tokyo to Sydney plunged amid increasing fears of a global economic downturn.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "UK to relax electric car rules as US tariffs hit",
        "description": "The prime minister says measures will help the car industry but critics claim they are not enough.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "US defends tariffs on remote island of penguins and seals",
        "description": "A group of islands, occupied only by penguins and seals, has been swept up in Trump's trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "'Sometimes you have to take medicine': Trump defends sweeping tariffs",
        "description": "Just hours after Trump's comments, stock markets plunged in Asia early on Monday, with Hong Kong's Hang Seng losing 9.8%.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Australia PM candidate ditches plan to end work from home",
        "description": "Peter Dutton's Liberal-National coalition had said the move would improve efficiency in the public sector.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "How PM might tackle impact of Trump tariffs",
        "description": "The BBC understands the PM is considering several options to mitigate the impact of US tariffs on the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Why shoppers are snapping up 'stripes' products for eye-popping prices",
        "description": "As Canada's Hudson's Bay Company faces an end to its 355-year legacy, shoppers are scrambling for anything with its iconic \"stripes\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Carmakers mull action over tariffs as JLR pauses car exports to US",
        "description": "The British firm say no vehicles will be shipped in April as it processes the impact of Donald Trump's tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Zimbabwe to scrap tariffs on US goods as it faces 18% Trump levy",
        "description": "President Mnangawa says he wants improved relations, days after Donald Trump said the US would impose an 18% tariff on Zimbabwe.",
        "source": "BBC Business",
        "fetched_date": "2025-04-08T07:25:45.849048"
    },
    {
        "title": "Clem Burke, Blondie Drummer, Dies at 70",
        "description": "“Clem was not just a drummer; he was the heartbeat of Blondie,” the band’s official social media shared on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Arista Records President David Massey to Retire",
        "description": "Massey revived Arista back in 2018, signing artists including JP Saxe, Lola Brooke and Måneskin.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Dire Wolves Have Just Been Brought Back From Extinction — and No This Isn’t Some ‘Game of Thrones’ Fantasy",
        "description": "In a stunning scientific development, the prehistoric canines made famous in the hit HBO show have been announced as the world’s first de-extinct animal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "NCT’s Mark Lee Is Reborn on Vulnerable Solo Debut ‘The Firstfruit’: “This Album Helped Me Find Myself”",
        "description": "From the nostalgic and scene-setting intro of “Toronto’s Window” to the groovy “1999,” the 13-track debut album gives fans a look inside the head (and heart) of one of K-pop’s brightest stars.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Minivan Crashes Into Crowd Near Downtown Los Angeles’ Fashion District, Injuring Nine Pedestrians",
        "description": "It's unclear what caused the accident, which is under investigation, near Santee Alley.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Ariana Grande Once Again Hits No. 1 With ‘Eternal Sunshine Deluxe: Brighter Days Ahead’",
        "description": "The Grammy Award-winning singer topped the charts last year with the original release of ‘Eternal Sunshine.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Dave Allen, Bass Player for Influential Postpunk Band Gang of Four, Dies at 69",
        "description": "His former bandmates announced his death on social media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Hollywood and Silicon Valley Collide at Breakthrough Prize Ceremony, With Science Celebrated and Trump Slammed",
        "description": "Known as the \"Oscars of Science,\" the Saturday night event saw Mark Zuckerberg, Jeff Bezos and Sam Altman rubbing shoulders with stars including Gwyneth Paltrow, Seth Rogen and Zoe Saldaña.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Ed Sheeran and Weezer Join Coachella 2025 Lineup",
        "description": "Their addition comes after FKA Twigs dropped out of the festival due to \"ongoing visa issues.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "FKA Twigs Cancels Coachella Performances, Remaining Tour Dates Over Visa Issues",
        "description": "The British singer-songwriter was also scheduled to perform at AXE Ceremonia.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Why Hollywood Feuds Aren’t What They Used to Be",
        "description": "Baldoni vs. Lively is the latest in a long, claw-scarred history of celebrity battles. A former reality show producer (who knows a thing or two about conflict) recalls how the more vintage clashes benefited from a dash of class.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Paul Schrader Accused of Sexually Harassing Former Assistant and Backing Out of Settlement",
        "description": "Schrader’s attorney denies the accusations, calling the legal filing a “desperate, opportunistic and frivolous lawsuit to enforce a settlement that was never signed by” the 'Taxi Driver' and 'Raging Bull' screenwriter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-08T07:25:46.637363"
    },
    {
        "title": "Verstappen’s arrogant swipe at McLaren gaffe",
        "description": "Max Verstappen has rubbed salt in the wound with a brutal comment about McLaren after their missed chance at the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Driver trapped in car after horrific crash",
        "description": "A terrifying fireball crash has brought a race to a standstill after a driver was left trapped inside her car as flames broke out.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Reds skipper ‘proud’ of milestone",
        "description": "A century of games for the Queensland Reds ranks as one of Tate McDermott’s “proudest” achievements in rugby union.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Renee Gracie drops Supercars truth bomb",
        "description": "Adult entertainer turned motorsport star Renee Gracie has put Australia’s top racing category on notice with a grim prediction.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Townsend dropped as Rabbits make Latrell move",
        "description": "A key playmaker has been dropped, a superstar fullback has been named at five-eighth and the reigning champs have reshuffled their spine in a wild instalment of team list Tuesday.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "NRL star’s defection set to rock rugby league",
        "description": "One of Australia’s most exciting NRL stars is rumoured to be considering switching international allegiances, the latest in a wave of defections.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Premiership blow? Hawks gun to miss months of 2025 season",
        "description": "Hawthorn’s premiership aspirations have taken a major hit, with a budding young superstar set to miss a chunk of the season, but when could he return?",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Hawks suffer crushing injury blow",
        "description": "Hawthorn has suffered a major blow with a serious injury to a key player who missed most of 2024.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Cricket boss’ concussion plans after sad Pucovski news",
        "description": "Strengthening injury protection for players will be high on the Paul Marsh’s list as cricket union boss following the medical retirement of former Test prodigy Will Pucovski.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Sad update as cricket world rocked",
        "description": "Former Aussie cricket prodigy Will Pucovski has announced the saddest news of his career in an emotional public appearance.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "‘Incredible addition’: Aussies hail star’s defection",
        "description": "Australian tennis is welcoming world No.12 Daria Kasatkina into the fold with open arms after her defection from Russia and want her in a green and gold uniform as soon as possible.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Aussie tennis star fumes at influencer reality",
        "description": "Aussie star Daria Saville has called out ‘marketing teams’ behind the rise of tennis influencers, something she said is costing players dearly.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "‘Scary’ star set to tear Australia apart",
        "description": "One player is tipped to make such a difference to Super Netball that “something will have to go horribly wrong” for her team not to win the premiership.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Verstappen’s arrogant swipe at McLaren gaffe",
        "description": "Max Verstappen has rubbed salt in the wound with a brutal comment about McLaren after their missed chance at the Japanese Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Driver trapped in car after horrific crash",
        "description": "A terrifying fireball crash has brought a race to a standstill after a driver was left trapped inside her car as flames broke out.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Reds skipper ‘proud’ of milestone",
        "description": "A century of games for the Queensland Reds ranks as one of Tate McDermott’s “proudest” achievements in rugby union.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Poll: 1st Colts comp offering rising rugby talent a second chance",
        "description": "It’s a comp helping launch young talent and identifying others who may have slipped under the radar and Waratah selectors will be monitoring every game of Colts in 2025 for future stars",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Nation claims record, icon wiped from history",
        "description": "One of the most iconic figures in American sports has been on top of the record books for decades, but he has finally been knocked off.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Shaq: ‘Ben Simmons needs to be arrested’",
        "description": "NBA icon Shaquille O’Neal has taken a flamethrower to Ben Simmons in a stunning take-down, declaring he “needs to be arrested”.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Sydney supersub continues to impress",
        "description": "Sky Blues attacker Adrian Segecic continues to stake a claim for a spot in Sydney FC’s starting team.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "‘Traitors’: Beckham bodyguard found dead",
        "description": "David and Victoria Beckham and some of the biggest stars on the planet have been rocked by the mysterious death of a celebrity bodyguard.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Tszyu’s wife blindsided by family revelation",
        "description": "Tim Tszyu stunned the boxing world by putting on a clinic against Joey Spencer before shocking his wife with a claim about their kids.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Masters chaos as spectators evacuated",
        "description": "More than 40,000 spectators have been evacuated from the US Masters in extraordinary scenes on the first day at the tournament.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Shaq: ‘Ben Simmons needs to be arrested’",
        "description": "NBA icon Shaquille O’Neal has taken a flamethrower to Ben Simmons in a stunning take-down, declaring he “needs to be arrested”.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Gelagotis’ pays late fee for filly to start in $1m race",
        "description": "Emerging filly Recuperato has thrived since her maiden win and will now contest a $1m race at The Championships after a late entry fee was paid.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "Olympic legend’s horrifying revelations",
        "description": "One of the greatest Olympians of all time has details disturbing details of his private life, going public with childhood abuse and a drug addiction.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "12yo quits rugby league over ugly incident",
        "description": "The father of a schoolboy whose shoulder was shattered after a dangerous tackle during a division three rugby league match is calling for change.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    },
    {
        "title": "‘Traitors’: Beckham bodyguard found dead",
        "description": "David and Victoria Beckham and some of the biggest stars on the planet have been rocked by the mysterious death of a celebrity bodyguard.",
        "source": "News AU",
        "fetched_date": "2025-04-08T07:25:48.954923"
    }
]