[
    {
        "title": "Who wins when Nigeria's richest man takes on the 'oil mafia'?",
        "description": "Having built a $20bn oil refinery, Aliko Dangote is now at the heart of a row in the murky industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "German manufacturers warn of the sector's 'formidable crash'",
        "description": "Germany's troubled manufacturing firms say they are facing a number of significant problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Megaport opens up Latin America to Chinese trade as US looks on",
        "description": "A new China-backed megaport in Peru may create whole new trade routes that will bypass North America entirely.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Watch given to Titanic hero sells for £1.5m",
        "description": "Auctioneers say the watch sale is the highest-ever for a Titanic artefact.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "German manufacturers warn of the sector's 'formidable crash'",
        "description": "Germany's troubled manufacturing firms say they are facing a number of significant problems.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Trump names fracking executive Chris Wright energy secretary",
        "description": "Wright is expected to fulfil Trump's campaign promise to \"drill, baby, drill\" and maximise US energy production.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "'Record breaking' 60m homes watched Tyson vs Paul fight, Netflix says",
        "description": "But the streaming giant's first foray into live boxing was beset with technical glitches.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "'Dreams quashed': Foreign students and universities fear Australia's visa cap",
        "description": "A bill limiting the number of foreign students Australia accepts has caused anxiety at home and abroad.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Why China is building a 'bullet train for power'",
        "description": "China produces more clean energy than any other country. Now it's rolling out an ultra-high-voltage grid to match – will its strategy of going big pay off?",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Why Canada could become the next nuclear energy 'superpower'",
        "description": "With its rich resources, uranium mining companies want Canada to play a key role in fuelling nuclear reactors worldwide.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Fed chair's comment makes rate cut 'uncertain' - 15 Nov 2024",
        "description": "A December Fed rate cut is uncertain after Chair Jerome Powell said that interest rates would come down slowly.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "UK Pizza Hut to raise funds after Budget tax hikes",
        "description": "The money could come from a sale of part of the business, or new investment from existing shareholders.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "X users jump to Bluesky - but what is it and who owns it?",
        "description": "Bluesky is picking up one million new users every day at its current rate.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Health stocks hit after Trump taps RFK Jr for top job",
        "description": "Investors are \"spooked\" by plan to name a vaccine-sceptic as US health secretary, analysts say.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Billions at stake in court battle over North Sea oil",
        "description": "Lawyers and campaigners have made their arguments before Lord Ericht in Edinburgh this week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "US hacker sentenced over Bitcoin heist worth billions",
        "description": "Ilya Lichtenstein laundered the stolen cryptocurrency with his wife Heather Morgan aka Razzlekhan.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "UK must rebuild post-Brexit relations with EU - Bank of England boss",
        "description": "Governor Andrew Bailey delivers his strongest comments yet on the UK's departure from the EU.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Volunteers enter South Africa shaft to aid miners",
        "description": "Authorities have cut supplies to thousands of illegal miners hiding underground.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Europe's flying taxi dreams falter as cash runs short",
        "description": "Makers of a new generation of European electric aircraft are struggling to raise money.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "UK economy barely grows with Budget fears blamed",
        "description": "The chancellor says she is \"not satisfied\" by the latest growth figures, which were weaker than expected.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Outage hits Bluesky just as the platform's popularity takes off",
        "description": "The platform said on Thursday evening that one million people had joined it over the previous day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "'Amazing showcase' for UK gaming industry cancelled",
        "description": "The organisers blamed \"increasing costs and less demand\" as the sector continues to struggle.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Meta fined €798m over 'unfair' Facebook Marketplace",
        "description": "The European Union says the tech giant crowded out rivals, breaching competition law.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Al Fayed's brother Salah also abused us, women say",
        "description": "Three former employees give accounts of abuse, including sexual assault and trafficking.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "The Onion buys Alex Jones's Infowars at auction",
        "description": "Infowars was auctioned as part of a defamation ruling after Jones falsely called the Sandy Hook School shooting a hoax.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "Diamond necklace linked to Marie Antoinette sells for $4.8m",
        "description": "Experts say some of the stones in the piece are a match with the original diamonds central to a royal scandal.",
        "source": "BBC Business",
        "fetched_date": "2024-11-18T07:24:52.439233"
    },
    {
        "title": "USPS Reveals Betty White Stamp Coming in 2025",
        "description": "The iconic actress died in December 2021, just a few weeks short of her 100th birthday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Jake Paul-Mike Tyson Fight Live Blog: Folie à Deux",
        "description": "The former YouTube star defeats the former undisputed heavyweight in the highly anticipated live event on Netflix.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Trump Names Karoline Leavitt as Youngest Ever White House Press Secretary",
        "description": "Leavitt is 27 and currently a spokesperson for Trump's transition.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Harris Campaign Joins Oprah Winfrey to Shut Down Rumors of Payment for Celebrity Endorsements",
        "description": "Records show that Winfrey's Harpo Productions was paid following her star-studded town hall event for the Democrat — but there is an easy explanation for the $1 million being sent to the company.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Sylvester Stallone Is Latest Celeb to Back Trump, Calls Him a “Second George Washington” at Gala",
        "description": "The actor, whose action blockbuster career's apex coincided with the president-elect's days ruling New York as a real estate mogul, sang his praises at a Mar-a-Lago event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Shel Talmy, Who Produced Hits by The Who, The Kinks and Other 1960s British Bands, Dies at 87",
        "description": "The record producer also oversaw hits by Manfred Mann and the duo Chad & Jeremy and was an early backer of David Bowie.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Brianna LaPaglia Calls Zach Bryan’s Silence “Deafening” Following Emotional Abuse Allegations",
        "description": "The Barstool Sports personality believes the country music star hasn’t responded to allegations because if he did he would have to deny it, which would cause her to release evidence.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Latinx House and Adobe Foundation Reveal Two Programs Launched Under $6M Film and TV Fund",
        "description": "The fund is designed to support emerging filmmakers through two programs: The Gloria Schoemann Editors Fellowship and the Proof of Concept Program, which will provide early investment for projects.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "The Milo Yiannopoulos Makeover: The Alt-Right’s Fallen Poster Boy Is Back for Trump 2.0",
        "description": "After years in the wilderness, the newly devout, “ex-gay,” alt-right firebrand is back with a new hustle: running a management firm for scandal-prone celebrities like Yeezy and Marjorie Taylor Greene and working for Trump Land behind the scenes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Meet NCT’s Mark Lee, the Busiest Man in K-Pop",
        "description": "The Hollywood Reporter's newest \"Person of Interest\" is a hugely popular 25-year-old Canadian-born K-pop star who is finally starting to feel his age. \"I'm kind of old now,\" he laments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Elon Musk Rebuked by Italian President for Interfering in Domestic Affairs",
        "description": "After calling German Chancellor Scholz “a fool,” the mercurial billionaire buddy of President-elect Donald Trump is now angering the Italians.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "Michael Strahan Addresses National Anthem Backlash",
        "description": "\"The only statement that should be made and that I want to make is that I love the military, I’ve always loved the military, and I will always love the military,\" he said in a social media post.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-18T07:24:53.283699"
    },
    {
        "title": "NRL star’s $2m lifeline after shock axing",
        "description": "Terrell May has wasted no time in finding a new club after the Sydney Roosters prop was shown the door by the NRL glamour club.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Tigers seize Roosters gun in big coup",
        "description": "The Wests Tigers have added add another key piece to their roster with Terrell May signing a three-year deal with the club.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Aussie hoping to make most of PGA bonus",
        "description": "A Perth golfer is hoping for a form turnaround after securing an Australian PGA Championship invitation.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Bleak reality behind viral Simmons footage",
        "description": "Australian NBA player Ben Simmons has found himself in the spotlight for all the wrong reasons once again after some damning vision.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Watch: Get to know the top AFL Draft prospects",
        "description": "The AFL Draft is almost here – and we have you covered from every angle. Watch highlights, interviews and expert analysis in the build-up to Wednesday night’s first round.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "AFL legend exposes sad truth of Carey storm",
        "description": "One of Wayne Carey’s fiercest rivals has spoken out after the premiership winner was sensationally snubbed by his former club.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "NRL star’s $2m lifeline after shock axing",
        "description": "Terrell May has wasted no time in finding a new club after the Sydney Roosters prop was shown the door by the NRL glamour club.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Tigers seize Roosters gun in big coup",
        "description": "The Wests Tigers have added add another key piece to their roster with Terrell May signing a three-year deal with the club.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Agar’s brave act as discard’s ‘hurt’ claim dismissed",
        "description": "Spinner Ashton Agar displayed some batting bravery as a former Test captain delivered a hard truth to an opening batter upset about being overlooked for Australia.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Aussie cricket great in bombshell report",
        "description": "Aussie cricket cult hero Jason Gillespie’s future as coach of Pakistan is suddenly clouded after a bombshell report dropped.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Injury hits Aussies in Cup defeat",
        "description": "The Australian women’s team fell short of a third-straight semi-final and now it’s the men’s team to try and end a 20-year Davis Cup drought.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Kyrgios reveals Novak role in comeback",
        "description": "Nick Kyrgios has played one competitive tour match in two years but has confirmed the location for his Australian comeback en route to the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Aussie champs broken up as star defects",
        "description": "Australia’s dominant SailGP team is being broken up, with a key member of their championship three-peat leaving on the eve of the new season.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Icon saved, big shake-up coming to Formula 1",
        "description": "Formula One has made a call on the future of an iconic race amid a schedule crunch and talk of some popular races being taken off the calendar.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Aussie great: ‘I don’t care how good you are’",
        "description": "An Aussie cricket great believes David Warner’s obvious successor is “selling himself short”, amid a tough start to his international career.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Brown crowned Supercars champ after Feeney wins Adelaide 500",
        "description": "Will Brown has sealed his maiden Supercars championship after opening up an unbeatable lead over his teammate and title rival Broc Feeney, who led home a Triple Eight one-two in the first leg of the Adelaide 500 on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Icon saved, big shake-up coming to Formula 1",
        "description": "Formula One has made a call on the future of an iconic race amid a schedule crunch and talk of some popular races being taken off the calendar.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Shock as Raygun emerges from retirement",
        "description": "Olympic breakdancer Raygun has hit the stage with an Aussie popstar, performing just days after announcing she was retiring.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Fans blame twins for football’s ‘biggest curse’",
        "description": "College basketball twins Haley and Hanna Cavinder are well aware of the “curse” they supposedly inflict on their boyfriends.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "The sad state of the Cowboys and can KC go unbeaten?",
        "description": "Jerry Jones and the Dallas Cowboys lament a lost season, with the amazing stats showing why, and can the Chiefs go unbeaten the rest of the way?",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Viral NFL star sends Raygun a message",
        "description": "Days after going viral for his Raygun celebration, an NFL star has made some huge claims about the Olympic breakdancer.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "‘Results don’t lie’: Matildas veteran opens up on disastrous Olympics",
        "description": "Emily van Egmond breaks down the Matildas “disappointing” Olympics campaign and how interim coach Tom Sermanni has helped turn it around.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "‘Overwhelming’: World Cup hero’s brave call",
        "description": "Having become a national hero during the Matildas’ glorious World Cup run, Cortnee Vine has made a significant revelation about her life since that major moment.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Update on Garside ex’s assault case",
        "description": "A major update on the ex-girlfriend of boxer Harry Garside has been revealed in court, as she fights allegations she attacked the Olympian in her own home.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Aussie hoping to make most of PGA bonus",
        "description": "A Perth golfer is hoping for a form turnaround after securing an Australian PGA Championship invitation.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 10",
        "description": "The biggest star of SuperCoach NBL is back from injury – and available for a bargain price. Here’s everything you need to know to get your team set for round 10.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "‘Too far’: One thing winning Wallabies won’t contemplate",
        "description": "With a 116-year first achieved in Wales the Wallabies have their tails up with an eye on doing something no Australian side has done in 40 years in the UK.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Fans say same thing about Wallabies win",
        "description": "Wallabies fans are daring to dream of greater heights, praising their new coach and pointing out a glaring Eddie Jones detail.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Monday Racebook: Gilbert Gardiner’s horses to follow, forgive",
        "description": "Herald Sun racing writer Gilbert Gardiner runs a rule over Thousand Guineas race day at Caulfield.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-18T07:24:55.288633"
    }
]