[
    {
        "title": "Boeing raises pay offer in bid to end seven-week strike",
        "description": "The union representing more than 30,000 striking workers endorsed the offer and will hold a ballot on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "UK borrowing costs at highest for a year after Budget",
        "description": "Analysts say the rise in borrowing costs is a sign the markets aren't happy about the increase in government spending.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "China's BYD overtakes Tesla revenue for first time",
        "description": "The electric vehicle giant saw its revenues jump 24% as government subsidies boost China's car industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Musk can continue with election cash giveaways for now, judge rules",
        "description": "Prosecutors say the case will now move to a federal court, following a request from Musk's lawyers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "The house paints that promise much more than colour",
        "description": "Paints now promise to make your house cooler, warmer, or simply peel off.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Russia fines Google more money than there is in entire world",
        "description": "The mind-boggling figure has been levied due to the company restricting Russian state media on YouTube.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Wariness of AI is overblown, expert suggests - 31 Oct 2024",
        "description": "Investment strategist suggests wariness of AI is overblown and that technology firms will be the profit-makers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "US election bets surge, despite red flags and mixed record",
        "description": "Election bets have exploded in the US, as it barrels toward the polls next week.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "How X users can earn thousands from US election misinformation and AI images",
        "description": "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Is there a £22bn ‘black hole’ in the UK’s public finances?",
        "description": "Economists say the state of public finances should not have come as a complete surprise to the new government.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Why Canada wants more overseas tourists to visit",
        "description": "Canada has launched a tourist drive but will tensions with China doom it to fail?",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "US economy growing despite voter angst",
        "description": "The US economy expanded at a solid annual rate of 2.8% over the three months to September.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Hollywood stars grow Wrexham  empire with brewery",
        "description": "The football club's star co-owners grow their Wrexham by buying half of the Wrexham Lager brewery.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "UK Budget 2024: Key points at a glance",
        "description": "Chancellor Rachel Reeves has delivered Labour’s first Budget since 2010 – here’s what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "UK growth set to peak next year before slowing again",
        "description": "The government's official forecaster raises its prediction for UK growth in 2024 and 2025 but reduces it for later years.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Starbucks drops olive oil coffees as it shakes up menu",
        "description": "The announcement comes less than a week after the company reported falling global sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Why Wikipedia has landed in legal trouble in India",
        "description": "India’s largest newswire service ANI has filed a $237,874 defamation lawsuit against Wikimedia Foundation.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "UK-based stars support US video game strikes as row continues",
        "description": "Famous voices from releases such as The Witcher and Cyberpunk 2077 say they support the SAG-Aftra strikes.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "TikTok founder becomes China's richest man",
        "description": "Zhang Yiming's fortune has leapt to almost $50bn, according to a newly published rich list.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Adidas ends 'fight' with Kanye West over antisemitism",
        "description": "The two collaborated on the Yeezy collection but cut ties due to the rapper's controversial comments.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "McDonald's apologises for E. coli as sales slide",
        "description": "Boss Chris Kempczinski says sorry for the outbreak as the burger giant faces flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Jeff Bezos defends Washington Post's end to election endorsements",
        "description": "The newspaper owner's comments follow the reported loss of subscribers and editorial staff resignations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "HSBC profits jump as bank set for major shakeup",
        "description": "Pre-tax profits rose to $8.5bn in the three months to the end of September, beating analysts' expectations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Australian PM accused of seeking upgrades from Qantas boss",
        "description": "Albanese has said he followed the rules and was \"completely transparent\" with all disclosures.",
        "source": "BBC Business",
        "fetched_date": "2024-11-01T07:23:41.398128"
    },
    {
        "title": "Megan Thee Stallion Holds Back Tears at Documentary Premiere: “I Started to Watch a Lot of People Dehumanize Me”",
        "description": "'Megan Thee Stallion: In Her Words' will introduce people to Megan Pete — the woman behind the entertainment persona — for the first time, says the Houston rapper.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "How Pop Stars Are Gaming the Grammy Ballot",
        "description": "Sabrina Carpenter is competing in country, Megan Thee Stallion is competing in rock, and Jelly Roll is competing against himself. THR’s music editor Mesfin Fekadu looks behind this year’s ballot machinations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "John Legend’s Manager Pens New York Times Op-Ed on Predatory, “Toxic” Music Industry Amid Diddy Allegations: “We Can Clean It Up”",
        "description": "Emmy-winning producer Ty Stiklorius describes a Sean Combs yacht party she attended 27 years ago and says: \"We have an opportunity to turn the page on an archaic, sometimes predatory model of doing business.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Japan Celebrates as Shohei Ohtani, Yoshinobu Yamamoto Win World Series with Dodgers",
        "description": "Baseball fans in Japan sought out special newspaper editions that rolled off the presses Thursday that paid tribute to Ohtani and Yamamoto.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Keke Palmer Opens Up About Impact of Child-on-Child Sexual Abuse: “I Felt Weird and Violated”",
        "description": "The actress and singer talks about her traumatic experience at 5 years old in her new book, 'Master of Me: The Secret to Controlling Your Narrative.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Dodgers Win World Series in 5 Games, Overcome 5-Run Deficit With Help of Errors to Beat Yankees 7-6",
        "description": "This marked the Los Angeles Dodgers' second World Series championship in five seasons.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "J-Pop Group BE:FIRST on Teaming Up With ‘One Piece’ for New Song and Performing in the U.S.",
        "description": "The seven-piece group chats with The Hollywood Reporter about their new 'One Piece' collaboration and their experience opening for K-pop boy group ATEEZ.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Zoë Kravitz and Channing Tatum Split and Call Off Engagement Following Three-Year Relationship",
        "description": "Kravitz and Tatum dated for three years, and announced their engagement in 2023.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "CNN Panel Guest Directs Racist Attack on Mehdi Hasan: “I Hope Your Beeper Doesn’t Go Off”",
        "description": "Trump supporter Ryan Girdusky was promptly booted off the show, and CNN later said he would not be welcomed back on the network.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Jennifer Aniston Says She’s Voting for “Sanity and Human Decency” After Casting Ballot for Kamala Harris",
        "description": "\"Let’s please end this era of fear, chaos and the attacks on our democracy — and vote for someone who will unite us and not continue to threaten to divide us,\" the actress wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Nicky Jam Retracts Trump Endorsement Following Puerto Rico Controversy",
        "description": "Jam had previously appeared at a Trump rally but told followers on Wednesday he never expected \"a comedian would appear to criticize and talk badly about my [Puerto Rico].\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Metro Boomin Sued Over Alleged 2016 Rape",
        "description": "The lawsuit points to lyrics from one of the producer's songs allegedly referencing the assault. He denied the allegations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-01T07:23:42.567932"
    },
    {
        "title": "Khawaja, Hazlewood square off in Shield",
        "description": "Australian star Josh Hazlewood has returned to red-ball cricket in an intriguing battle against Queensland’s seasoned openers.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Star Shark signs bumper new deal",
        "description": "A major domino in NRL free agency has fallen with Braydon Trindall agreeing to a new three-year deal to stay with the Sharks.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Scott delivers blow to Aussie ‘majors’",
        "description": "Australia’s highest ranked male golfer and one of the all-time greats has made the tough decision not to come home this year for the Aussie summer of golf.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Auckland a ‘strong favourite’ in Kiwi derby",
        "description": "Don’t try to tell Wellington Phoenix coach Giancarlo Italiano that his side is under the most pressure to win Saturday’s New Zealand derby against Auckland FC.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "‘Bit of flavour’: Rivals embrace high-stakes clash",
        "description": "Carlton and Essendon legends have urged their club’s AFLW sides to throw the kitchen sink at their rivals, with the Bombers’ finals spot at stake.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "‘Salutary lesson’: AFL confirms career-ending ban",
        "description": "As the AFL confirmed a career-ending ban for Melbourne’s Joel Smith the league boss said it should be a lesson to all players.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Star Shark signs bumper new deal",
        "description": "A major domino in NRL free agency has fallen with Braydon Trindall agreeing to a new three-year deal to stay with the Sharks.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is already in overdrive with a host of big names led by Ben Hunt on the move. Keep up to date with all the player movement as it happens in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Khawaja, Hazlewood square off in Shield",
        "description": "Australian star Josh Hazlewood has returned to red-ball cricket in an intriguing battle against Queensland’s seasoned openers.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Fresh blow as horror week gets worse",
        "description": "Retired star David Warner’s horror week has continued on a day of sad news for Australia’s international cricket stars.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Aussie Demon set for 20-year first",
        "description": "Alex de Minaur was supposed to be battling with a hip injury, but the Australian star’s fight has put him on the verge of a 20-year-first.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Aussie star goes berserk, takes big scalp",
        "description": "Australia’s Alexei Popyrin has blown up in an X-rated rant on his way to another big win over a top 10 opponent at the Paris Masters.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "‘Horrible’: Wild Verstappen conspiracy theory",
        "description": "The man who penalised Max Verstappen for his tactics against Lando Norris as blasted the F1 champion’s “horrible mindset”.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "F1 stars caught in bizarre threesome ordeal",
        "description": "F1 driver Pierre Gasly has revealed a truly bizarre proposition he and Charles Leclerc received from a fan that took things too far.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Cleary pic proves truth about relationship",
        "description": "Nathan Cleary has been making the most of the NRL off-season, with the latest pic proving his relationship with Mary Fowler has never been better.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Raygun’s attempt to ‘cash in’ gets rejected",
        "description": "Raygun’s bid to cash in on her fame in the wake of the Olympics has hit a major roadblock as she looks to capitalise on the saga.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "‘Next level’: Giddey proves the NBA wrong",
        "description": "Aussie Josh Giddey has left the entire NBA with egg on its face with one stat since his move to Chicago proving everyone wrong.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Can we trust the two halfway mark Super Bowl favourites?",
        "description": "There are two  rampaging favourites to make the Super Bowl: halfway through the NFL season, can anyone stop them?",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Auckland a ‘strong favourite’ in Kiwi derby",
        "description": "Don’t try to tell Wellington Phoenix coach Giancarlo Italiano that his side is under the most pressure to win Saturday’s New Zealand derby against Auckland FC.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Amorim promises ‘clarification’ on Manchester United job",
        "description": "Sporting Lisbon manager Ruben Amorim was peppered with questions about his prospective switch to Manchester United but he remained tight-lipped.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Aussie boxer in coma, mate found dead",
        "description": "An Australian Muay Thai boxer has reportedly been found in a hotel room in Pattaya with his mate dead on the floor.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Scott delivers blow to Aussie ‘majors’",
        "description": "Australia’s highest ranked male golfer and one of the all-time greats has made the tough decision not to come home this year for the Aussie summer of golf.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "White, Delly, star as United holds off Oliver-led Kings",
        "description": "Two huge Jack White threes in the dying seconds has seen Melbourne United serve up a Halloween night treat for its fans in a hard-fought 87-83 victory over the Kings.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "NRL great ‘disappointed’ by anthem stance",
        "description": "Players make their own decisions about singing the national anthem before matches and it doesn’t sit well with one NRL great.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Aussie Olympians’ $100k pay day blocked",
        "description": "Rugby Australia are standing in the way of a plan for two of Australia’s biggest Rugby Sevens stars to maximise their earning potential.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "From bouncer to car wash king to Melbourne Cup hope",
        "description": "The Melbourne Cup has seen oil-rich sheiks, casino moguls and high-flying bankers but never before has it seen a one-time nightclub bouncer, car wash king and car racer.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    },
    {
        "title": "Fresh twist after Olympian’s wife killed",
        "description": "There has been a fresh twist in the case against an Olympic cyclist charged with killing his wife who was also an Olympian.",
        "source": "News AU",
        "fetched_date": "2024-11-01T07:23:44.026197"
    }
]