[
    {
        "title": "US-China talks end with plan for Trump and Xi to approve",
        "description": "The US Commerce Secretary said the deal should result in some restrictions being resolved.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Budget airline Jetstar Asia to close in weeks, customers offered refunds",
        "description": "Jetstar Asia has struggled with rising supplier costs, high airport fees and increased competition.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Ros Atkins on… the UK's changing energy mix",
        "description": "Ros Atkins looks at the reasons behind the government's investment in nuclear power, and how its plan fits into the UK’s energy mix.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "HBO and CNN owner to split streaming and cable businesses",
        "description": "It comes as streaming services attract hundreds of millions of users around the world but cable TV has seen audiences decline.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Budget airline Jetstar Asia to close in weeks, customers offered refunds",
        "description": "Jetstar Asia has struggled with rising supplier costs, high airport fees and increased competition.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Average Australian home passes A$1m amid housing crisis",
        "description": "The nation is home to some of the least affordable cities on Earth to buy a property.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "US tariff turmoil makes Spain's flagship foods seek other markets",
        "description": "Spanish ham and olive oil producers are looking at other nations to replace sales in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "World Bank predicts worst decade for global growth since 60s",
        "description": "The US, Japan and the euro area are all expected to have lower growth as Trump's tariffs bite.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "How airline fees have turned baggage into billions",
        "description": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "US green energy firms brace for federal funding cuts",
        "description": "Billions of dollars of US federal funding for green energy projects hangs in the balance.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Pressure on as US-China resume trade talks - 9 Jun 2025",
        "description": "Markets react well as negotiators from Washington and Beijing meet in London to find a way forward.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "From festivals to weddings: Why drone shows are booming",
        "description": "Light shows involving hundreds and even thousands of drones are becoming big attractions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Uber brings forward trialling driverless taxis in UK",
        "description": "The autonomous cars with no human safety driver at the wheel will be trialled in London next spring.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "UK firms hold off on hiring as job vacancies fall",
        "description": "The employment market is \"weakening\" official figures suggest, as cautious businesses delay recruitment.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Eurostar plans direct trains to Frankfurt and Geneva",
        "description": "The firm hopes a fleet of up to 50 new trains will be up and running by the early 2030s.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "China's electric cars are becoming slicker and cheaper - but is there a deeper cost?",
        "description": "The future for EVs will inevitably involve China. But where does that leave the UK and Europe markets – and what of the questions around national security?",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "US and China meet for trade talks in London",
        "description": "Fresh talks aimed at resolving the trade war between the world's two largest economies are taking place.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Canada pledges to meet Nato's 2% defence spending target within a year",
        "description": "Prime Minister Mark Carney said Canada could no longer be dependent on the US for its security, and must act to secure its own borders.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Trump-Musk row heightens fears over Nasa budget cuts",
        "description": "The space agency has published its budget request to Congress which would see funding for science projects cut by nearly a half.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "'I burst into tears': How airline carry-on confusion triggered legal row",
        "description": "Budget airlines may be forced to standardise rules on underseat bags, under a proposed change to EU law.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "How India's 'biggest art deal' buried MF Husain masterpieces in a bank vault",
        "description": "The paintings are set to go up for auction for the first time on 12 June in India's financial capital, Mumbai.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Britain's energy bills problem - and why firms are paid huge sums to stop producing power",
        "description": "Could the government's radical plan to change the way the UK distributes electricity really bring down bills - or just lead to a postcode lottery?",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Will Musk's explosive row with Trump help or harm his businesses?",
        "description": "Experts say his tech empire needs more of Musk's attention - but also the continued custom of the government.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Spending Review: Massive cheques from the UK chancellor for some - but what do totals hide?",
        "description": "The total spend may be enormous, writes Laura Kuenssberg, but fears it could be “painful” for some remain.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "How Trump and Musk are still linked - despite falling out",
        "description": "Political contributions, government contracts and staff with divided loyalties mean the fallout may have only just begun.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "On board the driverless lorries hoping to transform China's transport industry",
        "description": "Driverless lorries are now operating across China - but public concern about these vehicles remains.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "The decades-old intrigue over an Indian guest house in Mecca",
        "description": "A now-demolished guest house in Mecca is at the centre of a bitter family tussle in India.",
        "source": "BBC Business",
        "fetched_date": "2025-06-11T07:28:13.660148"
    },
    {
        "title": "Mariah Carey Signs Multi-Album Deal With Gamma",
        "description": "L.A. Reid will produce the singer’s next album as part of the new partnership with the company launched by Larry Jackson.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Jessica Pratt, MJ Lenderman, Shaboozey Among Big Winners at 2025 Libera Awards",
        "description": "Pratt won record of the year with \"Here in the Pitch,\" while Lenderman won breakthrough artist and Shaboozey won this year's impact award.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "David Byrne Announces New Album ‘Who Is the Sky?’ With Appearances From St. Vincent, Hayley Williams",
        "description": "Byrne is set to tour the new album starting with dates in North America in September.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Kendrick Lamar Was the Top Winner at the 2025 BET Awards",
        "description": "SZA, Chris Brown, Doechii, Denzel Washington and Cynthia Erivo also earned awards at the Monday night ceremony in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "SHINee’s Key on K-pop Stardom After 30 and Reuniting with U.S. Fans",
        "description": "The “Pleasure Shop” singer, a member of legendary boy group SHINee, wants to show younger K-pop artists they can have a lengthy career: “A lot of good things happened to my own career that I couldn't imagine. And everything happened after [I was] 30 years old.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "BET Awards: Jamie Foxx Tearfully Thanks God for Giving Him a “Second Chance” After Health Scare",
        "description": "The actor-comedian-singer accepted the Ultimate Icon Award at the Monday night ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Jonathan Mayers, Concert Promoter and Bonnaroo Co-Founder, Dies at 51",
        "description": "The news arrives as the Tennessee music festival is set to kick off its 2025 edition Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Doechii Calls Out Trump’s “Ruthless Attacks” Amid L.A. Protests in BET Speech: “What Type of Government Is That?”",
        "description": "\"I want y'all to consider what kind of government it appears to be when every time we exercise our democratic right to protest, the military is deployed against us,\" the \"Alter Ego\" rapper said Monday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Thank You, Sly Stone",
        "description": "The journalist who got the late funk legend to break his decades-long silence pays tribute to his indelible message of hope — needed now more than ever.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "BET Awards 2025: Snoop Dogg, Keke Palmer, Tyler Perry and More Stars Walk the Carpet",
        "description": "Host Kevin Hart, Doechii, Machine Gun Kelly, Shaboozey, Jordin Sparks and Andra Day also attended the awards ceremony in Los Angeles on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Vin Diesel and Laverne Cox Among Speakers at 2025 CAA Amplify Summit",
        "description": "ACLU executive director Anthony Romero, former prime minister of New Zealand Dame Jacinda Ardern and CEO of Microsoft AI Mustafa Suleyman will also head to Laguna Beach for the annual summit.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    },
    {
        "title": "Diddy’s Ex Passed Out After Reading Cassie’s Lawsuit Describing “Freak-Off” Orgies",
        "description": "The rap mogul's girlfriend until his arrest in September continued to testify on Monday about alleged abuse, gaslighting and finding her agency as the relationship declined.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-11T07:28:13.882613"
    }
]