[
    {
        "title": "Mapping China's influence around the Panama Canal",
        "description": "A close-up look at Chinese projects that worry the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "What it means when Elon Musk brings his children to work",
        "description": "You'll sometimes see one of his children on his shoulders as billionaire Elon Musk makes public appearances.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Five key takeaways from Modi-Trump talks",
        "description": "Modi and Trump rekindle ties amid a global trade war, balancing tariffs, trade deals and strategic interests.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Too quiet on set? Hollywood pushes for more LA productions post wildfires",
        "description": "January's wildfires have exacerbated the decline of Hollywood's once booming film and television industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "What it means when Elon Musk brings his children to work",
        "description": "You'll sometimes see one of his children on his shoulders as billionaire Elon Musk makes public appearances.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Why don't Europeans buy more American cars?",
        "description": "Trump wants US vehicles to be more popular in Europe, but it's a difficult market for them to crack.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Is Trump right when he says the US faces unfair trade?",
        "description": "He wants to hit back at countries that place import taxes on American goods that he thinks are too high.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "What we've learned about Rachel Reeves's expenses - and the Labour response",
        "description": "Senior figures defended the chancellor after we revealed her expenses were investigated before she was an MP.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Why Muslims in India are opposing changes to a property law",
        "description": "Muslim groups say the changes are politically motivated but the government says it is responding to demands for reform.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "What is Doge and why is Musk cutting so many jobs?",
        "description": "US President Donald Trump’s new agency is tasked with slashing costs - but faces opposition.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Uber and Bolt drivers strike on Valentine's Day",
        "description": "Thousands of drivers are taking part in the strike action over pay and working conditions, a union says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Trump tariff VAT threat raises fears of hit to UK",
        "description": "The surprise inclusion of VAT to calculate tariffs prompts questions over the possible impact on British businesses.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "US politicians furious at UK demand for encrypted Apple data",
        "description": "They say the US should re-evaluate its cyber-security partnership with the UK unless the \"dangerous\" request is withdrawn.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "TikTok returns to Apple and Google app stores in the US",
        "description": "TikTok is again available on app stores in the US after President Donald Trump delayed a ban on the app.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "More migrant workers claim UK farm exploitation",
        "description": "The UK government says it always takes \"decisive action\" where abusive practices are found on farms.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Beyoncé ticket sale runs smoothly, to fans' surprise",
        "description": "Tickets for Beyoncé's latest UK dates go on general sale on Friday, with prices reaching up to £950.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Trump launches plan to target countries with new tariffs",
        "description": "The US president ordered his staff to develop a response to countries with trade policies he says are unfair.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "UK signals it will seek US steel tariff exemption",
        "description": "Business secretary Jonathan Reynolds says the government has a strong case to avoid tariffs on UK-made steel entering the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Jeff Bezos space firm Blue Origin to cut a tenth of jobs",
        "description": "The company is looking to trim manager ranks and focus on ramping up rocket launches.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Honda-Nissan multi-billion dollar merger collapses",
        "description": "The Japanese car making giants aimed to combine their businesses to compete against Chinese rivals.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Trump moves to close entries to government worker buyout programme",
        "description": "About 75,000 government employees have reportedly opted into the programme, which is designed to shrink the workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Igloo recalls coolers over finger amputations and injuries",
        "description": "People have reported other injuries including finger lacerations and bone fractures from using the product.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "'On a power trip' or 'obviously brilliant'? Americans weigh Musk's influence",
        "description": "The world's richest man is leading a sweeping cost-cutting drive. What do voters in a key swing state make of his role?",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Unofficial TikTok downloads surge in the US",
        "description": "Many people are turning to so-called \"sideloading\" because the app is unavailable on official stores.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "UK chancellor's CV exaggerated time at Bank of England",
        "description": "The BBC has established that Rachel Reeves left the financial institution nine months earlier than she states in her LinkedIn profile.",
        "source": "BBC Business",
        "fetched_date": "2025-02-15T07:20:30.530950"
    },
    {
        "title": "Selena Gomez Says She Couldn’t “Have Accepted” Her Relationship With Benny Blanco 10 Years Ago",
        "description": "The couple's joint album 'Said I Love You First' will drop on March 21.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Ari Emanuel Explains Why He Believes Blake Lively Instead of Justin Baldoni",
        "description": "The Endeavor CEO on why he's \"ride or die\" for Lively and Ryan Reynolds in their legal battle with the 'It Ends With Us' director.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "JonasCon: Jonas Brothers Celebrate 20 Years With One-Day Fan Event",
        "description": "The trio of brothers are heading to their home state of New Jersey for a free fan experience with live performances, Q&A panels, DJ sets and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Will Smith to Perform New Single “First Love” on Univision Awards Show ‘Premio Lo Nuestro’ (Exclusive)",
        "description": "This will mark the Grammy winner's first performance in the history of the show and the TV debut of the new track.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Selena Gomez Announces New Album With Fiancé Benny Blanco",
        "description": "'I Said I Love You First' is out next month. The couple released a single, \"Scared of Loving You,\" as part of the announcement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Couture-Clad Lady Gaga Fights Back Tears Eating Spicy Wings on ‘Hot Ones’ With Sean Evans",
        "description": "The superstar singer tried her best to keep a poker face, but when the heat level progressed to Da Bomb hot sauce, she fought back tears and quipped, \"Is this safe?\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Mandy Moore Looks Back on L.A. Fires Evacuations, Amazon Apologizes for Delivering a Package to Her In-Laws’ Lost Home",
        "description": "\"Do better, Amazon,\" the actress shared to her Instagram Story.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Kanye West Video Creator Defends Showing AI Celebrities Without Permission",
        "description": "In a new interview, Guy Bar attempted to justify his celebrity-filled stunt, and noted, \"I wish they would share it and say, 'We agree'.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "White House Kerfuffle Erupts Over Use of ‘Gulf of Mexico’ Amid Trump’s New ‘Gulf of America’",
        "description": "The Associated Press is in the crosshairs of the Trump administration after refusing the change the name of the body of water in its journalism after 400 years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Robert F. Kennedy Jr. Is Confirmed as Trump’s Health Secretary After Close Senate Vote",
        "description": "The GOP fell in line behind the president despite hesitancy over Kennedy's views on vaccines, voting 52-48, with Kentucky Sen. Mitch McConnell, who had polio as a child, the only \"no\" vote among Republicans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Universal Music Group and Music Health Alliance Launch Music Industry Mental Health Fund",
        "description": "The new initiative expands upon the company’s four-year partnership with one another.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "‘The Brutalist’ and ‘Challengers’ Among Society of Composers and Lyricists Award Winners",
        "description": "Diane Warren also earned an award for her Oscar-nominated song “The Journey” from ‘The Six Triple Eight.’",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-15T07:20:31.316996"
    },
    {
        "title": "Jordan Mailata belts out iconic anthem",
        "description": "Newly minted NFL Super Bowl champion Jordan Mailata has celebrated his historic triumph in a truly iconic way.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Rich list exposes ‘gender pay gap proof’",
        "description": "The highest paid athletes list of 2024 has been released with one presenter calling out an ugly and undeniable truth in the figures.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Sponsors make shock call on dumping Kerr",
        "description": "Matildas superstar Sam Kerr is one of the highest paid sportspeople in the country, but her personal brand has taken a big hit.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "NRL star in hot water over inappropriate act",
        "description": "The Eels star could face sanctions after his inappropriate sideline act was met with a swift and angry reaction from fans.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Cricket Australia has failed Aussie star",
        "description": "A former Test bowler has put the onus on Cricket Australia after Matt Kuhnemann was cited for a suspect action in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "‘Will pass’: More support for reported Aussie spinner",
        "description": "Days of testing will determine if breakout spin star Matt Kuhnemann’s action is suspect and his captain says it won’t be an issue.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Shock career move after star flees country",
        "description": "Italian tennis star Camila Giorgi has changed her career again after sensationally quitting tennis to become a lingerie model last year.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Tennis world loses it over de Minaur speech",
        "description": "Alex de Minaur lost the final, but won the crowd with a classy speech before he let slip a secret he had carried all week.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "‘He’s contracted’: Dee makes Pickett plea",
        "description": "A Melbourne teammate hopes to see the admittedly homesick Kysaiah Pickett at his feet for ‘many more’ seasons.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Young Swan caught buying illicit substance",
        "description": "The Swans youngster, who played five matches in 2024, has been suspended for the first two rounds of the upcoming AFL season.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "NRL star in hot water over inappropriate act",
        "description": "The Eels star could face sanctions after his inappropriate sideline act was met with a swift and angry reaction from fans.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "RTS nails new role as the Warriors win big",
        "description": "A veteran starred on the wing and a young gun did his best to win a starting spot as the Warriors thrashed Melbourne before they head off to Vegas.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Gilly digs knife in after Poms sledge Aussies",
        "description": "Adam Gilchrist has hit out at England’s ‘Barmy Army’ after they attempted to downplay Australia’s series win over Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "‘Getting fired anyway’: Shaq goes rogue",
        "description": "The basketball legend yelled “we’re getting fired anyway” as he stunned onlookers with a wild rant on a live NBA broadcast.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "$178m NFL trainwreck ends, reason revealed",
        "description": "Aaron Rodgers’ divorce from the New York Jets has gotten messier with the team explaining why the quarterback was cut.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Sponsors make shock call on dumping Kerr",
        "description": "Matildas superstar Sam Kerr is one of the highest paid sportspeople in the country, but her personal brand has taken a big hit.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Sliding City happy to be home",
        "description": "Melbourne City hopes returning to AAMI Park on Saturday will lead to a return to winning ways.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Olympics chaos as bombshell lawsuit drops",
        "description": "Imane Khelif has hit out after a bombshell lawsuit dropped regarding her controversial gold medal win at the Paris Games.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Schumacher wife upset over prison sentence",
        "description": "Sentences have been handed down and new details have emerged about the plot to blackmail the family of Formula 1 legend Michael Schumacher.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Former Formula 1 star set to race in Australia",
        "description": "A Formula 1 legend is heading to Australia to compete in the Race of Champions, with a month until some of the biggest names in motorsport line up on the grid at Accor Stadium.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Cadee’s last dance? Phoenix out to end NBL legend’s career",
        "description": "One of the NBL’s great careers could come to an end on Sunday. And although he’s out to make sure that happens, even Nathan Sobey wants Jason Cadee and his impact on basketball in Australia to be celebrated.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Aussie LIV quest blown away",
        "description": "Hard and fast was how Cam Smith wanted the Adelaide course for his LIV homecoming but when the wind started howling his hopes bit hard.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Simply arrogant: Lady Shenandoah awesome in first-up win",
        "description": "Lady Shenandoah is now an odds-on favourite for the Group 1 Surround Stakes despite the possible presence of unbeaten stablemate Autumn Glow after her brilliant first-up win.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Suaalii turns heads in crazy debut",
        "description": "Joseph Suaalii stole the show in his Super Rugby debut with an instant impact on the Waratahs, as they clinched a last-gasp win over the Highlanders.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Brumbies don’t mind playing the dark horse role",
        "description": "Nobody is picking the Brumbies to win the Super Rugby title this year, and that’s just how the team like it according to playmaker Noah Lolesio.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "‘Tacky’: Reality Taylor Swift can’t escape",
        "description": "Taylor Swift might be one of the most famous and liked women in the world but there’s a wild reality even she can’t escape.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    },
    {
        "title": "Ugly question still hanging over Kerr’s head",
        "description": "After the dust settles, Sam Kerr could be facing an even bigger mountain to climb after her dramatic legal saga.",
        "source": "News AU",
        "fetched_date": "2025-02-15T07:20:33.656858"
    }
]