[
    {
        "title": "Boeing workers strike as 25% pay rise rejected",
        "description": "More than 30,000 workers down tools after union members voted overwhelmingly to back the strike.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "New beanless 'coffee' emerges but does it taste any good?",
        "description": "Start-ups launch drinks that look and taste like coffee but they say are better for the environment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "UK ban on rental bidding wars is on the way - but will it work?",
        "description": "Renter groups say the plans are a positive step but warn more action will be needed to tackle unaffordable rents.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Microsoft lays off more gaming staff in new cuts",
        "description": "The Xbox owner announces 650 jobs will go after cutting almost 2,000 earlier this year.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "UK's ban on junk food TV adverts before 9pm to come in next year",
        "description": "Labour has confirmed it will implement the ban that the previous Conservative government committed to.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "New beanless 'coffee' emerges but does it taste any good?",
        "description": "Start-ups launch drinks that look and taste like coffee but they say are better for the environment.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Ex-Ticketmaster boss sentenced for hacking rival company CrowdSurge",
        "description": "British national Stephen Mead stole sensitive CrowdSurge data, contributing to the firm’s collapse.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Second-hand bedding a hit at St Andrews University",
        "description": "The recycled bedding has been distributed to new owners who have signed up to the scheme.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Jared Isaacman, the high-school dropout behind historic spacewalk",
        "description": "Jared Isaacman started his first company at age 16, and has long been passionate about flying.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "UK ban on rental bidding wars is on the way - but will it work?",
        "description": "Renter groups say the plans are a positive step but warn more action will be needed to tackle unaffordable rents.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Banana wine brings sweet taste of success to Malawi farmers",
        "description": "Emily Nkhana shares tips with the BBC on how to make banana wine.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "'We have no space to play': The guesthouse where everyone is homeless",
        "description": "A no-fault evictions ban will come in next summer, but thousands of families are already stuck in limbo.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Boeing boss in last-ditch plea ahead of strike vote",
        "description": "New chief executive tells staff that a strike would put the embattled firm's \"recovery in jeopardy\".",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "US inflation falls to lowest in over three years",
        "description": "Consumer prices in the US rose 2.5% over the 12 months to August, the slowest pace since February 2021.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Soaring cost of King’s Guards' real fur bearskin caps revealed",
        "description": "Bearskin caps worn by soldiers outside Buckingham Palace cost more than £2,000 each, says MOD.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Firm wins trademark case with EasyJet brand owner",
        "description": "The EasyGroup owner says he will appeal against the ruling, which found there was no infringement",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Why do companies fire and rehire their workers?",
        "description": "Controversy surrounds companies which dismiss their workers and rehire them on worse contracts.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Union wins Tesco 'fire and rehire' battle",
        "description": "The row erupted when Tesco proposed firing staff at some distribution centres and rehiring them on lower pay.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "How are renting and eviction rules changing?",
        "description": "A new law will ban no-fault evictions, limit rent rises and help tenants with children or pets.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "John Lewis losses halve as Waitrose sales rise",
        "description": "Sales at its department stores fell in what it calls a \"challenging market\", but revenues at Waitrose grew.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "High Street hit as 38 shops close every day",
        "description": "Chemists, pubs and banks made up half of High Street closures in the first six months of 2024, data suggests.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Rightmove rejects £5.6bn offer from Murdoch's firm",
        "description": "The property listing website said the offer from its Australian rival was 'wholly opportunistic'.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "UK chancellor warns hard decisions ahead in Budget",
        "description": "Rachel Reeves says tough choices will have to be made over tax, spending and welfare.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "How quickly are prices rising in the UK?",
        "description": "The rate at which prices are rising has nudged back above the Bank of England's target of 2%.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Iconic firm Campbell Soup set to drop soup from name",
        "description": "Executives at the 155-year old firm plan to change its name to reflect its growing line of products.",
        "source": "BBC Business",
        "fetched_date": "2024-09-13T07:23:31.490533"
    },
    {
        "title": "Mystery tremors were from massive nine-day tsunami",
        "description": "Scientists launched an investigation after being baffled by seismic signals picked up across the world",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The town that should have burned, but didn't",
        "description": "In 2017, one of California's largest ever wildfires was steadily approaching Montecito. But it had long been preparing for just such an event.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The secluded life of the US's 'lasagne lizard'",
        "description": "Scuba diving scientists are scouring riverbeds for the US'selusive, endangered hellbender – also known as the \"snot otter\" – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "UK farming's 'net zero' climate target in doubt",
        "description": "Doubts are raised over UK farming's ability to reach \"net zero\" greenhouse gas emissions by 2040.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-13T07:23:31.594997"
    },
    {
        "title": "Donald Trump Rejects Idea of Second Debate Against Kamala Harris",
        "description": "Former President Donald Trump has rejected the idea of a second debate with Vice President Kamala Harris, days after announcing himself as the victor in their initial head-to-head when the two met for the first time and he repeatedly lost his footing and his cool while sparring with his opponent in the upcoming election.  Trump, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Linda Ronstadt Endorses Kamala Harris After Donald Trump Schedules Rally at Music Hall Named After Her",
        "description": "Linda Ronstadt has endorsed Kamala Harris while speaking out against Donald Trump’s scheduled rally at Tucson, Arizona’s Linda Ronstadt Music Hall. In a statement shared on Instagram on Wednesday night, the “Blue Bayou” singer wrote, “Donald Trump is holding a rally on Thursday in a rented hall in my hometown, Tucson. I would prefer to […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Shannon Sharpe Admits to Lying About Phone Hack After Sex Act Goes Live on Instagram",
        "description": "NFL Hall of Famer Shannon Sharpe has admitted that a moment of intimacy between an unidentified man and woman that briefly graced his Instagram page on Wednesday was actually him and that the live clip was posted accidentally — not the result of him being hacked, as he’s previously stated.  On Wednesday, Sharpe’s 3.2 million […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Earthquake Rattles Los Angeles Area",
        "description": "A 4.7 magnitude earthquake rattled the Los Angeles area Thursday morning, unleashing boulders onto a Malibu road, visibly shaking Santa Monica’s 1909 wooden pier and jolting some people from bed. No injuries or damages were immediately reported. The U.S. Geological Survey said the earthquake was centered 4 miles north of Malibu and was about 7 […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Brat Fall, Anyone? Charli XCX Confirms Remix Version of Celebrated Pop Album With Troye Sivan",
        "description": "Don’t worry, everyone — Brat fall is coming. British bop-maker Charli XCX has announced a new version of her widely popular album, out on Oct. 11. “Brat and it’s completely different but also still brat,” the musician posted to her X account Thursday, confirming link-ups with Troye Sivan on Brat tune “Talk talk” and Lorde on […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "“It’s a Cult, and Walt’s the Messiah”: Meet the Couple Who Sued Disney Over Secretive Club 33",
        "description": "Scott and Diana Anderson only want one thing: to be let back into Club 33. But Club 33 definitely doesn’t want them as members. Since 1967, the club has served Disneyland’s highest-rolling VIPs — an in-the-know oasis over the Pirates of the Caribbean ride that purports to make the happiest place on Earth even happier. (Much […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Harvey Weinstein Indicted on Additional Charges in New York",
        "description": "A grand jury has indicted Harvey Weinstein on additional charges, prosecutors said in New York City criminal court Thursday.  The additional charges are currently under seal, but Weinstein is expected to be arraigned at a later date. In a press conference following the hearing, Weinstein’s attorney, Arthur Aidala, said he believed the grand jury considered […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Spotify Launching ‘Countdown To,’ Video Interview Series Focused on New Albums (Exclusive)",
        "description": "Spotify is launching a new video interview series that dives into new albums before they are released. Countdown To will feature artists conversing with fellow performers, collaborators, family members or friends to discuss the inspiration behind their new projects. The series will debut on Friday at midnight ET/9 p.m. PT Thursday, and the first episode […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Netflix, Shondaland, Latinx House and Sundance Institute Reveal New Cohort of Filmmaker Fellows",
        "description": "The Adelante Directors Fellowship has revealed the three creatives selected for the second round of the program. Barbara Cigarroa, Iliana Sosa and Michelle Salcedo snagged the fellowships, which deliver the chance to shadow an episode of a TV series, a grant to support them up to four weeks during the process, and a two-day orientation […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Flavor Flav Awards Jordan Chiles Her Own Bronze Clock at 2024 VMAs After Paris Olympics Controversy",
        "description": "Flavor Flav surprised Olympian Jordan Chiles with a touching gesture at the 2024 MTV Music Video Awards. While onstage with Chiles to present the award for best collaboration, which went to Taylor Swift and Post Malone for “Fortnight,” the rapper addressed the controversial decision that caused the gymnast to have her bronze medal revoked. “I […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "MTV VMAs Most Memorable Moments: Taylor Swift’s Big Wins, Chappell Roan’s Performance and Medleys From Katy Perry and LL Cool J",
        "description": "The 2024 MTV Video Music Awards were handed out Wednesday night in New York. The Hollywood Reporter has rounded up the biggest moments from the show. Taylor Swift Remembers 9/11… Taylor Swift took a moment to remember the tragedy of the 9/11 terrorist attacks when she accepted her first award during the telecast at the 2024 MTV […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "VMAs Host Megan Thee Stallion: “I Deserve a Gold Medal for Being a Bad B****”",
        "description": "Rapper Megan Thee Stallion acted as an energetic and engaging host for Wednesday night’s MTV Video Music Awards. The 29-year-old kicked off the night in a one-shoulder leotard, reminiscent of one that might be worn by an Olympic gymnast. Megan gave a shout-out to gold medalist and fellow Houston native Simone Biles, joking that Biles […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-13T07:23:31.863946"
    },
    {
        "title": "Three and Vodafone’s $19B merger hits the skids as UK rules the deal would adversely impact customers and MVNOs",
        "description": "The U.K.’s antitrust regulator has delivered its provisional ruling in a longstanding battle to combine two of the country’s major telecommunication operators. The Competition and Markets Authority (CMA) says that…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Oprah just had an AI special with Sam Altman and Bill Gates — here are the highlights",
        "description": "Late Thursday evening, Oprah Winfrey aired a special on AI, appropriately titled “AI and the Future of Us.” Guests included OpenAI CEO Sam Altman, tech influencer Marques Brownlee, and current…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "XP Health grabs $32M to bring employees more affordable vision care",
        "description": "Antonio Moraes, the grandson of a late prominent Brazilian billionaire, was never interested in joining the family-owned conglomerate of construction companies and a bank. Shortly after graduating from college, he…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Polaris Dawn astronauts perform historic private spacewalk while wearing SpaceX-made suits",
        "description": "A crew of four private astronauts made history in the early hours of Thursday when they opened the hatch of their SpaceX Dragon capsule and conducted the first commercial spacewalk. …",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Keith Rabois says Miami is still a great place for startups, even as a16z leaves",
        "description": "Keith Rabois, managing director of Khosla Ventures, was having dinner with a “very successful CEO” in October 2018 when the CEO asked him a question: How many people does it…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Meta is making its AI info label less visible on content edited or modified by AI tools",
        "description": "By making the AI info label harder to find, it might be easier for users to be deceived by content that was edited with AI, especially as editing tools become…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Cohost, the X rival founded with an anti-Big Tech manifesto, is running out of money and will shut down",
        "description": "Cohost, a would-be X rival launched to the public in June 2022, is shutting down, the company announced via the social network’s staff account earlier this week. The service had…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Shopsense AI lets music fans buy dupes inspired by red-carpet looks at the VMAs",
        "description": "At the MTV Video Music Awards (VMAs) on Wednesday night, new technology allowed fans to shop their favorite artists’ styles as they appeared on the screen. Though the drama from…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "A comprehensive list of 2024 tech layoffs",
        "description": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "ChatGPT: Everything you need to know about the AI-powered chatbot",
        "description": "ChatGPT, OpenAI’s text-generating AI chatbot, has taken the world by storm since its launch in November 2022. What started as a tool to hyper-charge productivity through writing essays and code…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "This startup is making manure out of other biogas power plants and now has $62M to play with",
        "description": "Working away on his PhD in Munich only a few years ago, Stephan Herrmann (now a doctor) couldn’t have conceived of a time when his idea for a carbon-negative power…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Faraday Future gives CEO and founder raises and bonuses after delivering 13 cars",
        "description": "Faraday Future is doling out big raises and bonuses to its CEO and its founder, despite having delivered just 13 cars in its 10-year history and recently laying off or…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Announcing the final agenda for the Space Stage at TechCrunch Disrupt 2024",
        "description": "We’re out-of-this-world excited to announce that we’ve finalized our dedicated Space Stage at TechCrunch Disrupt 2024. It joins Fintech, SaaS and AI as the other industry-focused stages — all under…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Bolt has quietly settled its lawsuit with Fanatics amid ongoing boardroom drama",
        "description": "Online sports apparel retailer Fanatics has agreed to settle and drop a lawsuit that it filed against troubled one-click payments provider Bolt in March, according to court documents obtained by…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Why Y Combinator companies are flocking to banking and HR startup Every",
        "description": "Rajeev Behera’s new all-on-one HR startup, dubbed Every, is either brilliant or crazy.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Threads makes it easier to evangelize the open social web with a new direct link feature",
        "description": "It’s a small advance, but one that speaks to Meta’s enginerring team paying attention to how the fediverse community is trying to educate Threads users about the possibilities.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Autonomous delivery startup Nuro pivots and another Indian EV scooter startup takes the IPO road",
        "description": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! The transportation…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "OpenAI unveils o1, a model that can fact-check itself",
        "description": "ChatGPT maker OpenAI has announced a model that can effectively fact-check itself by “reasoning” through questions.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Australian plan for misinformation law riles Elon Musk",
        "description": "The Australian government wants to fine social media platforms up to 5% of their global revenue if they fail to stop the spread of misinformation under a revised legislative plan…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Amazon and Flipkart violated competition laws in India, report says",
        "description": "An Indian antitrust regulator has found that Amazon and Flipkart, owned by Walmart, violated local competition laws, according to a report from Reuters. The finding presents a new challenge for…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-13T07:23:32.358536"
    },
    {
        "title": "Star’s drug test comes up ‘positive’",
        "description": "NSW Police have confirmed initial results of Josh Addo-Carr’s oral sample taken last Friday night have come up positive.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "AFL rocked by Dustin Martin bombshell",
        "description": "An AFL club has confirmed they have been in contact with retired Richmond great Dustin Martin over a potential return to footy in 2025.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Deep Cup run could help Socceroos ambitions",
        "description": "At least one Melbourne Victory player has extra reason for wanting his team to progress to the Australia Cup final.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "‘Not unconfident’: Bellamy’s good finals vibe",
        "description": "Storm coach Craig Bellamy is lapping up the rich talent available to him with just a single frontliner on the injury list ahead of a qualifying final showdown with Cronulla.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Free trade tracker: Every player linked with your club",
        "description": "Trade requests, the latest rumours and every player linked with your club. Stay across every big AFL trade story and see who could be on the move in our Trade Tracker.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "AFL rocked by Dustin Martin bombshell",
        "description": "An AFL club has confirmed they have been in contact with retired Richmond great Dustin Martin over a potential return to footy in 2025.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Star returns second ‘positive’ drug test",
        "description": "NSW Police have confirmed initial results of Josh Addo-Carr’s oral sample taken last Friday night have come up positive.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Operation fill AAMI Park: Storm blockbuster fills AFL finals void",
        "description": "Forget Sydney and Geelong – the best footy finals team of the 21st century launches its 14th-straight flag campaign with a home final in Melbourne on Saturday. Here’s why you shouldn’t miss it.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Wild scenes as seven wickets fall in last hour",
        "description": "There has been absolute carnage on the final day in England as the son of an Ashes legend starred in dramatic scenes.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "‘I’d love to’: Rebuilt bowler’s high-speed goal",
        "description": "An Australian fast bowler is still determined to break speed records as she prepares to break a six-year World Cup drought.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "’Fantastic’ Kokkinakis steals Davis Cup show",
        "description": "It’s a case of no Alex de Minaur no worries for the resurgent Australian Davis Cup team with two wins from two ties.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "‘Fantastic’: Special K steals Davis Cup show",
        "description": "It’s a case of no Alex de Minaur no worries for the resurgent Australian Davis Cup team with two wins from two ties.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Billionaire’s outrageous F1 plot exposed",
        "description": "What began as another bold — and potentially bogus — F1 rumour has quickly transformed into a tidal wave that threatens to flatten the paddock.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "McLaren’s huge call hangs Piastri out to dry",
        "description": "McLaren’s hunt for a first driver’s championship in 16-year has seen the team scrap its “papaya rules” as it chases down Red Bull’s lead.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Star breaks silence over wife’s Swift ‘feud’",
        "description": "Patrick Mahomes has opened up about politics as his wife and Taylor Swift have been in a controversy concerning Donald Trump.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "NFL great’s accidental X-rated Instagram clip",
        "description": "Shannon Sharpe has come clean about the his accidental Instagram Live post that had live audio of himself and a woman put in front of 3.2 million eyes.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Burrow’s Bengals aim to bounce back against Chiefs",
        "description": "Joe Burrow and the Cincinnati Bengals are aiming to avoid a second NFL defeat this weekend, but in their way are Patrick Mahomes and the Chiefs.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Coach breaks down over NFL star’s arrest",
        "description": "Footage of an NFL superstar’s police confrontation has been released, with his coach getting emotional addressing the incident.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Deep Cup run could help Socceroos ambitions",
        "description": "At least one Melbourne Victory player has extra reason for wanting his team to progress to the Australia Cup final.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Interim coach to take charge of Matildas",
        "description": "Matildas fans will get two chances to see the team play on home soil in December.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "The rising star who could derail Volk’s title plans",
        "description": "Australian UFC great Alex Volkanovski has competition for the featherweight title he craves with Brazilian fighter Diego Lopes believing that a win over American Brian Ortega at UFC 306 will give him first crack.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Rory’s ‘message’ as merger stalls",
        "description": "As the golf world sits in limbo waiting for a new deal between the PGA Tour and LIV’s Saudi backers, Rory McIlroy has a message for officials.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "New Zealand are NBL team to avoid",
        "description": "The NBL season is here and it is becoming clear there is an obvious team that coaches want to avoid early in the season.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Shock response to record Wallabies loss",
        "description": "A shellacking in Argentina for the Wallabies hasn’t resulted in mass changes for the next even more imposing challenge.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "King Charles like we’ve rarely seen him",
        "description": "King Charles has been swamped by the New Zealand women’s rugby team after he gave them permission to break royal protocol.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "Everest audition at Flemington for Growing Empire",
        "description": "Growing Empire could book a ticket to The Everest with victory on Saturday in the Listed Poseidon Stakes at Flemington.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-13T07:23:34.099124"
    }
]