[
    {
        "title": "Migrant crackdown risks choking off critical supply of US workers",
        "description": "President Donald Trump's crackdown on immigrants could have serious economic repercussions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Canada passes law fast-tracking 'nation-building' projects to counter Trump",
        "description": "The government hopes the legislation will reduce dependence on the US, but has drawn criticism from environmental groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Rising school fees push Indian families to the brink",
        "description": "Parents accuse private schools of steep fee raises which are stretching budgets to breaking point.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Pound hits near 4-year high as Trump rattles dollar",
        "description": "A report that the US President could name the new head of the central bank early raises concerns over its independence.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Canada passes law fast-tracking 'nation-building' projects to counter Trump",
        "description": "The government hopes the legislation will reduce dependence on the US, but has drawn criticism from environmental groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Nike says Trump tariffs could raise its costs by $1bn",
        "description": "Company executives say the sportwear giant will cut its reliance on producing goods in China to ease the impact of US trade policies.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "The woman who could bust Trump's 'big beautiful bill'",
        "description": "The Senate parliamentarian, often called a referee, has thrown a spanner in Trump's tax bill.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "A look at the key items in Trump's 'big, beautiful bill'",
        "description": "The tax and spending bill, which must still pass in the Senate, includes sweeping changes to the tax code, Social Security and more.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Why your old mobile phone may be polluting Thailand",
        "description": "The Asian nation is importing thousands of tonnes of electronic waste per year, despite a ban.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Russia's economy is down but not out",
        "description": "The country's economy has been surprisingly resilient but there are underlying problems.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Markets near record highs despite headwinds - 26 Jun 2025",
        "description": "Expert says investors are buying into reduced uncertainty.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Should we be letting flies eat our food waste?",
        "description": "In Lithuania and Australia, hungry fly larvae are used to process food waste into useful protein.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Anna Wintour stepping back as US Vogue's editor-in-chief",
        "description": "Dame Anna, who has been editor-in-chief for 37 years, will continue to hold a senior role at the company.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "'Made in the USA' reference disappears from Trump phone listing",
        "description": "Trump Mobile maintains the gold smartphone will be made in the US, despite the  changed wording on its website.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "BBC website in US launches paid subscription service",
        "description": "US-based users will have to pay $49.99 (£36) a year for access to most BBC News content.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "North Korea to open beach resort as Kim bets on tourism",
        "description": "Wonsan Kalma opens to domestic tourists on 1 July, six years after it was due to be completed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Thailand's 'weed wild west' faces new rules as smuggling to UK rises",
        "description": "A number of British travellers have been arrested and prices have collapsed due to overproduction.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "'Our food doesn't even last the month': Americans brace for Trump's welfare cuts",
        "description": "About 16% of West Virginians rely on a federal food subsidy programme that is facing big cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "The virtually abandoned Florida airport being turned into 'Alligator Alcatraz'",
        "description": "Surrounded by alligator infested swamps, BBC Mundo visited the site forming part of the Trump administration's mass deportation agenda.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Trump says Nato's new 5% defence spending pledge a 'big win'",
        "description": "Nato leaders meeting in The Hague say they have an \"ironclad commitment to collective defence\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Ticket resellers employ overseas workers to bulk-buy",
        "description": "An undercover probe finds workers help touts make money from gigs including Oasis and Taylor Swift.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Pledge to protect UK firms from cheap imports",
        "description": "The government's plan comes as UK businesses worry about the impact of US President Donald Trump's trade tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Deal or no deal? Zimbabwe still divided over land 25 years after white farmers evicted",
        "description": "Some white farmers accept compensation 25 years after land reform began - others fight on.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Turmoil and trade wars dominate China's 'summer Davos'",
        "description": "The conflict between Iran and Israel adds further uncertainty to an already strained global outlook.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Bumble to axe almost a third of staff as dating app struggles",
        "description": "The firm's founder became the world's youngest self-made female billionaire when it launched on the US stock market.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "US judge backs AI firm over use of copyrighted books",
        "description": "A US court has ruled Anthropic was not breaching copyright rules when it trained its AI model on books.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "Eurostar services returning to normal after major disruption",
        "description": "The rail operator says that repairs are now complete, but delays are expected until the end of Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-27T07:28:30.003533"
    },
    {
        "title": "How Bollywood, Cabs and MetroCards Led to Zohran Mamdani’s Winning Visual Campaign",
        "description": "The New York mayoral candidate — who shocked the establishment by triumphing in the Democratic primary — broke all the rules with his run's striking visual identity.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "Background Performer at Kendrick Lamar Halftime Show Arrested Over Gaza Sudan Flag",
        "description": "Four months after the show, Louisiana State Police confirmed they arrested New Orleans resident Zul-Qarnain Kwame Nantambu on charges of resisting an officer and disturbing the peace by interruption of a lawful assembly.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "How Diddy’s Right-Hand Woman Became the Phantom of His Trial",
        "description": "Kristina Khorram — known as \"KK\" and compared to Jeffrey Epstein associate Ghislaine Maxwell by producer Lil’ Rod Jones in his civil suit against Combs— has yet to face any charges, despite becoming an unseen star player at the former mogul's sensational trial.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "The Weeknd Kicks Off Sold-Out Four-Night Stand in Los Angeles",
        "description": "\"I came back with a vengeance,\" the superstar said, performing at the venue where he lost his voice and had to stop the show mid-performance back in 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "SiriusXM Goes All In on K-Pop Programming",
        "description": "Between station takeovers, in-studio interviews and regular music programming, the satellite radio company shows no signs of slowing down when it comes to K-Pop.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "Before Biting Incident, ‘Cobra Kai’ Star Martin Kove Had “Weird Mind F***” Encounter with Bill Hader",
        "description": "In 2013, the 'SNL' alum shared a strange story of petty, rude behavior while he was a driver on film sets in the late '90s.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "That’s It, The F-Word Is Officially Boring",
        "description": "Just go ahead and say it, nobody minds anymore. Political leaders cursing into hot mics was just the final boss of \"f**k\" losing all its punch and provocation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "BBC Introduces News Paywall for U.S. Users",
        "description": "The U.K. news channel, with BBC Studios, is introducing a paywall model starting at $49.99 per year or $8.99 per month.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "The Liver King Gets Out of Jail and Doubles Down: “The Videos Will Never Stop”",
        "description": "Brian Johnson posted a new video discussing his arrest for making a terroristic threat against Joe Rogan and continued to hint that he wanted to fight the podcaster despite now being under a restraining order.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "Scarlett Johansson, Matt Damon, Kristin Chenoweth Sign Open Letter Opposing SNAP, Medicaid Cuts: “This Is Unacceptable and Wrong”",
        "description": "“We call on Congress to reject cuts to these vital programs that help millions put food on their tables and provide access to health care,” the document reads.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "Sabrina Carpenter Debuts Alternate ‘Man’s Best Friend’ Cover That’s “Approved by God” Amid Online Backlash",
        "description": "In the new art, the Grammy winner glamorously clutches onto a man in a suit with a few other stray men in the background.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    },
    {
        "title": "Sean “Diddy” Combs Tells Judge He Will Not Testify at His Trial",
        "description": "On Tuesday, both prosecutors and the defense rested their cases. The hip-hip mogul potentially faces life in prison if found guilty.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-27T07:28:30.445028"
    }
]