[
    {
        "title": "UK and India to relaunch trade talks in Delhi",
        "description": "British trade secretary Jonathan Reynolds is in Delhi to kick-start two days of discussions on the deal.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Key US agencies tell staff not to answer Musk email on what they did last week",
        "description": "Some departments encouraged staff to respond, while others requested employees wait for further guidance.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Trump administration to cut thousands of jobs at Pentagon and IRS",
        "description": "The cuts targeting mostly new and recently promoted workers are part of the administration's push to shrink the federal work force.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Cryptocurrency theft of £1.1bn could be biggest ever",
        "description": "Dubai-based Bybit said it could afford to reimburse customers and that it was working to find the hackers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Key US agencies tell staff not to answer Musk email on what they did last week",
        "description": "Some departments encouraged staff to respond, while others requested employees wait for further guidance.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "List weekly accomplishments or resign, Musk tells US federal workers",
        "description": "The weekend email comes as Elon Musk leads an effort to aggressively curtail the government workforce.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Can Canadians get the world drinking tree sap?",
        "description": "The largest producer of maple syrup now wants you to drink the sap, which it calls maple water.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "BMW delays electric Mini over 'uncertainty'",
        "description": "The vehicle manufacturer says \"multiple uncertainties\" in the industry led to its decision.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Musk wields his Doge chainsaw - but is a backlash brewing?",
        "description": "Facing constituents angry about the impact of sweeping government job cuts,  some Republicans are expressing concern.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "BBC undercover filming exposes Indian pharma firm fuelling opioid crisis",
        "description": "An Indian drug maker tells a BBC undercover team its addictive cocktail drug is “very harmful” but “this is business”.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Scotch makers condemn English single malt whisky proposal",
        "description": "Scottish distilleries and MPs claim England's methods would damage the reputation of single malt.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "'I make more in one hour on TikTok than a day in the shop'",
        "description": "Laura Mallows sells most of her products via TikTok but \"dreams\" of opening a physical shop once more.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Apple pulls data protection tool after UK government security row",
        "description": "Customers' photos and documents stored online will no longer be protected by end-to-end encryption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Man offers to split winnings after thieves hit jackpot with his credit card",
        "description": "The Frenchman has called on the thieves to strike a deal with him to split the €500,000 (£413,664) prize.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Coinbase boss claims SEC will drop crypto lawsuit",
        "description": "The SEC's 2023 lawsuit formed part of a crackdown on crypto firms which President Trump pledged to reverse.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Farmers say bird flu a 'crisis' as egg prices soar",
        "description": "Farmers say they are losing the fight against bird flu as Trump officials propose vaccines for birds.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "St Pancras plans for direct trains from UK to Germany",
        "description": "The London station's owner and Eurotunnel hope to expand routes to Cologne, Frankfurt and Switzerland.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "What does Jack Ma's return to the spotlight mean?",
        "description": "Analysts say the Alibaba founder's re-emergence could signal a policy change in Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "UK government finances in surplus but pressure builds on Reeves",
        "description": "Chancellor faces a rising challenge to keep her tax and spending plans on track after missing forecasts.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Trump 'very frustrated' and Zelensky must strike minerals deal, says adviser",
        "description": "The comments overshadowed Zelensky's meeting with US envoy Keith Kellogg in Kyiv.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Trump's '$21m for voter turnout' claim triggers political row in India",
        "description": "The governing BJP has accused the opposition Congress of seeking \"external interference\" in elections.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Passengers on crashed Toronto plane offered US$30,000 each",
        "description": "The gesture to the affected travellers - all of whom survived - comes with no strings attached, the airline says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "The tiny Danish town transformed by Ozempic",
        "description": "American demand for weight-loss drugs is supercharging Denmark’s economy and transforming a small Danish community into an unlikely boomtown.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Birkenstock sandals are not art, says German court",
        "description": "The firm wanted to claim protection under copyright law, to stop rivals selling copycat versions of its shoes.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "What will Amazon do with James Bond?",
        "description": "Long-serving masterminds Barbara Broccoli and Michael G Wilson give creative control to Amazon.",
        "source": "BBC Business",
        "fetched_date": "2025-02-24T07:23:50.486053"
    },
    {
        "title": "Kamala Harris Urges Collective Action in Troubled Time at NAACP Image Awards: “We Have No Illusions About What We Are Up Against”",
        "description": "The former vice president, who received an enthusiastic show of support as she accepted the Chairman's Award, said, \"This chapter will not be written simply by whoever occupies the Oval Office or wealthiest among us. The American story will be written by you, by we the people.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Spirit Awards: Justin Simien Shares Plan for “Stopping the White Nationalist Coup Taking Over This Country”",
        "description": "The writer-director, who won best new nonscripted or documentary series for 'Hollywood Black,' delivered one of a handful of political comments during Saturday's awards show.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Do Couples That Sing Together Stay Together? Tate McRae and The Kid Laroi, Sonny & Cher and More Star-Studded Duets",
        "description": "From Beyoncé and Jay-Z to Camila Cabello and Shawn Mendes, take a look at the celebrity couples who have recorded songs together.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Matt Gaetz Claps Back at ‘Reacher’ Star Alan Ritchson for Calling Him a “Motherf***er”",
        "description": "\"We were not adversaries. He’s just trying to get Hollywood attention,\" the controversial politician says about the actor.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Dana Carvey Says Lorne Michaels Is Intrigued by Blake Lively-Justin Baldoni Legal Battle",
        "description": "The 'SNL' boss shared his commentary on the feud with the former castmember.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Tate McRae Draws Large Crowd to Kia Forum Parking Lot for Album Release Event",
        "description": "The “Greedy” singer debuted several new songs at the fan-focused event Thursday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "AP Sues Trump Administration Officials After White House Ban",
        "description": "The ban came after the Associated Press continued to use the phrase \"the Gulf of Mexico\" after Trump said he had renamed it \"the Gulf of America.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "New Kennedy Center President Says Trump Wants to “Make Art Great Again”",
        "description": "Ric Grenell says that the performing arts institution is planning a \"huge celebration of the birth of Christ\" for December.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Mayor Karen Bass Fires L.A. Fire Chief Following Deadly Wildfires",
        "description": "Bass said Friday that she \"met with and removed Kristin Crowley as fire chief effective immediately.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Voletta Wallace, Notorious B.I.G.’s Mother, Dies at 78",
        "description": "She was an outspoken advocate for her son and his memory in the wake of his 1997 death.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Tom Hanks and Rita Wilson Donate $1M for L.A. Wildfire Relief Efforts",
        "description": "The beloved couple is spreading funds across the Motion Picture and Television Fund, the Los Angeles Fire Foundation, SAG-AFTRA Foundation Disaster Relief Fund, the American Red Cross and MusiCares.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Grimes Says Elon Musk Is Ignoring “Child’s Medical Crisis”",
        "description": "The musician and producer made a public plea to the the tech mogul on his own social media platform, X, to try to get his attention.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-24T07:23:51.470670"
    },
    {
        "title": "Raiders stars evicted over Vegas fight named",
        "description": "The Canberra Raiders have confirmed two players from the NRL club are facing discipline over a hotel fight in Las Vegas.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Explicit texts leaked, $130m star goes viral",
        "description": "A popular American star has had illicit texts leaked with a viral video showing him being confronted over a cheating affair.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Rozee: Why Power succession plan will work",
        "description": "Port Adelaide captain Connor Rozee is confident one of the Power’s strengths will help transitioning coaches Ken Hinkley and Josh Carr.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Player motionless after horror king hit",
        "description": "The football world has been completely stunned by a shocking king hit in a South American match that left a player sprawled on the turf.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Aussie cricket icon pens final goodbye",
        "description": "Australian sporting legend Ian Chappell has stunned the cricket world with an announcement out of nowhere.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "India gets its way as cricket ‘farce’ slammed",
        "description": "A Virat Kohli masterclass put Pakistan on the brink of elimination, but the cricket world is fuming at the treatment India has received.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Tennis rocked as stars spill horror stories",
        "description": "Alex de Minaur’s fiancee has revealed a terrifying experience as the tennis world reckons with a truly horrific incident this week.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "New footage says it all in Raducanu drama",
        "description": "New footage of the moment that left tennis star Emma Raducanu hiding and in tears after spotting a “fixated” fan has been revealed.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Rozee: Why Power succession plan will work",
        "description": "Port Adelaide captain Connor Rozee is confident one of the Power’s strengths will help transitioning coaches Ken Hinkley and Josh Carr.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "How ‘lowering the eyes’ will help Crows",
        "description": "Adelaide skipper Jordan Dawson says the Crows are attacking 2025 with a narrow-minded approach to avoid another missed opportunity.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Raiders stars evicted over Vegas fight named",
        "description": "The Canberra Raiders have confirmed two players from the NRL club are facing discipline over a hotel fight in Las Vegas.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Roosters star in bombshell NRL rumour",
        "description": "Rumblings have emerged a Roosters enforcer is unhappy at the glamour club, with the Origin player eyeing an early exit from his contract.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "‘It’s greed’: Footy divided over $1.2m trend",
        "description": "“Exciting” AFL and NRL off-seasons with more player movement than ever has exposed a modern new reality about the footy codes.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Explicit texts leaked, $130m star goes viral",
        "description": "A popular American star has had illicit texts leaked with a viral video showing him being confronted over a cheating affair.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Trudeau’s brutal 11-word message to Trump",
        "description": "Canadian PM Justin Trudeau has delivered a blunt message to US President Donald Trump as tension between the nations continues to simmer.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Player motionless after horror king hit",
        "description": "The football world has been completely stunned by a shocking king hit in a South American match that left a player sprawled on the turf.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Kerr backed to return to her best",
        "description": "The Matildas have suffered another loss, but the eventual return of Sam Kerr from injury should improve them, according to her former Chelsea manager.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Star rushed to hospital in boxing insanity",
        "description": "A boxing beast has got his world title revenge as a star was rushed to hospital on a wild night that has stunned boxing commentators.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Clean sweep: Waters the driver to beat after wet and wild win",
        "description": "Cam Waters has produced a stellar opening round clean sweep on a wet and wild Sydney track, claiming all three race wins to stamp himself as the driver to watch this season.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Driver fined, relegated to last after embarrassing teammate crash",
        "description": "Teammates Aaron Love and James Courtney were involved in a bizarre collision at the start of Supercars qualifying which left their team principal fuming.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "NBA legend gets new Aussie teammate",
        "description": "The greatest shooter in NBA history could be getting passes from a young Aussie star following reports that he has signed with the Warriors.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "‘Crazy’ moment lifts Voke to Webex Players Series Sydney",
        "description": "Nick Voke continued New Zealand’s recent golden run on the PGA Tour of Australasia, taking out the Webex Players Series Sydney title. And there’s a moment the part-time content creator is keen to watch back.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Harley wants to savour same dream as Cup champ",
        "description": "Martin Harley harbours dreams of emulating fellow Irishman Robbie Dolan’s glorious Melbourne Cup triumph but for now, the Brisbane-based jockey will take his first Group 1 victory in Australia.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Aussies claim bronze in Vancouver",
        "description": "The Aussie women had to settle for bronze in Vancouver after they were thumped by their biggest rivals in the semi-final.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Wright close to returning for Reds",
        "description": "As desperate as Liam Wright is to return from a shoulder injury for the Reds, the Queenslanders aren’t expected to risk him while there is any doubt over his fitness.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "Student collapses, dies at rowing training",
        "description": "The 17-year-old Melbourne student collapsed after finishing a training session on a rowing machine.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    },
    {
        "title": "‘Wicked’: AFL WAG compared to conwoman",
        "description": "An AFL player’s beloved wife, who is suffering from terminal cancer, has revealed she’s been compared to conwoman Belle Gibson.",
        "source": "News AU",
        "fetched_date": "2025-02-24T07:23:53.504427"
    }
]