[
    {
        "title": "Meta is ditching fact checkers for X-style community notes. Will they work?",
        "description": "Many have questioned Meta's motivations for ditching fact checkers - but could it be a positive change?",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Growth at all costs? Why Reeves is in a sudden rush on the UK economy",
        "description": "The chancellor raised taxes in the Budget - but now she wants to get rid of barriers to business. Why the change of focus?",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Davos elite nod along as Trump delivers ultimatum",
        "description": "President Trump's 'America First' message takes shape, as the rest of the world begins to digest what it might mean for them and global trade.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "'I fled Ukraine as a refugee - now I've won investment on Dragons' Den'",
        "description": "Yana resettled in Huddersfield and set up business importing clothing from Ukraine to distribute.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Growth at all costs? Why Reeves is in a sudden rush on the UK economy",
        "description": "The chancellor raised taxes in the Budget - but now she wants to get rid of barriers to business. Why the change of focus?",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "'I don't want to buy a £4 coffee just so I can use the loo'",
        "description": "Should cafés let people who don't buy anything use their toilets?",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Elon Musk, MrBeast, Larry Ellison: Who might buy TikTok?",
        "description": "Several potential US buyers have expressed interest in purchasing the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "The French winemaker whose wines are illegal in his home country",
        "description": "Maxime Chapoutier makes wines that combine French and Australian grapes, a strict no-no in the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "'A mockery': Trump's new meme-coin sparks anger in crypto world",
        "description": "The president's meme-coin launch is being criticised as a stunt, while impatience grows for deregulation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Does China 'operate' Panama Canal, as Trump says?",
        "description": "The US president says the US should \"take back\" the famous waterway because China runs it now.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Leaders leave Davos with 'cautious optimism' - 24 Jan 2025",
        "description": "As the World Economic Forum closes, senior WEF official says leaders leave Davos with constructive optimism.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Trump urged not to put massive tariffs on UK",
        "description": "Business Secretary Jonathan Reynolds says there is no need for tariffs because the US has no goods trade deficit with the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Bank of Japan raises rates to highest in 17 years",
        "description": "The move comes hours after economic data showed prices rose last month at the fastest pace in 16 months.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Clampdown on fake Google reviews announced",
        "description": "Businesses which boost their star ratings will have warnings attached to them - fake reviewers will be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "US doesn't need Canadian energy or cars, says Trump",
        "description": "Speaking to business leaders in Davos, Trump also repeated his jibe that Canada could become a US state and would avoid tariffs if it did.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "UnitedHealthcare names new boss after former CEO killed",
        "description": "The company's former chief executive Brian Thompson was shot and killed in December.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Rolls-Royce strikes £9bn nuclear submarine deal",
        "description": "A deal for nuclear submarine reactors is agreed between the Ministry of Defence and Rolls-Royce.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "US government workers told to report DEI efforts or face 'consequences'",
        "description": "Government employees received emails threatening \"consequences\" if they did not report DEI work to the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Purdue and Sackler family agree $7.4bn opioid settlement",
        "description": "Under the terms, the opioid maker agreed to pay $900m, and the family behind it agreed to pay up to $6.5bn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Trump urges Opec countries to slash oil prices",
        "description": "The president says he wants Opec and Saudi Arabia to bring down the price of oil which he says is fuelling the Russia-Ukraine war.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "EU 'could consider' UK joining pan-Europe customs scheme",
        "description": "The UK joining the Pan-Euro-Mediterranean Convention is up for discussion in reset talks, says Maros Sefcovic.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Meta denies forcing users to follow Trump accounts",
        "description": "The Facebook and Instagram owner says the official profiles were updated to reflect the new position holders.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Canada offers to help Trump as it scrambles to avert tariff war",
        "description": "Prime Minister Justin Trudeau has threatened the stick against proposed US tariffs. Now he's trying a different approach.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "LinkedIn accused of using private messages to train AI",
        "description": "The lawsuit alleges LinkedIn tried to conceal its actions but the firm says the claims are false.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Trump puts all US government diversity staff on paid leave 'immediately'",
        "description": "A new executive order signed on Tuesday calls for an end to DEI practices in the federal government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Tesco, Aldi and Lidl hit back at UK farm inheritance tax",
        "description": "Tesco, Aldi and Lidl call for rethink of inheritance levy announced in Budget",
        "source": "BBC Business",
        "fetched_date": "2025-01-26T07:20:35.128480"
    },
    {
        "title": "Jesse Eisenberg on Tech Bros Pivoting to Politics: “Why Are They Not Spending Every Day Helping People?”",
        "description": "The actor, who notably portrayed Mark Zuckerberg in 'The Social Network,' made an appearance on 'Real Time With Bill Maher.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "K-Pop Festival KCON Announces 2025 L.A. Return",
        "description": "The CJ ENM-produced festival will kick off its 2025 season in Japan before returning to L.A. this summer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Pete Hegseth Confirmed as Trump’s Defense Secretary in Tie-Breaking Vote",
        "description": "Vice President J.D. Vance was on hand to cast a tie-breaking vote, unusual in the Senate for Cabinet nominees, who typically win wider support.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Sterling K. Brown Gives Update on ‘This Is Us’ Co-Stars Mandy Moore and Milo Ventimiglia, Who Lost Their Homes to the L.A. Fires",
        "description": "The Emmy winner revealed that he's spoken to both of his former TV family members since the fires occurred and says, \"It's difficult ... It’s one day at a time.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "‘What If…?’ Writer A.C. Bradley Lost Her Home in the L.A. Fires. Now She Faces Her Own ‘What If…?’ Moments With Young Daughter",
        "description": "The scribe and her three-year-old were out of the country when the blaze took their Altadena home, and are now trying to rebuild their lives.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Marilyn Manson Won’t Be Charged After Long Investigation of Sexual Assault Allegations",
        "description": "Los Angeles County District Attorney Nathan Hochman said the allegations are too old under the law and the evidence is not sufficient to charge the 56-year-old shock rocker.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Björk on Her Wild New Apple TV+ Concert Film, ‘Cornucopia’: “Something I Hadn’t Done Before”",
        "description": "The Icelandic songstress used VR technology and bespoke flutes to create what she calls \"digital theater.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Billy Ray Cyrus’ Ex-Wife “Genuinely Worried” After That Viral Performance",
        "description": "Firerose joins Trace Cyrus in speaking out about the country singer's condition following his \"disaster\" performance.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Dick Van Dyke Reveals His Longevity Secret at 99",
        "description": "The centenarian actor breaks down his exercise routine that he says has resulted in his long life.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Teddy Swims on Creating a New Album That “You Can Make Love and Cry to”",
        "description": "The Hollywood Reporter's newest \"Person of Interest\" is the singer-songwriter who just dropped the second part of his debut album, 'I've Tried Everything But Therapy,' ahead of the Grammys, where he is nominated for the first time.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Grammys Performers: Billie Eilish, Sabrina Carpenter, Charli XCX and Chappell Roan",
        "description": "Shakira, Benson Boone, Doechii, RAYE and Teddy Swims will also hit the stage at the Feb. 2 event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "Hans Zimmer in Talks to Re-create Saudi Arabia’s National Anthem",
        "description": "The Oscar-winning composer met with the country’s chairman of the General Entertainment Authority to discuss various collaborations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-26T07:20:35.324401"
    },
    {
        "title": "I’m A Celeb star’s tears over news from home",
        "description": "There will be tears all around on Sunday night’s episode of I’m A Celebrity when one of the campers receives some surprising news from home.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Tszyu targets huge home soil comeback",
        "description": "Australian boxer Tim Tszyu is aiming to return to the ring in April as he looks to bounce back from a second straight world title defeat.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Proof star’s AO fairytale was truly ridiculous",
        "description": "A telling stat has laid bare the brilliance of US underdog Madison Keys, with big names like Ash Barty, Aryna Sabalenka and Naomi Osaka falling short.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Melbourne United deliver another blow to injury hit Brisbane",
        "description": "Melbourne United has added to the Brisbane Bullets’ woes with a thumping win as big man Marcus Lee made his presence felt. Catch up on the latest NBL news.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Cheeky act sparks ‘spirit of cricket’ debate",
        "description": "Tom Curran appears to have learnt nothing from Jonny Bairstow’s costly Ashes mistake but his blushes were saved by an act of true sportsmanship.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Mooney magic lifts Aussies to Ashes win",
        "description": "A superb unbeaten half-century to Beth Mooney propelled Australia to a commanding 72-run win in Saturday night’s T20 International against England at Adelaide Oval, the result continuing the visitors’ Women’s Ashes nightmare.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Proof star’s AO fairytale was truly ridiculous",
        "description": "A telling stat has laid bare the brilliance of US underdog Madison Keys, with big names like Ash Barty, Aryna Sabalenka and Naomi Osaka falling short.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Has Big Three’s ‘invisible barrier’ broken Novak?",
        "description": "Novak Djokovic’s semi-final retirement sent the Aus Open into a tailspin but one remarkable stat could show his latest injury might not be much of a shock. FOLLOW MEN’S FINAL DAY LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "AFL commentator earns prestigious honour",
        "description": "Sports broadcasting pioneer and Fox Footy icon Kelli Underwood has been recognised with an Order of Australia for Services to Broadcasting.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "AFL star’s shocking act sparks media storm",
        "description": "Melbourne forward Kysaiah Pickett has sent shockwaves through the AFL world with a bizarre act on social media.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Broncos star cops huge reality check",
        "description": "Reece Walsh endured a difficult 2024 season and an NRL legend believes he will struggle even more in 2025 if he doesn’t make a necessary move.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Hayne’s rugby league return hits major snag",
        "description": "Jarryd Hayne’s attempt to return to the NRL has been dealt a huge blow with the ex-Eels star forced to withdraw from his comeback game.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Steph Rice reveals fears she joined a ‘cult’",
        "description": "Stephanie Rice has shared eye-opening details about her family’s fear that she had “lost her mind” before marrying her pastor husband.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Aussie GOAT makes shock career call",
        "description": "She took last year off competition and still spent the year surfing, and now Steph Gilmore has decided what she’ll be doing in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "‘Best I’ve ever seen’: NBA in disbelief",
        "description": "Nikola Jokic may well be the best basketball player on planet earth right now after the Denver Nuggets sensation did the unthinkable.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Huge snub as NBA All-Star starters named",
        "description": "Teams for the NBA’s new-look All-Star Game have been announced and some big-name players have been overlooked.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Mary Fowler act stuns after Matildas drama",
        "description": "Mary Fowler is back in action for Manchester City and she’s produced more fireworks after her Matildas teammate left the club this week.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Aussie striker scores on debut for Portsmouth",
        "description": "It wasn’t the result he wanted, but teenage Australian striker Thomas Waddingham hasn’t wasted any time in finding the back of the net for his new English Championship club.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Tszyu targets huge home soil comeback",
        "description": "Australian boxer Tim Tszyu is aiming to return to the ring in April as he looks to bounce back from a second straight world title defeat.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "F1 world in meltdown over Hamilton photo",
        "description": "Seven-time world champion Lewis Hamilton has sent the F1 world into a spin over a simple photo he shared on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Melbourne United deliver another blow to injury hit Brisbane",
        "description": "Melbourne United has added to the Brisbane Bullets’ woes with a thumping win as big man Marcus Lee made his presence felt. Catch up on the latest NBL news.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Dutton hits back at lunch scheme dig",
        "description": "Peter Dutton has hit back at recent criticism of an Opposition election pledge to give small businesses $20,000 of tax-deductible lunches.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Brad Waters’ horses to follow and forgive from Sandown Lakeside",
        "description": "Racenet’s Brad Waters provides his runners to both follow and forgive from racing at Sandown Lakeside on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Wallabies skipper warns of ‘massive risk’",
        "description": "The Wallabies captain has urged Australian players to think about the 2027 Rugby World Cup when deciding about their future.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-01-26T07:20:37.729657"
    }
]