[
    {
        "title": "Son of Estee Lauder, who took the brand global, dies aged 92",
        "description": "Leonard Lauder joined his parents' company in 1958 and served as chief executive for 17 years.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "The reality behind Trump's incredible investment claims",
        "description": "The president's impact on investment in the US is far more incremental than he has claimed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Global oil prices soar after Israel attacks Iran",
        "description": "The cost of crude oil affects everything from the price of food at the supermarket to how much it costs to fill up your car.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Fifa, the Club World Cup and Saudi Arabia",
        "description": "A detailed look at the figures behind the Fifa Club World Cup, and how investment from Saudi Arabia appears to be underpinning the tournament.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "The reality behind Trump's incredible investment claims",
        "description": "The president's impact on investment in the US is far more incremental than he has claimed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Can shoes be made in the US without cheap labour?",
        "description": "American production is possible, but it often needs to be automated to be cost effective.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Hiding in the fields - farm workers fearing deportation stay in California's shadows",
        "description": "Immigration raids on American farms are having ripple effects across the agricultural industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "The women at the centre of Somalia's construction boom",
        "description": "Mogadishu's rapid expansion after decades of war is giving unexpected opportunities in a male-dominated society.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Indian scientists search for the perfect apple",
        "description": "India can't grow enough apples to meet demand but farmers are struggling to raise production.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "A Serbian landmark bombed by Nato could get Trump makeover",
        "description": "The Serbian project, led by Trump's son-in-law Jared Kushner, has run into opposition and scandal.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Oil prices soar after Israel strikes on Iran - 13 Jun 2025",
        "description": "Energy expert talks about the market's reactions to the attack.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "From festivals to weddings: Why drone shows are booming",
        "description": "Light shows involving hundreds and even thousands of drones are becoming big attractions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Meta AI searches made public - but do all its users realise?",
        "description": "Meta AI users may be inadvertently making their searches public without realising it.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "How the Israel-Iran conflict could affect energy prices",
        "description": "Conflict in the Middle East often leads to higher energy prices, which can feed through to inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "What does the Air India crash mean for Boeing?",
        "description": "Until Thursday's tragic Air India crash in Ahmedabad, Boeing's 787 Dreamliner had an exemplary safety record.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Sweets from US company could damage DNA and increase cancer risk, UK agency warns",
        "description": "The FSA says chemical compounds in the sweets can increase the risk of cancer and damage DNA.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "China ready to drop all tariffs on African imports",
        "description": "The move comes as the continent's exports face the possibility of high tariffs from the US.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Reeves refuses to rule out tax rises after UK economy shrinks",
        "description": "The chancellor highlights \"uncertainty\" in the world as economists warn of tax rises if the economy fails to grow.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Human-sized Labubu doll sells for more than $150,000",
        "description": "The 131cm-high figurine was sold at the Yongle International Auction in Beijing.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "These scalpers made millions - and claimed staff at big ticketing firms helped",
        "description": "The touts alleged staff at resale sites Ticketmaster once owned helped them trade in bulk, the BBC reveals.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Trump says rare earths deal 'done' with China",
        "description": "The world's two biggest economies have agreed in principle a framework for de-escalating trade tensions.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "The Korean bakery chain that says croissants don't have to be French",
        "description": "Asian bakeries are seeing success at home and abroad by bringing global flavours to traditional French pastries.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Disney and Universal sue AI firm Midjourney over images",
        "description": "The Hollywood studios allege Midjourney's image generator is a \"bottomless pit of plagiarism\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Is Test cricket financially sustainable?",
        "description": "As Australia and South Africa contest the World Test Championship final, BBC Sport addresses the longer format’s future financial viability.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "Elon Musk says he regrets some posts about Donald Trump",
        "description": "The billionaire says his posts went \"too far\" after attacking the US president's planned tax and spending bill.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "WhatsApp tells BBC it backs Apple in legal row with UK over user data",
        "description": "The messaging app says the UK government's demands over data access could set a \"dangerous precedent.\"",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "US inflation ticks higher but tariff impact remains muted",
        "description": "Higher prices for some items were offset by declines in other areas, such as petrol, airfares and clothing.",
        "source": "BBC Business",
        "fetched_date": "2025-06-16T07:29:30.411558"
    },
    {
        "title": "CNN’s Scott Jennings on Being Stranded in Israel Amid War With Iran: “How Are We Going to Get Out of Here?”",
        "description": "The conservative commentator was touring Hamas atrocity sites when Operation Rising Lion broke out.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Nordstrom’s 30+ Best Summer Beauty Essentials to Shop at Up to Half Off Right Now",
        "description": "Through June 15, score up to 50 percent off hot weather-friendly skin care, makeup, hair care, beauty tools and more; plus, earn triple the beauty points or score a gift with purchase on select products.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Kanye “Ye” West Makes Brief Appearance at Sean “Diddy” Combs Trial",
        "description": "The rapper arrived at the federal courthouse in Manhattan on Friday morning, apparently in support of the fallen mogul, whose sex trafficking and racketeering trial is ongoing.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Caitlyn Jenner’s Israel Pride Parade Visit Disrupted by Iran War Breakout",
        "description": "“My heart is with Israel now and forever,” the former Olympian and transgender activist said on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "‘Friday the 13th’ House “Jason Universe” Announced for Halloween Horror Nights 2025",
        "description": "Universal Studios in both Hollywood and Florida is taking fans back to the terror of Camp Crystal Lake 45 years after the film’s release.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Mike Love Pays Tribute to Brian Wilson at Songwriters Hall of Fame Induction: “I Do Feel His Presence”",
        "description": "Love, a founder member of The Beach Boys, was inducted alongside music legends George Clinton, and The Doobie Brothers' Michael McDonald, Tom Johnston and Patrick Simmons",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Appeals Court Temporarily Blocks Judge’s Ruling to Return Control of National Guard to California",
        "description": "Earlier Thursday, U.S. District Judge Charles Breyer ruled the Guard deployment was illegal and both violated the 10th Amendment and exceeded President Trump's statutory authority.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "The Hollywood Reporter and GLAAD Celebrate Pride at Glittery Bash: “More Than Ever, It’s Important to be Loud, Proud and Vocal”",
        "description": "The Celebration of Pride '25, presented by Paramount+ FYC, brought a slew of guests from the LGBTQ community and allies to West Hollywood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "10 Iconic Beach Boys Needle Drops in Film and TV",
        "description": "From 'Almost Famous' to 'American Graffiti' and 'Full House,' Brian Wilson and the Beach Boys have soundtracked some of Hollywood's biggest titles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Sabrina Carpenter Slams Critics Who “Complain” She Only Sings About Sex: “Those Are the Songs That You’ve Made Popular”",
        "description": "On the topic of criticism of her sensuality, the Grammy winner revealed that she “truly feel[s] like I’ve never lived in a time where women have been picked apart more.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "The Lucrative Business of Becoming Taylor Swift: Tribute Acts Are Saving Lives, Pocketing Paychecks and Finding Fame",
        "description": "Five performers open up about making a living by channeling the pop star.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    },
    {
        "title": "Blake Lively Subpoenas Scooter Braun Amid Ongoing Legal Battle With Justin Baldoni",
        "description": "While a federal judge has dismissed Baldoni's $400 million defamation and extortion lawsuit against Lively, the actress' original suit against her 'It Ends With Us' director and co-star remains set for trial.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-16T07:29:31.470193"
    }
]