[
    {
        "title": "Why Canada could become the next nuclear energy 'superpower'",
        "description": "With its rich resources, uranium mining companies want Canada to play a key role in fuelling nuclear reactors worldwide.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Apple accused of trapping and ripping off 40m iCloud customers",
        "description": "A UK consumer group is seeking a £3bn payout for British users as a result of the legal action it is launching.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Inflation progress stalls in US in October",
        "description": "Prices in the US rose 2.6% over the 12 months to October, driven by more expensive food and groceries.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "VW launches $5.8bn tie-up with Tesla rival Rivian",
        "description": "The firms will share EV technology as they face slowing sales growth and competition from Chinese rivals.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Apple accused of trapping and ripping off 40m iCloud customers",
        "description": "A UK consumer group is seeking a £3bn payout for British users as a result of the legal action it is launching.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "'I won £1m in the UK lottery but I still bargain hunt'",
        "description": "Ceri Roberts says winning £1m on the National Lottery has been \"life changing\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Will Elon Musk be able to cut $2 trillion from US government spending?",
        "description": "The Tesla CEO claimed he could slash US spending by eradicating “waste”.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "'Too small' pension funds hold back growth - UK chancellor",
        "description": "The chancellor wants to merge the UK's pension funds, but critics worry about the impact on savers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Will Trump's victory spark a global trade war?",
        "description": "Trump has promised tariffs on all foreign goods. If he follows through, many smaller economies may be forced to respond in kind.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "How Japan's youngest CEO transformed Hello Kitty",
        "description": "As the cute character celebrates her 50th anniversary, the firm behind it is now a trillion yen business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "'Fed still set to cut rates despite inflation' - 13 Nov 2024",
        "description": "Michael Reid, the US Economist at RBC Capital Markets, says the Fed is still on track for a rate cut in December.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "The Guardian stops posting on Elon Musk's 'toxic' X",
        "description": "It has accused X of promoting \"disturbing content\", and says Mr Musk is using it to \"shape political discourse.\"",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Bali flights cancelled due to dangerous volcanic ash",
        "description": "Australian airlines say it is unsafe to fly after Mount Lewotobi Laki-laki spewed ash.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Why Tesla, crypto and prisons are Trump trade winners",
        "description": "As the dust settles on a post-election stock market rally, some firms have already gained.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "‘Adults buying kids' toys to escape global turmoil’",
        "description": "Retailers are increasingly targeting the \"kidult\" market as family finances are squeezed.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Shell wins landmark climate case against green groups in Dutch appeal",
        "description": "A court throws out a ruling that the gas and oil giant cut its greenhouse gas emissions.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Seven wild moments from the turbulent story of Bitcoin",
        "description": "Its record price is making headlines - but that's just one part of the cryptocurrency's tumultuous story.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "DNA-testing site 23andMe to lay off 40% of its workers",
        "description": "The once-popular general DNA-testing firm holds a trove of sensitive genetic data from its customers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Unemployment rises in UK as pay growth slows again",
        "description": "The rate of unemployment stood at 4.3% in the three months to September, up from 4% the previous quarter.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Gold, prices, and jobs: What's at stake in Ghana's elections?",
        "description": "In an echo of the US, the current vice-president is up against an ex-president in the 7 December vote.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Airlines suspend Haiti flights after plane hit by gunfire",
        "description": "It is the second time in weeks an aircraft has come under fire over Port-au-Prince, as gang violence worsens.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "An energy efficient home - why is it so difficult?",
        "description": "It can be hard to find good advice on how to make homes more energy efficient.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Bitcoin tops record $80,000 as Trump nears sweep of US Congress",
        "description": "On the campaign trail the president-elect pledged to make America \"the crypto capital of the planet\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "Mattel 'deeply regrets' porn site misprint on Wicked dolls",
        "description": "Recently-released dolls tied to the new Wicked movie inadvertently carry the address of an adult website.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "India's luxury airline Vistara flies into the sunset",
        "description": "Vistara is operating its last flight on Monday as it completes its merger with Air India.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "'I went from being a cleaner to building a warship'",
        "description": "As employers face a skill shortage, some firms have turned to unusual tactics to get the right workforce.",
        "source": "BBC Business",
        "fetched_date": "2024-11-14T07:23:04.646284"
    },
    {
        "title": "In Return to Washington, Donald Trump Meets With President Joe Biden in Oval Office",
        "description": "The president-elect's triumphant return to the White House on Wednesday began with a celebratory visit with House Republicans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Snoop Dogg Launches New Jewelry Line Called Lovechild (Exclusive)",
        "description": "The rap icon created the collection in collaboration with jewelry brand Metal Alchemist and gamma.: “I wanted to have a product I could share with the world that speaks to every element of who I am at this point in my life.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "‘Full House’ Star Dave Coulier Reveals He Has Stage 3 Non-Hodgkin Lymphoma",
        "description": "\"I went from, I got a little bit of a head cold to I have cancer,\" the actor and comedian says of his diagnosis, as he's trying to stay positive.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Charter Communications to Acquire John Malone’s Liberty Broadband in All-Stock Deal",
        "description": "\"I am grateful for Liberty Broadband's strategic partnership since 2013,\" says Charter CEO Chris Winfrey.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Social Listening Platform Hangout Launches With Universal, Sony, Warner Music Backing",
        "description": "With more than 100 million tracks, the service is \"inspired by queuing up the jukebox or putting on a favorite album with friends\" at a time when social media is \"based on division,\" says CEO Joseph Perla.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "The Guardian Will Stop Posting on “Toxic Media Platform” X",
        "description": "The London-based media group said it would stop posting to any of its official editorial accounts on the Elon Musk-owned social media platform.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Timothy West, Legendary British Stage, TV and Film Actor, Dies at 90",
        "description": "An actor in 'The Day of the Jackal,' 'Gentleman Jack,' EastEnders' and Shakespeare plays, he was the husband of Fawlty Towers star Prunella Scales.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "‘The Substance,’ ‘The Girl With the Needle,’ ‘Emilia Pérez’ Among European Film Awards Craft Winners",
        "description": "The awards ceremony will be held in Lucerne, Switzerland on Dec. 7.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "John Krasinski Named People’s Sexiest Man Alive",
        "description": "The 45-year-old actor, producer and director takes the title from Patrick Dempsey.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Trump Nominates Fox News Host Pete Hegseth to be Secretary of Defense",
        "description": "In addition to tapping the 'Fox & Friends' weekend host and Army veteran for a cabinet post, the president-elect announced that he'd be partnering with Elon Musk and Vivek Ramaswamy on efforts to increase government efficiency.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "‘Not True’: Oprah Winfrey Shuts Down Rumors of Payola From Kamala Harris Campaign",
        "description": "The media mogul was approached by TMZ and responded to rumors from an article that reported she received $1 million the same week that she hosted a town hall for the candidate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Tony Hinchcliffe Remains Defiant Following Puerto Rico Controversy, Slams Media on Podcast",
        "description": "Tony Hinchcliffe opened his \"Kill Tony\" show by refusing to apologize to those offended by his rude, dark jokes, which caused offense but did not appear to peel off much of the Latino vote from Trump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-14T07:23:04.978354"
    },
    {
        "title": "Safety issues raised after huge truck crashes",
        "description": "The Super Trucks series, which has had safety issues in the past, is back in the spotlight after two huge crashes in Adelaide.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Big-hitting guns primed for MCG derby",
        "description": "The Melbourne Stars are confident they can contain their arch rival’s powerful top order in a finals-shaping WBBL clash at the MCG.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Hawks leave scuffle scrutiny to ‘higher-ups’",
        "description": "Possible sanctions remain up in the air only two days from when Hawthorn takes to the field in a crunch semi-final against Port Adelaide.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "The bogeyman Jon Jones won’t talk about",
        "description": "Jon Jones is already imagining what’s next if he beats Stipe Miocic this weekend – UFC kingpins, exhibition bouts, jiu-jitsu tournaments. But not the one fight everyone wants: Tom Aspinall.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "1-18: Every AFL club’s fixture reveal rated",
        "description": "AFL clubs are getting more creative every year when it comes to fixture reveals. We’ve checked out how every club announced their 2025 schedule and ranked them 1-18. Did we get it right?",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "AFL Draft: Pick swap frenzy looms, everything you need to know",
        "description": "A pick swap frenzy could be on the cards at this year’s AFL draft, as clubs jockey to get themselves in the best spot for one of the most stacked pools ever. Here is everything you need to know.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "NRL transfer tracker: Every signing, player linked with your club",
        "description": "The NRL player market is already in overdrive with a host of big names led by Ben Hunt and Josh Addo-Carr on the move. Keep up to date with all the player movement in our transfer tracker.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "NRL delivers verdict on star’s betting drama",
        "description": "The NRL has revealed the outcome of an investigation after a star player’s Melbourne Cup post raised alarm bells.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Big-hitting guns primed for MCG derby",
        "description": "The Melbourne Stars are confident they can contain their arch rival’s powerful top order in a finals-shaping WBBL clash at the MCG.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Key change set to spark trade frenzy",
        "description": "Expect plenty of action after the WBBL and BBL finals, with confirmation of a new player movement window that should spark a trade frenzy.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "‘Disrespectful’ comment burns De Minaur",
        "description": "Daniil Medvedev has got tongues wagging with a message written on a TV camera after wiping Alex de Minaur off the court.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Demon down and out in Italy",
        "description": "Just getting to the ATP finals was a massive achievement for Alex de Minaur, but with his body still below par, the results have not gone his way.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Cummins hints at wild Warner career move",
        "description": "Pat Cummins has weighed in on the next chapter in David Warner’s cricket career after the veteran’s leadership ban was lifted.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "‘Too easy’: Proof stars have hacked basketball",
        "description": "The NBA season is in full swing and there are already calls to change a 44-year rule as a wild trend spells trouble for Australia’s players.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Cummins, wife reveal heartbreaking details",
        "description": "Pat Cummins and his wife have revealed some emotional private moments about the harsh reality of being Australian cricket captain.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Safety issues raised after huge truck crashes",
        "description": "The Super Trucks series, which has had safety issues in the past, is back in the spotlight after two huge crashes in Adelaide.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Brown on the verge of Supercars history at Adelaide",
        "description": "Championship frontrunner Will Brown is on the verge of a 40-year Supercars first as he closes in on a maiden series crown.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Shock as Raygun emerges from retirement",
        "description": "Olympic breakdancer Raygun has hit the stage with an Aussie popstar, performing just days after announcing she was retiring.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Fans blame twins for football’s ‘biggest curse’",
        "description": "College basketball twins Haley and Hanna Cavinder are well aware of the “curse” they supposedly inflict on their boyfriends.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "The sad state of the Cowboys and can KC go unbeaten?",
        "description": "Jerry Jones and the Dallas Cowboys lament a lost season, with the amazing stats showing why, and can the Chiefs go unbeaten the rest of the way?",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Viral NFL star sends Raygun a message",
        "description": "Days after going viral for his Raygun celebration, an NFL star has made some huge claims about the Olympic breakdancer.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "‘Can’t wait’: Sam Kerr’s big hint on return to football",
        "description": "After nearly a year on the sidelines with a serious knee injury, Matildas superstar Sam Kerr is finally eyeing a return. Check out the latest.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "‘Expectation is to win’: Socceroos coach sets tone",
        "description": "Socceroos coach Tony Popovic has revealed his plans for Thursday’s blockbuster World Cup qualifier against Saudi Arabia.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Goodman vows to pull off Christmas miracle against Inoue",
        "description": "Sam Goodman vows to be his “own Santa Claus” this Christmas as he looks to shock the world against Japanese superstar Naoya Inoue and become the undisputed super-bantamweight champion.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Aussie rookie matches world No.1",
        "description": "He went to the same college as Tiger Woods and now a rising Aussie star has secured the same award won by the current world No.1.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Bullets fly: SuperCoach NBL experts reveal round 9 trades",
        "description": "The Brisbane Bullets are suddenly the hottest team in SuperCoach NBL – and one player is on the radar for most of our experts. See their full moves here.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Rugby boss drops Cleary defection bombshell",
        "description": "Nathan Cleary remains the biggest name in the NRL, but a former Rugby Australia boss has detailed a potential bombshell code switch.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "‘Flashback’ guiding Wallabies in 40-year quest",
        "description": "The Wallabies’ win over England was epic but recent memories of a second-up hammering are front of mind as they look to keep their grand slam quest alive.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Dionysus to assert his class in The Beauford",
        "description": "A step up to his pet distance has New Zealand stayer Dionysus well placed to rule in the Listed The Beauford at Newcastle.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-14T07:23:07.865987"
    }
]