[
    {
        "title": "TikTok owner sacks intern for sabotaging AI project",
        "description": "Chinese technology giant ByteDance denied reports that the incident caused more than $10m of damage.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How hoax bomb threats are hurting air travel in India",
        "description": "An unprecedented surge in hoax bomb threats to Indian airlines is wreaking havoc on the industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as WhatsApp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Hurricane Oscar hits Cuba as it struggles with power outage",
        "description": "Millions of people are still without power, with food rotting in fridges and no water supply in many homes.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Meet the TikTokers buying up Japan’s empty homes",
        "description": "Content creators are going viral for renovating abandoned Japanese homes for low prices - but is all as it seems?",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How hoax bomb threats are hurting air travel in India",
        "description": "An unprecedented surge in hoax bomb threats to Indian airlines is wreaking havoc on the industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Musk's $1m-a-day to swing states voters 'deeply concerning'",
        "description": "The winner will be chosen from those who sign a petition by the tech billionaire's Trump-supporting group.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Boeing strikers to vote on 35% pay rise offer",
        "description": "About 33,000 unionised workers, mostly in Seattle, will decide this coming week whether to accept the deal.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "NHS consultant who lost £39k among 100 Revolut customers contacting BBC over scams",
        "description": "People say they have been poorly treated by the firm after being tricked out of cash while using app.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as WhatsApp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Pound falls as UK inflation declines - 16 Oct 2024",
        "description": "The British currency fell greater than expected and came up against a very strong dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "What could happen if Donald Trump drastically increases tariffs as he has promised to do?",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "China's economic slowdown deepens",
        "description": "Gross domestic product rose by 4.6% on a yearly basis, below Beijing's \"around 5%\" annual target.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "US probing Elon Musk's Tesla over self-driving systems",
        "description": "The National Highway Traffic Safety Administration's evaluation is the first step toward a potential recall of 2.4 million Tesla vehicles",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Trump says Apple boss called him to complain about EU",
        "description": "The EU ordered Apple to pay Ireland billions in unpaid taxes in September.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Is esports a viable career path for young Africans?",
        "description": "With esports on the rise across the continent, could more young Africans make a career as professional gamers?",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Boohoo considers break-up as sales slide",
        "description": "The online fashion firm is mulling whether to offload its brands as sales remain under pressure.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Tobacco firms to pay $23.6bn in proposed Canada settlement",
        "description": "The deal includes up to C$100,000 in compensation for some smokers and would resolve a decades-long legal fight with cigarette-makers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "What to know about London Stansted Airport's £1bn expansion",
        "description": "It is set to become the UK's second-busiest airport, behind Heathrow.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "How the India-Canada fallout could affect trade and immigration",
        "description": "The stakes for both countries are high as the rift over allegations that India ran a campaign to intimidate Sikh separatists in Canada deepens.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Netflix raises prices as password boost fades",
        "description": "The streaming giant will charge subscribers more in some countries to fuel growth.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Meta fires staff for buying toothpaste, not lunch",
        "description": "Meta workers reportedly used vouchers that should have been spent on meals to buy household goods.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Inheritance tax increases expected in UK Budget",
        "description": "It is not known how many people are likely to end up paying more under the government's plan.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Copy of US Constitution found in filing cabinet sells for $9m",
        "description": "Believed to be the only privately held copy of the charter in existence, it was discovered in a North Carolina home.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "UK Treasury hints it will spend billions on infrastructure",
        "description": "Government claims the move contrasts with former PM Liz Truss's controversial mini-Budget.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "US 'click to cancel' rule to ban subscription traps",
        "description": "New rule requires businesses to make subscribing and cancelling subscriptions equally simple.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Instagram defends new teen safety features after criticism",
        "description": "Law enforcement have reported a rise in sextortion scams targeting teens across online platforms.",
        "source": "BBC Business",
        "fetched_date": "2024-10-21T07:24:29.028607"
    },
    {
        "title": "Jennifer Lawrence is Pregnant, Set to Welcome Second Baby With Cooke Maroney",
        "description": "The news was confirmed after the Oscar-winning actress was spotted on Saturday night in Los Angeles with a visible baby bump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "2024 Rock & Roll Hall of Fame Induction: The Best Moments",
        "description": "The celebratory night featured a Cher and Dua Lipa duet, Kelly Clarkson leading a Foreigner supergroup and Dave Matthews Band covering Talking Heads.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Zayn Malik Postpones U.S. Tour Dates Due to the “Heartbreaking Loss” of Liam Payne",
        "description": "Payne died Wednesday in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Cindy Charles, Twitch’s Head of Music, Dies in Traffic Accident at 69",
        "description": "\"Anyone that uses music on Twitch owes a debt of gratitude to Cindy's work,\" wrote Twitch CEO Daniel Clancy in a tribute.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Cheryl Cole Speaks Out on Liam Payne’s Death, Says Their Son Has to “Face Reality of Never Seeing His Father Again”",
        "description": "\"Please give Liam the little dignity he has left in the wake of his death to rest in some peace at last,\" the English singer and television personality said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Simon Cowell, Who First Formed and Signed One Direction, on Liam Payne’s Death: “I Feel Empty”",
        "description": "The globally successful band that included Payne, Harry Styles, Louis Tomlinson, Niall Horan and Zayn Malik were first formed on Cowell's reality show, 'The X-Factor', in 2010.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Marc Anthony Endorses Kamala Harris: “This Election Goes Way Beyond Political Parties”",
        "description": "The artist's support for the vice president came in an ad titled \"Recuerdo.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Donald Trump Says He’ll Ask Rupert Murdoch to Direct Fox News to Halt Negative Ads Against Him",
        "description": "The former president and White House hopeful also referred to himself as \"the most stable human being\" in a lengthy appearance on 'Fox & Friends,' where he got the seat on the curvy couch.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Kamala Harris Campaign Targets Taylor Swift Concertgoers in Snapchat Push",
        "description": "Swifties in Miami for the next Eras Tour stop will see ads and filters promoting their \"Kamala era.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Niall Horan Rounds Out One Direction Tributes to Liam Payne: “The Bond We Had Doesn’t Happen Often in a Lifetime”",
        "description": "The Irishman wrote on his Instagram on Friday after Payne, who died from a hotel balcony fall in Buenos Aires Wednesday night, had attended Horan's concert in South America just two weeks ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Former NBC Exec Regrets Helping Market ‘The Apprentice’ in Op-Ed: “We Created a Monster”",
        "description": "\"I want to apologize to America,\" John D. Miller wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Molly Shannon’s Mary Katherine Gallagher Interrupts Kamala Harris’ Virtual Speech at Al Smith Charity Dinner",
        "description": "\"I just want to say that I'm Catholic and tonight is one of the biggest dinners next to the Last Supper,\" Gallagher tells the vice president.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-21T07:24:30.021454"
    },
    {
        "title": "Why defeat could cost Lions $1m",
        "description": "An upset AFLW loss has put Brisbane at risk of missing out on a major prize – and called further into question its criteria.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Socceroo makes Premier League debut",
        "description": "A Socceroos defender’s patience has been rewarded with an English Premier League debut, but the result wasn’t what he wanted.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "‘Grow up’: Broncos boss reacts to car crash",
        "description": "Brisbane Broncos CEO Dave Donaghy has broken his silence on the car crash involving star player Ezra Mam amid conjecture over his future.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Cross-code Bulldog hangs up boots",
        "description": "A Western Bulldogs defender has called time on one of the game’s most intriguing dual sport careers.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Why defeat could cost Lions $1m",
        "description": "An upset AFLW loss has put Brisbane at risk of missing out on a major prize – and called further into question its criteria.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Cross-code Bulldog hangs up boots",
        "description": "A Western Bulldogs defender has called time on one of the game’s most intriguing dual sport careers.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "‘Grow up’: Broncos boss reacts to car crash",
        "description": "Brisbane Broncos CEO Dave Donaghy has broken his silence on the car crash involving star player Ezra Mam amid conjecture over his future.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Club switch emerges after brutal falling out",
        "description": "A shock NRL club is reportedly interested in the services of Tigers veteran John Bateman, with his future at the merger club in doubt.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Controversial call sends Test hope packing",
        "description": "The stage was set for a Test batting contender to put his hand up – but not even the stars could find Shield runs on a bowler-dominated day.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Debutant’s big haul as Shield wickets tumble",
        "description": "The stage was set for a Test batting contender to put their hand up – but not even the stars could find Shield runs on a bowler-dominated day.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Cup draw sets up couple showdown",
        "description": "Alex de Minaur will be pitted against his girlfriend for the second year in a row at an important Australian Open warm-up event.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Demon’s bid to recreate United Cup magic",
        "description": "Alex de Minaur will lead Australia’s team in a star-studded Australian Open warm-up event that includes seven of the women’s world top 10.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Norris stripped of podium in wild F1 drama",
        "description": "Lando Norris had a podium finish taken away as the McLaren driver traded protests with Max Verstappen in a wild finish on Monday.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Vintage Marquez produces stunning Aus MotoGP victory",
        "description": "A stunning ride from eight-time world champion Marc Marquez has delivered him a brilliant victory at the Australian MotoGP despite a dramatic start off the grid, while Aussie Jack Miller came home strong.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "World rocked as surfer impaled by swordfish",
        "description": "A popular surfing figure has died at the age of 36 after a freak incident where she was fatally impaled by a swordfish.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Olympic legend given only years to live",
        "description": "A British Olympic champion has opened up on the heartbreaking diagnosis and the short time frame doctors have given him to live.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Clip shows star arrested in ‘dumbest way’",
        "description": "Extraordinary police footage has been released of the moment an officer had the perfect response after arresting an NBA player.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Eddie McGuire ‘in awe’ of lookalike son",
        "description": "Joe McGuire is taking massive steps to emerge from his famous dad’s imposing shadow in the cutthroat US college football system.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Socceroo makes Premier League debut",
        "description": "A Socceroos defender’s patience has been rewarded with an English Premier League debut, but the result wasn’t what he wanted.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Italian football great touring Australia",
        "description": "One of the world football’s finest ever defenders is in Australia this week and will visit three capital cities.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Stinging dad sledge sets up Tszyu superfight",
        "description": "Negotiations are underway for Tim Tszyu’s next fight — and they’ve begun in explosive fashion with the former champ told he’s been “found out”.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Wet and wild conditions wreaks havoc as Smylie secures first tour win",
        "description": "Queensland young gun Elvis Smylie secured his first tour win as a professional in a tense final day at the WA Open despite horrible conditions threatening to stop play all throughout the day.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "SuperCoach NBL fast trades, tips for Round 6",
        "description": "Get prepared for the highest scoring round of the SuperCoach NBL season so far with SIX teams on the double, plus the best crop of cheapies in a long time.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Arrest warrant out for ex-Wallabies captain",
        "description": "An international arrest warrant has been issued for a Wallabies captain over his conduct during his time in charge of a French club.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Everest success spurs plan for new Randwick feature race day",
        "description": "Formative discussions have already been held about the possibility of another feature race meeting at Royal Randwick in November next year, a week after Rosehill’s Five Diamonds race day.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-21T07:24:32.204059"
    }
]