[
    {
        "title": "Trump rings bell on record stock market - but will it last?",
        "description": "The US president-elect comes into office with a strong economy, but investors hope for more and current highs may be difficult to sustain.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "N Korea made millions from remote work scheme, US says",
        "description": "Fourteen North Koreans have been charged with fraud in the US over the long-running conspiracy",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "UK unveils new powers to approve large wind farms",
        "description": "The change is part of the government's new action plan for meeting its 2030 clean power target.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Mark Zuckerberg's Meta donates $1m to Trump fund",
        "description": "It appears to be the latest attempt by the Meta boss to build a closer relationship with the incoming president.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "N Korea made millions from remote work scheme, US says",
        "description": "Fourteen North Koreans have been charged with fraud in the US over the long-running conspiracy",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "New trade rules 'make the world smaller for my small business'",
        "description": "Rules come into force that will make it harder for some GB firms to sell goods to NI and the EU.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Star luxury property brokers charged with sex trafficking in US",
        "description": "The Alexander brothers are accused of drugging, assaulting and raping dozens of women over more than a decade.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "British trader found guilty of £1bn fraud",
        "description": "He was sentenced to 12 years in prison - the heaviest penalty ever for a Danish fraud case.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "India: Is the fastest-growing big economy losing steam?",
        "description": "India's economy slumped to 5.4%, below the central bank's 7% forecast. What's going on?",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "What is rage-baiting and why is it profitable?",
        "description": "Called rage-baiting, making people angry with social media posts can be a business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Mag 7 stocks not leading all the charge - 12 Dec 2024",
        "description": "NASDAQ rally becoming broader based as Donald Trump rings the opening bell today.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Is India's economic boom fading?",
        "description": "The rate of India’s economic growth is still robust, but the latest GDP figures signal a slowdown.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Australia to force tech giants to keep paying for news",
        "description": "The long-awaited decision follows a standoff with Meta, and succeeds a world-first law from 2021.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "'I'm more confident' despite rise in US inflation",
        "description": "Progress stabilising prices in the US may be stalling, just as public opinion brightens.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Elon Musk's Tesla lobbied UK to charge petrol drivers more",
        "description": "Musk's firm backed the government's green stance, despite its maverick chief executive's social media attacks.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Hackers find hole in Krispy Kreme Doughnuts' cyber-security",
        "description": "The hack has left some hungry customers unable to make online orders.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "The Onion's purchase of Alex Jones's Infowars rejected by judge",
        "description": "Judge Christopher Lopez ruled that an auction for Infowars did not result in the best bids possible.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Anger after Indian start-up pretends to sack stressed staff",
        "description": "A beauty service start-up pretended to have fired dozens of employees after they reported being stressed at work.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Coffee price surges to highest on record",
        "description": "Coffee drinkers are set to feel the pinch from high prices after crops got hit by drought and heavy rainfall.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "General Motors pulls plug on robotaxi business",
        "description": "After the announcement, the project's co-founder posted on social media \"GM are a bunch of dummies.\"",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "More jobs and no 'nuisance taxes' - Ghanaians' great expectations",
        "description": "John Mahama was elected on his pledges to solve the economic crisis but won't find it easy, analysts say.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "UK car loan scandal victims told to complain",
        "description": "Aggrieved car buyers who feel they were mis-sold a loan should complain to their lender, MPs hear.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Amazon and eBay to pay 'fair share' for e-waste recycling",
        "description": "Firms which produce e-cigarettes will also be asked to pay more towards UK recycling.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Blow for UK as equipment giant Ashtead chooses US",
        "description": "The building equipment rental firm joins others who have moved to the US from London.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Luigi Mangione charged with murdering healthcare CEO in New York",
        "description": "The 26-year-old man was taken into custody at a McDonald's in the town of Altoona, Pennsylvania, on Monday.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Murdoch loses bid to change trust in real-life 'Succession' battle",
        "description": "The court says Murdoch acted in \"bad faith\" by trying to give control of his empire to his eldest son.",
        "source": "BBC Business",
        "fetched_date": "2024-12-13T07:25:33.493461"
    },
    {
        "title": "Billboard Music Awards: Winners List",
        "description": "Taylor Swift led the night, and made history, winning 10 awards, bringing her career BBMA total to 49 trophies.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Trent Reznor and Atticus Ross Prefer Movie Soundtracks Because “the Culture of the Music World Sucks”",
        "description": "The Nine Inch Nails musicians are behind the sound of movies like 'Challengers,' 'The Social Network,' 'Mank,' 'Queer' and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Taylor Swift Makes History as Most Decorated Artist at Billboard Awards",
        "description": "The pop star won 10 honors on Thursday, bringing her career total to 49. Zach Bryan, Morgan Wallen and Shaboozey also won honors and Beyoncé was named top country female artist.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Unreleased Michael Jackson Tracks Discovered in Abandoned Storage Unit (Exclusive)",
        "description": "How one Ventura County stay-at-home dad came into possession of material recorded between 1989 and 1991 by the King of Pop.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "“He Is Ready to Party”: Three Men Share Details of Alleged Sexual Assaults by Sean “Diddy” Combs in New Suits",
        "description": "The rap mogul was granted access to a laptop while being held in federal custody on the same morning the new cases were filed in a New York court.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Dick Van Dyke Says His Neighbors “Carried Me Out” During Malibu Fire Evacuation",
        "description": "The nearly 99-year-old said he was trying to crawl to his car when three neighbors came to the rescue.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Eras Tour Dancer Says He Cried For Days After It Ended, Praises Taylor Swift: “I Would Follow You Anywhere”",
        "description": "\"It has been the honor of my life to have been at your side night after night,\" he wrote.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Morgan Wallen Sentenced in Chair-Throwing Case After Pleading Guilty",
        "description": "The country star is required to spend seven days in a DUI education center and be under supervised probation for two years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "‘Vanderpump Rules’ Star James Kennedy Arrested for Domestic Violence",
        "description": "Authorities say they were dispatched to a home in Burbank on Tuesday night after getting a call about an argument between a man and a woman.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Donald Trump Says 2024 Campaign “Hit the Nerve of the Country” in Time Person of the Year Interview",
        "description": "The president-elect talked about his political rebirth as he was recognized with the prestigious magazine cover honor for the second time.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Mariah Carey Will Headline Show Open for NFL Christmas Gameday on Netflix",
        "description": "The pop star will perform her festive hit \"All I Want for Christmas Is You\" on Dec. 25 as it celebrates its 30th anniversary.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "Marvel Comics Sets Godzilla Crossover Event for 2025 (Exclusive)",
        "description": "The six-issue 'Godzilla vs. Marvel' will take place over different time periods, beginning with a Fantastic Four one-shot book.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-12-13T07:25:34.357321"
    },
    {
        "title": "‘Too much’ of a gap for Sydney’s liking",
        "description": "Sydney FC’s mixed start to the A-League season has one Sky Blues star calling for his team to ‘relax’ and ‘focus’.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "LeBron steps away amid rumours, decline",
        "description": "LeBron James appears to be searching for answers as he steps away from the Lakers amid a worrying decline and swirling trade rumours.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Shock names among Aus Open wildcards",
        "description": "Rising stars and a three-time major champ were among those given Australian open wildcards with one particular name not yet included.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Cleary’s sea moss diet aids big injury news",
        "description": "NRL superstar Nathan Cleary is tucking into a breakfast not many could stomach and is getting the dividends as he recovers from shoulder surgery.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Australia’s hottest WAG drops huge news",
        "description": "The influencer labelled “Australia’s hottest WAG” and her footy star boyfriend are celebrating a big step in their high-profile relationship",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "AFL drops first All Stars names",
        "description": "The first players have been confirmed for the Indigenous All Stars squad for a match that could have a far-reaching legacy.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "How bizarre carnivore diet has Cleary ahead of schedule",
        "description": "Panthers star halfback Nathan Cleary says he’s ahead of schedule in his recovery from shoulder surgery, making an early return to training thanks to a breakfast not many could stomach.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Cleary’s sea moss diet aids big injury news",
        "description": "NRL superstar Nathan Cleary is tucking into a breakfast not many could stomach and is getting the dividends as he recovers from shoulder surgery.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Australian cult hero sensationally axed",
        "description": "Australian skipper Pat Cummins has confirmed the squad for the upcoming third Test with a cult hero being brutally left out.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘It’s tough’: Aussie change confirmed for Brisbane",
        "description": "Despite winning the second Test in Adelaide, Australia will make a single change to its line-up for the third clash with India in Brisbane.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Shock names among Aus Open wildcards",
        "description": "Rising stars and a three-time major champ were among those given Australian open wildcards with one particular name not yet included.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘Kick in the guts’: Barty, Ricciardo lose jobs",
        "description": "A simple social media update has exposed the truth as Daniel Ricciardo and Ash Barty were quietly released.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Aussie trio about to shock the fight world",
        "description": "In just a month, three Aussie boxers can call themselves world champion and bring Australia to the top of the sport after Tim Tszyu’s loss.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Radical plan will flip cricket on its head",
        "description": "A cricket great has a radical plan to shake up world cricket and the one trophy England seemingly has no chance of winning.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘Nervy time’: Why Buckley fears for his job",
        "description": "Nathan Buckley says he and his colleagues are worried for their jobs at an AFL broadcaster, declaring “it’s a nervy time” for them.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘Kick in the guts’: Barty, Ricciardo lose jobs",
        "description": "A simple social media update has exposed the truth as Daniel Ricciardo and Ash Barty were quietly released.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Oscar Piastri celebrates huge personal news",
        "description": "Oscar Piastri has every reason to smile after some huge news dropped at the end of the Aussie’s successful F1 season with McLaren.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘Kick in the guts’: Barty, Ricciardo lose jobs",
        "description": "A simple social media update has exposed the truth as Daniel Ricciardo and Ash Barty were quietly released.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Dawn Fraser’s family shocked by question",
        "description": "As Dawn Fraser was undergoing emergency surgery after her horror fall, one question from medical staff stunned her daughter.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "LeBron steps away amid rumours, decline",
        "description": "LeBron James appears to be searching for answers as he steps away from the Lakers amid a worrying decline and swirling trade rumours.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Contenders and pretenders: the NFL Playoff race surprise leaders",
        "description": "The playoff race is heating up: who are the pretenders and contenders for Super Bowl LIX as we head into Week 15?",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘Too much’ of a gap for Sydney’s liking",
        "description": "Sydney FC’s mixed start to the A-League season has one Sky Blues star calling for his team to ‘relax’ and ‘focus’.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Spurs’ great escape as pressure eases on Postecoglou",
        "description": "Pressure on Tottenham coach Ange Postecoglou remains but was relieved a little after his team fought back from a goal down to snatch a draw against Rangers in Europe League action.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "‘I’ll never forget’: Tszyu vow over Zerafa’s ‘b**** move’",
        "description": "Tim Tszyu has revealed the vow he made to his grandpa about never fighting Michael Zerafa after the controversial cancellation of their blockbuster bout in 2021.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "The one change Henkel made to rocket to Gippsland Super 6 lead",
        "description": "For almost seven years, Ben Henkel, who tries to make a living from golf has refused to wear a glove during play. He put that superstition aside, and now leads the Gippsland Super 6.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "LeBron steps away amid rumours, decline",
        "description": "LeBron James appears to be searching for answers as he steps away from the Lakers amid a worrying decline and swirling trade rumours.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "NRL star’s heartwarming baby joy",
        "description": "An NRL star has stunned with a huge announcement – revealing a new addition to his family in a heartwarming Instagram post.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Aussie star’s big World Cup move",
        "description": "After being crowned the best Rugby Sevens player in the world an Australian try-scoring machine is taking a big step towards possibly earning a World Cup spot.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Randwick inside mail: Lees plot another Ingham upset",
        "description": "Kris Lees has won The Ingham twice with outsiders and isn’t ruling out another upset result on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2024-12-13T07:25:37.511144"
    }
]