[
    {
        "title": "From eyesore to asset: How a smelly seaweed could fuel cars",
        "description": "Scientists in the Caribbean are turning algae that have been choking beaches into biofuel.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Wicked proves popular as opening set to be biggest for Broadway film",
        "description": "Wicked is also expected to have the top-grossing opening weekend in UK and Ireland of 2024.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "'We had to break rules', says Jaguar as radical rebrand stirs debate",
        "description": "The iconic carmaker's rebrand has certainly caught people's attention, but will it pay off?",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "'I was scammed out of £75k by Martin Lewis deepfake advert'",
        "description": "Des Healey lost £76,000 in a scam using a deepfake of Martin Lewis and Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Wicked proves popular as opening set to be biggest for Broadway film",
        "description": "Wicked is also expected to have the top-grossing opening weekend in UK and Ireland of 2024.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Nominee for agriculture secretary completes Trump cabinet",
        "description": "Brooke Rollins - head of a pro-Trump right-wing think tank - is his pick for agriculture secretary.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Can RFK Jr make America's diet healthy again?",
        "description": "Kennedy's plans to ban dyes in cereals and fluoride in water could get major pushback from the food industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "UK perfume boss admitted he ignored Russia sanctions",
        "description": "David Crisp told undercover agent he had ignored \"government edicts\" to sell £1.7m of his luxury Boadicea the Victorious product.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Inside South Africa's 'ruthless' gang-controlled gold mines",
        "description": "Illegal miners live dangerously, but make roaring profits selling gold on the black market.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Is nuclear power gaining new energy?",
        "description": "Countries around the world are building new nuclear power stations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Investors 'wary of incoming administration' - 22 Nov 2024",
        "description": "As US shares lock in a week of gains, investors are keeping an eye out for the new administration's policies.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "UK wants to hire EU negotiator to 'reset' relations",
        "description": "The role will “prepare and lead negotiations with the EU on key UK interests”, the job posting said.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Spain fines budget airlines including Ryanair €179m",
        "description": "The government says charging for hand luggage and printing boarding passes at the airport are \"abusive practices\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Trump nominates Bessent to lead US Treasury in flurry of announcements",
        "description": "He also announces nominees for labour secretary, housing secretary and surgeon general.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "How could the Apple tax windfall be spent in Ireland?",
        "description": "The EU’s highest court ruled that Apple had to pay more than €14bn to the Republic of Ireland.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Analysis: Will UK chancellor's difficult week cause her lasting damage?",
        "description": "BBC's Ben Wright looks at the impact of a tricky week of scrutiny for the chancellor.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Satellite images show Russia giving N Korea oil, breaking sanctions",
        "description": "Satellite image analysis shows several North Korean tankers visiting Russia dozens of times since March.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "The mighty material that supercharges jet engines",
        "description": "Hi-tech coatings make all sorts of high performance engineering, like jet engines, possible.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Gary Gensler to leave role as SEC chairman",
        "description": "Donald Trump revealed plans to sack Mr Gensler on \"day one\" of his new administration.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Temu owner's shares slump as China slowdown hits sales",
        "description": "US-listed shares of the e-commerce giant fell nearly 11% on Thursday following the announcement.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "How Adani's US fraud charges impact India's economy and politics",
        "description": "The charges could jeopardise the ambitions of one of the world’s richest men, both at home and abroad.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Fraud probe launched into defence firm Thales",
        "description": "Thales UK, which has its headquarters in Berkshire, employs more than 7,000 staff across the country.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Trudeau plays Santa with seasonal tax break",
        "description": "The opposition calls Trudeau's tax measures \"a trick\" aimed at deflecting attention from rising costs.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Sell Chrome to end search monopoly, Google told",
        "description": "The tech giant is resisting fiercely, calling the proposal \"wildly overbroad\" and claiming it will hurt consumers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Thousands of PayPal customers report brief outage",
        "description": "The online payment company says a brief technical issue has now been resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "US charges Indian billionaire Gautam Adani with fraud",
        "description": "The Adani Group has denied the allegations of bribery and fraud, calling them \"baseless\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-25T07:26:50.073228"
    },
    {
        "title": "Casa Bonita Cast and Crew Members Unanimously Vote to Unionize With Actors’ Equity, IATSE",
        "description": "“Today, we are proud that we stood as a group and said clearly: We want to make Casa Bonita better,” the workers leading the unionization effort said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Miley Cyrus Reveals Godmother Dolly Parton’s Response to “Used to Be Young”: “I’m Like 80. That Should Have Been My Song”",
        "description": "The \"Jolene\" singer said that the track didn’t apply to Cyrus, who is still \"young and beautiful.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Sean “Diddy” Combs Bail Decision Delayed as Rapper Seeks Home Confinement for Third Time",
        "description": "The beleaguered rapper-mogul will remain incarcerated for the weekend in Brooklyn as he awaits his trial on sex trafficking and racketeering charges, which is set for May.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Kendrick Lamar Releases Surprise Album ‘GNX’",
        "description": "The album comes after his successful chart run with the anthem \"Not Like Us\" and months before he headlines the Super Bowl halftime show, which he references on one song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Power Lawyers: THR’s Top Music Attorneys of 2024",
        "description": "Recording stars hungry for films, tours and huge catalog payoffs turn to these 16 chart-topping attorneys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "The 20 Best Music Schools in the World",
        "description": "From New York to Northridge, our annual list of the institutions preparing the next generation of composers across all media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Lando Norris Is “Just a Normal Guy” … Who Also Drives Really Cool Race Cars",
        "description": "The Hollywood Reporter's newest \"Person of Interest,\" the 25-year-old British driver for McLaren's Formula 1 team, is always finding joy in the exhilarating race-winning moments but also the quiet, everyday ones.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Patton Oswalt Comic ‘Minor Threats’ Launches Anthology Spinoff With Matt Fraction, Brian Michael Bendis (Exclusive)",
        "description": "Writers Gail Simone and Gerry Duggan and artists Michael Allred and Gene Ha are also among those working in the universe of the cult hit comic published by Dark Horse Entertainment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Jussie Smollett’s Conviction in Alleged Hoax Street Attack Overturned by Illinois Supreme Court",
        "description": "The former 'Empire' actor has been on a legal roller coaster after he claimed in 2019 that he was attacked in Chicago by two Black men who hurled homophobic slurs at him and yelled, “This is MAGA country.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Matt Gaetz Withdraws as Trump’s Pick for Attorney General",
        "description": "“While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,” Gaetz said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "Muni Long Explains How She “Made” It",
        "description": "The singer opens up about her TikTok hit \"Made for Me,\" working with Mariah Carey and the perils of being a songwriter: \"Not getting credit, not getting paid, the producer running off with the money — it happened to me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "FCC Chair Jessica Rosenworcel to Step Down Next Year",
        "description": "Rosenworcel will be succeeded atop the Commission by Brendan Carr.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-25T07:26:51.226616"
    },
    {
        "title": "India close in as Australia’s dire batting struggles exposed",
        "description": "Australia is staring down the barrel of defeat in Perth, with the hosts’ tailenders exposed to India’s rampant attack. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Quicker’: Star Pie’s bold pre-season call",
        "description": "A Collingwood superstar has an ambitious goal for his 20th AFL pre-season as the Pies welcomed their new draftees onto the track.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘What’s happened?’: Cricket turns on Smith",
        "description": "Steve Smith’s wretched run of form has reached ugly depths with the cricket world turning on the previously invincible cricketer.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘I’m staggered’: Aussie’s remark stuns greats",
        "description": "Comments from Australian bowler Josh Hazlewood left cricket greats “staggered” and asking if there’s a “divide” in the Aussie changeroom.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Quicker’: Star Pie’s bold pre-season call",
        "description": "A Collingwood superstar has an ambitious goal for his 20th AFL pre-season as the Pies welcomed their new draftees onto the track.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Scary prospect as AFL champs get back to work",
        "description": "A double dose of Ashcrofts setting the standards at Brisbane Lions pre-season on Monday could be a worrying sign for the rest of the AFL.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Dragons sign Ben Hunt’s replacement",
        "description": "The Dragons have landed on Ben Hunt’s replacement for the next two seasons after they signed a halfback who had fallen out of favour at his previous club.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Joey Johns married in secret ceremony",
        "description": "NRL legend Andrew Johns and partner Kate Kendall’s big secret is out with the pair reportedly getting hitched overseas.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "India close in as Australia’s dire batting struggles exposed",
        "description": "Australia is staring down the barrel of defeat in Perth, with the hosts’ tailenders exposed to India’s rampant attack. FOLLOW LIVE.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘What’s happened?’: Cricket turns on Smith",
        "description": "Steve Smith’s wretched run of form has reached ugly depths with the cricket world turning on the previously invincible cricketer.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Tennis world stunned by Djokovic ‘bombshell’",
        "description": "The tennis world has been left stunned by Novak Djokovic’s shock announcement that he’s acquiring the services of one of his greatest rivals.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Lleyton Hewitt drops bomb on tennis world",
        "description": "Lleyton Hewitt has not held back as he dropped a bomb on the tennis world following Australia’s Davis Cup elimination.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Damning reasons for Aussie failure exposed",
        "description": "Cricket greats are making damning calls on the state of Australian cricket after the Aussies were embarrassed in the first Test.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Star wins title, drops retirement bombshell",
        "description": "Red Bull superstar Max Verstappen has poured fuel on the fire of retirement speculation after clinching his fourth straight F1 crown.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Iconic band ‘absolutely butchered’ US anthem",
        "description": "F1 fans have been left stunned over iconic 90s band Boyz II Men’s rendition of the US national anthem at the Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Ring girl reveals ‘big names’ in her DMs",
        "description": "Viral ring girl Sydney Thomas has revealed her new-found fame has seen her inbox become overran with big names hitting her up.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Surprising twist in violent pickleball scandal",
        "description": "The man who got kicked in the face in a moment of unthinkable violence has had a stunning response to his opponent’s behaviour.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Not an NBA player’: Simmons torn to shreds",
        "description": "Aussie NBA star Ben Simmons has hit rock bottom after a disastrous moment saw him go viral for all the wrong reasons.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Giddey gets Aussie NBA bragging rights",
        "description": "Josh Giddey got the last laugh in his clash against Dyson Daniels, the man who has leapfrogged him in the Aussie NBA pecking order.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "England stunned by Aussie Ange masterclass",
        "description": "Ange Postecoglou has blown the football world away after producing a tactical masterclass against the best team in England.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Need rest’: Matilda defends star’s withdrawal",
        "description": "The Matildas will play four games in 10 days in two states and one veteran says it’s no surprise one of her star teammates is one of three key withdrawals.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Jury ‘stunned’ as McGregor mask slipped",
        "description": "Bombshell details about the exact moment Conor McGregor lost the jury in his assault case have been reported in graphic fashion.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Nothing will change’: Oz Open rule focus is clear",
        "description": "Cam Smith got a tap on the shoulder at the wrong time on Sunday but slow play won’t be concerning him in his quest for the Australian Open.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "SuperCoach NBL trade tips, early mail for Round 10",
        "description": "After a week off for the international FIBA break, the NBL is back with a bang this week. Get the best trade tips and latest word on injured stars to get your team set for round 10.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Aussie sevens star crowned world’s best",
        "description": "Interest from rival codes will only intensify after this Australian was crowned the best sevens player on the planet.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "‘Numb arm’: Wallabies’ nervous wait on $5m man",
        "description": "The grand slam dream is over for the Wallabies but the nightmare could just be starting as the team waits for injury news on a breakout star.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Air Tino: Gollan’s Hong Kong dream takes off",
        "description": "Tony Gollan is confident the training facilities at Sha Tin will mirror those at Eagle Farm as the champion trainer prepares for the first international runner of his career in Hong Kong next weekend.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-25T07:26:53.570299"
    }
]