[
    {
        "title": "'I'm not playing games' on US port strikes, union boss says",
        "description": "Harold Daggett vows union is \"going to win\", as Joe Biden backs \"meaningful\" dockworker pay rise.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "India's iconic tramcars set to ride into Kolkata sunset",
        "description": "Kolkata's iconic trams are in danger of being shut down entirely. But activists are fighting back.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "US ports strike causes first shutdown in 50 years",
        "description": "The strike is set to significantly disrupt trade, creating uncertainty ahead of the US election.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Looking for a pay rise? Try datacentre construction",
        "description": "Despite offering high pay companies that build datacentres are struggling to find skilled staff.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Irish government announces tax cuts in pre-election budget",
        "description": "In July, Jack Chambers pledged €1.4bn in tax measures and new expenditure of €6.9bn",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "India's iconic tramcars set to ride into Kolkata sunset",
        "description": "Kolkata's iconic trams are in danger of being shut down entirely. But activists are fighting back.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Microsoft: 'ever present' AI assistants are coming",
        "description": "The tech giant says we are moving to a \"fundamentally new age\" of \"persistent\" AI tools.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "'I had to crawl to plane toilet' - BBC's Frank Gardner",
        "description": "The BBC's Frank Gardner says the \"humiliating\" experience he had on board is unacceptable in 2024.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Xi Jinping is worried about the economy - what do Chinese people think?",
        "description": "Two new pieces of research offer a rare glimpse into how Chinese people feel about their future.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "US ports strike causes first shutdown in 50 years",
        "description": "The strike is set to significantly disrupt trade, creating uncertainty ahead of the US election.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Expert says impact of port strikes 'too great' - 1 Oct 2024",
        "description": "John Drake from the US Chamber of Commerce says President Biden needs to act on US port strikes",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Migrants with criminal records - what new US data shows",
        "description": "BBC Verify looks into Donald Trump's claim that Kamala Harris “allowed” 13,000 non-citizens convicted of homicide to enter the US.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "'It's just a mess' - Left in limbo by US student loan logjam",
        "description": "As Democrats and Republicans fight over student debt, borrowers are caught in the middle.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "The world’s diamond polishing capital feels Ukraine war impact",
        "description": "Wars and recession in key Western markets have left India's diamond industry workers distraught and jobless.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Aston Martin shares shaken after profit warning",
        "description": "The company, famed for its links to James Bond, has been hit by falling sales in China.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "McDonald’s and supermarkets failed to spot slavery",
        "description": "Red flags went undetected as victims worked at a restaurant and a supermarket supplier in the UK, BBC finds.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Does Chinese investment benefit or damage Ireland?",
        "description": "Ireland is home to 40 Chinese firms, which some critics say harms the country's reputation.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "The red flags that were missed or dismissed when Harrods was bought",
        "description": "Experts say Qatar either missed or dismissed much of what was already known about Mohamed Al Fayed at the time of the purchase.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Hollywood's big boom has gone bust",
        "description": "Productions are down by about 40% and entertainment industry employees say they can't find work.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Postmasters won't all get payouts by March - minister",
        "description": "Campaigners had called for a deadline of March 2025 for payments to be made to some sub-postmasters.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "More staff and new equipment for firm awarded £6m",
        "description": "The programme aims to make vehicles more sustainable and cheaper.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Ex-Harrods director won't take top job at Fenwick",
        "description": "Nigel Blow, who worked for Mohamed Al Fayed at Harrods for 14 years, was due to start the new role this month.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Workers must keep all customer tips under new law",
        "description": "Bosses must pass on all tips and service charges to staff under new employment rules.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "People told to read meter as energy bills rise",
        "description": "A 10% energy price rise has taken effect, meaning annual bills will be £1,717 on average.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "ScotRail's full timetable to return next Monday",
        "description": "Trains have been running on a reduced timetable since 10 July following a pay dispute with drivers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Sperm donor cash rises by £10 as UK faces shortage",
        "description": "The £10 rise comes into effect in England, Wales and Northern Ireland from 1 October.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Post Office minister 'horrified' at more IT faults",
        "description": "A report says it is likely that Capture, which preceded the Horizon system, also caused shortfalls.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "Mike Ashley's Frasers Group makes offer for Mulberry",
        "description": "The takeover approach values the luxury handbag maker at £83m amid concerns about its future.",
        "source": "BBC Business",
        "fetched_date": "2024-10-02T07:22:53.112071"
    },
    {
        "title": "A Himalayan river may be making Everest taller",
        "description": "River erosion at its base is helping push Mount Everest upwards, a new study says.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The world's greatest unpaid debt?",
        "description": "Should rich countries and fossil fuel companies pay for the climate losses and damages they have caused?",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The former trash islands teeming with life",
        "description": "Sri Lanka's capital city has transformed its polluted aquatic ecosystems into biodiverse havens for wildlife.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Earth tides: Why our planet's crust has tides too",
        "description": "How do they differ from the ocean? A geophysicist breaks it down for us.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The science behind the 'mini moon' entering Earth's orbit",
        "description": "An asteroid is going to circle our planet for two months this autumn before going on its way.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Iceland's high-tech farm turning algae into food",
        "description": "A facility near the Icelandic capital, Reykjavik, is using innovative farming technology to grow algae.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The Bahamas: The last lighthouse of its kind",
        "description": "Reece Parkinson heads to the Bahamas, where he meets a community adapting to unpredictable weather patterns.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The logger who learned to love trees",
        "description": "Roberto Brito learned how to use a chainsaw at the age of 11. Now he uses his intimate knowledge of the Amazon rainforest to guide tourists around in his flip-flops.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The shrinking habitat of a celebrity hippo",
        "description": "The illustrious Moo Deng has attracted a frenzy of attention. But in the wild, her species is quietly disappearing.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "How climate change is super-charging storms",
        "description": "Fueled by heat from ocean waters, hurricanes, typhoons and tropical cyclones are sometimes known as nature’s steam engines. We need to know how they are changing.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "The feud that brought electricity to New York",
        "description": "When electricity was first rolled out in New York in the late 19th Century, sparks flew between competitors. Today, the city is attempting to complete its electric evolution.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "How Vienna prepared itself for a 5,000-year flood",
        "description": "The steps Vienna took to prepare for extreme rainfall may hold lessons for how other cities can face deluges to come.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Why rivers need their curves back",
        "description": "For centuries meandering rivers have been straightened – but experts say restoring their natural bends and curves can prevent flooding and create healthy habitats for wildlife.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "'It smells like an overflowing food bin': The weird biology of the enormous 'corpse plant'",
        "description": "It stands metres high, takes a decade to flower, smells like death and draws huge crowds when it blooms. But scientists are still unravelling the baffling lifecycle of the titan arum.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Climate a more fundamental threat than terror - Lammy",
        "description": "Foreign Secretary David Lammy vows to put climate change at the heart of the UK's foreign policy.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Which is the 'dirty side' of a hurricane?",
        "description": "In tropical storms, location matters when it comes to what damage to expect – especially if you're on the \"dirty\" side of a hurricane, where winds can be up to 50% stronger.",
        "source": "BBC Earth",
        "fetched_date": "2024-10-02T07:22:53.207961"
    },
    {
        "title": "Henry Winkler and Chrissy Teigen Go K.A.M.P-ing at Hammer Museum Fundraiser",
        "description": "The family-focused event, which raises money for free kids programs at the museum, featured art activities and children's book readings by artists and celebrity guests.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Sean “Diddy” Combs to Face Lawsuits From 120 Additional Accusers",
        "description": "The complaints will start to be filed within 30 days in courts across the nation. Combs, who's already facing a dozen lawsuits over alleged sex crimes, has been denied bail for sex trafficking and racketeering charges.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Jon Bon Jovi to Join Stephen Colbert for Annual Montclair Film Festival Conversation (Exclusive)",
        "description": "The New Jersey rocker and subject of this year's Hulu docuseries 'Thank You, Goodnight,' will join the 'Late Show' host for a ticketed event at the New Jersey Performing Arts Center.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Ireland Boosts Local Film and TV Production With New Tax Incentive",
        "description": "The targeted approach aims to boost the Irish film scene, which is having a moment with buzzy features like 'Small Things Like These' and Gaelic rap comedy 'Kneecap.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Erewhon Teams With Deodorant and Body Care Brand Salt & Stone for Surprising Smoothie Collab",
        "description": "Salt & Stone founder Nima Jalali tells THR about partnering with Erewhon on the Salt & Serve creation: \"It's got a flavor that’s a bit unexpected but still really indulgent, and I think people are going to love it.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "DNC Targets J.D. Vance Ahead of VP Debate With New “Poster Boy” Ad Campaign (Exclusive)",
        "description": "The vice presidential candidates will face off near the ads in NYC on Tuesday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Pete Rose, Baseball’s Banned Hits Leader, Dies at 83",
        "description": "His cause and manner of death had not yet been determined.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Sean “Diddy” Combs Renews Bid for Release While Awaiting Trial",
        "description": "Combs was denied bail twice by a federal judge and magistrate over concerns that he poses a safety risk to the community and witnesses in the case.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "How the World’s Top News Orgs Hope to Tackle Misinformation as a Historic U.S. Election Looms",
        "description": "CBS News, the BBC, AP, Reuters and Paramount are all taking part in a first-of-its-kind initiative to tackle the rapid spread of misinformation in news.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "‘Rust’ Armorer Loses Bid for New Trial, Dismissal of Charges",
        "description": "The court said that Hannah Gutierrez-Reed's lawyer could've tested and presented evidence of a batch of ammunition, some of which matched the live rounds found on the 'Rust' set, but chose not to.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "‘Sing Sing’ Actor JJ Velazquez Sees Murder Conviction Vacated After 23 Years in Prison",
        "description": "Velazquez portrayed one of the inmates in the prison theater troupe in the A24 film.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Dikembe Mutombo, Hall of Fame NBA Player and Tireless Advocate, Dies at 58",
        "description": "The athlete had been battling brain cancer.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-02T07:22:53.590917"
    },
    {
        "title": "Peak XV trims fund size and fees as Indian market overheats",
        "description": "Peak XV, the largest India and Southeast Asia-focused venture firm, is reducing the size of a handful of its funds and lowering fees as it seeks to become “deeply aligned”…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Palmer Luckey: Every country needs a ‘warrior class’ excited to enact ‘violence on others in pursuit of good aims’",
        "description": "Palmer Luckey raged against America’s adversaries, endorsed completely autonomous weapons, and hinted at an Anduril IPO.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Impulse bets shuttling satellites between orbits is big business, and raises $150M to scale up",
        "description": "Impulse Space has raised a massive new tranche of funding as big-name investors bet that moving satellites around in orbit will soon be a high demand service.  The startup, which…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "A comprehensive list of 2024 tech layoffs",
        "description": "A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2024.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "A hidden microphone on a San Francisco street pole is spotting ‘bops’ in the wild",
        "description": "In San Francisco’s Mission district, good music is all around you. That’s why, high up on a street pole at an undisclosed location in the Mission, Riley Walz installed a…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Motorway’s Harry Jones on why he co-founded five startups with the same team",
        "description": "When Harry Jones, Tom Leathes, and Alex Buttle set out to found Motorway, a startup that connects car owners with dealers looking to buy and…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Threads users can now see who follows them from other fediverse servers",
        "description": "Instagram head Adam Mosseri announced on Tuesday that users who have connected their accounts to the fediverse, also known as the open social web, can now see who follows them…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Anthropic hires OpenAI co-founder Durk Kingma",
        "description": "Durk Kingma, one of the lesser-known co-founders of OpenAI, today announced that he’ll be joining Anthropic. In a series of posts on X, Kingma revealed that he’ll be working mostly…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Direct ocean capture may be the next frontier for carbon removal",
        "description": "Amsterdam-based Brineworks, a company specializing in seawater electrolysis technology, says its innovative method is expected to cost under $100 per ton of CO2 at scale.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "OpenAI’s DevDay brings Realtime API and other treats for AI app developers",
        "description": "It’s been a tumultuous week for OpenAI, full of executive departures and major fundraising developments, but the startup is back at it, trying to convince developers to build tools with…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Pinterest rolls out genAI tools for product imagery to advertisers",
        "description": "The new capability, rolling out Tuesday, will help advertisers who want to enhance their Pinterest Product Pins (ads) and attract more clicks, according to Pinterest.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Aspect Build gets $3.85M to help developers create software with Bazel",
        "description": "Monorepos are becoming an increasingly popular way to manage source code, but they require a slightly different toolset. Google developed its own internal build and test tool on top of…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Runware uses custom hardware and advanced orchestration for fast AI inference",
        "description": "Sometimes, a demo is all you need to understand a product. And that’s the case with Runware. If you head over to Runware’s website, enter a prompt and hit enter…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Acceleron Fusion has raised $15M to take another stab at cold fusion, filing reveals",
        "description": "Where most startups aim to recreate the superheated, super-pressurized conditions inside of a star, Acceleron takes a different approach.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Microsoft HoloLens 2 discontinued with no successor in sight",
        "description": "Microsoft was ahead of the game in the world of enterprise AR.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "The complete agenda for the Disrupt Stage at TechCrunch Disrupt 2024",
        "description": "Get ready for TechCrunch Disrupt 2024, our signature event for startups of all stages, taking place at Moscone West in San Francisco from October 28-30. This year, we’re expecting a…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Ashton Kutcher, Effie Epstein, and Guy Oseary are coming to TechCrunch Disrupt 2024",
        "description": "Last year, Sound Ventures, the 9-year-old, Beverly Hills, California-based venture firm led by general partners Ashton Kutcher, Guy Oseary, and Effie Epstein, announced a new $265 million AI fund that…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Numa raises $32M to bring AI and automation to car dealerships",
        "description": "Numa, a startup developing AI-powered automation tech for car dealerships, has raised fresh capital in a Series B round.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "How the FBI and Mandiant caught a ‘serial hacker’ who tried to fake his own death",
        "description": "Jesse Kipf was a prolific hacker who sold access to systems he hacked, had contacts with a notorious cybercrime gang, and tried to use his hacking skills to get off the grid for good.",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Ford cuts price of BlueCruise hands-free driving feature",
        "description": "Ford is slashing both the monthly and annual cost of its hands-free driver-assistance feature, BlueCruise, for new and existing owners in response to “customer and dealer” feedback, the company tells…",
        "source": "TechCrunch",
        "fetched_date": "2024-10-02T07:22:53.776117"
    },
    {
        "title": "Daicos upload sends footy world into frenzy",
        "description": "An unexplained photo of Argentinian football superstar Lionel Messi showing off an AFL jumper has got tongues wagging.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Legend’s plan to hurt Cleary at kickoff",
        "description": "Former Storm champion Cooper Cronk has outlined a brutal plan to test just how good Nathan Cleary’s shoulder really is.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "One reason for Socceroos’ poor start",
        "description": "Getting the best consistently out of several younger and inexperienced Socceroos is a challenge that awaits the national team’s new coaching staff.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "‘Funny journey’: Storm star’s unusual road to GF",
        "description": "Every player’s journey to the NRL grand final is different but few can rival Storm flyer Will Warbrick.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Daicos upload sends footy world into frenzy",
        "description": "An unexplained photo of Argentinian football superstar Lionel Messi showing off an AFL jumper has got tongues wagging.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "‘So special’: Blues mark historic milestone",
        "description": "It looked impossible 20 years ago, but Carlton will celebrate a significant milestone when its AFLW side runs out on Saturday night.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Dally M Awards night: Everything you need to know, expert tips",
        "description": "The best NRL and NRLW players of 2024 are set to be recognised at the Dally M Awards night tonight. Here’s everything you need to know ahead of our live coverage of the evening.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Legend’s plan to hurt Cleary at kickoff",
        "description": "Former Storm champion Cooper Cronk has outlined a brutal plan to test just how good Nathan Cleary’s shoulder really is.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Aussie World Cup weapon emerges",
        "description": "All-rounders are like gold in T20 cricket and among Australia’s list of them at the World Cup is a world class youngster showing what she can do.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "From ‘impossible’ to the T20 World Cup",
        "description": "When she had to drive her dog to the park and let it run around for exercise because she couldn’t even walk, the T20 World Cup seemed a long way away for Darcie Brown.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Kyrgios drops bombshell amid return reveal",
        "description": "Nick Kyrgios’ return to the court is getting closer by the day but the Aussie has also cryptically teased an even bigger announcement.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Stunning twist in doping case for Sinner",
        "description": "World number one Jannik Sinner has revealed he is “very disappointed” over the World Anti-Doping Agency’s latest move in his steroid case.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Ricciardo not dead yet as lifeline emerges",
        "description": "Although faint, Daniel Ricciardo’s F1 career still has a heartbeat as the sport refuses to let the Aussie veteran go.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "F1 rivals caught out in love triangle",
        "description": "Two of the F1 world’s rising stars have been tangled up in a messy love triangle with a glamorous model.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Vince McMahon’s sick plot for daughter exposed",
        "description": "Disgraced former WWE boss Vince McMahon has come under fire over a disgusting storyline he attempted to put his daughter in.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Nathan Cleary lifts lid on wild car chase",
        "description": "Nathan Cleary has detailed an eye-opening moment that unfolded with the paparazzi before his relationship with Mary Fowler went public.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Actor’s ‘shameless’ post after NBA icon dies",
        "description": "Hollywood star Rob Schneider has sparked a storm with an insensitive conspiracy theory claim over the death of an NBA legend.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Cult figure’s cause of death revealed",
        "description": "Dikembe Mutombo – one of the most iconic players of the 1990s known for his signature finger wag – has died aged 58.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "One reason for Socceroos’ poor start",
        "description": "Getting the best consistently out of several younger and inexperienced Socceroos is a challenge that awaits the national team’s new coaching staff.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Aussie strike stuns Mariners in shock Champions League defeat",
        "description": "An Australian once on the books of a Premier League club has sunk Central Coast Mariners in a stunning AFC Champions League Elite defeat to Thai club Buriram United.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Kiwi world title challenger’s Tyson Fury-like promise",
        "description": "Andrei Mikhailovich is promising a Tyson Fury-like shake up of world boxing when he steps into the ring as a massive underdog against the middle weight world champion in Sydney on Friday night.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Aussie gun calls for women’s President Cup",
        "description": "After more than two decades of the men losing to the USA in the Presidents Cup, Australia’s top-ranked female golfer says the women could do better if given a chance.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "NBL Late Mail: SuperCoach warning as Delly in doubt",
        "description": "Watch this space, SuperCoaches. Former NBA star Matthew Dellavedova has missed Melbourne United training and is in doubt.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Wallaby star to chase NFL dream",
        "description": "A Queensland Reds and Wallabies excitement machine has decided to chase a career in the NFL, his team has confirmed.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Reds and Blues set for Anzac Day battle",
        "description": "The Reds won’t settle for just making the quarter-finals in next year’s Super Rugby Pacific competition.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Nine Group 1 winners in the Turnbull Stakes field",
        "description": "A high quality field of 16 contenders has been declared to contest the $750,000 Group 1 Turnbull Stakes (2000m) at Flemington on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    },
    {
        "title": "Teen cyclist dead after horror incident",
        "description": "The cycling community has been rocked with news of an 18-year-old dying following a horror incident at the world championships.",
        "source": "News AU",
        "fetched_date": "2024-10-02T07:22:55.005801"
    }
]