[
    {
        "title": "US markets watchdog sues Musk over Twitter stake disclosure",
        "description": "The complaint filed to a US federal court alleges Musk saved $150m at the expense of Twitter shareholders.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Meta cuts 5% of jobs to lose 'lowest performers'",
        "description": "The company will shed roughly 3,600 roles but plans to backfill the roles later in the year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "LA fire victims fear new housing crisis",
        "description": "Thousands of people need new homes after losing everything. Some fear they may never get back on the property ladder.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Spain plans 100% tax for homes bought by non-EU residents",
        "description": "The measure is meant to help tackle the country's housing crisis, the prime minister said.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Meta cuts 5% of jobs to lose 'lowest performers'",
        "description": "The company will shed roughly 3,600 roles but plans to backfill the roles later in the year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Boeing output hit by strikes and safety problems",
        "description": "The troubled manufacturer says deliveries fell by a third last year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Buy something or leave, Starbucks says",
        "description": "The policy being rolled out in the firm's North American cafes comes as it tries to boost flagging sales.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "TikTok users flock to Chinese app RedNote as US ban looms",
        "description": "A swarm of \"TikTok refugees\" has made RedNote the most downloaded app on Apple's US App Store.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "The truth behind your $12 dress: Inside the Chinese factories fuelling Shein's success",
        "description": "Workers making clothes for the fast fashion giant tell the BBC they labour for up to 75 hours a week.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Norway leads world in electric cars. What can others learn?",
        "description": "Nine in 10 new cars in the country are now battery-powered, and it aims to hit 100% later this year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "US shares open higher after new PPI reading  - 14 Jan 2025",
        "description": "US shares opened higher after the Producer Price Index rose at a slower-than-expected pace in December.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "UK bans cattle, pigs and sheep imports from Germany after foot-and-mouth case",
        "description": "The disease is contagious in livestock like cattle, but poses no risk to humans or food safety.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "TikTok says report of possible sale to Musk 'pure fiction'",
        "description": "The firm has repeatedly said it will not sell its US operation as it face a 19 January deadline.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Google faces UK investigation over search dominance",
        "description": "The tech giant accounts for 90% of web searches in the UK - the regulator will probe whether that harms consumers and rivals.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Starmer and Reeves navigate tricky economic backdrop",
        "description": "Sir Keir Starmer and Rachel Reeves are the duo that best personify the Labour project of the 2020s.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "US tightens control on AI chips export drawing pushback",
        "description": "The new rules are intended to make sure the \"the world's AI runs on American rails\", and stays out of the hands of \"malicious actors\", say officials.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Apple pushes back on call to end diversity programme",
        "description": "The tech giant has asked investors to reject a proposal from a conservative group to end its DEI policies.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Chancellor will remain for all of Parliament, Downing Street says",
        "description": "Market jitters have raised questions over Rachel Reeves' management of the economy.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Online safety laws unsatisfactory, minister says",
        "description": "Peter Kyle responds as internet safety campaigner Ian Russell says laws to protect children need fixing.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Watch: I will work with Trump for low whisky tarriffs - Swinney",
        "description": "John Swinney says he will capitalise on Donald Trump's Scottish connection in an attempt to avoid tariffs being applied on imports to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Reeves defends China visit and hails £600m boost to UK",
        "description": "The chancellor has been criticised for making the trip while the UK government is under pressure from rising borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "More people in late 20s still living with parents",
        "description": "The rising cost of buying or renting home in the UK has led more to remain in the family home, a think-tank says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Meta and Amazon scale back diversity initiatives",
        "description": "The companies are among the latest major corporations to alter their diversity programmes since Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "US and UK toughen sanctions on Russian oil industry",
        "description": "The actions are aimed at cutting off revenue Moscow is using to fund its war in Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Fewer rate cuts and higher loan costs - how US jobs surprise affects you",
        "description": "Jobs growth in the US surged unexpected last month. That's good news for the world's largest economy but could be \"punishing\" for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "'I don't like this Musk chap': Reform members say they're unbothered by spat",
        "description": "Activists gathering at a regional conference assess whether the US billionaire could help or hinder the party.",
        "source": "BBC Business",
        "fetched_date": "2025-01-15T07:22:07.520746"
    },
    {
        "title": "Steve Guttenberg Gives Emotional Update on Wildfire Devastation: “We’re in Shock”",
        "description": "The actor, who has made headlines for assisting his Pacific Palisades community, tells The Hollywood Reporter about his neighborhood's plight: \"We're going to have some depression and a lot of sadness.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Hollywood Pantages Donates $125,000 to Firefighters, First Responders Amid L.A. Fires",
        "description": "The iconic theater in the heart of Hollywood is splitting the funds between five organizations supporting those tackling the wildfires and those facing immediate need.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Hollywood Stars Who Have Lost Homes in the Devastating L.A. Wildfires",
        "description": "Mandy Moore, Anna Faris, Milo Ventimiglia, Paris Hilton, Jeff Bridges, Bozoma Saint John, Mel Gibson, Billy Crystal and Diane Warren are among the celebrities whose houses were destroyed by the blazes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Palisades Fire: How the Will Rogers Ranch Horses Were Saved",
        "description": "The herd is now out of harm's way. But those responsible for their rescue face an uncertain future.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "O-Town Members Distance Themselves From Diddy: “We Have Nothing to Do With Him”",
        "description": "“We've already had a Lou [Pearlman] and now we're dealing with a Diddy,” says Erik-Michael Estrada.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "French Woman Says AI Brad Pitt Scammed Her Out of $850K",
        "description": "The scammers used fake, AI-generated photos of the megastar actor that led the French woman to believe she was communicating with the real Brad Pitt.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Ali MacGraw, Whose Malibu Home Burned Down in 1993, on Devastation of Loss and Best Ways Forward",
        "description": "The breakout superstar of 1970's 'Love Story' recalls the events of a fateful day when a fire claimed her Malibu home while offering advice to those experiencing much worse tragedy right now in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Sony Music Entertainment, Warner Music Group Call Off Grammy Week Events as Cancellations Mount Following Deadly L.A. Wildfires",
        "description": "The 2025 Grammy Awards are slated to take place on the ceremony’s original date of Feb. 2 and sources say the Clive Davis party is still on.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Kate Middleton “Relieved” to Be in Remission After Battling Cancer",
        "description": "The Princess posted to Instagram Tuesday: \"As anyone who has experienced a cancer diagnosis will know, it takes time to adjust to a new normal. I am however looking forward to a fulfilling year ahead.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Tony Slattery, British Actor, Comedian and ‘Whose Line Is It Anyway?’ Regular, Dies at 65",
        "description": "A contemporary of Emma Thompson, Hugh Laurie and Stephen Fry, he was featured in 'Peter's Friends' after they all met at Cambridge University.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Mandy Moore’s Family Sheltering With Hilary Duff After Home Impacted From L.A. Wildfires",
        "description": "In an Instagram post shared Tuesday, Moore's brother-in-law Griffin Goldsmith, whose home also burned down from the fires, expressed gratitude to Duff and her family for their generosity.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Ex-Home of Beach Boys’ Dennis Wilson, Where He Once Housed Manson Family, Survives Palisades Fire",
        "description": "14400 Sunset Blvd., where in the late 1960s Wilson would regularly host cult leader Charles Manson and many of his followers, has been left standing following the L.A. wildfires.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-15T07:22:08.589236"
    },
    {
        "title": "Kyrgios’ smacks down ‘jealous’ Aussie great",
        "description": "Nick Kyrgios has taken the baton from his doubles partner Thanasi Kokkinakis as the pair gang up on an Aussie legend.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Cracks appear, Djoker loses cool with coach",
        "description": "Novak Djokovic’s Australian Open campaign almost looked to be falling apart as the king of Melbourne Park let an unknown star run over him.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Perry’s urgings with Ashes up for grabs",
        "description": "Australia has arguably got out of jail, as England crumbled, in the opening two matches of the Ashes and there’s one thing superstar Ellyse Perry is urging her teammates to do in order to keep the pressure up.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "World No. 1 addresses elephant in the room",
        "description": "There is one staple missing from world No. 1 Aryna Sabalenka’s introduction to the court at the Australian Open – and it is the same reason she has a “blue flag”.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Perry’s urgings with Ashes up for grabs",
        "description": "Australia has arguably got out of jail, as England crumbled, in the opening two matches of the Ashes and there’s one thing superstar Ellyse Perry is urging her teammates to do in order to keep the pressure up.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "‘String of events’ leads to bad BBL news",
        "description": "A heavy fielding collision forced a key BBL all-rounder to be sidelined for 12 days, but another issue from the same game has ended his tournament as a key fast bowler  also suffered a serious injury.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Kyrgios smacks down ‘jealous’ Aussie great",
        "description": "Nick Kyrgios has taken the baton from his doubles partner Thanasi Kokkinakis as the pair gang up on an Aussie legend.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Cracks appear, Djoker loses cool with coach",
        "description": "Novak Djokovic’s Australian Open campaign almost looked to be falling apart as the king of Melbourne Park let an unknown star run over him.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Revealed: Full 2025 SuperCoach prices, boom and bust picks",
        "description": "A new SuperCoach season is just around the corner. Get an early sneak peek at full prices and positions – and the top picks – for six of the most relevant teams in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Sad Hird wife detail emerges amid split",
        "description": "It was revealed on Monday that James and Tania Hird had split after 27 years together – but there were clear signs it had been over for a while.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Star half drops Parramatta bombshell",
        "description": "Dylan Brown has reportedly informed the Eels of news that will send shockwaves across the NRL before the season begins.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "NRL trials schedule: First-look at new signings, positional puzzles",
        "description": "The countdown is on for NRL action with trials less than a month away. Find out when and where your team is playing and read every club’s in-depth season preview inside.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Football icon splits from wife after 30 years",
        "description": "Manchester City manager Pep Guardiola has split from his wife of 30 years, with reports claiming the pair had been living apart for nearly five years.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Nick Kyrgios reveals retirement bombshell",
        "description": "Nick Kyrgios has dropped a bomb surrounding his future at the Australian Open and it is not what fans want to hear.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Rams’ Wildcard win boosts LA as Dallas ponders Prime contender",
        "description": "There are just eight teams left standing in the NFL, while the Dallas Cowboys have approached a shock contender for their vacant coaching job.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "World losing its mind over Shaq footage",
        "description": "Video of NBA legend Shaquille O’Neal left looking tiny next to a record-breaking teenager is racing across the internet.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Timely return for A-League easybeats",
        "description": "Brisbane Roar need all the help they can get, so the return of a player from an overseas loan spell will be greatly appreciated by the struggling A-League club.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "‘F***ing insane’: PL fairytale the real deal as Reds silenced; 10-min disaster rocks City — Wrap",
        "description": "Nottingham Forest’s fairytale Premier League season took another big step on Tuesday when the former European champions secured a draw over league leaders Liverpool at home.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Redcliffe rematch for Wilson after controversial Navarrete title loss",
        "description": "Queensland boxer Liam Wilson is eyeing a rematch with the man who took the title he believes should be his, and it could be held on home soil this year.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "‘Sour taste’: Aussie F1 gun in huge trouble",
        "description": "A rare, thinly-veiled driver move could spell trouble for Australia’s newest F1 driver Jack Doohan with eyebrows raised.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Basketball Australia U20 Nationals: How to watch live, schedules, key info",
        "description": "Hoops stars of the future are set to shine at the Basketball Australia Under-20 & Ivor Burge National Championships in Ballarat. See how to watch every match LIVE.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "‘Easier than having a mate’: Why Doull’s partner was perfect caddy",
        "description": "Jordan Doull’s girlfriend, Kathryn Norris, put her own on course disappointment behind her to play an “instrumental” role in his remarkable win at the Webex Players Series. Here’s how it played out in WA.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Kembla preview: Cuban Rain is ready to make a splash",
        "description": "Local trainers Robert and Luke Price looks set for a good day at their home track with three leadings chances and a filly ready to run a cheeky race.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Wallabies star confident of securing new deal",
        "description": "A leading Wallaby is yet to secure his future beyond this year, but he seems anything but concerned about it.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Sales pitch begins to keep Wallabies coach",
        "description": "Public lauding of Wallabies coach Joe Schmidt will be the players’ way of convincing him to stay rather than private urgings that could put unwanted pressure on him.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-15T07:22:10.287456"
    }
]