[
    {
        "title": "Boeing offers staff 25% pay hike in bid to avoid strike",
        "description": "The tentative deal comes just days ahead of a possible strike at the plane maker's main factories.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Google's lucrative ad tech business goes on trial",
        "description": "Regulators have successfully argued Google is too powerful in search - now they are coming for its ad tech.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "The luxury plane that took flight 75 years ago",
        "description": "The Bristol Brabazon laid the foundation for the development of Concorde.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Where will the UK bury nuclear waste for 100,000 years?",
        "description": "Britain's nuclear waste needs a permanent home - but finding a community willing to take it is tricky.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Chinese giant Chery could build cars in UK",
        "description": "Chery is weighing up the possibility of building cars in the UK, according to a senior executive.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Google's lucrative ad tech business goes on trial",
        "description": "Regulators have successfully argued Google is too powerful in search - now they are coming for its ad tech.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Climate change leaves future of Pacific Islands tourism 'highly uncertain'",
        "description": "Tourist sector bosses in the region are increasingly concerned about the impact of climate change.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Starmer faces union pressure over UK winter fuel payment cut",
        "description": "Unite boss Sharon Graham suggests the government needs to be ''brave enough'' to admit they have made a mistake.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Corruption review finds 'red flags' in more than 130 Covid contracts in UK",
        "description": "An anti-corruption charity finds significant concerns in £15.3bn worth of contracts awarded during the pandemic.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "The luxury plane that took flight 75 years ago",
        "description": "The Bristol Brabazon laid the foundation for the development of Concorde.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Kakeibo: The Japanese art of saving money",
        "description": "Kakeibo, a century-old Japanese technique for budgeting, is a no-nonsense way to take charge of your finances.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "How Microsoft is tackling AI bias",
        "description": "Microsoft is turning to AI to make its workplace more inclusive",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Aly Raisman on competing at the highest level",
        "description": "The decorated US gymnast opened up to the BBC's Katty Kay about blocking out the noise, trusting her training and her winning mindset.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Jackie Joyner-Kersee's gold-medal attitude",
        "description": "The retired athlete and hall-of-famer opened up to the BBC's Katty Kay about the challenges she faced on the road to the Olympics, and the winning mindset that saw her through them.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "China shifts gear in Africa as it looks to a green future",
        "description": "China looks to invest in clean energy but it is not clear if this will shift the relationship with Africa.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Boeing Starliner returns to Earth, but without astronauts",
        "description": "The troubled spacecraft returns empty to New Mexico from the International Space Station.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "A tale of two towers - how fire safety differs at luxury London high-rise and Margate estate",
        "description": "Both buildings have had fires recently, but residents on opposite ends of the economic spectrum tell of very different experiences.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Owner of OnlyFans paid $631m as subscriptions rise",
        "description": "Leonid Radvinsky's huge earnings were revealed in the online platform's latest accounts.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Selena Gomez joins billionaire celebrity rich list",
        "description": "The celebrity joins the billionaire ranks thanks to her Rare Beauty make-up business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Mixed jobs report adds to US economy concerns",
        "description": "Employers added 142,000 jobs in August, figures show, which was less than expected.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "More councils to get control of local buses under planned law",
        "description": "Transport Secretary Louise Haigh promises to deliver a \"bus revolution\" that will save vital routes.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Aldi shoppers treat themselves as cost pressures ease",
        "description": "Aldi reveals it made an extra £2.4bn in sales in 2023, despite now facing a slowdown in growth.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Cockfosters car park plan 'ridiculous' - residents",
        "description": "Building 350 homes on the station car park will make it hard to get into central London, locals say.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "'Without emergency government fund, I wouldn't be here'",
        "description": "The BBC hears from those who have used the Household Support Fund, which has been extended until April 2025.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Body Shop's remaining stores rescued from administration",
        "description": "The deal for the cosmetics firm appears to secure the immediate future for remaining staff.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "What is the winter fuel payment and how can I still claim it?",
        "description": "A row over winter fuel payments exposes issues with unclaimed benefits such as pension credit.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "Fudge maker devastated as social media suspended",
        "description": "The family-run business claims it has lost almost 100,000 followers after Instagram's decision.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "First-class stamp price to rise to £1.65",
        "description": "The company says the price rise is needed as it faces \"very real and urgent\" financial challenges.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "UK house prices hit two-year high",
        "description": "The recent rate cut has boosted confidence among homebuyers, the UK's largest mortgage lender says.",
        "source": "BBC Business",
        "fetched_date": "2024-09-09T07:22:18.744480"
    },
    {
        "title": "The secluded life of the lasagne lizard",
        "description": "Scuba diving scientists are scouring riverbeds for the elusive, endangered hellbender – also known as the snot otter, or lasagne lizard – to give them a fighting chance of survival.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "How 'good fire' is reviving wildlife",
        "description": "The destruction a fire brings can be crucial for certain species to thrive. Meet the conservationists reviving the ancient art of \"good fire\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The largest dam removal in US history is complete",
        "description": "The Klamath River is free of four huge dams for the first time in generations. But for the Yurok tribe, the river's restoration is only just beginning – starting with 18 billion seeds.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Protecting Thailand's famous 'paradise beach'",
        "description": "Lucy Hedges is in Thailand where she explores the beach made world-famous by Hollywood.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The scientists drilling into an active Icelandic volcano",
        "description": "Scientists are preparing to drill into the rock of an Icelandic volcano to learn more about how volcanoes behave.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Earth's spectacular and remote 'capital' of lightning",
        "description": "With storms occurring between 140 to 160 nights a year, it's no wonder the area is a world record holder.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Less is more: Can degrowth save the world?",
        "description": "The degrowth movement questions the feasibility of the idea of endless economic growth on a finite planet.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "How fixing how we farm might stop the next pandemic",
        "description": "Land use for food and agriculture around the world is putting pressure on climate and biodiversity.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "How electric vehicles could improve our mental health",
        "description": "Noise and air pollution are major threats and EVs can therefore offer a promising solution.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "How greening our cities can reduce heat stress",
        "description": "Heat is the most deadly extreme weather phenomenon and cities are seeking ways to cool their urban cores.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "How climate chaos is threatening the real 'Paddington bear'",
        "description": "Drought forces the real Paddington Bear into deadly conflict with cattle farmers in the Andes.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Tidal kites: New technology harnessing ocean energy",
        "description": "These mechanical creatures lurk beneath the water's surface and power homes in the Faroe Islands.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Malaysia's adventure hotspot that crosses seven habitats",
        "description": "An 11-mile hike in the Bako National Park in Malaysia transports travellers through seven distinct habitats.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The global phenomenon swallowing whole neighbourhoods",
        "description": "Giant ravines: Entire communities are disappearing because of an extreme form of soil erosion.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "A tale of the US through abandoned buildings",
        "description": "Two urban explorers' stories of decay tell a tale of a changing American cultural landscape.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "What makes the emperor penguin an egg-cellent father",
        "description": "In the BBC Select documentary Penguins: Spy in the Huddle, we explore the world of penguin fathers.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The floating houses that are resilient to extreme weather",
        "description": "The floating houses built to withstand typhoons and flooding in the Philippines.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "What it's like to camp in Antarctica",
        "description": "Marc Cieslak spends a night on ice, camping under the stars.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Why sunsets on Mars are tinted blue",
        "description": "The reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Molossia: A small, unrecognised 'nation' within the US",
        "description": "With its own currency and 'head of state', this American micronation has become an odd tourist destination.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Can these 3D-printed sea walls protect marine wildlife?",
        "description": "One team is on a mission to create 3D printed sea walls with environmental benefits.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Ghost towns: What nature does without us",
        "description": "Ghost towns are remnants of lost communities but also a testament to nature's persistence.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Spectacular Nasa footage of solar activity behind the aurora",
        "description": "Our star's activity is increasing and that could mean more supercharged light shows on Earth.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The Sicilian ocean songs with a hidden message",
        "description": "Sicily's mysterious ocean songs contain secret messages about ancient fishing practices – with ramifications for today’s ecology.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "What we've learned since the biggest oil spill in US history",
        "description": "Fourteen years after the BP Deepwater Horizon disaster, would we fare any better at cleaning up another huge oil spill?",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The fall foliage town that banned influencers",
        "description": "As hordes of photographers began descending on a small, rural community to capture its vibrant autumnal colours, local residents have been fighting back.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The factor making it difficult for bees to find flowers",
        "description": "\"We're only touching the tip of the iceberg in terms of how these effects are influencing these pollinators.\"",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The giant vehicles pushing the limits of electric power",
        "description": "How much energy you can pack into a battery is one limit on how big an EV can get – but meet the EVs ditching batteries altogether to attain mammoth proportions.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The 'living tractors' reviving Turkey's wastelands",
        "description": "When water buffalo make a home for themselves in abandoned spaces, they can bring with them a rich array of frogs, bats and plant life.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Baby boom prompts call to boost wild beaver population",
        "description": "A leading conservation group wants the government to give the go-ahead to bringing back beavers in the wild.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "The reality of being homeless in a heatwave",
        "description": "IV drips, cooling centres and gallons of free water are just some of the tactics used to help the homeless in the US survive deadly heat.",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Surging seas are coming for us all, warns UN chief",
        "description": "Speaking to the BBC at the Pacific Islands Forum, António Guterres says these islands are the \"most vulnerable\".",
        "source": "BBC Earth",
        "fetched_date": "2024-09-09T07:22:18.833516"
    },
    {
        "title": "Could Two New Docs Subtly Change the Presidential Election?",
        "description": "Adam Kinzinger had turned down more than a dozen requests to make a documentary. Then the director of Hot Tub Time Machine walked in. The Illinois Republican congressman who famously — and largely solitarily — turned on Donald Trump after Jan. 6 was reluctant to participate in a movie that focused on his fading hopes to retain his seat. But Steve […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Megan Thee Stallion Wants to Collab With Taylor Swift",
        "description": "Megan Thee Stallion is looking to add to her long list of collabs with none other than Taylor Swift. The rapper spoke to People magazine about her hopes for working with The Tortured Poets Department singer-songwriter. “I love Taylor Swift, and I would like to collab with her one day,” Megan said. “She’s a stallion […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Will Jennings, Oscar Winner for “My Heart Will Go On” and “Up Where We Belong,” Dies at 80",
        "description": "Will Jennings, the Oscar-winning co-writer behind such hits as “My Heart Will Go On” and “Tears in Heaven,” has died. He was 80. Jennings died Friday morning at his home in Tyler, Texas, his caregiver, Martha Sherrod, told The Hollywood Reporter. He had been in declining health for the past five or six years, she […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Planes Targeting Trump Fly Over College Football Stadiums, Telling Voters to Sack Project 2025 (Exclusive)",
        "description": "College football fans who were tailgating at several universities this weekend were in for a surprise when planes carrying Election 2024 messages flew over their respective parking lots and stadiums. On Saturday, the second week of the 2024 college football season, planes carrying banner messages specific for three universities flew across the sky, courtesy of […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Dennis Quaid Says He Doesn’t “Regret Anything” About Marriage to Meg Ryan",
        "description": "Dennis Quaid is looking back at his previous marriage to Meg Ryan and sharing the best thing that came out of their relationship. The Reagan actor was recently interviewed on Who’s Talking to Chris Wallace?, where host Chris Wallace asked him if being in the spotlight — and being labeled one of “Hollywood’s golden couples” — […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Screamin’ Scott Simon, Longtime Sha Na Na Performer, Dies at 75",
        "description": "Screamin’ Scott Simon, who spent 52 years as the pianist of the energetic rock ’n’ roll and doo-wop group Sha Na Na, died Thursday in Ojai after a long battle with sinus cancer, his daughter Nina Simon announced. He was 75. A member of Sha Na Na from 1970 until they quit touring in 2022, […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Twice’s Tzuyu on Her Passion for Releasing a Solo Album and Her Advice to Aspiring K-Pop Idols",
        "description": "“I always had a curiosity of what it would be like to work as a solo artist and create my own music and do my own stage performance, and that curiosity kind of developed into a certain level of passion for it,” Tzuyu explains through a translator on Zoom with The Hollywood Reporter. The 25-year-old […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Ella Bleu Travolta Pays Tribute to Her Late Mother Kelly Preston With Touching New Song",
        "description": "John Travolta’s daughter Ella Bleu Travolta paid tribute to her late mother Kelly Preston with a touching new song, “Little Bird.” In the ballad, Ella sings about the weight of grief, wishing she could hear mom say, “My little bird, don’t you cry, hear my lullaby it’ll be alright.” The visuals accompanying the song feature […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Donald Trump’s Sentencing in Hush Money Trial Delayed Until After November Election",
        "description": "Donald Trump’s sentencing in his hush money case has been postponed until after the November election, granting the former president a hard-won reprieve as he navigates the homestretch of his current campaign and the aftermath of his criminal conviction. In a decision Friday, Manhattan Judge Juan M. Merchan delayed Trump’s sentencing until Nov. 26, three […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Sérgio Mendes, Brazilian Bossa Nova Giant and Bandleader, Dies at 83",
        "description": "Iconic bossa nova producer, songwriter, pianist and song interpreter Sérgio Mendes has died at 83. The legendary Brazilian superstar whose career spanned more than six decades and helped craft the modern sound of Latin pop and dance died in Los Angeles of undisclosed causes. Beginning in his teens, Mendes — who was born on Feb. […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "Music’s Platinum Players: From Beyoncé to Chappell Roan, Meet the 25 Stars Who Are Setting the Culture Afire",
        "description": "This past year, the new kids on the block have ruled the music scene. Chappell Roan emerged as the current princess of pop. Teddy Swims, Benson Boone and Tommy Richman marked breakthroughs, dominated streaming services and went viral on TikTok, as Shaboozey took over country music. Speaking of that genre, it’s continuing to explode on […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "James Murdoch, Barry Diller Among Media Execs Endorsing Kamala Harris in Open Letter",
        "description": "Dozens of senior corporate executives — including many with close tied to Hollywood and the media business — endorsed vice president Kamala Harris in an open letter released Friday morning. “Her election is the best way to support the continued strength, security, and reliability of our democracy and economy,” the letter states. “With Kamala Harris […]",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-09-09T07:22:19.078792"
    },
    {
        "title": "European VC Atomico closes $1.24B across two funds for early and growth-stage startups",
        "description": "Atomico has historically leaned toward earlier funding rounds while dipping into later stages where it made sense; now it’s setting itself up to focus just as much on the later…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "The Try Guys say their subscription strategy is working",
        "description": "YouTube creators The Try Guys claim they’re on-track to reach profitability, with subscriptions to their three-month-old, ad-free service 2nd Try now accounting for 20% of the company’s revenue. Those numbers…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Apple Intelligence delays could impede iPhone 16 ‘supercycle’",
        "description": "When Apple unveiled its AI plans at WWDC in June, analysts suggested the feature could put the iPhone 16 on track for another “supercycle.” Like the addition of 5G before…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Elon Musk says Tesla has ‘no need’ to license xAI models",
        "description": "Elon Musk has denied a report that one of his companies, Tesla, has discussed sharing revenue with another of his companies, xAI, so that it can use the startup’s AI…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "La French Tech gears up to go in a new direction",
        "description": "After weeks in political limbo, France now has a new prime minister, former EU’s Brexit negotiator Michel Barnier. But parliament remains bitterly divided, generating uncertainty for many economic sectors —…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Bending Spoons plans to lay off 75% of WeTransfer staff after acquisition",
        "description": "Italy-based app company Bending Spoons, which owns Evernote and Meetup, is planning to lay off 75% of the staff of file transfer service WeTransfer, TechCrunch has learned. Bending Spoons acquired…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Meta Llama: Everything you need to know about the open generative AI model",
        "description": "Like other generative AI models, Llama can perform a range of different assistive tasks, like coding and answering basic math questions, as well as summarizing documents in eight languages.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Apple Event 2024: iPhone 16, Apple Intelligence and all the other expected ‘Glowtime’ reveals",
        "description": "Apple’s Glowtime iPhone event will include the iPhone 16, but may also feature new AirPods, a new Apple Watch and possibly even new Macs.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Sunamp’s thermal battery uses a chemical found in salt-and-vinegar potato chips",
        "description": "The startup has devised a durable way to store solar power as heat that can then be used for household heating or hot water.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "The coolest startup in the Bay Area is a baseball team called the Oakland Ballers",
        "description": "This year, the B’s made their debut in the Pioneer League, a professional baseball organization that’s partnered with the MLB, but unlike the minor leagues, it’s not tied to any existing MLB teams.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Telegram reportedly ‘inundated’ with illegal and extremist activity",
        "description": "A New York Times analysis of more than 3.2 million Telegram messages from 16,000 channels found that the messaging platform has been “inundated” with illegal and extremist activity. Specifically, The Times…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Bluesky grows to 9M+ users",
        "description": "Bluesky keeps growing: The company announced that as of Friday morning, it had added 3 million new users, bringing its total user count to more than 9 million. In other…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Payroll startup Warp disavows ‘affiliate’ who posted about white superiority",
        "description": "Warp, a young payroll startup in New York, is in the spotlight following controversial posts from an account tied to the company. On Thursday, an account posting under the name…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Canva wants you to pay a lot more for its AI features",
        "description": "Canva is dramatically increasing prices for some customers. Canva Teams subscribers on older pricing plans will see a 300% increase for a five-person plan, jumping from $119.99 per year to…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Boeing’s Starliner performs flawless touchdown without on-board crew, program’s future remains uncertain",
        "description": "After months of delays and uncertainty, Boeing’s Starliner capsule has returned from the International Space Station, touching down in White Sands Space Harbor, New Mexico, just after midnight on Saturday. …",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Aptos CEO Mo Shaikh shares his journey to web3 and market opportunities in Asia and Middle East",
        "description": "TechCrunch sat down with Shaikh this week at the Korea Blockchain Week 2024 conference in Seoul to talk about Aptos’ expansion; its partnerships with major Asian web2 companies; and how…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Startups are getting fined, or sometimes banned, by individual states",
        "description": "The problem, experts say, is that each state has its own complex fees, tax, and business registration requirements.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "For security, we have to stop picking up the phone",
        "description": "Today’s scams can be as simple as picking up a phone call. To avoid the next fraud, there are good reasons to let your calls run to voicemail.",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "How a viral AI image catapulted a Mexican startup to a major adidas contract",
        "description": "Antonio Nuño, Fatima Alvarez, and Enrique Rodriguez have been friends since they were five years old. As teenagers, they became volunteers helping indigenous communities — first in Mexico, then in other countries — and saw that many of the women were artisans.  The trio came to realize that these artists…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Second Byju’s auditor exits in a year amid bankruptcy proceedings",
        "description": "BDO, the auditor for Indian edtech startup Byju’s, has resigned with immediate effect, marking the second auditor departure for the embattled startup in about a year and further intensifying concerns…",
        "source": "TechCrunch",
        "fetched_date": "2024-09-09T07:22:19.327272"
    },
    {
        "title": "Socceroos must be ‘brave’ in redemption bid",
        "description": "It’s not ‘a matter of life or death’ but the Socceroos are desperate to return winning ways against Indonesia in Jakarta.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Far from over’: Young gun out to revive Supercars title charge",
        "description": "Triple Eight young gun Broc Feeney experienced the highs and lows of racing during last year’s Supercars enduros. Now he’s ready to ignite his title charge with a twin assault at Sandown and Bathurst.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Athlete stripped of gold over banned flag",
        "description": "A Paralympic athlete has been sensationally stripped of his gold medal after he unfurled a banned flag during his celebrations.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Raygun’s shock new world ranking revealed",
        "description": "The drama engulfing Rachel “Raygun” Gunn has taken its biggest turn yet on the day the divisive athlete landed back in Australia.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Stinkers and stars in AFL finals voting",
        "description": "Finals can be the stage for players to make their reputations or break them and there was a smattering of both across the opening round of the AFL playoffs.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Bailey Smith drops bomb on Bulldogs",
        "description": "Bailey Smith has declared his next move will be to leave the Bulldogs with the club sending an immediate message to its rivals.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Felt sweet’: Perfect news for minor premiers",
        "description": "Melbourne Storm won its final home-and-away game by 38 points without the superstar fullback who will be ready to go for the finals.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Ridiculous’: NRL boss shuts down Bennett",
        "description": "The NRL boss left no doubt what he thought about master coach Wayne Bennett’s call to get rid of the Bunker after his team lost on Sunday.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Very rare’: Green makes T20 presence felt",
        "description": "Already a bona fide Test star and having plundered through the IPL, Cameron Green is showing his all-round abilities are key to the rebuilding Australian T20 team.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Aussies secure series whitewash after gun all-rounder’s career-best masterclass",
        "description": "Australia has secured a 3-0 series whitewash over Scotland following Cameron Green’s all-round heroics during the third T20I at The Grange on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Taylor, Travis stun with PDA at US Open",
        "description": "The A-list couple appeared more in love than ever during their very public date at the US Open.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Fans lose it over kiss as Kyrgios roasted",
        "description": "Jannik Sinner sealed his US Open victory with a kiss and many are trying to throw the special moment in Nick Kyrgios’ face.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Darts prodigy is ‘here to win’ in Australia",
        "description": "Luke Littler has taken the darts world by storm this year and the teenager is in Australia this week, determined to continue his red hot form.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Absolutely hate it’: Aussies in Paris drama",
        "description": "A new rule at the Olympics athletics events is sure to divide athletes and fans and produce high drama in Paris, writes Sally Pearson.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Astonishing ‘rise’ set to flip F1 in $215m race",
        "description": "Daniel Ricciardo has been given a reality check as the urgency mounts at Red Bull amid a three-horse race to replace a struggling driver.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Far from over’: Young gun out to revive Supercars title charge",
        "description": "Triple Eight young gun Broc Feeney experienced the highs and lows of racing during last year’s Supercars enduros. Now he’s ready to ignite his title charge with a twin assault at Sandown and Bathurst.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Shadowy F1 figure signs absurd $300m deal",
        "description": "Minds are being blown around the Formula 1 world with a secretive F1 official signing a deal that 18 drivers can only dream about.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Transformed Hollywood star unrecognisable",
        "description": "A former WWE heavyweight champion turned Hollywood star has left jaws on the floor after showing off his body transformation.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "$180 million star arrested in ‘absurd’ scene",
        "description": "One of football’s biggest stars was pinned to the ground and handcuffed outside of a stadium ahead of the opening game of the season.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Swift-Kelce photo could ‘break the internet’",
        "description": "A new photo of Taylor Swift and Kansas City Chiefs star Travis Kelce is quickly going viral and for a very sweet reason.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "NFL about to see something ‘never done before’",
        "description": "A historic, freakish feat seems destined to happen in the NFL this year — and it’s something even Tom Brady could only dream of.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Socceroos must be ‘brave’ in redemption bid",
        "description": "It’s not ‘a matter of life or death’ but the Socceroos are desperate to return winning ways against Indonesia in Jakarta.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Socceroo being ‘treated like a proper player’ again",
        "description": "A star Socceroo who is much happier after a change of clubs in England is intent on helping Australia bouncing back after a shock loss to Bahrain.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Combat coup: Foxtel, Kayo launch dedicated UFC channel",
        "description": "MMA fans, rejoice. A dedicated channel similar to Fox Footy AFL and Fox League NRL will give fans wall-to-wall UFC coverage for fight fans to devour.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Definitely pushing’: Major move for LIV players",
        "description": "There’s one significant thing LIV Golf has done that an Australian gun thinks could have big ramifications for local events in the future.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "SuperCoach NBL winner reveals his team for this season",
        "description": "How does the first winner of SuperCoach NBL plan to back to back? One team makes up almost half his starting squad. See his team here, plus expert advice.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Body found in search for rugby legend’s wife",
        "description": "Police have made a tragic discovery in the search for a rugby legend’s wife after she vanished going for a group swim.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Humiliating’: Wallabies torn to shreds",
        "description": "Australia has fallen apart on the international stage with the Wallabies imploding in spectacular fashion on Sunday morning.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "Muswellbrook, Queanbeyan tips, inside mail: $10 best bet",
        "description": "A Brett Cavanough-trained filly can bounce off her first run at Scone last month when she steps out for start number two at Muswellbrook on Tuesday.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    },
    {
        "title": "‘Incredible’: Aussie trio make cycling history",
        "description": "One Australian on the podium at the end of a cycling grand tour is an achievement, but three in Spain made for an historic day.",
        "source": "News AU",
        "fetched_date": "2024-09-09T07:22:20.743645"
    }
]