[
    {
        "title": "Trump will 'probably' cut Mexico and Canada tariffs - US commerce chief",
        "description": "Canada's Minister of Foreign Affairs told the BBC's Newsnight her office had not been contacted about the plan.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "China targets 5% growth as it reels from Trump tariffs",
        "description": "A key meeting has begun to revive China's lagging economy, which is now facing a trade war with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "US stock markets fall amid trade war fears",
        "description": "Canada's Prime Minister Justin said Donald Trump's decision to impose import taxes was \"very dumb\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Apple takes legal action in UK data privacy row",
        "description": "The tech giant is appealing a government order for access to customers' private data, the BBC understands.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "China targets 5% growth as it reels from Trump tariffs",
        "description": "A key meeting has begun to revive China's lagging economy, which is now facing a trade war with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Hong Kong billionaire to sell Panama Canal ports to US firm",
        "description": "BlackRock will buy two ports after Trump's interest in taking back control of the key shipping route.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Can Tesla's EVs win over India's price-conscious buyers?",
        "description": "The EV giant has begun hiring in India and is reportedly hunting for showrooms in Delhi and Mumbai.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Trudeau hits out at 'dumb' tariffs as Trump warns of further hikes against Canada",
        "description": "Canada has imposed its own retaliatory tariffs, which will remain in place until the US reverses course.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Trump tariffs could be good for some countries, including the UK",
        "description": "Donald Trump's tariffs on Canada, Mexico and China have turned back the clock 70 years, erasing decades of globalisation.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "What we can read into China's tariffs response",
        "description": "Beijing's tit-for-tat measures are an opening swing, not a direct punch.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "What minerals does Ukraine have and what are they used for?",
        "description": "A minister says nearly all key details have been finalised for a deal giving the US access to the country's minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Supreme Court wary of Mexico's fight against US gunmakers",
        "description": "Mexico accuses US firms of practices that help arm gangs, but the US gun trade association denies wrongdoing.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "'I will have to raise prices by 10%' - toymakers warn of tariff pain",
        "description": "Trump tariffs have left toymakers stunned, scrambling and warning of higher prices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Six things that could get more expensive for Americans under Trump tariffs",
        "description": "Economists warn that new tariffs on Canadian and Mexican goods could push up prices on a wide range of products.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Zero-hour contract ban in UK to include agency workers",
        "description": "The policy is part of 250 additions to the Employment Rights Bill, although the amendment will not spell out what \"short notice\" means.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Trump's tariffs risk economic turbulence - and voter backlash",
        "description": "Trump is making a high-stakes bet that could either reap major political dividends, or seriously undercut his second term.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Rising egg prices in the US spark chicken rental trend",
        "description": "The service provides hens, feed, and support for six months, allowing customers to collect fresh eggs at home.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Bubble tea chain bigger than Starbucks sees shares jump on debut",
        "description": "Mixue's shares rose by more than 40% in their Hong Kong Stock Exchange debut.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Markets sink as Trump confirms tariffs on Canada, Mexico and China",
        "description": "The US president has repeatedly threatened to tax imports from two of the country's closest neighbours.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Ban on India's stock market 'She-Wolf' puts regulators on the spot",
        "description": "India's market regulator recently banned a dozen financial influencers from giving trading advice.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Ex-Barclays boss with Epstein links seeks to clear name",
        "description": "Jes Staley wants to overturn a decision by the UK regulator banning him from holding a senior role in the City.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Diversity backlash: Is 'masculine energy' coming to the UK?",
        "description": "Donald Trump has scrapped federal diversity initiatives and many US firms have too - will UK companies follow suit?",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Switzerland targets rich tourists but at what cost?",
        "description": "Switzerland's already upmarket tourism sector is trying to attract more high rollers.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Crypto prices rally after Trump backs five coins for 'crypto reserve'",
        "description": "Trump named five cryptocurrencies he wanted in a potential national reserve so the US could become \"the Crypto Capital of the World\".",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "In the US, DEI is under attack. But under a different name, it might live on",
        "description": "Donald Trump has promised to \"terminate\" diversity programmes. But a rebrand might yet save them.",
        "source": "BBC Business",
        "fetched_date": "2025-03-05T07:24:34.808990"
    },
    {
        "title": "Jay-Z Suing Woman Who Accused Him of Raping Her at 13 in New Lawsuit",
        "description": "The suit also names Texas lawyer Tony Buzbee, who has been at war with the rap mogul ever since his name entered the attorneys frenzy of \"Diddy\" lawsuits.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Meet Everyone Hates Elon, the U.K.-Based Collective Attempting to Take Down Musk: “Let’s Make Billionaires Losers Again”",
        "description": "The group recently became an online sensation thanks to posters they plastered all over London picturing the richest man in the world making his infamous Hitler-like salute while in a Tesla (which they call a \"swasticar\"): \"This is a real moment where people have had enough of billionaires getting involved in our politics.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Kimberly Burch,  Fiancée of Faster Pussycat Singer Taime Downe, Falls to Death on Royal Caribbean Ship During The 80s Cruise",
        "description": "The 1980s nostalgia cruise features the likes of Squeeze, Adam Ant, Tiffany and Men at Work.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Lyle and Erik Menendez’s Upcoming Day in Court Delayed as Newsom Steps Into Battle For Freedom",
        "description": "The governor of California seemed to be reacting to the new L.A. district attorney's attitude about victimhood when he ordered a Parole Board risk assessment for the incarcerated Menendez brothers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "BBC Boss Isn’t “Ruling Out” Reinstating Gaza Doc, Admits “Unanswered Questions Weren’t Followed Up”",
        "description": "Tim Davie said no one needs \"any prodding\" on an independent investigation into the BBC's scandal-hit Gaza documentary, in which one of the young Palestinian boys was found to have ties to Hamas.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Carl Dean, Dolly Parton’s Husband of Nearly 60 Years Who Inspired ‘Jolene,’ Dies at 82",
        "description": "Parton met Dean outside the Wishy Washy Laundromat the day she moved to Nashville at 18.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Trump and Vance Pulled an Old Hollywood Trick on Zelensky (Guest Column)",
        "description": "By letting his vice president instigate the Oval Office blowup with the Ukrainian leader, Trump resorted to a timeworn industry technique a veteran screenwriter calls \"The Stranger in the Room.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Candace Owens’ Latest Crusade: Exonerating Harvey Weinstein",
        "description": "The far-right and vociferous anti-#MeToo commentator who left Ben Shapiro’s media outfit amid antisemitism allegations said she has been talking to the imprisoned producer for years: \"It will explode the world.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Contradictory Accounts of Gene Hackman’s Health in His Final Months Emerge",
        "description": "Multiple accounts from family and those close to the late actor and his wife indicate the couple withdrew from everyone in their final days and weeks.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Tate McRae Earns First U.S. No. 1 Album With ‘So Close to What’",
        "description": "The 21-year-old pop star is also preparing to head to out on a massive 82-date world tour.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "3.9-Magnitude Earthquake Shakes L.A. on Hollywood’s Biggest Night",
        "description": "The 2025 Oscars wrapped just hours before the quake hit North Hollywood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "Chappell Roan Duets With Elton John on ‘Pink Pony Club’ for Electric Oscar Party Performance",
        "description": "The 27-year-old breakout, aka the Midwest Princess, is expected to do a 45-minute set inside the starry fundraiser co-hosted by Jean Smart, Sheryl Lee Ralph, Neil Patrick Harris and David Burtka.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-03-05T07:24:35.326499"
    },
    {
        "title": "‘Great ride’: Smith’s retirement bombshell",
        "description": "Following Australia’s loss to India in the Champions Trophy, skipper Steve Smith has made a huge call over his playing future.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Get to 40’: Durable Pie determine to power past 250",
        "description": "Collingwood star Jack Crisp will become a 250-game player this weekend, but he has his eyes set on playing deep into his 30s — and maybe even to 40.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Outplayed not disadvantaged: Smith denies India leg up in loss",
        "description": "The Dubai wicket was ‘completely different’ to the one Australia had played on in Pakistan but skipper Steve Smith refused to concede it disadvantaged the Aussies in their semi final loss against India.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Key inclusion to keep 22-year streak alive",
        "description": "It’s been two decades since Melbourne Storm lost an opening round match, and despite fitness doubts, one superstar is ready to fire.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Key inclusion to keep 22-year streak alive",
        "description": "It’s been two decades since Melbourne Storm lost an opening round match, and despite fitness doubts, one superstar is ready to fire.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Safe’: Broncos move amid cyclone backlash",
        "description": "The NRL is under fire for forcing players to leave Brisbane with a cyclone approaching and the Broncos coach has revealed what the club is doing to help.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Get to 40’: Durable Pie determine to power past 250",
        "description": "Collingwood star Jack Crisp will become a 250-game player this weekend, but he has his eyes set on playing deep into his 30s — and maybe even to 40.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Heartbreak’: AFL great’s wedding called off",
        "description": "The footy legend father of a Channel 7 star has gone public with the family’s heartbreak after his son’s wedding was suddenly called off.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Great ride’: Smith’s retirement bombshell",
        "description": "Following Australia’s loss to India in the Champions Trophy, skipper Steve Smith has made a huge call over his playing future.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Outplayed not disadvantaged: Smith denies India leg up in loss",
        "description": "The Dubai wicket was ‘completely different’ to the one Australia had played on in Pakistan but skipper Steve Smith refused to concede it disadvantaged the Aussies in their semi final loss against India.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Tennis star slams Trump for ‘hurting’ nation",
        "description": "Ukraine’s top ranked tennis player has criticised US President Donald Trump for decisions that are “hurting” Ukraine against Russia.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Aussie surge nets five-year first",
        "description": "A rankings breakthrough by a teenage tennis star has set a five-year benchmark for Australia ahead of a big teams event.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Scary’ Kiwi netball recruit in Aussie coup",
        "description": "The NSW Swifts head into the 2025 Super Netball season as one of the premiership favourites after signing New Zealand’s best player.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "F1 boss’ four-word reaction to sext scandal",
        "description": "Christian Horner’s reaction to his bombshell sexting scandal last season has been revealed ahead of the new season of Drive to Survive.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Russell edges Verstappen to post fastest testing time",
        "description": "George Russell struck late on the third and final day of Formula One pre-season testing as he edged four-time reigning world champion Max Verstappen to post Friday’s fastest time.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘No grudges’ as Reds face former favourite son",
        "description": "The Reds are fully aware of the damage former Queensland star James O’Connor can cause them on Sunday in Christchurch.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Revenge is sweet for the Queensland Reds",
        "description": "Almost 12 months after losing to the Western Force in Perth, the Queensland Reds have returned fire, claiming a hard-fought win in the dying moments in Super Rugby.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Absolute chills’: NBA star’s heartbreaking act",
        "description": "The Dallas Mavericks’ nightmare season has gone from bad to worse after Kyrie Irving went down with what could be a serious injury.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Games moved, postponed: How TC Alfred has sidelined sport",
        "description": "Tropical Cyclone Alfred has wreaked havoc on sports across all levels in Queensland, with AFL and NRL among those forced to reconsider their plans for this weekend.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Socceroo makes timely return",
        "description": "While it’s good news for one Socceroo, another has been sidelined for the rest of the season with an ankle injury.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "‘Worst call I’ve seen’: Boxing in disbelief",
        "description": "Boxing controversy has erupted after superstar Gervonta ‘Tank’ Davis was seemingly granted preferential treatment in his world title fight.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "LIV star claim as golf war nears end",
        "description": "While the golf world inches closer to LIV stars possibly returning to the PGA Tour, one major champion has reportedly made his plans clear.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "LeBron stuns NBA world with unbeatable points record",
        "description": "In the debate as the greatest basketballer of all-time, LeBron James has notched another stunning record which is unlikely to ever be broken.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Moree preview: Brown hoping to Snatch a win despite big weight",
        "description": "Tamworth trainer Wayne Brown in concerned about Snatchreilly’s big handicap and is relying on the gelding’s class advantage to help get him home.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Legend’s daughter’s big news after break-up",
        "description": "The daughter of a football icon has announced big personal news after her split from disgraced NRL player Brett Finch.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    },
    {
        "title": "Teen crushed to death in horror gym accident",
        "description": "Graphic Warning: Gym goers have been left shaken after a teenager was crushed to death in a shocking weightlifting accident.",
        "source": "News AU",
        "fetched_date": "2025-03-05T07:24:37.950325"
    }
]