[
    {
        "title": "How scammers duped India job seekers with a fake bank",
        "description": "Job scams are not uncommon in India but the setting up of a fake branch still took many by surprise.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Blade Runner 2049 maker sues Musk over robotaxi images",
        "description": "Alcon Entertainment says it specifically denied a request to use material from the film at the event.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Vulnerable customers had VW cars taken away",
        "description": "VW Finance showed \"a lack of empathy\", according to the Financial Conduct Authority.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "TikTok owner sacks intern for sabotaging AI project",
        "description": "Chinese technology giant ByteDance denied reports that the incident caused more than $10m of damage.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "How hoax bomb threats are hurting air travel in India",
        "description": "An unprecedented surge in hoax bomb threats to Indian airlines is wreaking havoc on the industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Blade Runner 2049 maker sues Musk over robotaxi images",
        "description": "Alcon Entertainment says it specifically denied a request to use material from the film at the event.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "A Netflix for the village - India's start-ups go rural",
        "description": "Indian start-ups are shifting their focus to rural consumers, hoping to tap into a new wave of growth.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Musk is giving some US voters $1m. Is it legal?",
        "description": "Two voters have already picked up their lottery-style cheques for a million dollars from Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Liam Payne's death prompts music industry soul searching",
        "description": "Is duty of care to musicians, particularly young artists, being addressed in the music industry?",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Vulnerable customers had VW cars taken away",
        "description": "VW Finance showed \"a lack of empathy\", according to the Financial Conduct Authority.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Pound falls as UK inflation declines - 16 Oct 2024",
        "description": "The British currency fell greater than expected and came up against a very strong dollar.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Would Donald Trump’s taxes on trade hurt US consumers?",
        "description": "What could happen if Donald Trump drastically increases tariffs as he has promised to do?",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Harris and Trump gamble $200m on biggest prize",
        "description": "The Keystone State is the lynchpin of the swing-state electoral firewalls for both campaigns.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "How Duolingo became so addicting, according to its CEO",
        "description": "Perhaps no app has mastered user loyalty quite like Duolingo, the gamified language-learning platform 34 million people a day can't put down.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Holiday in Greenland? New airports aim to entice tourists",
        "description": "The Arctic territory hopes that three new airports will pave the way for direct flights from the US and Europe.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "The work sickness timebomb that risks a lost generation of UK workers",
        "description": "Britain is sick, and getting sicker. Economics editor Faisal Islam unpacks whether the government can get people working again.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Top vaccine maker buys stake in major Bollywood studio",
        "description": "The deal comes at a time when Bollywood is struggling to overcome its lean patch since the Covid-19 pandemic.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Musk's $1m-a-day to swing states voters 'deeply concerning'",
        "description": "The winner will be chosen from those who sign a petition by the tech billionaire's Trump-supporting group.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Boeing strikers to vote on 35% pay rise offer",
        "description": "About 33,000 unionised workers, mostly in Seattle, will decide this coming week whether to accept the deal.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "NHS consultant who lost £39k among 100 Revolut customers contacting BBC over scams",
        "description": "People say they have been poorly treated by the firm after being tricked out of cash while using app.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "How does WhatsApp make money? It's free - with some tricks",
        "description": "We all use messaging apps such as WhatsApp for free, but what's in it for them?",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Hurricane Oscar hits Cuba as it struggles with power outage",
        "description": "Millions of people are still without power, with food rotting in fridges and no water supply in many homes.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Meet the TikTokers buying up Japan’s empty homes",
        "description": "Content creators are going viral for renovating abandoned Japanese homes for low prices - but is all as it seems?",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "China's economic slowdown deepens",
        "description": "Gross domestic product rose by 4.6% on a yearly basis, below Beijing's \"around 5%\" annual target.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "US probing Elon Musk's Tesla over self-driving systems",
        "description": "The National Highway Traffic Safety Administration's evaluation is the first step toward a potential recall of 2.4 million Tesla vehicles",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Trump says Apple boss called him to complain about EU",
        "description": "The EU ordered Apple to pay Ireland billions in unpaid taxes in September.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Is esports a viable career path for young Africans?",
        "description": "With esports on the rise across the continent, could more young Africans make a career as professional gamers?",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Boohoo considers break-up as sales slide",
        "description": "The online fashion firm is mulling whether to offload its brands as sales remain under pressure.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "Tobacco firms to pay $23.6bn in proposed Canada settlement",
        "description": "The deal includes up to C$100,000 in compensation for some smokers and would resolve a decades-long legal fight with cigarette-makers.",
        "source": "BBC Business",
        "fetched_date": "2024-10-22T07:25:40.290812"
    },
    {
        "title": "‘The Office’ Star Jenna Fischer Called Christina Applegate Right Away After Receiving Breast Cancer Diagnosis",
        "description": "The sitcom actress reveals the fellow survivor was one of the first people she phoned after getting the news.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Steven Spielberg, Spike Lee and Ken Burns Among Recipients of National Medals of Arts",
        "description": "Missy Elliott and Queen Latifah are also among the 20 recipients of National Medals of Arts, which will be formally presented by President Joe Biden at a White House ceremony.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Grammys: Tyla’s Album Kicked Out of R&B, Will Compete in Pop (Exclusive)",
        "description": "The singer, whose viral hit \"Water\" won the inaugural best African music performance Grammy earlier this year, will compete in pop with her debut album, though it is rooted in Afrobeats and R&B.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "L.A. Dodgers Headed to World Series After Beating Mets, Will Face Yankees in the Fall Classic",
        "description": "The Dodgers eliminated the Mets on Sunday night in Game 6 of the National League Championship Series. Game 1 of the World Series airs Friday on Fox.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Alex Edelman Reveals Past Connection With Steven Spielberg’s Mother at Shoah Foundation Gala",
        "description": "The star-studded New York event celebrated the 30th anniversary of the USC-based organization that aims to collect, preserve and share testimonies with survivors and witnesses of the Holocaust and other genocidal crimes as well as to document and combat contemporary antisemitism.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "’60 Minutes’ Responds to Donald Trump’s Accusation Over “Deceitful Editing” of Kamala Harris Interview: “That Is False”",
        "description": "\"Former President Donald Trump is accusing '60 Minutes' of deceitful editing of our Oct. 7 interview with Vice President Kamala Harris. That is false,\" the CBS newsmagazine said Sunday, while the Trump campaign responded that the show \"just admitted to doing exactly what\" he accused them of.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "LGBTQ+ Filmmakers, Activists Address How Hollywood Can Confront the Current Moment at NewFest36",
        "description": "A collection of voices across art and politics took part in a conversation about how storytelling and social media can help respond to anti-LGBTQ+ backlash.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Jennifer Lawrence Is Pregnant, Set to Welcome Second Baby With Cooke Maroney",
        "description": "The news was confirmed after the Oscar-winning actress was spotted Saturday night in Los Angeles with a visible baby bump.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "2024 Rock & Roll Hall of Fame Induction: The Best Moments",
        "description": "The celebratory night featured a Cher and Dua Lipa duet, Kelly Clarkson leading a Foreigner supergroup and Dave Matthews Band covering Talking Heads.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Zayn Malik Postpones U.S. Tour Dates Due to the “Heartbreaking Loss” of Liam Payne",
        "description": "Payne died Wednesday in Argentina.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Cindy Charles, Twitch’s Head of Music, Dies in Traffic Accident at 69",
        "description": "\"Anyone that uses music on Twitch owes a debt of gratitude to Cindy's work,\" wrote Twitch CEO Daniel Clancy in a tribute.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "Cheryl Cole Speaks Out on Liam Payne’s Death, Says Their Son Has to “Face Reality of Never Seeing His Father Again”",
        "description": "\"Please give Liam the little dignity he has left in the wake of his death to rest in some peace at last,\" the English singer and television personality said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-10-22T07:25:40.521392"
    },
    {
        "title": "‘Massive’: Warner lands new cricket role",
        "description": "He may be retired from international cricket but fans will still get a glimpse of David Warner this summer, with the veteran landing a new gig.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Critics call out mass Commonwealth Games cull",
        "description": "There were some certainties around which sports would be axed for the cut-price 2026 Comm Games but the shock was in some which made the cut.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "NFL icon’s engagement plans for 24yo gf",
        "description": "The NFL coaching legend has been dating his much, much younger partner since earlier this year and is making big plans.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "‘Don’t like it’: Marnus act divides cricket",
        "description": "A former Australian captain has called out Marnus Labuschagne over a bizarre act to start the summer, declaring “I really wish he wouldn’t”.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Uncapped ruck could play All-Stars game",
        "description": "With the AFL Indigenous All Stars set to return after a 10-year hiatus, a ruckman without a senior game could be in line for a big promotion.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "From Kenya with love: Breakout AFLW star’s inspiring story",
        "description": "Elaine Grigg and Western Bulldogs heard the outside noise — and answered it emphatically. The young Bulldogs star explains how she helped her side go from dour to delirium inside a week.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "No hard feelings for grand final rivals",
        "description": "Vibes are high in Kangaroos camp with players going from grand final rivals to good mates ahead of this week’s clash with the Kiwis.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Test your knowledge with our ultimate NRL 2024 quiz",
        "description": "Think you know your rugby league? Were you paying attention throughout the 2024 NRL season? Take our quiz and put your knowledge to the test.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "‘Massive’: Warner lands new cricket role",
        "description": "He may be retired from international cricket but fans will still get a glimpse of David Warner this summer, with the veteran landing a new gig.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "‘Don’t like it’: Marnus act divides cricket",
        "description": "A former Australian captain has called out Marnus Labuschagne over a bizarre act to start the summer, declaring “I really wish he wouldn’t”.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Tennis stars hit out: ‘Stop ruining the sport’",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Big tennis change coming to Aussie comps",
        "description": "A massive rule change will get its first exposure in Australian tennis tournaments this summer, but it won’t be popular with all players.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Broncos coach’s ‘unforgivable act of treason’",
        "description": "Michael Maguire has been brutally called out over a “gut punch” inflicted on an entire state as the real losers of his bombshell move emerge.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Elephant in the room in Grand Final loss",
        "description": "The Sydney Swans have let another golden opportunity slip, and there’s an inescapable truth their supporters won’t want to hear.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Infuriating detail on AFL premiership Cup",
        "description": "It’s the trophy every team wants to lift on Grand Final day, but one missing detail continues to baffle AFL fans. Now it’s been explained.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Norris stripped of podium in wild F1 drama",
        "description": "Lando Norris had a podium finish taken away as the McLaren driver traded protests with Max Verstappen in a wild finish on Monday.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Vintage Marquez produces stunning Aus MotoGP victory",
        "description": "A stunning ride from eight-time world champion Marc Marquez has delivered him a brilliant victory at the Australian MotoGP despite a dramatic start off the grid, while Aussie Jack Miller came home strong.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "America loses it as Trump streaker ’jailed’",
        "description": "An X-rated entertainer waving a divisive sign has been identified as the woman behind an NFL stadium stunt that has gone viral.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "World rocked as surfer impaled by swordfish",
        "description": "A popular surfing figure has died at the age of 36 after a freak incident where she was fatally impaled by a swordfish.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "NFL icon’s engagement plans for 24yo gf",
        "description": "The NFL coaching legend has been dating his much, much younger partner since earlier this year and is making big plans.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "America loses it as Trump streaker ’jailed’",
        "description": "An X-rated entertainer waving a divisive sign has been identified as the woman behind an NFL stadium stunt that has gone viral.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Ex-A-League star in way of Sydney FC",
        "description": "One of the A-League best players from last season looms as Sydney FC’s biggest threat in Japan on Wednesday night.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Matildas veteran’s Asian Cup aim",
        "description": "As the Matildas embark on their journey to the 2026 Women’s Asian Cup, a veteran of the squad has stated her intention be part of the tournament on home soil.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Major development after Olympics farce",
        "description": "Imane Khelif has announced a huge career move and the release of a new documentary months after winning gold at the Paris Olympics.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Wet and wild conditions wreaks havoc as Smylie secures first tour win",
        "description": "Queensland young gun Elvis Smylie secured his first tour win as a professional in a tense final day at the WA Open despite horrible conditions threatening to stop play all throughout the day.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "NBL Late Mail: Good news on top trade Delly",
        "description": "Matthew Dellavedova is the sixth most purchased SuperCoach NBL player this week and he has received positive news on an ankle injury, plus the latest on Bryce Cotton.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "NRL convert in shock Wallabies call",
        "description": "His last game was in an NRL final and now Joseph-Aukuso Suaalii is set to play his next match as a Wallaby in the UK after a rapid elevation and confirmation he’s not going to England just for a ride.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "‘I’m ready’: Sad sight for NRL lovers",
        "description": "Less than a month after playing in an NRL preliminary final, the newest multimillion-dollar signing for Australian rugby declared himself ready to wear Wallaby gold.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Muramasa sacrifice could be rewarded in Geelong Cup",
        "description": "A tough decision to scratch Muramasa from the $5m Caulfield Cup last week could lead to a win in Wednesday’s Geelong Cup instead.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    },
    {
        "title": "Second tragedy hits Olympian icon after reveal",
        "description": "After dropping heartbreaking news about his terminal diagnosis, Sir Chris Hoy has gone public with his family’s second secret tragedy.",
        "source": "News AU",
        "fetched_date": "2024-10-22T07:25:42.397772"
    }
]