[
    {
        "title": "Wall Street stocks bounce back from Trump tariff losses",
        "description": "Investors were buoyed by a better-than-expected jobs report and rising hope of US-China trade talks.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Tariffs on car parts entering the US come into force",
        "description": "Import taxes were eased after carmaker outcry,  but it's \"still a big tariff\", analysts say.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "M&S supplier resorts to pen and paper after cyber attack",
        "description": "What's going on behind the scenes in the aftermath of the cyber attack on M&S.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Co-op cyber attack affects customer data, firm admits, after hackers contact BBC",
        "description": "The firm previously said there was \"no evidence that customer data was compromised\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Tariffs on car parts entering the US come into force",
        "description": "Import taxes were eased after carmaker outcry,  but it's \"still a big tariff\", analysts say.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "US court rules ex-Abercrombie CEO unfit for trial",
        "description": "Mike Jeffries is \"mentally incompetent\" and will spend time in hospital to see if his condition improves, a judge rules.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "US jobs grow by more than expected despite tariff turmoil",
        "description": "Employers added 177,000 roles in April as the jobs market continues to prove resilient.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Temu to stop selling goods from China directly to US customers",
        "description": "The online marketplace says it will move to a \"local fulfillment model\" in the US, with sales handled by locally based sellers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Deported gang members get second chance at call centre",
        "description": "In the Mexican city of Tijuana a number of firms are employing people who were removed from the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "'We don't care': A defiant China looks beyond Trump's America",
        "description": "Chinese exporters tell the BBC if the US doesn't want their goods, \"other countries have money\" to buy them.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Trump signs order to block funding to public radio",
        "description": "Trump alleged that both organisations have produced \"biased and partisan news coverage\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Meta threatens to cut off Facebook in Nigeria over huge fines",
        "description": "The social media giant has challenged demands to pay $290m over regulatory violations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Talks or no talks: Who blinks first in US-China trade war?",
        "description": "Donald Trump and Xi Jinping are locked in a game of chicken - despite wanting the same outcome.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Apple says most US-bound iPhones no longer made in China",
        "description": "The technology giant says US tariffs will add around $900m to its costs this quarter.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "M&S working 'day and night' over cyber attack",
        "description": "The boss of the retailer says he is \"really sorry\" for the disruption which caused it to pause its online operations.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Businesses count costs as India and Bangladesh impose trade restrictions",
        "description": "Relations between the countries have been sour for months but differences were mostly expressed verbally until now.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "What's in the US-Ukraine resources deal?",
        "description": "The BBC's analysis editor looks at what has been agreed in the much-anticipated agreement.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "McDonald's sales drop as diners face 'uncertainty'",
        "description": "The burger chain says its US customers are \"grappling with uncertainty\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Xbox prices hiked worldwide amid tariff uncertainty",
        "description": "The company has pointed to increasing game development costs and \"market conditions\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Tesla denies contacting headhunters to replace Musk",
        "description": "The electric car firm says a report that it is hunting for a successor is \"absolutely false\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Seven takeaways from US-Ukraine resources deal",
        "description": "What this will and won't change for US assistance to Ukraine, three years into the war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Harrods latest UK retailer to be hit by cyber attack",
        "description": "The firm told the BBC it had restricted internet access in its stores following an attempted cyber attack.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "'They wanted $4m': Lessons for M&S from other cyber attacks",
        "description": "The retailer is reeling from a ransomware attack - here's what other people did when in the same situation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "US and Ukraine sign long-awaited natural resources deal",
        "description": "The White House has been pushing for the agreement as a prerequisite for further military assistance.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks",
        "description": "The US president blames the first quarterly GDP decline in three years on his Democratic predecessor.",
        "source": "BBC Business",
        "fetched_date": "2025-05-03T07:24:02.762778"
    },
    {
        "title": "Girl Group KATSEYE Returns With ‘Gnarly’ Hyperpop Single",
        "description": "The Hybe-Geffen Records group, whose formation through the competition series ‘Dream Academy’ was documented in a Netflix documentary last year, is back with a new, experimental song.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Beyoncé Teaches Us to Expect the Unexpected During Cowboy Carter Tour Opening Week in Los Angeles",
        "description": "For night two, the superstar added classics to her setlist including 'Single Ladies' and 'Love on Top.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "PR Machine Expands With Launch of Influence Public Relations for Digital Talent, Staff Promotions",
        "description": "Influence is co-founded by PR Machine’s Mike Liotta and Emily Baird, the latter of whom will step down to become CEO at Influence while Rachel Hosseini and Grace Topalian are being upped at PR Machine.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "PBS President Says Trump’s Executive Order to End Funding Is “Blatantly Unlawful”",
        "description": "The Corporation for Public Broadcasting’s leadership doesn’t get it either.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Fashion Designer Riccardo Tisci Accused of Drugging, Sexually Assaulting New York Man in Legal Complaint",
        "description": "Tisci's rep said the \"allegations are categorically untrue\" in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Prince Harry Loses Appeal Over U.K. Security Detail After Barristers Argued His Life Was “At Stake”",
        "description": "The ruling means that the Duke and Duchess of Sussex will receive a \"bespoke\", taxpayer-funded security service while in the U.K.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Russell Brand Granted Bail at First London Court Hearing on Rape, Sexual Assault Charges",
        "description": "The disgraced presenter, charged with one count of rape, one count of indecent assault, one count of oral rape and two counts of sexual assault, will have his next court appearance on May 30.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Ed Sheeran Sets ‘Play’ Release Date, Drops Second Single “Old Phone”",
        "description": "“I made this record all over the world, finished it in Goa, India, and had some of the most fun, explorative creative days of my life,” the singer wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Trump Signs Executive Order Directing Federal Funding Cuts to PBS and NPR",
        "description": "It's the latest move by the Trump administration to utilize federal powers to control or hamstring institutions whose actions or viewpoints he disagrees with.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Jack Antonoff Named ASCAP’s Songwriter of the Year at 2025 Pop Awards",
        "description": "Teddy Swims' \"Lose Control,\"  co-written by ASCAP songwriter Joshua \"Ammo\" Coleman, won pop song of the year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Jill Sobule, “I Kissed a Girl” and “Supermodel” Singer, Dies at 66",
        "description": "She \"was a force of nature and human rights advocate whose music is woven into our culture.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "Lorde Is “So Grateful” for Charli XCX’s ‘Brat’ and “Girl, So Confusing” Remix: “It Gave Me a Kick” of Inspiration for New Album",
        "description": "\"It’s just this amazing thing when a peer throws the gauntlet down like that,“ the two-time Grammy winner said in reference to the success of Charli's sixth studio album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-03T07:24:03.387367"
    },
    {
        "title": "AFL legend goes nuclear over election issue",
        "description": "An AFL legend has delivered a blistering spray at a handful of issues that have plagued the lead up to the Australian federal election.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "AFL legends ‘exposed’ as rumour swirls",
        "description": "A footy great has let loose a staggering rumour surrounding the biggest names in the AFL media with noses already out of joint.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "$77m goes up in smoke after boxing boilover",
        "description": "Ryan Garcia has suffered a stunning upset at the hands of Rolly Romero which has put his rematch with Devin Haney on ice.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Ex-Sun has point to prove in QClash",
        "description": "Lions coach Chris Fagan says former Gold Coast Suns forward Sam Day is ‘getting better every week’ for Brisbane.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "‘Get a loan‘: Eels coach’s cheeky reply says it all",
        "description": "Jason Ryles said he would need to ask his halfback for money if he was going to say what he really wanted to after Parramatta’s controversial loss.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "‘Can’t do this’: NRL has ‘officially lost the plot’",
        "description": "Mitchell Moses was incensed and let his feelings show after a controversial moment that had TV commentators speaking up on his behalf.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "AFL legend goes nuclear over election issue",
        "description": "An AFL legend has delivered a blistering spray at a handful of issues that have plagued the lead up to the Australian federal election.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "AFL legends ‘exposed’ as rumour swirls",
        "description": "A footy great has let loose a staggering rumour surrounding the biggest names in the AFL media with noses already out of joint.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Disgraced legend to be stripped of honours",
        "description": "Cricket NSW will consider removing two of Michael Slater’s honours as the fallout from his domestic violence charges continues.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "‘Benchmark’: Aussie legend’s last hurrah",
        "description": "After piling on thousands of runs for Australia and becoming the ultimate cult hero, David Boon has called time on his second career in cricket.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Legend’s verdict on brutal Billy Slater call",
        "description": "A Queensland legend has given his verdict on a big headache facing Maroons coach Billy Slater ahead of the State of Origin opener.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "‘Unacceptable’: Aussie F1 star has had enough",
        "description": "Aussie Jack Doohan has blown up on team radio and was still visibly fuming as he walked down pit lane at the Miami Grand Prix.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Controversy over Verstappen’s big baby news",
        "description": "Max Verstappen has shared massive, private relationship news just hours after his shock no-show at the Miami Grand Prix was explained.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Reds remain winless in Fijian capital due to last-minute try",
        "description": "A final minute try has denied Queensland Reds a drought-breaking win in Fiji and puts their chances of hosting a Super Rugby finals match in doubt.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Olympian returns to rugby as a man",
        "description": "Ellia Green, an Olympic gold medallist and former NRLW competitor, has made a comeback in a men’s rugby competition.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Stadium left in shock after horror fall",
        "description": "A fan attending a Major League Baseball game was rushed to hospital after falling onto the playing field in a shocking scene.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Aussie makes history, wins major NBA award",
        "description": "He may have missed out on Defensive Player of the Year, but Dyson Daniels could not be denied for his all-round improvement in his first season at the Atlanta Hawks.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "City keen to exploit ‘weak’ Sydney defence",
        "description": "Melbourne City has the chance to not only end Sydney FC’s season on Saturday but also secure an AFC Champions League Elite spot.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Billionaires save Aussie club in eyewatering deal",
        "description": "Fears about Western United’s future have been quashed following an investment of more than $70m in the A-League club by a US-based business.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "$77m goes up in smoke after boxing boilover",
        "description": "Ryan Garcia has suffered a stunning upset at the hands of Rolly Romero which has put his rematch with Devin Haney on ice.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Aussie ‘aura’ could end winning drought",
        "description": "The new Australian captain of the International Team for the Presidents Cup brings something special to the table.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Rising Aussie WNBA star suffers horror season-ending injury",
        "description": "Just two weeks being drafted into the WNBA, young Australian Georgia Amoore’s dream has turned into a nightmare with a shocking training injury.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "‘Quiet’ colt makes loud winter carnival statement",
        "description": "Chris Munce could have a promising winter carnival prospect after two-year-old Cool Archie made it consecutives wins for the campaign in the Dalrello Stakes at Eagle Farm.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "All hell breaks loose after car crash interview",
        "description": "NFL icon Bill Belichick has come out in defence of his 24-year-old girlfriend after she intervened in a controversial TV interview.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    },
    {
        "title": "John Coates erupts on TV star Sandra Sully",
        "description": "John Coates has launched an extraordinary attack on Sandra Sully after the TV star reached out to the Australian Olympics great.",
        "source": "News AU",
        "fetched_date": "2025-05-03T07:24:11.013415"
    }
]