[
    {
        "title": "Trump imposes tariffs but Canada and Mexico hit back",
        "description": "The US president will tax imports from America's three largest trading partners. Both Canada and Mexico plan retaliatory tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "'Is it for a day or four years?': Tariff uncertainty spooks small businesses",
        "description": "Entrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Why Dynasty Warriors makers scrapped sequel to reinvent series",
        "description": "Tomohiko Sho says the unreleased game was something fans were 'starting to get a bit bored of'.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Tax relief for Indian middle class - but will it boost economy?",
        "description": "The finance minister announced steps to tackle slowing growth, rising prices and low middle-class consumption.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "'Is it for a day or four years?': Tariff uncertainty spooks small businesses",
        "description": "Entrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "How countries respond to Trump's tariffs is what matters next",
        "description": "Retaliatory taxes against the US by other nations could lead global trade into uncharted territory.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Barclays customers hit by third day of payment issues",
        "description": "Since Friday there have been problems with bank's app, online banking and payments and transfers.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Davey urges Starmer to start EU customs union talks",
        "description": "Sir Ed Davey calls for PM to use meeting with EU leaders to \"fire the starting gun\" on new trade deal.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Your phone, a rare metal and the war in DR Congo",
        "description": "There is a good chance that inside your device is some metal dug up in a mine controlled by rebels.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Trump's tariffs hit China hard before - this time, it's ready",
        "description": "Trump has threatened a 10% levy from 1 February - but his campaign included 60% tariffs against Chinese imports.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Trump using tariffs 'as geopolitical leverage' - 31 Jan 2025",
        "description": "Expert says President Trump may not impose the full 25 percent tariffs if he gets some concessions.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Take-off or bail out? The airport even Ryanair thinks is a tough sell",
        "description": "After Rachel Reeves pledges her support, is Doncaster Sheffield Airport clear for take-off?",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Barclays customers face second day of issues after IT outage",
        "description": "Online banking, the bank's app and payments in and out of accounts are all affected.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Booze, oil and orange juice: How Canada could fight Trump tariffs",
        "description": "As Justin Trudeau warns Canadians they could face \"difficult days\" ahead, here are four options for retaliation.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Canada 'will stand up to a bully', says PM contender Carney over Trump tariffs",
        "description": "The prime ministerial candidate responds to Donald Trump imposing 25% tariffs on Canada.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Will Donald Trump’s tariffs hurt US consumers?",
        "description": "Trump claims more taxes on trade wouldn't be a cost to the US - but almost all economists dispute this.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "'Outlandish comments': War of words between US, Canada and Mexico",
        "description": "As Donald Trump threatened to impose border taxes, the leaders of America's neighbours said they were prepared to act.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Blow for Reeves as AstraZeneca ditches £450m investment",
        "description": "The drugs giant blames \"protracted\" talks with the government as well as differences over funding.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Ex-Trafigura boss convicted of bribery in landmark case",
        "description": "The commodities giant went on trial in Switzerland over attempts to gain access to Angola's oil market.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Five key impacts of Brexit five years on",
        "description": "The UK left the European Union on 31 January 2020.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Sri Lanka eases vehicle import ban, but can people afford a new car?",
        "description": "A scarcity of vehicles to buy, the country's weak currency and high taxes have forced up prices of cars.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Brexit has some benefits, No 10 says on anniversary",
        "description": "But the PM wants to \"make Brexit work better for the British people\", Downing Street says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "New non-opioid painkiller approved by US health agency",
        "description": "New drug suzetrigine, known by its brand name Journavx, has been approved to treat moderate to severe pain.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Apple iPhone sales dip despite AI rollout",
        "description": "The company's signature phone has been updated with artificial intelligence, but sales are down.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "Farmers in bird flu 'panic' call for UK vaccine plan",
        "description": "Vaccinating poultry against bird flu is still not allowed in the UK despite a rise in farm outbreaks.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "US economic growth slows despite consumers spending more",
        "description": "The world's largest economy missed forecasts after expanding at 2.3% between October and December.",
        "source": "BBC Business",
        "fetched_date": "2025-02-02T07:20:15.609776"
    },
    {
        "title": "MusiCares Grateful Dead Tribute Is Big on Laughs (Thank You, Woody Harrelson), Love and Vibes",
        "description": "John Mayer jammed with Dead & Company at the lively event hosted by Andy Cohen that also included performances from Wynonna Judd, Norah Jones, Sammy Hagar, Vampire Weekend, My Morning Jacket and more.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Bad Bunny, Katy Perry, Shakira and Ed Sheeran are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Commentary: Two Very Different Disasters, One Possible Lesson",
        "description": "A film director who survived both 9/11 in New York and the fires here in L.A. looks back on the similarities — and very real differences — between the two catastrophes, and what can be learned from both.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Trump Administration Responds to Selena Gomez Crying Over Mass Deportations With Mothers of Crime Victims",
        "description": "The singer and actress previously posted an emotional video regarding the deportation of undocumented immigrants, where she says through tears, \"All my people are getting attacked … the children. I don’t understand.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Universal Studios Offering L.A. Wildfire First Responders Free Theme Park Tickets",
        "description": "The complimentary one-day pass and discounted guest tickets are meant to thank fire fighters, police officers and others for their heroic efforts to battle the devastating blazes across Los Angeles County.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Former Skydance Interactive President Pleads Guilty to Piloting Drone That Crashed Into Plane During Palisades Fire",
        "description": "Peter Akemann has agreed to cover an estimated $65,169 in plane repairs and to complete 150 hours of community service to help aid Southern California wildfire relief.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "An Artist’s Historic House In Pacific Palisades Was Lost In the Fire. He Hopes to Rebuild",
        "description": "The colorful Eric Owen Moss-designed 708 House became a neighborhood magnet and sparked ideas for large-scale public art installations. Owner Ed Massey reflects on its memory.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Kelsea Ballerini Defends Beyoncé’s Country Grammy Nominations: “You Don’t Have To Be a Country Artist To Make a Country Record”",
        "description": "The 31-year-old Grammy nominee says she doesn’t understand other opinions on the matter: “It’s amazing to have huge, respected artists and other genres come in and celebrate ours.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "How Mel Gibson Became Trump’s Accidental Ambassador",
        "description": "Plus, how scorched Teslas could make fire cleanup even more challenging and how map-makers are responding to the “Gulf of America”.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "My Own Private Palisades: A Writer Remembers His Vanished Neighborhood",
        "description": "A writer who grew up in the devastated community tried — and failed — to save his family home. But he didn’t lose just a house. He lost his childhood.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Lady Gaga Performs Touching Tribute, Nirvana Reunites and Music’s Biggest Stars Catch Up Backstage at L.A. FireAid Benefit Concert",
        "description": "The “Shallow” singer closed out the star-studded benefit concert with a song she co-wrote for the show with her fiancé, Michael Polansky.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "Laverne Cox on Trump’s Anti-Trans Executive Orders: “The Republican Party Is Worried About the Wrong 1 Percent”",
        "description": "Cox was promoting her Prime Video series ‘Clean Slate,’ about a trans woman who reunites with her estranged father, played by George Wallace.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-02T07:20:15.981981"
    },
    {
        "title": "‘Send him home’: Great’s blunt advice",
        "description": "Former Australian wicketkeeper Brad Haddin has issued a stark warning to the selectors ahead of the second Test in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "NBA erupts over ‘biggest deal in history’",
        "description": "One of the biggest names in the NBA is set to join forces with LeBron James in a trade that completely alters the league’s landscape.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "‘Send him back home to bat’: Haddin’s message to Aussie selectors",
        "description": "With the World Test Championship final in mind, Brad Haddin believes Sam Konstas would benefit more from playing state cricket at home if he’s not part of the second Test in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "US anthem booed after Trump bomb drops",
        "description": "A star performer was booed in front of 20,000 fans when singing the US anthem after Donald Trump angered an entire country.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "‘Send him home’: Great’s blunt advice",
        "description": "Former Australian wicketkeeper Brad Haddin has issued a stark warning to the selectors ahead of the second Test in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "‘Send him back home to bat’: Haddin’s message to Aussie selectors",
        "description": "With the World Test Championship final in mind, Brad Haddin believes Sam Konstas would benefit more from playing state cricket at home if he’s not part of the second Test in Sri Lanka.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Tennis icon watches son lose to Aussie",
        "description": "A tennis legend was watching on as his son went down to an Aussie as Australia made a strong start to their Davis Cup campaign.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Tomic breaks silence on bombshell probe",
        "description": "Bernard Tomic has spoken out for the first time after he was interviewed by police into suspicious bets made on two of his games.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Kane Cornes drops deeply personal secret",
        "description": "AFL commentator Kane Cornes has divulged a family secret he has always kept hidden away from football fans.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "AFL legend’s sad Brownlow revelation",
        "description": "Footy great Ian Stewart says he wants his three Brownlow medals back after they were located on the other side of the world",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "NRL great steps away over sad personal news",
        "description": "NRL legend Ryan Girdler has shocked the broadcasting world by quitting his job as the sad reason for him stepping away emerges.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Star’s massive first task as Eels skipper",
        "description": "Mitch Moses has only been captain for a couple of days, but he faces his first major test and it’s all to do with his powers of persuasion.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "America loses it over Aussie megastar",
        "description": "Australia’s Rhea Ripley is taking wrestling by storm as one of WWE’s biggest stars, but her dominance has sparked debate.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Anna Kournikova went from star to recluse",
        "description": "The Russian beauty had a cocktail and even computer virus named after her at height of fame before her horror stalking ordeal.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "US anthem booed after Trump bomb drops",
        "description": "A star performer was booed in front of 20,000 fans when singing the US anthem after Donald Trump angered an entire country.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Aussie legend dispatched in $5.3m NBA bomb",
        "description": "Aussie basketball icon Patty Mills has been shipped out for the fourth time in 18 months, making a move to a star-studded NBA team.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Victory leap into third after quickfire second half goals",
        "description": "Melbourne Victory is suddenly back up into third on the A-League Men’s ladder after a 2-0 win over Perth Glory on Saturday night. Catch up with the latest news from the weekend’s action.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Liverpool land heavy blow in title race as Forest bury Brighton",
        "description": "Nottingham Forest have smashed Brighton 7-0 in a ridiculous game, but it is Liverpool who took another step towards the Premier League title – heaping more pressure on Arsenal.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "‘Wow’: Controversy as Adesanya knocked out",
        "description": "Jaws have dropped around the MMA world with former champ Israel Adesanya’s career left in disarray after a brutal KO defeat.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Bathurst rocked by massive smash",
        "description": "The driver of this Mercedes was lucky to escape serious injuries after flying through the air at 200km/h.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Supercars team owner airborne in terrifying Bathurst crash",
        "description": "Supercars team owner Stephen Grove has been hospitalised after a scary airborne crash at the top of Mount Panorama in the Bathurst 12 Hour.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Cotton, Wildcats outclass Kings in pivotal NBL battle",
        "description": "Bryce Cotton continued his NBL MVP push with another standout performance as the Perth Wildcats get their top-two hopes alive with a big win over the Sydney Kings. Recap the action from the round here.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Local flirts with history as McLeod edges closer to victory",
        "description": "Victoria’s Cameron John fell short of equalling a historic score, while Jake McLeod edged closer to a drought-breaking win on Day three of the Webex Players Series event on the Murray River.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "O’Shea eyes major spring riches with rising star Yorkshire",
        "description": "Yorkshire continued on winning ways at Rosehill Gardens on Saturday but the stable remain in no rush with the emerging star.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Tahs suffer early Suaalii blow with injury icing debut",
        "description": "Superstar Joseph-Aukuso Suaalii’s hotly anticipated debut in the NSW Waratahs jersey has been cruelled by an injury.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Wallabies grudge match secured with Jones’ Japan",
        "description": "He left the Wallabies after a horror World Cup campaign to take a job in Japan some say he’d already lined up and now Eddie Jones will have to coach against his former players.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-02-02T07:20:18.396068"
    }
]