[
    {
        "title": "US asks China to stop Iran from closing Strait of Hormuz",
        "description": "Iran's Press TV had earlier reported that parliament had approved a plan to close the Strait.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "How China made electric vehicles mainstream",
        "description": "The world's second largest economy is both the biggest producer and buyer of EVs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Analysis: Russian government clearly nervous as country faces economic challenges",
        "description": "Russian minister Maxim Reshetnikov has warned that the country's economy was teetering \"on the brink of recession\".",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Telegram boss to leave fortune to over 100 children he has fathered",
        "description": "The technology tycoon said his children would not have access to their inheritance for 30 years.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "How China made electric vehicles mainstream",
        "description": "The world's second largest economy is both the biggest producer and buyer of EVs.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "FedEx founder and former boss Fred Smith dies aged 80",
        "description": "The Vietnam War veteran started the firm in 1973 with 14 planes before it became a global brand.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Hundreds of Voice of America reporters fired as Trump guts outlet",
        "description": "The majority of VOA - some 85% of its workforce - has been laid off since Trump ordered it dismantled.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Cars, cash and a tycoon stirring debate in Zimbabwe",
        "description": "Some are beguiled by the Zimbabwean tycoon's generosity, others alarmed about the source of his wealth.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Russia's economy is down but not out",
        "description": "The country's economy has been surprisingly resilient but there are underlying problems.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Can shoes be made in the US without cheap labour?",
        "description": "American production is possible, but it often needs to be automated to be cost effective.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Markets muted amid Middle East conflict - 18 Jun 2025",
        "description": "Global investment expert says markets are in a 'wait and see mode' amid escalating tensions in the Middle East.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Why Ukraine is one of the world's most digital countries",
        "description": "Despite the war, Ukraine has developed of the most advanced systems for digital government services.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Shorts at work: Can men now get their legs out in the office?",
        "description": "Whether shorts are ever appropriate for the office remains a contentious topic, so what should you do?",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "'Not just smut': Why it's happily ever after for romance books",
        "description": "Despite being mocked by book critics for years, the romantasy genre is booming - and that means big business for publishers and bookshops.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "BBC threatens AI firm with legal action over unauthorised content use",
        "description": "It is first time that the BBC has taken such action regarding alleged scraping of its content for AI.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Adorable or just weird? How Labubu dolls conquered the world",
        "description": "The dolls have almost tripled their maker's profits - and according to some, energised Chinese soft power.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Trump confirms further delay to TikTok ban or sale deadline",
        "description": "It's the third time the date has been moved back by Trump since he took office in January.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Interest rates held at 4.25% by Bank of England",
        "description": "The central bank decides to hold interest rates at 4.25% with inflation remaining above its target level.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Texas Instruments pledges 'historic' $60bn US chip investment",
        "description": "The announcement comes as Trump pressures big technology firms to increase manufacturing in America.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Devastating crash threatens Air India's ambitious turnaround",
        "description": "The tragedy happened as Air India was on the \"final climb phrase\" of its brand transformation after the Tata buyout.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Fed holds interest rates for fourth time despite tariff turmoil",
        "description": "The US central bank leaves its key interest rate unchanged at 4.3%, as its view of the economy darkens.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Japan's Nippon seals controversial US Steel deal after Trump pact",
        "description": "Nippon agreed to give a \"golden share\" to the US government to win approval of the takeover.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Los Angeles Lakers to sell majority ownership in historic deal",
        "description": "The deal would mark the most expensive sale of a US sports team in history.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "OpenAI boss: Meta offering $100m plus to poach my staff",
        "description": "Sam Altman said so far none of his \"best people\" had jumped ship to his big tech rival.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Trump to extend US TikTok ban deadline, White House says",
        "description": "The app was supposed to be banned in the US after its Chinese owner refused to sell it by a January deadline.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Amazon boss says AI will replace jobs at tech giant",
        "description": "Andy Jassy tells staff to embrace artificial intelligence (AI) as he warns the workforce will get smaller.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Chocolate price rises hit UK record as food costs grow",
        "description": "Food prices grew for a third month in May, as the overall rate of inflation remained at 3.4%.",
        "source": "BBC Business",
        "fetched_date": "2025-06-23T07:29:19.049075"
    },
    {
        "title": "Paris Hilton Buys Mark Wahlberg’s Former Mansion for $63M After Her Home Was Lost in L.A. Wildfires",
        "description": "Hilton and her husband, Carter Reum, purchased the luxury estate that comes with a golf course, skate park and 12 bedrooms.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Bonnaroo Music and Arts Festival Change Plan for Full Refunds, Not Announcing Future Dates Yet",
        "description": "The music festival was canceled earlier this month because of weather concerns and was originally issued 75 percent refunds.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "R. Kelly Files Motion to Vacate His Conviction Amid Ongoing Murder-for-Hire Claims in Prison",
        "description": "The incarcerated former R&B superstar says he believes Board of Prisons officials are attempting to kill him and now wants a new trial, citing prosecutorial corruption.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Ed Sheeran Releases New Song “Drive” From ‘F1: The Album’",
        "description": "The film, starring Brad Pitt and directed by Joseph Kosinski, and companion album releases on June 27.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "R. Kelly’s Request to Leave Prison for Home Confinement Denied Amid Alleged Murder Plot",
        "description": "The disgraced music star had sought release from the North Carolina jail amid allegations that federal prison officials are trying to kill him in a murder-for-hire scheme.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Hilary Rosen Appointed Deputy Chair of BAFTA’s Board of Trustees",
        "description": "She will help oversee the delivery of the British Academy's mission as an arts charity, championing creatives and practitioners working in film, games and TV.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Chris Brown Pleads Not Guilty to U.K. Assault Charge",
        "description": "The American singer — currently on tour in Europe — is accused of attacking a music producer with a bottle in a London club two years ago.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Cardi B Drops “Outside,” Her First Song of 2025",
        "description": "This is the rapper's first solo release since \"Enough (Miami)\" last year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Will Drake Kill the Diss Track?",
        "description": "How the artist's lawsuit against Kendrick Lamar's 'Not Like Us' could suppress a vital part of hip-hop culture.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Iranian Cannes Winner, Oscar Nominee Call for End to Israel-Iran Conflict",
        "description": "Palme d'Or winner Jafar Panahi and the Oscar-nominated Mohammad Rasoulof signed an open letter in France's Le Monde, calling on Iran to end uranium enrichment and for the killing on both sides to stop.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Why Sabrina Carpenter Might Consider Banning Phones at Her Concerts",
        "description": "\"Depending on how long I want to be touring, and what age I am, girl, take those phones away,\" she quips.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    },
    {
        "title": "Bad Bunny Slams ICE Over Raids in Puerto Rico: “Those Motherf***ers”",
        "description": "The Grammy-winning Puerto Rican shared footage of an ICE operation in the U.S. territory.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-23T07:29:19.584076"
    }
]