[
    {
        "title": "Trump nominates Bessent to lead US Treasury in flurry of announcements",
        "description": "He also announces nominees for labour secretary, housing secretary and surgeon general.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Analysis: Will UK chancellor's difficult week cause her lasting damage?",
        "description": "BBC's Ben Wright looks at the impact of a tricky week of scrutiny for the chancellor.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Gary Gensler to leave role as SEC chairman",
        "description": "Donald Trump revealed plans to sack Mr Gensler on \"day one\" of his new administration.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Temu owner's shares slump as China slowdown hits sales",
        "description": "US-listed shares of the e-commerce giant fell nearly 11% on Thursday following the announcement.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Analysis: Will UK chancellor's difficult week cause her lasting damage?",
        "description": "BBC's Ben Wright looks at the impact of a tricky week of scrutiny for the chancellor.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Spain fines budget airlines including Ryanair €179m",
        "description": "The government says charging for hand luggage and printing boarding passes at the airport are \"abusive practices\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Satellite images show Russia giving N Korea oil, breaking sanctions",
        "description": "Satellite image analysis shows several North Korean tankers visiting Russia dozens of times since March.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "The mighty material that supercharges jet engines",
        "description": "Hi-tech coatings make all sorts of high performance engineering, like jet engines, possible.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Inside South Africa's 'ruthless' gang-controlled gold mines",
        "description": "Illegal miners live dangerously, but make roaring profits selling gold on the black market.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Is nuclear power gaining new energy?",
        "description": "Countries around the world are building new nuclear power stations.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Investors 'wary of incoming administration' - 22 Nov 2024",
        "description": "As US shares lock in a week of gains, investors are keeping an eye out for the new administration's policies.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "The business of transforming mental health at work",
        "description": "Cherie Clonan, CEO of The Digital Picnic, explains how free dinners, burnout-preventing days off and even ADHD assessments have boosted employee wellbeing – and her bottom line.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "How Adani's US fraud charges impact India's economy and politics",
        "description": "The charges could jeopardise the ambitions of one of the world’s richest men, both at home and abroad.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Fraud probe launched into defence firm Thales",
        "description": "Thales UK, which has its headquarters in Berkshire, employs more than 7,000 staff across the country.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Trudeau plays Santa with seasonal tax break",
        "description": "The opposition calls Trudeau's tax measures \"a trick\" aimed at deflecting attention from rising costs.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Sell Chrome to end search monopoly, Google told",
        "description": "The tech giant is resisting fiercely, calling the proposal \"wildly overbroad\" and claiming it will hurt consumers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Thousands of PayPal customers report brief outage",
        "description": "The online payment company says a brief technical issue has now been resolved.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "US charges Indian billionaire Gautam Adani with fraud",
        "description": "The Adani Group has denied the allegations of bribery and fraud, calling them \"baseless\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Bluesky chief doesn't know age limit for platform",
        "description": "Jay Graber wrongly said you needed to be 18 to use Bluesky, when the actual age limit is 13.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Archegos boss sentenced to prison over massive fraud",
        "description": "Hwang was found guilty of fraud in a case that cost Wall Street banks billions of dollars in losses.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Are K-pop stars workers? South Korea says no",
        "description": "In a dispute involving band NewJeans, the government said celebrities were not entitled to the same rights as workers.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Uncertainty after Australia foreign students bill hits opposition",
        "description": "Universities had already begun making changes, as the controversial bill was expected to easily pass.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Ford cuts 800 jobs, claiming weak demand for electric cars",
        "description": "The move is part of a wider restructuring programme, which will see 4,000 posts closed across Europe.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Logan Paul accused of misleading fans over crypto investments",
        "description": "New evidence suggests the YouTuber promoted investments without revealing his financial interest in them.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Palestinian olive harvest under threat from Israeli attacks and restrictions",
        "description": "Harvesting olives is an economic necessity for many Palestinians, but it is increasingly precarious.",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Al Fayed abuse ‘could be on scale of Savile’, says survivors’ advocate",
        "description": "Speaking about her new role, Dame Jasvinder Sanghera says Al Fayed's \"tentacles went far and wide\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Trump selects financier Howard Lutnick as commerce secretary",
        "description": "Trump said Lutnick would lead the administration's \"tariff and trade agenda\".",
        "source": "BBC Business",
        "fetched_date": "2024-11-23T07:24:07.355475"
    },
    {
        "title": "Power Lawyers: THR’s Top Music Attorneys of 2024",
        "description": "Recording stars hungry for films, tours and huge catalog payoffs turn to these 16 chart-topping attorneys.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "The 20 Best Music Schools in the World",
        "description": "From New York to Northridge, our annual list of the institutions preparing the next generation of composers across all media.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Lando Norris Is “Just a Normal Guy” … Who Also Drives Really Cool Race Cars",
        "description": "The Hollywood Reporter's newest \"Person of Interest,\" the 25-year-old British driver for McLaren's Formula 1 team, is always finding joy in the exhilarating race-winning moments but also the quiet, everyday ones.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Patton Oswalt Comic ‘Minor Threats’ Launches Anthology Spinoff With Matt Fraction, Brian Michael Bendis (Exclusive)",
        "description": "Writers Gail Simone and Gerry Duggan and artists Michael Allred and Gene Ha are also among those working in the universe of the cult hit comic published by Dark Horse Entertainment.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Jussie Smollett’s Conviction in Alleged Hoax Street Attack Overturned by Illinois Supreme Court",
        "description": "The former 'Empire' actor has been on a legal roller coaster after he claimed in 2019 that he was attacked in Chicago by two Black men who hurled homophobic slurs at him and yelled, “This is MAGA country.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Matt Gaetz Withdraws as Trump’s Pick for Attorney General",
        "description": "“While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,” Gaetz said in a statement.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Muni Long Explains How She “Made” It",
        "description": "The singer opens up about her TikTok hit \"Made for Me,\" working with Mariah Carey and the perils of being a songwriter: \"Not getting credit, not getting paid, the producer running off with the money — it happened to me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "FCC Chair Jessica Rosenworcel to Step Down Next Year",
        "description": "Rosenworcel will be succeeded atop the Commission by Brendan Carr.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "BAFTA Breakthrough 2024: Mawaan Rizwan, Nava Mau Among 43 “Must-Watch” Young Creatives",
        "description": "The latest cohort of up-and-coming talent also includes an editor on BAFTA-winning 'Top Boy' and a costume designer on the Glen Powell-led Netflix movie 'Hit Man.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Meet the New Trump Resistance: Europe’s Filmmakers",
        "description": "Progressive continental auteurs aren’t ready to give up on America just yet. But their governments are less inclined to pick a fight with the President-elect.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Chris Stapleton, Jelly Roll, Brooks & Dunn Shine at 2024 CMA Awards; Morgan Wallen Wins Top Honor",
        "description": "Wallen didn't attend but finally won entertainer of the year, while Stapleton took home single, song and male vocalist of the year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Billy Ray Cyrus Was “Surprised” by Beyoncé’s CMA Awards Snub: “Her Album Was Brilliant”",
        "description": "The \"Texas Hold 'Em\" singer received zero nominations, despite her 'Cowboy Carter' being a chart-topping album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2024-11-23T07:24:07.713862"
    },
    {
        "title": "Giddey gets Aussie NBA bragging rights",
        "description": "Josh Giddey got the last laugh in his clash against Dyson Daniels, the man who has leapfrogged him in the Aussie NBA pecking order.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Aussie star’s brutal sledge caught on mic",
        "description": "Australia’s brutal collapse continued on Day 2 of the first Test, as Mitchell Starc showed some resistance and unleashed a cheeky sledge.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Smith and Smylie share PGA lead",
        "description": "Cam Smith’s quest for a fourth Australian PGA Championship title is well and truly on target but another Queenslander can’t be discounted.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Bowlers under pressure as patient Rahul, Jaiswal, build India’s lead",
        "description": "India’s openers are controlling the pace of play with Australia’s bowlers yet to take a wicket as KL Rahul and Yashasvi Jaiswal heap pressure on the home side. Follow it live here.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "History counts for nothing as AFLW foes vie for GF berth",
        "description": "They’ve been the AFLW’s two greatest forces in the league’s short history. But this year, only one of Brisbane and Adelaide will get a shot at the ultimate glory. Who will it be?",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Giants star blows internet sensation away",
        "description": "One of the biggest YouTubers on the planet has gatecrashed GWS Giants training, challenging players to foot races which ended in wild scenes.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "‘Blank canvas’: Coach’s plans for new-look Eels",
        "description": "Jason Ryles swatted away the flies and handled his first major press conference with ease as the new Eels coach discussed all the key issues facing his club.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "NRL Market Watch: Young star extends stay at Tigers",
        "description": "The Wests Tigers have landed another signing coup while former Rugby Sevens star Nathan Lawson is feverishly learning the Dragons playbook after his NRL conversion.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Aussie star’s brutal sledge caught on mic",
        "description": "Australia’s brutal collapse continued on Day 2 of the first Test, as Mitchell Starc showed some resistance and unleashed a cheeky sledge.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Bowlers under pressure as patient Rahul, Jaiswal, build India’s lead",
        "description": "India’s openers are controlling the pace of play with Australia’s bowlers yet to take a wicket as KL Rahul and Yashasvi Jaiswal heap pressure on the home side. Follow it live here.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "‘Massive’: Belief behind stunning Aussie win",
        "description": "Australia is just one win away from a third straight Davis Cup final and a surprise choice from captain Lleyton Hewitt led to the emotional win.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "‘Oh my god’: Australia in Davis Cup insanity",
        "description": "Australia has progressed to the semi-finals of the Davis Cup after wild scenes that dropped jaws around the tennis world.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "‘Primed’: Scary prediction for Test whitewash",
        "description": "Cricket legends are tipping Australia to dominate the Test summer, as one player’s answer revealed the flaw in India’s team.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Calls for Piastri change after ‘No. 2’ furore",
        "description": "There is growing scrutiny on the dynamic between McLaren’s Oscar Piastri and Lando heading into this weekend’s Las Vegas Grand Prix.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Aussie champs broken up as star defects",
        "description": "Australia’s dominant SailGP team is being broken up, with two members of their championship three-peat leaving on the eve of the new season.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Shackles finally thrown off Aussie F1 star",
        "description": "Aussie gun Oscar Piastri has addressed McLaren’s controversial team orders as he prepares for the final races of the 2024 F1 season.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Daniel Ricciardo is living his best life",
        "description": "Following his unceremonious exit from the F1 grid, Daniel Ricciardo has been keeping busy, including a wild day in Buffalo.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Ring girl reveals ‘big names’ in her DMs",
        "description": "Viral ring girl Sydney Thomas has revealed her new-found fame has seen her inbox become overran with big names hitting her up.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Surprising twist in violent pickleball scandal",
        "description": "The man who got kicked in the face in a moment of unthinkable violence has had a stunning response to his opponent’s behaviour.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Giddey gets Aussie NBA bragging rights",
        "description": "Josh Giddey got the last laugh in his clash against Dyson Daniels, the man who has leapfrogged him in the Aussie NBA pecking order.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "The stunning stat behind NFL’s new Super Bowl favourite",
        "description": "There’s one standout stat behind the NFL’s new Super Bowl favourite: will they continue to dominate heading into Week 12?",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Soccer superstar to marry ex-wife’s niece",
        "description": "Former Brazil striker Hulk has organised his marriage to Camila Angelo, the niece of his ex-wife, after years of family turmoil.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Reds coach wants Unite Round shared",
        "description": "An A-League coach wants Unite Round to be moved around Australia rather than be held each year in Sydney.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "McGregor speaks after verdict in rape case",
        "description": "The martial arts fighter was accused of ‘brutally raping and battering’ Nikita Hand in December 2018.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Smith and Smylie share PGA lead",
        "description": "Cam Smith’s quest for a fourth Australian PGA Championship title is well and truly on target but another Queenslander can’t be discounted.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Giddey gets Aussie NBA bragging rights",
        "description": "Josh Giddey got the last laugh in his clash against Dyson Daniels, the man who has leapfrogged him in the Aussie NBA pecking order.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Wallabies make mass changes for crunch game",
        "description": "Joseph Suaalii has been named in the Wallabies’ starting line-up as one of several changes for Monday morning’s clash with Scotland.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "‘One that got away’ Wallabies stumbling block",
        "description": "The Wallabies are a man down in their quest to create a 40-year first with a former Junior Wallabies star now standing in their way.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Maher sprinter bolts home in The Meteorite",
        "description": "Exciting sprinter Nadal showed his Group 1 potential with a blistering win in The Meteorite at Cranbourne on Saturday.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    },
    {
        "title": "Six-time world champion dead at 65",
        "description": "A six-time world champion has died suddenly in hospital as tributes came pouring in from the cycling community.",
        "source": "News AU",
        "fetched_date": "2024-11-23T07:24:10.997557"
    }
]