[
    {
        "title": "Trump delays tariffs as the rest of the world plays hardball",
        "description": "The US president reveals his poker \"tell\" by showing he is open to delays to secure trade deals.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Musk's AI firm deletes posts after chatbot praises Hitler",
        "description": "The announcement came after the Grok AI chatbot gave controversial answers to user queries.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Ramaphosa opposes Trump's 30% tariff on South Africa",
        "description": "US President Donald Trump announces a 30% tariff on South African imports starting from 1 August.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Trump threatens extra 10% tariff on nations siding with Brics",
        "description": "The president said the levy will apply to \"any country aligning themselves with the Anti-American policies of Brics\".",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Musk's AI firm deletes posts after chatbot praises Hitler",
        "description": "The announcement came after the Grok AI chatbot gave controversial answers to user queries.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "US will hike tariffs on copper to 50%, Trump says",
        "description": "Similar threats are looming over pharmaceuticals, lumber and semiconductors.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "US delays higher tariffs but announces new taxes for some countries",
        "description": "Trump says the US will impose a raft of levies after pausing his Liberation Day tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Former UK PM Rishi Sunak takes job at Goldman Sachs",
        "description": "Sunak will take up the part-time role while remaining Conservative MP for Richmond and Northallerton.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "How Trump's tariff chaos could reshape Asia's businesses",
        "description": "The US president's tough stance on global trade is shaking up the region's crucial supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Why the world's superyachts are getting bigger and bigger",
        "description": "Billionaires and multimillionaires around the globe are trading up for more space and luxury.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Expert says investor behaviour subdued - 7 Jul 2025",
        "description": "Investment advisor tells the BBC that repeated announcements from the White House have become hard to rely upon.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Why little Lithuania has big plans for space tech",
        "description": "Lithuania has a promising space tech sector, but it wants more government support.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Workplace misconduct and discrimination NDAs to be banned in the UK",
        "description": "The government plans to change the law to void confidentiality agreements that silence staff.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Trump calls Musk's new political party 'ridiculous'",
        "description": "The US president and Tesla boss were close allies before a dramatic falling out in recent weeks.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "How tariffs are shifting global supply chains",
        "description": "Trump's 90-day pause on his sweeping tariffs plan is about to expire. But already some firms are radically changing how they work.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Not getting a summer job? Here are eight ways to change that",
        "description": "Grace Pickett, 18, says it's \"frustrating\" so many part-time jobs require previous experience.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Trump signs sweeping tax and spending bill into law",
        "description": "A signing ceremony at the White House on Friday afternoon kicked off celebrations for 4 July.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Elon Musk says he is launching new political party",
        "description": "The world's richest man says he is setting up a new political organisation called the America Party.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "'Is there gold in them?': Indian artisans up in arms over Prada's sandals",
        "description": "Artisans who make Kolhapuri sandals are demanding better recognition after Prada failed to acknowledge design roots.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "US debt is now $37tn – should we be worried?",
        "description": "President Trump's budget bill will add to the US debt pile but is there a limit to how much the rest of the world will lend Uncle Sam?",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Pride in London returns as events struggle with falling funds",
        "description": "UK Pride organisers tell the BBC that less sponsorship funding and fewer volunteers are behind cancelled events.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Crying at work: A sign of strength, weakness or just being human?",
        "description": "After UK Chancellor Rachel Reeves cried in parliament this week, how acceptable is it to show emotion at work?",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "One in 10 cars sold in UK made in China",
        "description": "One in 10 cars bought in the UK are Chinese owned, new figures suggest.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Trump says US to start sending out tariff letters",
        "description": "The move comes ahead of a deadline that may see much higher import taxes on goods coming into the US.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "What have tariffs really done to the US economy?",
        "description": "As President Trump weighs tariff plans, he will have one eye on the US economy.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Sport agent Jonathan Barnett accused of rape in US lawsuit",
        "description": "Barnett denies allegations he kept the woman as a \"sex slave\" over a six year period.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Fictional K-pop bands beat BTS and Blackpink in US charts",
        "description": "Songs from the film KPop Demon Hunter have surpassed the success of real-life K-pop bands BTS and Blackpink.",
        "source": "BBC Business",
        "fetched_date": "2025-07-09T07:29:21.469925"
    },
    {
        "title": "Ayo Edebiri Recalls Confusion When She Joked About Being Irish",
        "description": "'The Bear' actress explained how her now-viral bit came to be during her appearance on 'Conan O’Brien Needs a Friend.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Oasis’ A-List Guests: Metallica’s Lars Ulrich, Sony Music’s Rob Stringer Among Industry Notables at Tour Opening",
        "description": "Anya Taylor-Joy, Louis Tomlinson, Matt Smith and Cara Delevingne were among the stars who made it out to Wales for the famed Britpop band's first show in 16 years.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Peter Jackson Wants to Bring This 400-Pound Flightless Bird Back From Extinction",
        "description": "Along with Colossal Biosciences, the filmmaker is joining an indigenous-centered partnership to resurrect the 12-foot-tall moa, dead for centuries.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Will Apple Ever Air ‘Tehran’ Season 3?",
        "description": "A nearly two-year holdoff may — finally — be coming to an end.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "John Summit Is Bringing EDM Festival Scene Back to New York With Experts Only Fest",
        "description": "\"There’s a glaring gap in the market, it’s a no-brainer for us to do New York,\" Summit tells The Hollywood Reporter of launching the electronic festival in September on Randall’s Island.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Ryan Reynolds, Rob Mac, Roy Wood Jr. Among Just For Laughs Award Winners, Presenters",
        "description": "‘Clean Slate’ star George Wallace, ‘Overcompensating’ creator and star Benito Skinner, and comic Hannah Berner will pick up trophies in Montreal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "From Diddy to Spacey, Celebrity #MeToo Cases Are Proving Tough to Convict",
        "description": "The cultural reckoning keeps having setbacks in the legal world: “We went from ‘always believe an accuser’ to ‘maybe we too often believe an accuser.’”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Jeffrey Epstein “Client List” Doesn’t Exist, No More Files to Be Released, Justice Dept. Says",
        "description": "Attorney General Pam Bondi for weeks had suggested that more material was going to be revealed after a first document dump she had hyped angered President Donald Trump's base by failing to deliver revelations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Mark Ruffalo Slams Joe Rogan Over Response to ICE Immigration Raids: “It’s a Little Late Now”",
        "description": "The criticism followed the popular podcaster calling the mass targeting of undocumented migrant workers for arrest and deportation “insane” in an episode released last week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "‘The Salt Path’ Backlash: Raynor Winn’s Novel Adapted Into Star-Studded Film Upended in Exposé",
        "description": "An investigation by U.K. outlet The Observer has called into question the events of the bestselling non-fiction book that was adapted for the screen starring Gillian Anderson and Jason Isaacs.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Pearl Jam Drummer Matt Cameron Leaves Band After 27 Years",
        "description": "\"Much love and respect to Jeff, Ed, Mike and Stone for inviting me into the band in 1998 and for giving me the opportunity of a lifetime, filled with friendships, artistry, challenges and laughter,\" Cameron said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    },
    {
        "title": "Lauryn Hill Performs Strongly in Nearly Empty Stadium Until 3:37 a.m. After Essence Festival Runs Way Behind",
        "description": "The artist took the stage at the Caesars Superdome in New Orleans as the last of eight acts Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-07-09T07:29:21.747686"
    }
]