[
    {
        "title": "Trump-Musk relationship implodes with insults and threats",
        "description": "\"Elon and I had a great relationship. I don't know if we will anymore,\" Trump says, threatening to cancel government contracts with Musk's companies.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "India central bank delivers sharp rate cut as growth and inflation fall",
        "description": "India's economy grew by 6.5% in the previous financial year ending March, data last week showed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Dr Martens profits slump by more than 90%",
        "description": "The company says a challenging market and uncertainty about tariffs are having an effect.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Tariffs prompt record plunge in US imports",
        "description": "American purchases of Canadian goods in April fell to the lowest level since 2021.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "India central bank delivers sharp rate cut as growth and inflation fall",
        "description": "India's economy grew by 6.5% in the previous financial year ending March, data last week showed.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Tesla shares tumble as Trump-Musk feud erupts",
        "description": "Tesla shares plunged 14%, marking one of the steepest declines in months as Musk and Trump battled online.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "India leads in remittances - but Trump's tax could deal a blow",
        "description": "Trump's proposed 3.5% tax on remittances by foreign workers could seriously impact top recipient India.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Lululemon shares plunge as Trump tariffs bite",
        "description": "The athleisure brand joins a growing list of big firms to warn about the impact of Trump's policies.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "How airline fees have turned baggage into billions",
        "description": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "US green energy firms brace for federal funding cuts",
        "description": "Billions of dollars of US federal funding for green energy projects hangs in the balance.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Markets flat on report of Xi-Trump call - 5 Jun 2025",
        "description": "Jim Thorne from Wellington-Altus Private Wealth says a US and China trade deal will happen.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Should you be eating food products with fewer ingredients?",
        "description": "Food firms are marketing ranges with fewer ingredients, but are they healthier?",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Trump confirms China trip after 'very good' call with Xi",
        "description": "The leaders of the US and China agree to further talks aimed at reaching a deal amid an ongoing trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "US-Boeing deal over crashes 'repugnant' - lawyer for victims' families",
        "description": "The plane maker has agreed to pay $1.1bn to avoid prosecution over two fatal crashes that killed 346 people.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Europe cuts interest rates as Trump's tariffs loom",
        "description": "The eurozone's central bank makes its eighth cut but warns US tariffs will weigh on the economy.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "World Bank U-turn ends loan ban to Uganda over gay rights",
        "description": "The bank had ended all lending to Uganda two years ago because of a harsh, new anti-LGBTQ law.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Stores open at midnight as fans rush to buy Nintendo Switch 2",
        "description": "One retailer says it's the \"biggest gaming pre-order ever\" - but there questions over whether high prices will dent sales.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Musk urges Americans to tell lawmakers to 'kill the bill'",
        "description": "Billionaire says the bill, which faces a key test in the Senate, undercuts efforts to slash federal spending.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Musk turns on Republicans - and gives Trump's big bill a harder path",
        "description": "The billionaire's criticism could embolden Republicans who are considering voting against the tax and spending bill.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Tanzania announces shutdown of X because of pornography",
        "description": "The content is contrary to the nation's \"laws, culture, customs, and traditions\", the information minister says.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Analysis: Tariff relief for UK but new clock ticking on US deal",
        "description": "If the UK's deal with the US is not finalised by 9 July, the UK's tariff on steel will go back up to 50%.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "UK chancellor announces £15bn for transport projects",
        "description": "Money will be spent on tram, train and bus projects in England across the Midlands, North and West Country.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Trump's 50% tariffs on metals come into effect",
        "description": "Trump doubles down on his tariffs, while sparing the UK from the latest duties.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "UK temporarily spared from Trump's 50% steel tariffs",
        "description": "The executive order raises import taxes for US firms buying from other countries - but the levy remains at 25% for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Oreo maker sues Aldi in US over 'copycat' packaging",
        "description": "The discount supermarket is being sued in a US court, accused of imitating the American biscuit brand.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Debt and trade issues weaken UK growth, OECD says",
        "description": "The policy group lowers its UK economy forecast due to trade barriers and Britain's \"very thin\" financial buffer.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "Pornhub pulls out of France over age verification law",
        "description": "It's the latest setback for the world's most popular porn site, which is also under investigation by the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-06-06T07:27:07.588587"
    },
    {
        "title": "The National’s Matt Berninger on Flying Solo: “It’s Dangerous Territory, But Rock and Roll Can’t Kill You”",
        "description": "The singer talked to THR about overcoming burnout, his \"pile of Legos\" lyrics and the cosmic connection between sad dads and Taylor Swift-loving teenagers.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Inaugural Pride LIVE! Hollywood Fest Expands Lineup With Music Events, Screenings and More",
        "description": "Screenings of 'Happy Clothes: A Film About Patricia Field' and 'The Big Johnson' will be joined by events at Amoeba Music for the monthlong event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Will Trump Torch L.A.’s Olympics?",
        "description": "When the Games kicks off at the end of his term, will the president use them to turn the screws on a deep-blue city or will he leverage the spectacle as a lame-duck victory lap?",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Colman Domingo, Paul Tazewell, Sean Bankhead to be Honored at Native Son Awards",
        "description": "Additional honorees include Derrick Adams, Dr. David J. Johns and Phill Wilson.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "“Getting to Do It for an Audience, It’s Like Drugs”: 7 Tony Nominees on Jumping Between Hollywood and Broadway",
        "description": "Sarah Snook, Darren Criss, Nicole Scherzinger, Jonathan Groff, Audra McDonald, Cole Escola and Louis McCartney join THR's Tonys Roundtable and dish about non-trad casting, pushing people's buttons and life on the Great White Way.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Jacob Tierney Adapting ‘Heated Rivalry,’ Gay Hockey Romance Novel for TV",
        "description": "The ‘Letterkenny’ and ‘Shoresy’ director wrote and is helming the six-parter based on the enemies-to-lovers romancer by Rachel Reid and picked up by Crave.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Diddy Trial: Forensic Video Expert and Cassie Ventura’s Best Friend Bolster and Hinder Prosecution’s Case",
        "description": "Frank Piazza shut down the notion that the notorious hotel beating in 2016 was doctored, while Bryana Bongolan's shaky testimony on cross-examination likely did the feds no favors.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "‘I Don’t Understand You’ Filmmakers on Channeling Their Own Adoption Nightmare Into the Well-Received Horror-Comedy",
        "description": "David Joseph Craig and Brian William Crano discuss bringing the types of characters they'd like to see to the screen: \"There was a gay Bechdel Test thing going on.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Hollywood Invented the Attention Economy. Now It’s Being Devoured by It",
        "description": "From MrBeast to the Eras Tour, creators now control the cultural conversation Hollywood once monopolized. The industry that perfected obsession is now struggling to survive it.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Harvey Weinstein’s Team Wants the Jury to Believe He’s a Scapegoat of #MeToo",
        "description": "In closing arguments, attorney Arthur Aidala positioned the encounters between the former mogul and the three women as part of consensual and transactional relationships.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Jessie J Reveals Early Breast Cancer Diagnosis",
        "description": "The Grammy nominee took to Instagram to share the news because she \"wanted to be open and share it” partly “because selfishly I do not talk about it enough.”",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    },
    {
        "title": "Aging CEOs, Ambitious Nepo Babies and a Tech Revolution: Succession in the Music Biz",
        "description": "Meet the new boss… same as the old boss? As the industry prepares for the AI takeover, insiders question who’s next in line at the major labels.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-06-06T07:27:08.589614"
    }
]