[
    {
        "title": "Biden blocks Japan's Nippon Steel from buying US Steel",
        "description": "An executive order says the deal could have posed a risk to US national security.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "China's overqualified youth taking jobs as drivers, labourers and film extras",
        "description": "With high youth unemployment rates, Chinese graduates are resorting to working as waiters, cleaners and movie extras.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Fire devastates one of Africa's largest clothes markets",
        "description": "Ghana's Kantamanto market has been devastated by fire with traders urging the government to help.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Apple AI alert falsely claimed Luke Littler had already won darts final",
        "description": "An AI-generated notification says the teen has won the tournament before the final is even played.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "China's overqualified youth taking jobs as drivers, labourers and film extras",
        "description": "With high youth unemployment rates, Chinese graduates are resorting to working as waiters, cleaners and movie extras.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Why does Britain face flight chaos during bad weather?",
        "description": "Delays and cancellations related to British weather may become more common.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Apple to pay $95m to settle Siri 'listening' lawsuit",
        "description": "The tech giant denies wrongdoing after being accused of eavesdropping on customers.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Musk 'misinformed' on grooming gangs, says UK minister",
        "description": "The Conservatives have also criticised the billionaire for \"sharing things that are factually inaccurate\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "How Trump and Musk's interventions prompt fresh diplomatic challenge",
        "description": "Politicians are navigating how to deal with the social media presence of Donald Trump and Elon Musk.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Sweden's green industry hopes hit by Northvolt woes",
        "description": "Financial problems at battery maker Northvolt have shaken hopes for Sweden's green industry sector.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Robinhood CEO: Crypto under relentless assault - 19 Dec 2024",
        "description": "The CEO of online investing platform Robinhood says the Trump administration will be very good for business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Nick Clegg leaves Meta ahead of Trump's return as US president",
        "description": "He will be replaced by Republican Joel Kaplan, a former White House deputy chief of staff under President Bush.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Slovakia threatens to cut benefit for  Ukrainians",
        "description": "A dispute between Slovakia and Ukraine over Russian natural gas transit has been escalating.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Why Apple is offering rare iPhone discounts in China",
        "description": "Rival technology giant Huawei has also cut smartphone prices in the run-up to the Lunar New Year holiday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "How a home-made snack empowered Indian women",
        "description": "The Lijjat co-operative, run by women, employs more than 45,000 people and is famous for its crispy poppadoms.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Court strikes down US net neutrality rules",
        "description": "The ruling marks a significant moment in the long running battle over how to regulate internet providers.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Rosita Missoni, co-founder of Italian label, dies aged 93",
        "description": "Lombardy's president, who confirmed the news, says Missoni's death is \"a great loss for Italy\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Tesla sales stall as China's BYD closes in",
        "description": "Tesla's ranking as the world's top electric vehicle seller is threatened after sales fell last year.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "UK house prices rose by 4.7% in 2024, says lender",
        "description": "Housing market activity remained \"remarkably resilient\" despite affordability challenges, the lender says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "'I quit my job with Google to follow my dreams'",
        "description": "Entrepreneur Simmy Dhillon says he grew up wanting to help his parents retire from their jobs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Police probe if blast at Trump hotel is linked to New Orleans attack",
        "description": "President Biden said \"any possible connection\" was being investigated, but \"thus far, there is nothing to report\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Era of cheap Russian gas to EU ends as transit across Ukraine stops",
        "description": "The EU says most states will not be affected but other European countries, including Moldova, are facing shortages.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Moldova faces energy crisis as flow of Russian gas ends",
        "description": "Russian gas has stopped passing through Ukraine after a five-year deal expired, leaving Moldova at risk of a crisis.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Elon Musk changes his name to Kekius Maximus on X",
        "description": "The world's richest man sparks speculation after changing his name and using a picture of Pepe the Frog.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Pre-flight checks found 'no issues' before S Korea air crash",
        "description": "Jeju Air says the plane that crashed in South Korea killing 179 people had passed a pre-flight inspection.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Do not wipe toilet seat with toilet paper: Japanese maker",
        "description": "Social media users have complained that their seats were scratched after being wiped with toilet paper.",
        "source": "BBC Business",
        "fetched_date": "2025-01-04T07:21:30.717369"
    },
    {
        "title": "Neil Young Retracts Glastonbury Boycott, Will Now Play Fest Following “Error in Information Received”",
        "description": "The rock star will now perform at the U.K. music festival after saying Tuesday he wouldn't be playing because Glastonbury was under the BBC's \"corporate control.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Selena’s Killer Files for Parole 30 Years After Tejano Singer’s Death",
        "description": "In 1995, Yolanda Saldívar gunned down the singer after it was discovered she'd been embezzling money from her boutiques.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Wayne Osmond, Original Member of the Singing Osmonds, Dies at 73",
        "description": "He started out in Utah as a youngster in a family barbershop quartet, and he and his siblings would become regulars on ‘The Andy Williams Show’ and score a big hit with \"One Bad Apple.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Jeremy Renner Reflects on Second Anniversary of Snowplow Accident: “My Gratitude List Is Very Long”",
        "description": "“Ringing in my second 'ReBirthday' today. I send out my love, respect and gratitude for the army of people that it took to put me back together again,\" the actor wrote on Instagram.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Most Anticipated Concert Tours of 2025: Billie Eilish, Kendrick Lamar & SZA, Sabrina Carpenter and More",
        "description": "Zayn Malik, Usher, Coldplay, Katy Perry, Shakira and Ed Sheeran are also among artists hitting the road.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Billie Eilish’s ‘Birds of a Feather’ Is Spotify’s Most Streamed Song of 2024",
        "description": "The breezy pop song is nominated for three Grammys including record and song of the year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Neil Young Pulls Out of Glastonbury 2025, Saying Festival Is Under the BBC’s “Corporate Control”",
        "description": "\"We were told that BBC was now a partner in Glastonbury and wanted us to do a lot of things in a way we were not interested in,\" Young said about the decision to not play with his new band, the Chrome Hearts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Sugar Bowl Postponed After Deadly Truck Attack in New Orleans",
        "description": "The college football quarterfinal between Georgia and Notre Dame was set to take place at Louisiana's Superdome on New Year's Day but will now take place Thursday night after the tragedy in which at least 10 people were killed.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Best Moments and Biggest Surprises From Janet Jackson’s New Las Vegas Residency",
        "description": "The star debuted her new show, set for 10 nights over the next two months, at Resorts World Las Vegas on Monday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Hollywood’s Most Notable Deaths of 2024",
        "description": "Carl Weathers, Shannen Doherty, Bob Newhart, Donald Sutherland, Liam Payne, Maggie Smith, James Earl Jones, Gena Rowlands and Jon Landau are among several entertainment legends the industry lost this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "How to Watch the Times Square New Year’s Eve Celebration and 2025 Ball Drop Live",
        "description": "Tune in to watch Jonathan Bennett and Jeremy Hassell return as this year's hosts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Angelina Jolie and Brad Pitt Reach Divorce Settlement After Eight-Year Legal Battle",
        "description": "The pair married in 2014 and split two years later, with Jolie later claiming that Pitt was abusive toward her and their children, but he was cleared of the allegations in an investigation and the FBI declined to press charges.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-04T07:21:31.665495"
    },
    {
        "title": "Star flees SCG in ‘massive’ Test series twist",
        "description": "The Test series is on a knife’s edge and tantalisingly poised after India’s spearhead left the SCG in a massive blow to the tourists’ hopes.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Record broken as teen freak makes history",
        "description": "Teen sensation Luke Littler has become the youngest world champion in darts history in insane scenes in London.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Aussie teen ‘crosses line’ as greats drop bomb",
        "description": "Australian cricket legends are all giving the same advice to Sam Konstas after the teen’s “cocky” act backfired big time against India.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Star flees SCG in ‘massive’ Test series twist",
        "description": "The Test series is on a knife’s edge and tantalisingly poised after India’s spearhead left the SCG in a massive blow to the tourists’ hopes.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Cummins lures India danger man into match-saving trap",
        "description": "Australian hero Scott Boland has ripped through India’s top order, before captain Pat Cummins ended Rishabh Pant’s potential match-winning innings. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Kudermetova books spot in Brisbane final as dream run continues",
        "description": "World No.107 Polina Kudermetova has continued her fairytale Brisbane International run, booking a berth in Sunday’s final with a straight sets win over Anhelina Kalinina.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Heartbreak as Birrell’s dream Brisbane run finally ends",
        "description": "After knocking over both the World No.8 and 35, Kimberly Birrell’s inspiring Brisbane International campaign has ended in heartbreak, crashing out of the quarter-finals.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "‘Can’t wait’: Ch7 star shares huge news",
        "description": "AFLW great turned TV commentator Abbey Holmes has dropped a bombshell from out of nowhere, much to the delight of fans.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "AFL star arrested and charged",
        "description": "A Richmond Tigers premiership star has been charged with assault following an alleged late-night incident in New South Wales.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Raiders snubbed as $3.5m star leaves Knights",
        "description": "One of the biggest dominoes in the NRL player market has fallen with a star forward deciding on a move to a Sydney-based club.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "‘Tragedy’: Tigers rocked by 15-year ban",
        "description": "The Wests Tigers’ civil war has taken an explosive turn with senior powerbrokers banished by a so-called “Gang of Four”.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Star deletes Instagram after racy video",
        "description": "Angel Reese scrubbed her Instagram account after posting this video of her revealing New Year’s outfit.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "First ever Aussie women’s sports bar closes",
        "description": "A women’s sports bar opened with much fanfare and enthusiasm but just a few months later, it’s had no choice but to call last drinks.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Trade means more headaches for Simmons",
        "description": "Ben Simmons’ career has again been plunged into uncertainty after his NBA team pressed the trigger on a surprise trade.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Matildas on alert after surprise Sam Kerr move",
        "description": "Sam Kerr’s return to football could be sooner than originally thought following an update that’s sure to have caught the attention of Matildas interim coach Tom Sermanni.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Roar’s horror season continues",
        "description": "The Roar’s miserable A-League season shows no signs of improving, but Brisbane coach Ruben Zadkovich wants his players to ‘embrace’ the situation.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Utter chaos in boxing ‘freak show’ brawl",
        "description": "There have been insane scenes at a traditional New Year’s Eve boxing event with an all-in brawl erupting after illegal acts.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Ricciardo’s harshest F1 critic ‘proven right’",
        "description": "The fortunes of Daniel Ricciardo have mirrored Australia’s battle with a nation that thoroughly outclassed Australia in sport in 2024.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Schumacher reveals massive family news",
        "description": "Formula One legend Michael Schumacher’s daughter has shared some beautiful news about their family, months after her wedding.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "NBA star banned by own team in ugly saga",
        "description": "An NBA trade saga has taken an ugly turn, with the Miami Heat confirming it was suspending its own star player after he spoke out.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Scott happy with ‘very solid’ start",
        "description": "Adam Scott has no intention of slowing down as he starts his 25th year as a professional golfer.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Autumnmation lands a Summer success",
        "description": "Trainer Chris Waller thought Reece Jones was going too slow in front on Autumnmation but the young jockey had something left in the locker when it counted.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "David Pocock reveals major life update",
        "description": "It’s the first glimpse fans have been given of the Pocock family’s newest member since their pregnancy announcement earlier this year.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Rookie Reds prop in Wallabies training squad",
        "description": "An emerging Queensland Reds prop has been included in a 40-man Wallabies training squad.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-04T07:21:34.045512"
    }
]