[
    {
        "title": "US lays out plans to hit Chinese ships with port fees",
        "description": "The charges will start in 180 days and rise in the coming years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Trump's tariffs leave China's neighbours with an impossible choice",
        "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "The rise and wobble of India's EV pioneer Ola",
        "description": "Ola, once a rising star, is facing falling sales amid rising competition and regulatory scrutiny.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Trump and Meloni talk up chances of US trade deal with Europe",
        "description": "The US president separately said he is confident of making \"a very good deal\" with China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Trump's tariffs leave China's neighbours with an impossible choice",
        "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Ukraine says outline of minerals deal signed with US",
        "description": "The move would be a step towards a final deal derailed by a row at the White House in February.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "'My home is worth millions, but my kids can't afford to live here'",
        "description": "Housing has taken a back seat in Canada's election to Donald Trump's tariffs, but advocates argue the affordability crisis is just as disruptive.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Google has illegal advertising monopoly, judge rules",
        "description": "It is the second major case Google has lost in a year, after it was found to have a monopoly on online search.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Firms say Meta not helping them to recover hacked accounts",
        "description": "Businesses around the world say they are unable to get back into their Facebook and Instagram pages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Malaysian trade minister on US tariffs",
        "description": "Malaysia's minister Zafrul Aziz will be representing the ASEAN bloc in its negotiations with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "No global recession despite US tariffs, says IMF",
        "description": "The international economic group predicts \"notable markdowns, but not recession\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Trump administration threatens Harvard with foreign student ban",
        "description": "Homeland Security Secretary Kristi Noem accused the institution of \"threatening national security\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Trump attacks Fed boss Powell for not cutting interest rates",
        "description": "The US president says Jerome Powell's \"termination\" as central bank chair \"cannot come fast enough!\"",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "BluSmart breakdown - how Uber's EV rival in India collapsed",
        "description": "The company has halted taxi bookings after allegations of fund diversion by India's market regulator.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Tesla whistleblower wins latest legal battle in fight against Musk",
        "description": "Engineer Cristina Balan raised a safety concern about a design flaw which could affect the cars' braking in 2014.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Shein and Temu warn tariffs will raise prices in US",
        "description": "The firms said operating expenses have risen \"due to recent changes in global trade rules and tariffs\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Why China curbing rare earth exports is a blow to the US",
        "description": "As the trade war continues to escalate, China has hit back at Trump by suspending exports of rare earth minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Gold hits new record over US-China trade war fears",
        "description": "Prices rose after the US Fed's chair warned tariffs could hit economic growth and fuel inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "UK bans EU cheese and meat to stop disease spreading",
        "description": "People coming into Great Britain can no longer bring cured meats or cheese from the EU following an outbreak of foot and mouth disease.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Vance to visit India as Trump intensifies tariff war with China",
        "description": "The visit comes as India and US continue high-stakes talks to finalise a bilateral trade deal.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Aboard the 'silver trains', China's retirees do their bit to offset Trump's tariffs",
        "description": "A new initiative aims to boost the local economy by attracting elderly travellers to remote parts of the country.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "US tariffs will make global trade shrink, says WTO",
        "description": "The Geneva-based institution says American tariffs will send international trade into reverse.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Viral videos claim luxury bags are made in China - is it true?",
        "description": "BBC Verify's Jake Horton looks into the truth behind the claims, and what we know about how luxury goods are made.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "California becomes first state to sue over Trump tariffs",
        "description": "The state - the 5th largest world economic power - says it is being disproportionately impacted by the tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Nvidia shares plunge amid $5.5bn hit over export rules to China",
        "description": "The chip manufacturing giant will require licences to export its H20 AI chip to China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-18T07:27:17.120627"
    },
    {
        "title": "Lil Wayne Says He Won’t Perform at the Super Bowl After NFL Got His Hopes Up With 2025 Halftime Show",
        "description": "\"They stole that feeling. It was perfect,” the rapper explained as to why he doesn't want to take the stage during football’s biggest night in the future.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Meet the Artist Who’s Animating Justin Bieber’s Next Chapter",
        "description": "Gal Yosef collaborated with the pop star on the visual for his Skylrk fashion line. The noted digital sculptor shows his work all over the world.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Peabody Awards: ‘Baby Reindeer,’ ‘Hacks,’ ‘Shogun’ Among Entertainment Nominees",
        "description": "The organization today announced the nominees in the arts, children's/youth, entertainment and interactive and immersive categories.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "How ‘Star Wars’ Is Changing Its Tune",
        "description": "The legendary John Williams once set the soundtrack for the billion-dollar franchise. Now a new generation of Hollywood composers that he inspired are giving the Force a whole new feel.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Richard Pryor’s Essential Albums Released as Box Set",
        "description": "The LPs, reissued by Rhino, span 1974 to 1983 and include some of the late comic's most iconic routines.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "‘Beneath the Trees Where Nobody Sees’ Sequel First-Look: “Scarier, Gorier, Cuter”",
        "description": "Creator Patrick Horvath's followup to the surprise hit arrives July 9, and once again is Richard Scarry meets 'Dexter.'",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Drake Cites Kendrick Lamar’s Super Bowl Performance in Amended Complaint",
        "description": "“It was the first, and will hopefully be the last, Super Bowl halftime show orchestrated to assassinate the character of another artist,\" the rapper's amended complaint against UMG said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Kim Kardashian Will Testify in Trial Over 2016 Robbery That Targeted Her in Paris",
        "description": "The October 2016 robbery took place in a Paris apartment where Kardashian was staying for Paris Fashion Week.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Hailee Steinfeld Reveals Why She Took a “Bit of a Break From Music”",
        "description": "The 'Sinners' actress said it was a \"very difficult decision\" to step back from music to focus on acting.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Fyre Festival 2 Postponed and No New Date Announced",
        "description": "The postponement comes less than two months before the music festival was set to take place.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Michelle Trachtenberg’s Cause of Death Revealed",
        "description": "The 'Gossip Girl' and 'Buffy the Vampire Slayer' actress died in February at age 39.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Role Model Parts Ways With Best Friends Music Management (Exclusive)",
        "description": "The buzzing Interscope act had been represented by Danny Rukasin.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-18T07:27:17.882320"
    },
    {
        "title": "Wright on track at Bells Beach",
        "description": "An Australian surfing great powered through her heat at Bells Beach on Friday to qualify for the round-of-16.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Iconic ‘Grey Wiggle’ makes sad revelation",
        "description": "Andrew Redmayne, who burst into Australian hearts as the ‘Grey Wiggle’ with his World Cup heroics has made a sad announcement.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Lions star blasts ‘cowards’ in fiery swipe",
        "description": "Brisbane Lions co-captain Lachie Neale has taken the rare step of calling out “cowards” after his team’s loss to Collingwood.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Olympic legend ruthlessly humiliates mums",
        "description": "Olympic legend Shelly-Ann Fraser-Pryce took no prisoners, ruthlessly humiliating mums in her son’s school sports day.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "NRL live: Bulldogs blow Bunnies away in dominant first half",
        "description": "The Bulldogs are well on top in their Good Friday clash against the Rabbitohs, heading into the break with a strong lead after a Souths star was sent to the sin bin early. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Tedesco’s telling call as showdown looms",
        "description": "James Tedesco has sounded a warning to fellow NSW fullback Dylan Edwards ahead of their highly anticipated clash on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Cripps, Blues strike early blow on shellshocked Roos",
        "description": "North Melbourne has been slow out of the blocks, and Carlton is taking full advantage as the Blues continue their momentum from last week’s big win.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Lions star blasts ‘cowards’ in fiery swipe",
        "description": "Brisbane Lions co-captain Lachie Neale has taken the rare step of calling out “cowards” after his team’s loss to Collingwood.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "World Cup winner loses CA contract",
        "description": "A six-time World Cup winner who for a long time was the world’s No.1 T20 bowler couldn’t make her way onto Cricket Australia’s contract list.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Spin star’s injury blow",
        "description": "As Australia’s leading white-ball spinner went down with an injury another World Cup winner continued a poor run with the bat as his team made IPL history.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Serena comes clean on Super Bowl furore",
        "description": "Serena Williams has opened up about her decision to be part of Kendrick Lamar’s Super Bowl half time show and the rumours about Drake.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Sports power couple split in marriage shock",
        "description": "One of the world’s biggest sporting power couples appear to have split up and are living apart after nearly a decade of marriage.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Michael Schumacher spotted in helicopter",
        "description": "Days after a rare public act, Formula 1 legend Michael Schumacher has been spotted flying from Majorca to Switzerland.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "F1 erupts over ‘disrespectful’ move to Piastri",
        "description": "Comedian Dave Hughes has led outrage from Aussie F1 fans after Oscar Piastri was snubbed in a “disrespectful” act amid claims of bias.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Country stars, sons of guns, a surprise show of power in Aussie rugby U20s squad",
        "description": "Country stars, sons of guns, a Sevens speedster and standouts from the battle with Eddie Jones’ Japan side make up the touring Australian U20s about to tackle the best young talent in rugby.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Rugby cops heavy $38m loss",
        "description": "Hopes are high for a financial windfall for Australian rugby this year and officials need it after revealing a massive deficit.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "‘Misogyny alive and well’: On-air act slammed",
        "description": "A TV segment showing a reporter interacting with female fans has come under fire, highlighting a troubling double standard.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Iconic ‘Grey Wiggle’ makes sad revelation",
        "description": "Andrew Redmayne, who burst into Australian hearts as the ‘Grey Wiggle’ with his World Cup heroics has made a sad announcement.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "City star injured again",
        "description": "Melbourne City coach Aurelio Vidmar believes his team will again ‘cope’ without injured Socceroos great Mathew Leckie.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Aussie breaks UFC curse, makes shock reveal",
        "description": "Aussie Alex Volkanovski has rewritten the UFC record books, winning an epic title fight to reclaim his belt and become champ again.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "‘It’s f***ing golf’: Ugly clip sickens millions",
        "description": "Police have launched an investigation into a golf course brawl that has gone viral after one of the sport’s unwritten law was violated.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Briasa can seal Everest slot with Group 1 double",
        "description": "A slot in The Everest could be the reward if Briasa can secure a rare Group 1 Randwick sprint double on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "Sports power couple split in marriage shock",
        "description": "One of the world’s biggest sporting power couples appear to have split up and are living apart after nearly a decade of marriage.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    },
    {
        "title": "72yo’s romance with 24yo gets really weird",
        "description": "Incredible new details of how Jordon Hudson is intertwining herself in Bill Belichick’s professional life are fascinating America.",
        "source": "News AU",
        "fetched_date": "2025-04-18T07:27:19.079904"
    }
]