[
    {
        "title": "Inside the rural Texas town where Elon Musk is basing his business empire",
        "description": "The tycoon and Donald Trump advisor has moved his businesses from California to a mostly rural central Texas county. What do the neighbours think?",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Why everyone is suddenly so interested in US bond markets",
        "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "What we know about US-Ukraine minerals deal",
        "description": "The US and Ukraine have taken the first step to finalising a deal that would set up an investment fund for Ukraine's reconstruction.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "US lays out plans to hit Chinese ships with port fees",
        "description": "The charges will start in 180 days and rise in the coming years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Why everyone is suddenly so interested in US bond markets",
        "description": "What is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Designed in US, made in China: Why Apple is stuck",
        "description": "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Anxiety at US colleges as foreign students are detained and visas revoked",
        "description": "High-profile detentions and visa revocations are putting students on edge, as Trump tightens his squeeze on US schools.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Starmer and Trump discuss 'productive' trade talks",
        "description": "The men held their first call since the US president imposed tariffs on UK goods earlier this month.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Firms say Meta not helping them to recover hacked accounts",
        "description": "Businesses around the world say they are unable to get back into their Facebook and Instagram pages.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Malaysian trade minister on US tariffs",
        "description": "Malaysia's minister Zafrul Aziz will be representing the ASEAN bloc in its negotiations with the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Nvidia: The AI chip giant caught between US and China",
        "description": "Led by Jensen Huang, dubbed the 'Taylor Swift of tech', the chip giant has become pivotal in the race for AI supremacy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "PM Modi and Elon Musk talk India-US tech collaboration",
        "description": "Modi said he discussed with Musk India's potential to collaborate with the US on technology.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Trump's tariffs leave China's neighbours with an impossible choice",
        "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "No global recession despite US tariffs, says IMF",
        "description": "The international economic group predicts \"notable markdowns, but not recession\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "'My home is worth millions, but my kids can't afford to live here'",
        "description": "Housing has taken a back seat in Canada's election to Donald Trump's tariffs, but advocates argue the affordability crisis is just as disruptive.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Google has illegal advertising monopoly, judge rules",
        "description": "It is the second major case Google has lost in a year, after it was found to have a monopoly on online search.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "The rise and wobble of India's EV pioneer Ola",
        "description": "Ola, once a rising star, is facing falling sales amid rising competition and regulatory scrutiny.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Trump and Meloni talk up chances of US trade deal with Europe",
        "description": "The US president separately said he is confident of making \"a very good deal\" with China.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Trump administration threatens Harvard with foreign student ban",
        "description": "Homeland Security Secretary Kristi Noem accused the institution of \"threatening national security\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Trump attacks Fed boss Powell for not cutting interest rates",
        "description": "The US president says Jerome Powell's \"termination\" as central bank chair \"cannot come fast enough!\"",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "BluSmart breakdown - how Uber's EV rival in India collapsed",
        "description": "The company has halted taxi bookings after allegations of fund diversion by India's market regulator.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Tesla whistleblower wins latest legal battle in fight against Musk",
        "description": "Engineer Cristina Balan raised a safety concern about a design flaw which could affect the cars' braking in 2014.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Shein and Temu warn tariffs will raise prices in US",
        "description": "The firms said operating expenses have risen \"due to recent changes in global trade rules and tariffs\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Why China curbing rare earth exports is a blow to the US",
        "description": "As the trade war continues to escalate, China has hit back at Trump by suspending exports of rare earth minerals.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "Gold hits new record over US-China trade war fears",
        "description": "Prices rose after the US Fed's chair warned tariffs could hit economic growth and fuel inflation.",
        "source": "BBC Business",
        "fetched_date": "2025-04-20T07:24:11.313869"
    },
    {
        "title": "New Pornographers Drummer Joe Seiders Arrested for Possession of Child Porn",
        "description": "The band confirmed that Seiders is no longer a member of the group, writing that \"our hearts go out to everyone who has been impacted by his actions.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Haley Joel Osment Apologizes for Using Antisemitic Slur in Police Arrest Footage",
        "description": "\"What came out of my mouth was nonsensical garbage — I’ve let the Jewish community down and it devastates me,” the actor said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Morgan Wallen and Post Malone Reunite on New Single ‘I Ain’t Comin’ Back’",
        "description": "The single follows last year's 'I Had Some Help,' which spent six weeks atop the Hot 100.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Robbie Williams Impassioned Plea Over Fans Seeking Photos From Celebrities Strikes a Chord: “Allow People the Dignity of Their Privacy”",
        "description": "Adam Lambert, Natasha Bedingfield and Joey McIntyre were among those expressing support for the U.K. pop singer's comments.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Pollstar Awards: Taylor Swift, Stevie Nicks, Chappell Roan Take Home Top Awards",
        "description": "Nicks was inducted into the Pollstar Live Hall of Fame, while Swift won the major tour of the year award for the second year in a row.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Lana Del Rey Releases “Bluebird,” Second Single From Newly Untitled Album",
        "description": "The song’s release comes on the heels of “Henry, Come On,” which was released a week earlier.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Maren Morris Talks Coachella Sets With Zedd and the LA Philharmonic: “I Feel Like I Just Got My Voice Back”",
        "description": "The singer took to the Coachella Valley Music Festival stage last weekend for the first time since 2019.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Menendez Brothers’ Bid for Shorter Sentence and Possible Parole Is Delayed Again",
        "description": "A new hearing is set for May 9 to discuss the admissibility of the California parole board's comprehensive risk assessments, which were ordered by Gov. Gavin Newsom.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Lil Wayne Says He Won’t Perform at the Super Bowl After NFL Got His Hopes Up With 2025 Halftime Show",
        "description": "\"They stole that feeling. It was perfect,” the rapper explained as to why he doesn't want to take the stage during football’s biggest night in the future.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Meet the Artist Who’s Animating Justin Bieber’s Next Chapter",
        "description": "Gal Yosef collaborated with the pop star on the visual for his Skylrk fashion line. The noted digital sculptor shows his work all over the world.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Peabody Awards: ‘Baby Reindeer,’ ‘Hacks,’ ‘Shogun’ Among Entertainment Nominees",
        "description": "The organization today announced the nominees in the arts, children's/youth, entertainment and interactive and immersive categories.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "How ‘Star Wars’ Is Changing Its Tune",
        "description": "The legendary John Williams once set the soundtrack for the billion-dollar franchise. Now a new generation of Hollywood composers that he inspired are giving the Force a whole new feel.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-20T07:24:11.644960"
    },
    {
        "title": "Broncos’ Reece Walsh nightmare confirmed",
        "description": "Broncos fullback Reece Walsh has all-but been ruled out of State of Origin Game 1 with the Broncos announcing big news on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Galvin’s shock move in ugly NRL feud",
        "description": "The increasingly bitter feud between teenage star Lachlan Galvin and the Wests Tigers has taken another dramatic twist.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "‘Balls-up’: NRL set to drop sanction on Penrith",
        "description": "Penrith coach Ivan Cleary has admitted his team’s sideline blunder was a complete “balls-up” as the NRL prepares to punish the club.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "NRL drama as report names three legends",
        "description": "Drama has suddenly emerged in NRL TV land with three of rugby league’s biggest-names at the centre of the intrigue.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Fonua-Blake red-hot, Knights woes continue",
        "description": "Cronulla star Addin Fonua-Blake had to prove his fitness for this game but has started on fire, while the Knights attacking woes have continued.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Broncos’ Reece Walsh nightmare confirmed",
        "description": "Broncos fullback Reece Walsh has all-but been ruled out of State of Origin Game 1 with the Broncos announcing big news on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "AFL Live: Surprise debut as Power jump Swans",
        "description": "Former Crow and Sun Rory Atkins is a late inclusion for Port Adelaide after a key goalkicker pulled out of the clash against Sydney. And the Power have started hot. LIVE UPDATES",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "‘Mockery’: AFL coach torches Vic Premier",
        "description": "Damien Hardwick has taken an unprompted swipe at Victorian Premier Jacinta Allan, accusing her of putting her nose where it shouldn’t be.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Cricket world loses it as 14yo makes history",
        "description": "A teenage phenom has lit up the cricket world in a historic moment in the IPL before breaking down in tears in sad scenes.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Warnie’s son to Robert Irwin: Hold my beer",
        "description": "Hot on the heels of Robert Irwin’s eye-popping transformation, the son of another Aussie legend has dropped his own dramatic change.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Tennis world slams ‘creepy’ shower rule",
        "description": "Tennis players will have to abide by a new ‘creepy’ shower rule as the sport works to implement stricter doping measures.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "De Minaur powerless as Alcaraz curse extends",
        "description": "It’s the same old story for Alex de Minaur after the Aussie star got in the way of a red-hot Carlos Alcaraz on Saturday morning.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "AFL legend’s brutal assessment of old club",
        "description": "Fremantle’s greatest ever player Matthew Pavlich has given his old team a harsh reality check as they aim to break a 30-year drought.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "JLO causes stir as shameless F1 joke swirls",
        "description": "Jennifer Lopez stole the show at the Formula 1 on Sunday morning with a jaw-dropping appearance that made a mockery of her age.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "‘F***ing idiot’: Drama turns F1 on its head",
        "description": "There has been high drama between Max Verstappen, Oscar Piastri and Lando Norris as one driver showed left commentators stunned.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Wallaby great in shock Olympics code switch",
        "description": "Former Wallaby Quade Cooper is making a comeback – but not for Australian rugby. The veteran star is switching sports to do what nobody ever has.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Former Wallaby in shock code switch to chase Olympic dream",
        "description": "Former Wallaby Quade Cooper is making a comeback – but not for Australian rugby. The veteran star is switching sports completely in a bid to make the Olympic team.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "‘Misogyny alive and well’: On-air act slammed",
        "description": "A TV segment showing a reporter interacting with female fans has come under fire, highlighting a troubling double standard.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Melbourne City keep slim premiers hopes alive after drama filled Wanderers draw",
        "description": "Melbourne City has salvaged a late draw against Western Sydney Wanderers to keep its slim A-League premiers hopes alive, but it wasn’t without controversy. All the latest round 27 results here.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Sky Blues ready for ‘must-win’ battle",
        "description": "The pressure is back on Sydney FC in the battle for an A-League finals berth after Adelaide United’s win over Wellington Phoenix.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Aussie breaks UFC curse, makes shock reveal",
        "description": "Aussie Alex Volkanovski has rewritten the UFC record books, winning an epic title fight to reclaim his belt and become champ again.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "‘It’s f***ing golf’: Ugly clip sickens millions",
        "description": "Police have launched an investigation into a golf course brawl that has gone viral after one of the sport’s unwritten law was violated.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Aussie star set for life-changing payday",
        "description": "Josh Giddey’s first season in Chicago may have come to an end on Thursday, but he is still expected to cash in big time.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Sandown Lakeside tips Monday: Apprentice to deliver winning result",
        "description": "Apprentice jockey Luke Cartwright looks set to continue on his winning ways when chasing his first Sandown winner on Easter Monday’s card on the Lakeside track.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Warnie’s son to Robert Irwin: Hold my beer",
        "description": "Hot on the heels of Robert Irwin’s eye-popping transformation, the son of another Aussie legend has dropped his own dramatic change.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    },
    {
        "title": "Fevola in off-camera incident, star sent home",
        "description": "A hit Australian TV series has been rocked by an off-camera incident that has seen one celebrity pair immediately sent home.",
        "source": "News AU",
        "fetched_date": "2025-04-20T07:24:13.597769"
    }
]