[
    {
        "title": "The US and China are finally talking. Why now?",
        "description": "Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
        "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Trump misspeaks and calls toy firm Mattel a country",
        "description": "The US president says tariffs are \"the most misunderstood thing\" in business and threatens more action.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "UK to announce fresh sanctions on Putin's 'shadow fleet'",
        "description": "Officials say action will be taken against up to 100 oil tankers that have been carrying cargo.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
        "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Mexico sues Google over 'Gulf of America' name change",
        "description": "President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Hormone-treated beef will not enter UK after US deal, says government",
        "description": "Farmers are raising questions over how checks will ensure US beef produced using hormones doesn't enter the UK market.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Trump proposes 80% China tariff ahead of trade talks",
        "description": "The meeting is the strongest sign yet that the world's two biggest economies are ready to de-escalate their trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "US and China are ready to talk tariffs - who will blink first?",
        "description": "The BBC's journalists in Washington DC and Singapore analyse US and China's moves ahead of the negotiation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "India worried about Chinese 'dumping' as trade tensions with Trump escalate",
        "description": "Experts warn that a flood of cheap Chinese goods could hurt the competitiveness of Indian exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "What is in the UK-US tariff deal?",
        "description": "The two nations have announced a deal to reduce tariffs - here's what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "US and UK agree to deal slashing Trump tariffs on cars and metals",
        "description": "It will leave a 10% import tax on most goods shipped from the UK to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "How good is the UK trade pact for America?",
        "description": "In Trump's new trade pact with the UK, we got a glimpse of the types of agreements he may seek across the globe.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Inside the secretive world of Zara",
        "description": "The BBC's Emma Simpson gets a rare glimpse behind the scenes of how the fashion brand operates.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "UK must 'do everything' to rebuild trade with EU, says Bank boss",
        "description": "Andrew Bailey says he does not take a view on Brexit, but reversing the post-Brexit hit to UK-EU trade would be \"beneficial\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Bill Gates plans to give away most of his fortune by 2045",
        "description": "Microsoft founder said he will speed up his charitable giving - and accused Elon Musk and Doge of \"killing children\" through aid cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "US agreement leaves the UK open to do a much more significant EU deal",
        "description": "Economically this US deal is relatively small, although important to very specific sectors.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Chris Mason: Starmer can claim limited win with America deal",
        "description": "The government's diplomatic achievement in sorting this deal before anyone else delivers reprieve to carmakers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Trump deal is a significant achievement for Starmer",
        "description": "The UK looks set to be the first to get a deal since US President Trump unleashed a wave of global tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Apple hits back at US judge's 'extraordinary' contempt order",
        "description": "The legal battle - started by Epic Games - could determine the future of the highly lucrative App Store.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Bank lowers interest rates and hints at more cuts to come",
        "description": "The Bank cuts rates for the second time this year, saying the slowdown in inflation was behind the move.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "iPhone maker announces plan to build Mitsubishi EVs",
        "description": "The Taiwan-made electric vehicle is expected to go on sale in Australia and New Zealand next year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Fed holds rates because of tariff 'uncertainty'",
        "description": "The Federal Reserve said Trump's barrage of tariffs were generating too much uncertainty to predict its next moves.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "Disney to open theme park in the Middle East",
        "description": "The company's seventh park will be on Yas Island in Abu Dhabi.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "WeightWatchers files for bankruptcy as fat-loss jabs boom",
        "description": "The firm is struggling with debt and tough competition from weight-loss drugs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-10T07:23:46.061074"
    },
    {
        "title": "This Alternative Artist Landed a Top-20 Chart Debut With an Album Made Almost Entirely on His Phone",
        "description": "Darkroom/Interscope's D4Vd debuted at No. 13 on the Billboard 200 this week, recording most of the album through the popular music creation app BandLab.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Harry Styles Attended Pope Leo XIV’s Historic Conclave Election",
        "description": "The singer joined the crowd gathered at Saint Peter's Square in the Vatican on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Sean “Diddy” Combs Trial Sees Jury Finalization Kicked to Monday So No One Gets “Cold Feet”",
        "description": "The trial should remain on schedule after the defense suggested that the final 12 jurors and six alternates could ask to be excused after spending a weekend contemplating a role in a major celebrity's fate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Stars Talk L.A Wildfires, Home Rebuilds and What to Do With Your Tesla at EMA Impact Summit",
        "description": "Phil Rosenthal, Kevin Nealon, Miranda Cosgrove, Jenna Dewan, Drew Scott and Malin Akerman were among the stars who kicked off the Environmental Media Association event on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Menendez Brothers Attorney Suddenly Nixes Request for D.A.’s Recusal From Resentencing",
        "description": "The brothers' battle to regain their freedom was back in court Friday, but instead of hearing why D.A. Hochman's bias against them means he needs to go, their lawyer killed the motion for withdrawal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Rosé Gets “Messy” in Latest ‘F1’ Soundtrack Single and Music Video",
        "description": "Last week, Doja Cat and Don Toliver’s new track, “Lose My Mind,” was released in support of the upcoming film’s companion album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Trump Fires Librarian of Congress Carla Hayden",
        "description": "Hayden, whose 10-year term was set to expire next year, had come under backlash from a conservative advocacy group.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "I’m One of the Filmmakers DOGE Targeted at the NEH. Here’s Why We’re in Trouble (Guest Column)",
        "description": "A documentarian describes what she and many of her peers have been going through as the Trump administration makes drastic cuts to the National Endowment for the Humanities.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "ACM Awards 2025: Full List of Winners",
        "description": "Lainey Wilson won entertainer of the year and female artist of the year, while Chris Stapleton took home the award for male artist of the year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Trump Names Fox News Host Jeanine Pirro Acting U.S. Attorney for Washington, D.C.",
        "description": "Pirro, a co-host of 'The Five,' has been a high-profile supporter of the president, and previously worked as a judge and DA.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "Katie Pandolfo Named G.M. of L.A.’s Crypto.com Arena",
        "description": "She heads downtown after working at another AEG property, Dignity Health Sports Park, since 2004.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "With Jury Nearly Finalized, Sean “Diddy” Combs’ Prosecutors Say They May Have Lost Key Witness",
        "description": "The 45 men and women who made it through the first stage of selection for the federal case's jury will be narrowed to 12 jurors and six alternates on Friday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-10T07:23:46.734176"
    },
    {
        "title": "AFL world erupts over umpiring howler",
        "description": "Footy fans have been left seeing red and calling out the AFL over the state of the umpiring after a blatant free kick went unpaid.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Kohli drops news India has always dreaded",
        "description": "Virat Kohli has reportedly got Indian cricket chiefs begging for a change of heart with the star batsman’s call rocking 1.4 billion fans.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Graham Arnold’s Iraq appointment confirmed",
        "description": "New Iraq boss Graham Arnold’s coaching staff is set to include some familiar faces.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Maroons dealt crushing State of Origin blow",
        "description": "The QLD Maroons have copped an early blow for the State of Origin opener with a Broncos star ruled out with a hamstring injury.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Maroons dealt crushing State of Origin blow",
        "description": "The QLD Maroons have copped an early blow for the State of Origin opener with a Broncos star ruled out with a hamstring injury.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Fans all say same thing about Latrell Mitchell",
        "description": "Latrell Mitchell has stolen the show in the pouring rain by doing something only he could to complete an incredible Souths victory.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "AFL world erupts over umpiring howler",
        "description": "Footy fans have been left seeing red and calling out the AFL over the state of the umpiring after a blatant free kick went unpaid.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Showdown 57: Port debutants brace for furnace",
        "description": "There is no bigger stage in South Australia than the Showdown. Port Adelaide’s four debutants tell Simeon Thomas-Wilson how they’re preparing for the ultimate battle.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Kohli drops news India has always dreaded",
        "description": "Virat Kohli has reportedly got Indian cricket chiefs begging for a change of heart with the star batsman’s call rocking 1.4 billion fans.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "‘Horrible’: Aussie presenters pray for safety",
        "description": "Aussie presenters Grace Hayden and Erin Hollands have shared scary updates after the former Miss World Australia revealed she is holed up in a room.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "‘Hoodwinked’: Wayne Bennett sold a lemon",
        "description": "The South Sydney Rabbitohs were meant to turn things around in 2025, instead Wayne Bennett has been sold a lemon in his return to the club.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Chilling girlfriend threats before Aussie axed",
        "description": "Jack Doohan was privately dealing with terrifying matters behind the scenes before his F1 axing with emails coming to light.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Triple Eight young gun fires first shot in practice",
        "description": "Triple Eight young gun Broc Feeney has launched the first strike in his bid to hit back from a podium-free round in New Zealand after blitzing practice at Symmons Plains.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Aussie star KOd in frightening scenes",
        "description": "Joseph Suaalii left Allianz Stadium on a stretcher after an ugly incident involving teammate Andrew Kellaway.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Reds conquer Tahs after Suaalii’s sickening head clash",
        "description": "With the British and Irish Lions heading to Australia soon, the only concern among New South Wales and Queensland was the health of Joseph-Aukuso Suaalii rather than the scoreboard.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "‘Chaos’: Football star arrested for murder",
        "description": "A former college football star is facing second-degree murder charges after allegedly opening fire in a bar in a chaotic scene.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "‘Unthinkable’: Simmons hits $252m crossroad",
        "description": "Ben Simmons is an NBA free agent and noises coming from around the NBA show he still has some lifelines left to save his career.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Graham Arnold’s Iraq appointment confirmed",
        "description": "New Iraq boss Graham Arnold’s coaching staff is set to include some familiar faces.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Botic brace sends Western Utd to semi final, ends Adelaide’s season",
        "description": "Noah Botic fired home a brace as Western United recovered from a nightmare start to beat Adelaide United and set up an A-League semi-final against Melbourne City.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Former heavy world champ lashes SBW-Gallen fiasco",
        "description": "A former heavyweight world champion has joined cruiserweight king Jai Opetaia in calling out Paul Gallen and Sonny Bill Williams over their upcoming blockbuster fight.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Greg Norman in terrifying mid-air incident",
        "description": "Greg Norman has released images of his terrifying ordeal where he heard something “shatter” thousands of feet above the ground.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Opals lose star as Australia seals Trans-Tasman Challenge titles",
        "description": "Kings star Xavier Cooks has led the Boomers to the Trans-Tasman Challenge title as the Opals ensured Australia claimed both best of three series against New Zealand.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Queanbeyan preview, tips: Track stats make a persuasive case",
        "description": "Like a fine wine, the Rob Potter-trained Almost Persuaded is getting better with age and is looking to keep her immaculate Queanbeyan track and distance in tact.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "Aussie cycling star announces shock retirement",
        "description": "Australia’s five-time Tour de France stage winner Caleb Ewan has announced his retirement aged just 30, declaring the past two seasons had “taken a significant toll on my relationship with the sport”.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "New vision shows cause of ‘devastating’ fall",
        "description": "This is the moment it all went wrong for an American baseball fan who was left with a broken neck and back after falling 6m to the field.",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    },
    {
        "title": "‘Not a bikini?’: Anger over runner’s briefs",
        "description": "A 31-year-old who recently competed her first marathon has responded to critics of her outfit, asking: “Should I have worn a tracksuit?”",
        "source": "News AU",
        "fetched_date": "2025-05-10T07:23:48.067040"
    }
]