[
    {
        "title": "Succession-like feud engulfs one of Singapore's richest families",
        "description": "Kwek Leng Beng, the chairman of property giant CDL, has accused his son of plotting a boardroom coup.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Instagram may launch separate Reels app to take on TikTok - report",
        "description": "It comes as Chinese-owned short-video app TikTok's future remains uncertain in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "US intelligence head 'not told' about UK's secret Apple data demand",
        "description": "Tulsi Gabbard said she was seeking further information from the FBI and other US agencies.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "BP shuns renewables in return to oil and gas",
        "description": "The energy giant has announced its strategy after rivals also rowed back on green energy plans.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Instagram may launch separate Reels app to take on TikTok - report",
        "description": "It comes as Chinese-owned short-video app TikTok's future remains uncertain in the US.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Nvidia says AI chip sales strong despite DeepSeek fears",
        "description": "Boss Jensen Huang responds to concerns about an AI bubble sparked by Chinese firm DeepSeek.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Musk, tariffs and tensions - takeaways from Trump's first cabinet meeting",
        "description": "Trump covered a wide range of topics, ranging from efforts to cut government spending to immigration, the economy and Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Trump says 25% tariffs on EU will be announced soon",
        "description": "\"The EU was formed to screw the United States,\" Trump says.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "What we know about US-Ukraine minerals deal",
        "description": "A Ukrainian official says Kyiv has agreed to the terms of a deal which would give the US access to mineral deposits.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Who is Doge's official leader? White House says it's not Musk",
        "description": "The agency known as \"Doge\" is Musk's brainchild, but the White House insists that he is not its leader - or even employed by it.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "NYSE Opening Bell",
        "description": "Watch the latest from BBC’s new daily business programme coming from the heart of New York’s financial district.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Pokémon boss believes series can last another 50 to 100 years",
        "description": "CEO Tsunekazu Ishihara speaks to the BBC about the future of the world's most valuable media franchise.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Apple boss says its DEI programmes may change",
        "description": "His comments came as shareholders rejected a call for the firm to consider ending its diversity practices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "BP shareholders want it to make money, not climate policy",
        "description": "The oil and gas producer faces criticism for its shift away from green energy, but many support it.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Tesla shares slump after European sales fall",
        "description": "Shares in the US electric carmaker dropped after European sales halved in January.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Aston Martin cuts 170 jobs after fall in sales",
        "description": "A total of 170 jobs cut by Aston Martin after car sales dropped in 2023.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Billion Indians have no spending money, report says",
        "description": "India's population is 1.4 billion but its consuming class is only 140 million, or about as big as Mexico.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "US House narrowly passes Trump-backed spending bill",
        "description": "It is still several steps from becoming law, but marks a major victory for Republican House Speaker Mike Johnson.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Wonder Woman game axed as Warner Bros cuts three studios",
        "description": "Warner Bros Games joins a growing list of companies making cuts in the gaming industry.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Ukraine PM says minerals deal  agreed with US",
        "description": "Denis Shmyhal said the Ukrainian government would not sign a deal without security guarantees.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Apple AI tool transcribed the word 'racist' as 'Trump'",
        "description": "Experts have questioned the company's explanation that it is due to the two words being similar.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Trump orders copper probe in first step to tariffs",
        "description": "The White House said the metal was vital to national security.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Myanmar villagers reveal 'desperate' illegal kidney sales",
        "description": "Two Burmese men tell the BBC they used forged documents and middlemen to undergo surgery in India.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Major Asia bank to cut 4,000 roles as AI replaces humans",
        "description": "It makes DBS one of the first major banks to offer details on how AI will affect its operations.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Theranos founder Elizabeth Holmes loses fraud appeal",
        "description": "Holmes was sentenced to more than 11 years in prison for defrauding investors in her blood-testing company.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Putin offers Russian and Ukrainian rare minerals to US",
        "description": "The proposal to give the US access to minerals would also include those from territories taken from Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-02-27T07:23:41.077246"
    },
    {
        "title": "Drake Cancels Remaining Australia, New Zealand Tour Dates",
        "description": "Due to a scheduling conflict, says a rep for the rapper, the four sold-out shows are postponed: \"We are actively working on rescheduling these dates.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Anti-Elon Musk Poster “Don’t Buy a Swasticar” in London Goes Viral",
        "description": "\"Goes from 0 to 1939 in 3 seconds,\" says the poster from campaign group Everyone Hates Elon as a slump in European Tesla sales also makes headlines.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Fyre Fest 2 Announces Ticketing Partner, Guarantees Refunds",
        "description": "Founder Billy McFarland has branded the second fest as a comeback for himself and the brand after a 2017 disaster in the Bahamas.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Trump’s Least Favorite Writer — “a Total Loser” — Gets the Last Word (Again) With ‘All or Nothing’",
        "description": "'Fire and Fury' author Michael Wolff's new page-turner is packed with revelations about Trump's comeback, including a desperate campaign by Rupert Murdoch to regain the president's trust.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Roger Waters Defamed Filmmaker With Antisemitic Remarks, Court Finds",
        "description": "The Pink Floyd bassist was accused of making antisemitic statements in response to the documentary 'The Dark Side of Roger Waters.' Al Jazeera was also named in the complaint.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "K-Pop Star Chung Ha Finds Closure on New EP ‘Alivio’: “I Wanted to Share That Part of Me”",
        "description": "The 29-year-old singer and former girl group member discusses working with her good friend Sunmi and why she embraced her own vulnerability: \"I couldn't ignore that part of me.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "SAG Awards: “Very Worried” Michael Urie, Hopeful Lily Gladstone Respond to Trump Attacks on DEI Initiatives",
        "description": "\"America is a big DEI experiment,\" the 'Killers of the Flower Moon' star said, as she remained optimistic that Hollywood will continue to tell diverse stories. \"When there's something to resist, a lot of times it turns up the creativity.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "AP Will Remain Banned From White House Press Pool Following “Gulf of Mexico” Dispute",
        "description": "The judge, a Trump appointee, noted that he will consider a request for a preliminary injunction and advised the Trump administration to reconsider their position.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Jewish Hollywood Protests Artists4Ceasefire Pins After Bibas Bodies Release: “Have You No Shame?”",
        "description": "The Brigade, representing some 700 producers, filmmakers, agents, managers, publicists, executives, actors and actresses, is taking issue with a letter encouraging attendees of the 2025 Academy Awards to wear a controversial emblem.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "American Music Awards Set Memorial Day Return on CBS",
        "description": "The ceremony last aired on ABC in 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Roberta Flack, Soulful “Killing Me Softly With His Song” Performer, Dies at 88",
        "description": "The singer, pianist and four-time Grammy winner had two other No. 1 hits with \"The First Time Ever I Saw Your Face\" and \"Feel Like Makin' Love.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "German Conservatives Win Historic Election, Far-Right Vote Doubles",
        "description": "Germany now faces weeks to months of negotiations as the conservatives, under presumptive Chancellor-to-be Friedrich Merz, try to form a government collation.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-02-27T07:23:41.836202"
    },
    {
        "title": "Sydney clinches 2026 Asian Women’s Cup final",
        "description": "Sydney has pulled off another sporting coup by being awarded the final of the 2026 AFC Women’s Asian Cup, with details of the 21-day festival locked in.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Walters launches passionate Reece Walsh defence",
        "description": "Former Broncos coach Kevin Walters has doubled down on his strident defence of Brisbane ace Reece Walsh and one of his famous habits.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Matildas want coaching ‘surety’ from Football Australia",
        "description": "The Matildas have lost a third successive match in a ‘massive wake-up call’ ahead of next year’s AFC Women’s Asian Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Racing rocked as Melbourne Cup winner dies",
        "description": "The horse racing industry is in mourning after a popular trainer who won the 2000 Melbourne Cup sadly passed away.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Aussie spin star breaks silence on ICC probe",
        "description": "Matthew Kuhnemann has broken his silence after being cleared of a suspect bowling arm by the ICC, saying he “never doubted” his action.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Rumour swirls amid Mitch Starc no-show",
        "description": "The reasons why arguably Australia’s best bowler isn’t at the Champions Trophy tournament in Pakistan have been revealed.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Raducanu’s security move amid frightening incident",
        "description": "Emma Raducanu’s security has been revamped after the English tennis star was allegedly followed across four countries by her stalker",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "De Minaur’s $10m gamble horribly backfires",
        "description": "Aussie tennis star Alex de Minaur has been left to ponder what could have been after a risky call proved incredibly costly.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Five Tasmanian stars to power your SuperCoach side",
        "description": "The Tasmanian Devils enter the AFL in 2028, but you don’t have to wait until then to barrack for your own team of Tassie stars.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "How Power will cover injured superstar",
        "description": "Port Adelaide faces a major challenge with the loss of Zak Butters but is confident in its depth to cover the superstar’s absence.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Walters launches passionate Reece Walsh defence",
        "description": "Former Broncos coach Kevin Walters has doubled down on his strident defence of Brisbane ace Reece Walsh and one of his famous habits.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Major change as new Jillaroos era begins",
        "description": "A new era begins for the Jillaroos this weekend, but the more things change, the more they stay the same.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "‘It’s greed’: Footy divided over $1.2m trend",
        "description": "“Exciting” AFL and NRL off-seasons with more player movement than ever has exposed a modern new reality about the footy codes.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "NFL team torched as Trump rumours swirl",
        "description": "There has been an angry backlash against the Super Bowl champions with the team told to “go f*** yourselves” over Donald Trump rumours.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Sydney clinches 2026 Asian Women’s Cup final",
        "description": "Sydney has pulled off another sporting coup by being awarded the final of the 2026 AFC Women’s Asian Cup, with details of the 21-day festival locked in.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Matildas want coaching ‘surety’ from Football Australia",
        "description": "The Matildas have lost a third successive match in a ‘massive wake-up call’ ahead of next year’s AFC Women’s Asian Cup.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Aussie’s career derailed by latest defeat",
        "description": "Aussie Jason Moloney faces a long climb back into world title contention after suffering his second straight loss on Japanese soil.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Clean sweep: Waters the driver to beat after wet and wild win",
        "description": "Cam Waters has produced a stellar opening round clean sweep on a wet and wild Sydney track, claiming all three race wins to stamp himself as the driver to watch this season.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Driver fined, relegated to last after embarrassing teammate crash",
        "description": "Teammates Aaron Love and James Courtney were involved in a bizarre collision at the start of Supercars qualifying which left their team principal fuming.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Josh Giddey stuns in epic NBA turnaround",
        "description": "Australia’s Josh Giddey has continued his red-hot NBA form, leading his team to victory while a fellow Aussie shattered records.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Aussie trio chasing major chance",
        "description": "A win at this week’s New Zealand Open in Queenstown has some major benefits.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "‘Going super’: Reserve Bank rates highly in Inglis Sprint",
        "description": "Trainer Michael Kent Jr cannot fault equal favourite Reserve Bank who will seek to protect his perfect first-up record in the $1m Inglis Sprint at Flemington on Saturday.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Boost for Reds as Wallabies star returns",
        "description": "It has been a long wait for Reds star Liam Wright, but the Queensland flanker is finally ready to return from a shoulder injury.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Suaalii sidelined for Tahs in fresh $5m blow",
        "description": "Superstar NRL convert Joseph-Aukuso Suaalii has been sidelined for the NSW Waratahs after being injured in the opening round of the Super Rugby season.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Aussie defector’s staggering gold medal act",
        "description": "Six months after sensationally switching his allegiance from Australia to England, the cycling defector has rubbed salt in the wounds.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Legend’s daughter’s big news after break-up",
        "description": "The daughter of a football icon has announced big personal news after her split from disgraced NRL player Brett Finch.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    },
    {
        "title": "Teen crushed to death in horror gym accident",
        "description": "Graphic Warning: Gym goers have been left shaken after a teenager was crushed to death in a shocking weightlifting accident.",
        "source": "News AU",
        "fetched_date": "2025-02-27T07:23:44.435396"
    }
]