[
    {
        "title": "Starbucks to hire more baristas in bid to win back customers",
        "description": "The move to increase staff numbers comes as the coffee shop giant continues to see sales fall.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Xi's real test is not Trump's trade war",
        "description": "The real battleground of the current trade war might be China's domestic economy",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Trump calls Bezos as Amazon says no plan to show tariff price rises",
        "description": "Donald Trump called Amazon founder Jeff Bezos to complain about the plan, which the company said had been rejected.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Trump eases car tariffs after firms raised concerns",
        "description": "The president said the move would give companies relief while they adjust their supply chains.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Xi's real test is not Trump's trade war",
        "description": "The real battleground of the current trade war might be China's domestic economy",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Richard Branson criticises Donald Trump's tariffs",
        "description": "Sir Richard Branson told the BBC he wanted to \"make London prosperous for everybody\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Canada will deal with Trump 'on our terms', Carney tells BBC",
        "description": "Speaking exclusively to the BBC, Canada's PM says he will only visit the US when there is a \"serious discussion to be had\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Fifty years after the war, Vietnam faces a new US threat: tariffs",
        "description": "The South East Asian country is on a path to prosperity. The US-China trade war could change that.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "How Armenia is trying to build a Silicon Valley in the Caucasus",
        "description": "The country is aiming to boost its technology sector by training children in tech from a young age.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Could South America benefit from Trump's trade tariffs?",
        "description": "Countries in the continent may see exports rise as both the US and China need new suppliers.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Highly unlikely for tariffs to be ratcheted up, expert says",
        "description": "David Waddell says markets have sniffed out that there are reasons to be less pessimistic in this environment.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Analysis:  Carney wants to lead a G7 fightback on Trump tariffs",
        "description": "In winning the Canadian election, Mark Carney becomes the biggest economic force against the US president.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "How Spain powered back to life from unprecedented national blackout",
        "description": "However diversified Spain's energy mix is, the blackout required an enormous effort to get back up and running.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Malta's golden passport scheme breaks EU law, top court rules",
        "description": "The scheme lets people become citizens after paying, buying or renting property of a certain value, and donating to charity.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Trainer prices will rise due to tariffs, says Adidas",
        "description": "Adidas says trade tariffs introduced by President Donald Trump will lead to price rises for US consumers.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Prince Andrew's firm linked to controversial PPE millionaire",
        "description": "Documents show Doug Barrowman-linked company owned the prince's start-up competition for two years.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Australian PM dismisses warning over AAA credit rating",
        "description": "High public spending puts the country's rating at risk if savings are not found, analysts have said.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "ChatGPT AI bot adds shopping to its powers",
        "description": "The move is a challenge to tech rivals such as Google as well as other websites offering product reviews.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "DHL lifts suspension of high-value deliveries to US",
        "description": "The delivery giant is resuming deliveries worth more than $800 after negotiating \"adjustments\" to customs rules.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "There are signs Trump could be ready to retreat on tariffs",
        "description": "BBC economics editor Faisal Islam on what comes next for the US president's central economic policy.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Why might public sector workers in UK go on strike again?",
        "description": "BBC Verify examines why political pressure over public sector pay and industrial action has re-emerged.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "'Tech entrepreneur took our money but failed to deliver our start-up dreams'",
        "description": "One client of Josh Adler re-mortgaged their home, another spent life savings to pay for websites and apps.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "'Kicking butt' or 'going too fast'? Trump voters reflect on 100 days",
        "description": "Five Trump supporters say his first 100 days have met their expectations - with a few surprises and some warning signs.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Titanic survivor's letter sold for £300,000 at auction",
        "description": "Colonel Archibald Gracie's letter from onboard the ill-fated ocean liner has been described as \"prophetic\".",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "Reeves suggests UK trade with EU more important than US",
        "description": "The chancellor indicates that moving closer to the EU on trade is a bigger priority than the US.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "How much has Elon Musk's Doge cut from US government spending?",
        "description": "BBC Verify has looked at the agency's biggest claimed savings, examining the figures and speaking to experts.",
        "source": "BBC Business",
        "fetched_date": "2025-04-30T07:26:03.897591"
    },
    {
        "title": "The Hollywood Reporter Names Ada Guerin as Creative Director and Tony Maglio as Television Editor",
        "description": "Guerin will oversee the look and feel of multiple editorial properties for the brand, while Maglio will oversee THR’s television coverage.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Seventeen’s Hoshi and Woozi, IVE and NMIXX Among First Wave of Artists on Lineup for KCON L.A. 2025",
        "description": "The annual K-Pop festival returns to the Los Angeles Convention Center and the Crypto.com Arena for three days of programming during the day and performances at night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Chappell Roan Signs Management Deal With Noah Kahan Manager Drew Simmons",
        "description": "The move comes months after Roan left manager Nick Bobetsky, who managed her through her breakout as one of the biggest artists in pop music.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Hollywood’s Most Notable Deaths of 2025",
        "description": "Val Kilmer, Gene Hackman, Michelle Trachtenberg, David Lynch, Irv Gotti and Jeff Baena are among several entertainment legends the industry lost has this year.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Mike Van Named First-Ever CEO of Billboard",
        "description": "Van has been promoted to CEO of the publication after serving as Billboard's president since 2022.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Stephanie Ruhle Sets MSNBC Primetime Special With Laid-Off Federal Workers (Exclusive)",
        "description": "The special, set to run May 1, will also feature reports from Jacob Soboroff on the impact of the DOGE cuts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Bad Company, Cyndi Lauper, Outkast, The White Stripes Lead Rock & Roll Hall of Fame Class of 2025",
        "description": "Chubby Checker, Joe Cocker and Soundgarden round out this year's inductees, set to be honored in November at the induction show in Los Angeles.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Bruce Springsteen Performs With Smokey Robinson, John Fogerty at 2025 American Music Honors Event",
        "description": "Robinson, Fogerty, Emmylou Harris, Tom Morello and Joe Ely were recognized at this year's annual ceremony in New Jersey.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "At WHCD Weekend, Glam With a (Small) Dash of Dystopia",
        "description": "Many of the Capital's parties went on per the crowded usual, with just a slightly uneasy undercurrent",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Lana Del Rey Joins Jelly Roll at Stagecoach to Perform ‘Save Me’",
        "description": "Del Rey joined Jelly Roll during his headlining set a day after she performed at the country festival Friday night.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "Mike Myers Explains Origins of Recent Canadian Political Activism",
        "description": "The 'Saturday Night Live' alum, who's returned to the sketch show to play Elon Musk, has used his time on the air to also support his native country and starred in an ad for Canada's Liberal Party.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "White House Correspondents’ Dinner Focuses on Awards, Journalism as Trump Snubs Comic-Free Soirée",
        "description": "As the current administration is tightening its grip on the White House press corps, the governing body's \"nerd prom\" saw fewer A-list celebrities and more attention on reporters' work.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-04-30T07:26:04.219631"
    },
    {
        "title": "NBA star comes face-to-face with rival’s dad",
        "description": "An NBA star has criticised his own dad, who was spotted taunting a rival player in a bold act that sparked ugly scenes in the playoffs.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Queensland selection shock",
        "description": "Queensland Reds coach Les Kiss has made a surprising selection decision for his team’s clash with Fijian Drua in Suva.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Socceroos must find ‘solution’ for missing star",
        "description": "An “unexpected” selection could be the answer for the Socceroos in their bid to replace injured star Jackson Irvine.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Lyon ‘really comfortable’ with interchange spray",
        "description": "St Kilda coach Ross Lyon is “really comfortable” with his spray to Hugo Garcia and says he isn’t afraid of coaching with conviction in the future.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Positional gamble could dictate Origin opener",
        "description": "She was the Dally M centre of the year in 2024, but Tiana Penitani Gray will play a new position in the Origin opener.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Players respond to key change at Magic Round",
        "description": "Bunker involvement for high shots has been the burning issue, and players are happy to hear that the video referee won’t interfere for minor offences at Magic Round.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Lyon ‘really comfortable’ with interchange spray",
        "description": "St Kilda coach Ross Lyon is “really comfortable” with his spray to Hugo Garcia and says he isn’t afraid of coaching with conviction in the future.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "AFL Now: Banned Roo’s ‘ATFL’ tribunal sledge",
        "description": "North Melbourne forward Paul Curtis has taken to social media to make his feelings known about being banned for three games for a tackle on Josh Sinn. More in AFL Now.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "14yo freak blows minds as record smashed",
        "description": "Cricket commentators around the world, including Indian legend Sachin Tendulkar, have been left in awe after a teen phenom’s history-making feat.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Watch: 14-year-old sensation blasts 35-ball IPL ton",
        "description": "Vaibhav Suryavanshi only turned 14 last month. He’s just made history as the youngest player to ever score a men’s T20 century, and he’s done it on the cutthroat stage of the IPL.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Aussie tennis star cops monster drugs ban",
        "description": "After revelations he was facing an anti-doping charge last December, an Australian grand slam winner has been handed a heavy penalty.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Djokovic’s shock retirement admission",
        "description": "Tennis legend Novak Djokovic made the shocking admission after being bundled out in the first round of back-to-back tournaments.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "‘Insanity’: Grave fears as Aussie sport booms",
        "description": "Leading sports neuroscientist Dr Alan Pearce has issued a grave warning to Aussies as a new combat sport makes waves across the country.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Aussie legend goes nuclear on F1 star",
        "description": "The last Aussie to win a F1 world championship is backing Oscar Piastri to win the title, labelling his McLaren teammate “weak”.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Heartbreaking photo shows devastating twist",
        "description": "The fiancee of a motocross star killed in a horror crash has revealed her pregnancy in a heart breaking post mourning his death.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Queensland selection shock",
        "description": "Queensland Reds coach Les Kiss has made a surprising selection decision for his team’s clash with Fijian Drua in Suva.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "‘Best outcome’: Next Wallabies coach confirmed",
        "description": "The Wallabies’ coaching “transition” from Joe Schmidt to Queensland Reds mentor and former rugby league player Les Kiss will take place next year.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "NBA star comes face-to-face with rival’s dad",
        "description": "An NBA star has criticised his own dad, who was spotted taunting a rival player in a bold act that sparked ugly scenes in the playoffs.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "24yo leaks email, world giggles at romance",
        "description": "The ex-cheerleader girlfriend of a sports legend has gone public after the couple’s 49-year age gap romance gripped America.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Socceroos must find ‘solution’ for missing star",
        "description": "An “unexpected” selection could be the answer for the Socceroos in their bid to replace injured star Jackson Irvine.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Next best thing for A-League premiers",
        "description": "Being unable to compete in the AFC Champions League Elite competition has A-League premiers Auckland FC exploring other options.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "‘More money’: Tszyu in massive career U-turn",
        "description": "Tim Tszyu has reached an agreement for a blockbuster world title fight re-match in a stunning development nobody saw coming.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Aussie ‘aura’ could end winning drought",
        "description": "The new Australian captain of the International Team for the Presidents Cup brings something special to the table.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "NBA star comes face-to-face with rival’s dad",
        "description": "An NBA star has criticised his own dad, who was spotted taunting a rival player in a bold act that sparked ugly scenes in the playoffs.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Wagga, Wyong previews: Nickson chasing a Majestic win",
        "description": "Warwick Farm trainer Gary Nickson won the Wagga Town Plate in 1988 with Grand Gaelic and returns this year with a great chance of adding a second with Felix Majestic.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "Olympian couple’s fatal fight about renos",
        "description": "A police interview with Rohan Dennis has revealed what happened in the tragic seconds before champion cyclist Melissa Hoskins’ death.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "24yo leaks email, world giggles at romance",
        "description": "The ex-cheerleader girlfriend of a sports legend has gone public after the couple’s 49-year age gap romance gripped America.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    },
    {
        "title": "MP says NRL star died due to climate change",
        "description": "The family of a former NRL player who tragically died have slammed comments made by an MP linking his death to climate change.",
        "source": "News AU",
        "fetched_date": "2025-04-30T07:26:07.004252"
    }
]