[
    {
        "title": "Elon Musk, MrBeast, Larry Ellison: Who might buy TikTok?",
        "description": "Several potential US buyers have expressed interest in purchasing the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "The French winemaker whose wines are illegal in his home country",
        "description": "Maxime Chapoutier makes wines that combine French and Australian grapes, a strict no-no in the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Clampdown on fake Google reviews announced",
        "description": "Businesses which boost their star ratings will have warnings attached to them - fake reviewers will be banned.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "US doesn't need Canadian energy or cars, says Trump",
        "description": "Speaking to business leaders in Davos, Trump also repeated his jibe that Canada could become a US state and would avoid tariffs if it did.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "The French winemaker whose wines are illegal in his home country",
        "description": "Maxime Chapoutier makes wines that combine French and Australian grapes, a strict no-no in the EU.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Davos elite nod along as Trump delivers ultimatum",
        "description": "President Trump's 'America First' message takes shape, as the rest of the world begins to digest what it might mean for them and global trade.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Trump urged not to put massive tariffs on UK",
        "description": "Business Secretary Jonathan Reynolds says there is no need for tariffs because the US has no goods trade deficit with the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Bank of Japan raises rates to highest in 17 years",
        "description": "The move comes hours after economic data showed prices rose last month at the fastest pace in 16 months.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "'A mockery': Trump's new meme-coin sparks anger in crypto world",
        "description": "The president's meme-coin launch is being criticised as a stunt, while impatience grows for deregulation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Does China 'operate' Panama Canal, as Trump says?",
        "description": "The US president says the US should \"take back\" the famous waterway because China runs it now.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Leaders leave Davos with 'cautious optimism' - 24 Jan 2025",
        "description": "As the World Economic Forum closes, senior WEF official says leaders leave Davos with constructive optimism.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "UnitedHealthcare names new boss after former CEO killed",
        "description": "The company's former chief executive Brian Thompson was shot and killed in December.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Rolls-Royce strikes £9bn nuclear submarine deal",
        "description": "A deal for nuclear submarine reactors is agreed between the Ministry of Defence and Rolls-Royce.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "US government workers told to report DEI efforts or face 'consequences'",
        "description": "Government employees received emails threatening \"consequences\" if they did not report DEI work to the White House.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Purdue and Sackler family agree $7.4bn opioid settlement",
        "description": "Under the terms, the opioid maker agreed to pay $900m, and the family behind it agreed to pay up to $6.5bn.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Trump urges Opec countries to slash oil prices",
        "description": "The president says he wants Opec and Saudi Arabia to bring down the price of oil which he says is fuelling the Russia-Ukraine war.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "EU 'could consider' UK joining pan-Europe customs scheme",
        "description": "The UK joining the Pan-Euro-Mediterranean Convention is up for discussion in reset talks, says Maros Sefcovic.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Meta denies forcing users to follow Trump accounts",
        "description": "The Facebook and Instagram owner says the official profiles were updated to reflect the new position holders.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Canada offers to help Trump as it scrambles to avert tariff war",
        "description": "Prime Minister Justin Trudeau has threatened the stick against proposed US tariffs. Now he's trying a different approach.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "LinkedIn accused of using private messages to train AI",
        "description": "The lawsuit alleges LinkedIn tried to conceal its actions but the firm says the claims are false.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Trump puts all US government diversity staff on paid leave 'immediately'",
        "description": "A new executive order signed on Tuesday calls for an end to DEI practices in the federal government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Tesco, Aldi and Lidl hit back at UK farm inheritance tax",
        "description": "Tesco, Aldi and Lidl call for rethink of inheritance levy announced in Budget",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Sun owner to pay Prince Harry 'substantial' damages",
        "description": "News Group Newspapers offers an \"unequivocal apology\" to the Duke of Sussex for \"serious intrusion\".",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Tech giants are putting $500bn into 'Stargate' to build up AI in US",
        "description": "Trump has extolled the project as an important investment, but Elon Musk is throwing shade on it.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Netflix to raise prices as new subscribers soar",
        "description": "Squid Game 2 and live sports, including the Jake Paul v Mike Tyson fight, fuelled new memberships.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "Reeves optimistic despite surprise rise in UK borrowing",
        "description": "Borrowing - the difference between spending and tax revenue - hit its highest December level for four years.",
        "source": "BBC Business",
        "fetched_date": "2025-01-25T07:20:59.878654"
    },
    {
        "title": "‘What If…?’ Writer A.C. Bradley Lost Her Home in the L.A. Fires. Now She Faces Her Own ‘What If…?’ Moments With Young Daughter",
        "description": "The scribe and her three-year-old were out of the country when the blaze took their Altadena home, and are now trying to rebuild their lives.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Trump Delivers Harsh Words to California While Heading to Los Angeles to Survey Fire Damage",
        "description": "The president will depart on Air Force One for L.A. this afternoon for a brief trip that may or may not include his old foe, Gov. Gavin Newsom.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Marilyn Manson Won’t Be Charged After Long Investigation of Sexual Assault Allegations",
        "description": "Los Angeles County District Attorney Nathan Hochman said the allegations are too old under the law and the evidence is not sufficient to charge the 56-year-old shock rocker.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Björk on Her Wild New Apple TV+ Concert Film, ‘Cornucopia’: “Something I Hadn’t Done Before”",
        "description": "The Icelandic songstress used VR technology and bespoke flutes to create what she calls \"digital theater.\"",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Billy Ray Cyrus’ Ex-Wife “Genuinely Worried” After That Viral Performance",
        "description": "Firerose joins Trace Cyrus in speaking out about the country singer's condition following his \"disaster\" performance.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Dick Van Dyke Reveals His Longevity Secret at 99",
        "description": "The centenarian actor breaks down his exercise routine that he says has resulted in his long life.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Teddy Swims on Creating a New Album That “You Can Make Love and Cry to”",
        "description": "The Hollywood Reporter's newest \"Person of Interest\" is the singer-songwriter who just dropped the second part of his debut album, 'I've Tried Everything But Therapy,' ahead of the Grammys, where he is nominated for the first time.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Grammys Performers: Billie Eilish, Sabrina Carpenter, Charli XCX and Chappell Roan",
        "description": "Shakira, Benson Boone, Doechii, RAYE and Teddy Swims will also hit the stage at the Feb. 2 event.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Hans Zimmer in Talks to Re-create Saudi Arabia’s National Anthem",
        "description": "The Oscar-winning composer met with the country’s chairman of the General Entertainment Authority to discuss various collaborations.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Spencer Pratt, Heidi Montag Sue Los Angeles Over Water Supply Issues That Hampered Firefighting",
        "description": "The lawsuit faults the Los Angeles Department of Water and Power for delaying repairs to a massive reservoir that services the Pacific Palisades.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "SZA to Perform at Super Bowl with Kendrick Lamar",
        "description": "The Grammy-winning stars, who are currently topping the charts with their collaborative hits, will perform at the Feb. 9 event in New Orleans.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "The ADL Scolds Elon Musk for Nazi Puns: “The Holocaust Is Not a Joke”",
        "description": "After defending Musk's viral salute, The Anti-Defamation League is criticizing the tech billionaire for making a series of Holocaust jokes.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-25T07:21:00.131029"
    },
    {
        "title": "Novak drops shock Andy Murray claim",
        "description": "After bowing out of the Aussie Open, Novak Djokovic has made a surprise call about the future of his relationship with Andy Murray.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "‘Disgrace’: World’s had enough of Australians",
        "description": "The landscape has turned at the Australian Open and in an extraordinary turn of events, the world has had enough of the host country.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Broncos star cops huge reality check",
        "description": "Reece Walsh endured a difficult 2024 season and an NRL legend believes he will struggle even more in 2025 if he doesn’t make a necessary move.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Hayne’s rugby league return hits major snag",
        "description": "Jarryd Hayne’s attempt to return to the NRL has been dealt a huge blow with the ex-Eels star forced to withdraw from his comeback game.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Rolled for 15 to BBL final: Sangha’s road back from rock bottom",
        "description": "Jason Sangha was captain the night Sydney Thunder was skittled for 15. Then, he spent years out of the team. As LACHLAN MCKIRDY explains, it’s why he’s savouring every moment of his first BBL final.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Aussie stars in never seen before snub",
        "description": "The Australian cricket team has every right to feel hard done by as the cricket world slammed a bizarre decision made by the ICC.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Novak drops shock Andy Murray claim",
        "description": "After bowing out of the Aussie Open, Novak Djokovic has made a surprise call about the future of his relationship with Andy Murray.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "‘Disgrace’: World’s had enough of Australians",
        "description": "The landscape has turned at the Australian Open and in an extraordinary turn of events, the world has had enough of the host country.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "AFL star’s mark of the year goes viral",
        "description": "Hawthorn livewire forward Nick Watson has produced arguably the best mark of 2025 and he did it during a match simulation.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Scary thing about Lions for AFL rivals",
        "description": "Draft picks Levi Ashcroft and Sam Marshall are set to “drive the standards” in Brisbane’s bid for back-to-back AFL premierships.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Broncos star cops huge reality check",
        "description": "Reece Walsh endured a difficult 2024 season and an NRL legend believes he will struggle even more in 2025 if he doesn’t make a necessary move.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Hayne’s rugby league return hits major snag",
        "description": "Jarryd Hayne’s attempt to return to the NRL has been dealt a huge blow with the ex-Eels star forced to withdraw from his comeback game.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Steph Rice reveals fears she joined a ‘cult’",
        "description": "Stephanie Rice has shared eye-opening details about her family’s fear that she had “lost her mind” before marrying her pastor husband.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Aussie GOAT makes shock career call",
        "description": "She took last year off competition and still spent the year surfing, and now Steph Gilmore has decided what she’ll be doing in 2025.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "‘Best I’ve ever seen’: NBA in disbelief",
        "description": "Nikola Jokic may well be the best basketball player on planet earth right now after the Denver Nuggets sensation did the unthinkable.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Huge snub as NBA All-Star starters named",
        "description": "Teams for the NBA’s new-look All-Star Game have been announced and some big-name players have been overlooked.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Socceroo set to remain in Europe",
        "description": "A Socceroos defender is expected to continue his career in Europe rather than join an A-League club, while a second forward could be leaving Macarthur FC to play abroad.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "‘Really poor’: Socceroos coach blasts prodigy",
        "description": "Socceroos coach Tony Popovic hasn’t held back in his assessment of the standard of Australian players, including a one-time prodigy.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "‘Oh my gosh’: Star knocked out after taunt",
        "description": "Boxing “Monster” Naoya Inoue has dropped jaws around the boxing world after appearing to take a taunt very personally.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "‘We saw her’: F1 erupts at Lewis footage",
        "description": "F1 fans have gone into meltdown after spotting a major detail in footage of Lewis Hamilton’s first test drive on track with Ferrari.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "F1 world in meltdown over Hamilton photo",
        "description": "Seven-time world champion Lewis Hamilton has sent the F1 world into a spin over a simple photo he shared on Instagram.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "High stakes: Bitter homecoming clashes to shape NBL finals",
        "description": "Still be two weeks away, Melbourne coach Dean Vickerman has foreshadowed a finals-shaping end to the regular season with South East Melbourne — right after a homecoming against United’s grand final vanquishers.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Dutton hits back at lunch scheme dig",
        "description": "Peter Dutton has hit back at recent criticism of an Opposition election pledge to give small businesses $20,000 of tax-deductible lunches.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Wagga preview: Cooee worth a shout for Country final",
        "description": "Trainer Ron Stubbs will be a step closer to a fourth straight Country Championship Final appearance should Cooee maintain his unbeaten record at Wagga on Sunday.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Wallabies skipper warns of ‘massive risk’",
        "description": "The Wallabies captain has urged Australian players to think about the 2027 Rugby World Cup when deciding about their future.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "McDermott and Wright to again lead Reds",
        "description": "The Queensland Reds have named the same co-captains for their 2025 Super Rugby Pacific season.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    },
    {
        "title": "Olympian to learn family’s pain in court",
        "description": "The heartbroken family of an Olympic cyclist are expected to deliver victim impact statements detailing their pain and grief to the court.",
        "source": "News AU",
        "fetched_date": "2025-01-25T07:21:01.546663"
    }
]