[
    {
        "title": "The US and China are finally talking. Why now?",
        "description": "Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Along the Canada border, small-town America feels sting of Trump's trade war",
        "description": "Since the trade war began, crossings between the US and Canada are down some 17%. What has that cost towns such as Port Huron and Michigan?",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Hormone-treated beef will not enter UK after US deal, says government",
        "description": "Farmers are raising questions over how checks will ensure US beef produced using hormones doesn't enter the UK market.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Trump proposes 80% China tariff ahead of trade talks",
        "description": "The meeting is the strongest sign yet that the world's two biggest economies are ready to de-escalate their trade war.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Along the Canada border, small-town America feels sting of Trump's trade war",
        "description": "Since the trade war began, crossings between the US and Canada are down some 17%. What has that cost towns such as Port Huron and Michigan?",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "'I freaked out and spent $400 online': US consumers on cheap shipping changes",
        "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Kwik Fit founder Sir Tom Farmer dies aged 84",
        "description": "The Edinburgh-born businessman built the firm into a £1bn business and also owned Hibernian FC.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Mexico sues Google over 'Gulf of America' name change",
        "description": "President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "US and China are ready to talk tariffs - who will blink first?",
        "description": "The BBC's journalists in Washington DC and Singapore analyse US and China's moves ahead of the negotiation.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "India worried about Chinese 'dumping' as trade tensions with Trump escalate",
        "description": "Experts warn that a flood of cheap Chinese goods could hurt the competitiveness of Indian exports.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Markets welcome US-UK trade agreement",
        "description": "Wealth management expert says financial markets will be relieved the US is striking deals with trading partners.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "The ex-Google exec who wants to simplify your life",
        "description": "Marissa Mayer, a former Google and Yahoo executive, believes AI should simplify our lives.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Trump misspeaks and calls toy firm Mattel a country",
        "description": "The US president says tariffs are \"the most misunderstood thing\" in business and threatens more action.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "UK to announce fresh sanctions on Putin's 'shadow fleet'",
        "description": "Officials say action will be taken against up to 100 oil tankers that have been carrying cargo.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "What is in the UK-US tariff deal?",
        "description": "The two nations have announced a deal to reduce tariffs - here's what you need to know.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "US and UK agree to deal slashing Trump tariffs on cars and metals",
        "description": "It will leave a 10% import tax on most goods shipped from the UK to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "How good is the UK trade pact for America?",
        "description": "In Trump's new trade pact with the UK, we got a glimpse of the types of agreements he may seek across the globe.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Inside the secretive world of Zara",
        "description": "The BBC's Emma Simpson gets a rare glimpse behind the scenes of how the fashion brand operates.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "UK must 'do everything' to rebuild trade with EU, says Bank boss",
        "description": "Andrew Bailey says he does not take a view on Brexit, but reversing the post-Brexit hit to UK-EU trade would be \"beneficial\".",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Bill Gates plans to give away most of his fortune by 2045",
        "description": "Microsoft founder said he will speed up his charitable giving - and accused Elon Musk and Doge of \"killing children\" through aid cuts.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "US agreement leaves the UK open to do a much more significant EU deal",
        "description": "Economically this US deal is relatively small, although important to very specific sectors.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Chris Mason: Starmer can claim limited win with America deal",
        "description": "The government's diplomatic achievement in sorting this deal before anyone else delivers reprieve to carmakers.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Trump deal is a significant achievement for Starmer",
        "description": "The UK looks set to be the first to get a deal since US President Trump unleashed a wave of global tariffs.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Apple hits back at US judge's 'extraordinary' contempt order",
        "description": "The legal battle - started by Epic Games - could determine the future of the highly lucrative App Store.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Bank lowers interest rates and hints at more cuts to come",
        "description": "The Bank cuts rates for the second time this year, saying the slowdown in inflation was behind the move.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "iPhone maker announces plan to build Mitsubishi EVs",
        "description": "The Taiwan-made electric vehicle is expected to go on sale in Australia and New Zealand next year.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Fed holds rates because of tariff 'uncertainty'",
        "description": "The Federal Reserve said Trump's barrage of tariffs were generating too much uncertainty to predict its next moves.",
        "source": "BBC Business",
        "fetched_date": "2025-05-11T07:24:31.426495"
    },
    {
        "title": "Dump Truck Crashes Into Whisky a Go Go Music Venue on Sunset Strip",
        "description": "Mötley Crüe, the Doors, Janis Joplin and Guns N' Roses have all performed at the beloved Los Angeles site.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "The Hollywood Reporter Takes Home 2025 American Society of Magazine Editors Best Cover Award",
        "description": "The news organization won best local magazine cover for THR’s 2024 “The Work Issue,” photographed by Fredrik Broden.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "SoundCloud Says It “Has Never Used Artist Content to Train AI Models” After Backlash on Terms of Service Change",
        "description": "\"Any application of AI at SoundCloud will be designed to support human artists, enhancing the tools, capabilities, reach and opportunities available to them on our platform,\" SoundCloud said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "California Attorney General Says He’s Considering a New Way to Stop Trump’s Hollywood Tariff Plan",
        "description": "The First Amendment could be key, state's top prosecutor Rob Bonta tells The Hollywood Reporter.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "This Alternative Artist Landed a Top-20 Chart Debut With an Album Made Almost Entirely on His Phone",
        "description": "Darkroom/Interscope's D4Vd debuted at No. 13 on the Billboard 200 this week, recording most of the album through the popular music creation app BandLab.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Harry Styles Attended Pope Leo XIV’s Historic Conclave Election",
        "description": "The singer joined the crowd gathered at Saint Peter's Square in the Vatican on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Sean “Diddy” Combs Trial Sees Jury Finalization Kicked to Monday So No One Gets “Cold Feet”",
        "description": "The trial should remain on schedule after the defense suggested that the final 12 jurors and six alternates could ask to be excused after spending a weekend contemplating a role in a major celebrity's fate.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Stars Talk L.A Wildfires, Home Rebuilds and What to Do With Your Tesla at EMA Impact Summit",
        "description": "Phil Rosenthal, Kevin Nealon, Miranda Cosgrove, Jenna Dewan, Drew Scott and Malin Akerman were among the stars who kicked off the Environmental Media Association event on Thursday.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Menendez Brothers Attorney Suddenly Nixes Request for D.A.’s Recusal From Resentencing",
        "description": "The brothers' battle to regain their freedom was back in court Friday, but instead of hearing why D.A. Hochman's bias against them means he needs to go, their lawyer killed the motion for withdrawal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Rosé Gets “Messy” in Latest ‘F1’ Soundtrack Single and Music Video",
        "description": "Last week, Doja Cat and Don Toliver’s new track, “Lose My Mind,” was released in support of the upcoming film’s companion album.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Trump Fires Librarian of Congress Carla Hayden",
        "description": "Hayden, whose 10-year term was set to expire next year, had come under backlash from a conservative advocacy group.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "I’m One of the Filmmakers DOGE Targeted at the NEH. Here’s Why We’re in Trouble (Guest Column)",
        "description": "A documentarian describes what she and many of her peers have been going through as the Trump administration makes drastic cuts to the National Endowment for the Humanities.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-05-11T07:24:32.262040"
    },
    {
        "title": "Hayne makes official rugby league return",
        "description": "Jarryd Hayne officially returned to rugby league on Sunday as he pulled on the boots for the first time since his final NRL game in 2018.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "‘Embarrassed’ Tigers take stock after blowout",
        "description": "Wests Tigers coach Benji Marshall says his team showed no fight in 64-0 smashing in Melbourne with some soul-searching on the way.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Aussie becomes champ, stuns UFC world",
        "description": "Australian fighter Jack Della Maddalena has produced a masterclass display to become the UFC’s new welterweight champion.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Aussie cricket legend dead at age 84",
        "description": "An Australian Ashes hero and cult hero has died at the age of 84 in news that has devastated the cricket world.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Hayne makes official rugby league return",
        "description": "Jarryd Hayne officially returned to rugby league on Sunday as he pulled on the boots for the first time since his final NRL game in 2018.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "‘Embarrassed’ Tigers take stock after blowout",
        "description": "Wests Tigers coach Benji Marshall says his team showed no fight in 64-0 smashing in Melbourne with some soul-searching on the way.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Bailey firing as Giants and Cats locked in a classic",
        "description": "The Giants had a handy lead in the first term thanks to two Jake Stringer goals, but he’s now been subbed out – and the Cats are on top. FOLLOW LIVE",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "‘Unbelievable’: $1.5m AFL rumour swirls",
        "description": "The footy rumour mill has gone into overdrive with an AFL great going public with sensitive details about stars of the footy media.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Aussie cricket legend dead at age 84",
        "description": "An Australian Ashes hero and cult hero has died at the age of 84 in news that has devastated the cricket world.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Cricket world mourns the death of Australia’s ‘$100m legend’",
        "description": "Cricket has lost its $100 million batting legend following the death of the legendary Bob Cowper – a superb batsman who became Australia’s most wealthy former Test cricketer.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Wild scenes as courtside interview hijacked",
        "description": "A tennis star got caught in a lift and Coco Gauff’s interview was cut short as Spain’s power outage caused havoc at the Madrid Open.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Sinner hit ‘rock bottom’ due to doping saga",
        "description": "Two-time Australian Open champion Jannik Sinner is preparing to make his return to tennis after a three-month ban and has spoken about the pain his doping saga has caused him.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "‘Hoodwinked’: Wayne Bennett sold a lemon",
        "description": "The South Sydney Rabbitohs were meant to turn things around in 2025, instead Wayne Bennett has been sold a lemon in his return to the club.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Feeney puts Supercars title chase on track with sprint double",
        "description": "Triple Eight star Broc Feeney has put his championship assault back on track after taking out a sprint race double at Symmons Plains to steal the title lead from his teammate Will Brown.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Chilling girlfriend threats before Aussie axed",
        "description": "Jack Doohan was privately dealing with terrifying matters behind the scenes before his F1 axing with emails coming to light.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Aussie star KOd in frightening scenes",
        "description": "Joseph Suaalii left Allianz Stadium on a stretcher after an ugly incident involving teammate Andrew Kellaway.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Reds conquer Tahs after Suaalii’s sickening head clash",
        "description": "With the British and Irish Lions heading to Australia soon, the only concern among New South Wales and Queensland was the health of Joseph-Aukuso Suaalii rather than the scoreboard.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "‘Chaos’: Football star arrested for murder",
        "description": "A former college football star is facing second-degree murder charges after allegedly opening fire in a bar in a chaotic scene.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "‘Unthinkable’: Simmons hits $252m crossroad",
        "description": "Ben Simmons is an NBA free agent and noises coming from around the NBA show he still has some lifelines left to save his career.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Graham Arnold’s Iraq appointment confirmed",
        "description": "New Iraq boss Graham Arnold’s coaching staff is set to include some familiar faces.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Mesmerising Arzani fires Victory into A-Leagues semi finals",
        "description": "A mesmerising, match-winning display from Socceroos winger Daniel Arzani has sent the Victory through to the A-League’s semi-finals with a 2-1 win over Western Sydney Wanderers.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Aussie becomes champ, stuns UFC world",
        "description": "Australian fighter Jack Della Maddalena has produced a masterclass display to become the UFC’s new welterweight champion.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Greg Norman in terrifying mid-air incident",
        "description": "Greg Norman has released images of his terrifying ordeal where he heard something “shatter” thousands of feet above the ground.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Opals lose star as Australia seals Trans-Tasman Challenge titles",
        "description": "Kings star Xavier Cooks has led the Boomers to the Trans-Tasman Challenge title as the Opals ensured Australia claimed both best of three series against New Zealand.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Messara weighs up Scone Cup tilt with The Coast winner",
        "description": "Scone trainer Paul Messara is weighing up running Know Thyself in Friday’s Listed $200,000 Scone Cup (1600m).",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Aussie cycling star announces shock retirement",
        "description": "Australia’s five-time Tour de France stage winner Caleb Ewan has announced his retirement aged just 30, declaring the past two seasons had “taken a significant toll on my relationship with the sport”.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "Brutal truth about Candice, David’s marriage",
        "description": "Candice Warner has opened up about her decade-long marriage to cricketer David Warner, saying the couple have faced their challenges.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    },
    {
        "title": "New vision shows cause of ‘devastating’ fall",
        "description": "This is the moment it all went wrong for an American baseball fan who was left with a broken neck and back after falling 6m to the field.",
        "source": "News AU",
        "fetched_date": "2025-05-11T07:24:33.797410"
    }
]