[
    {
        "title": "The truth behind your £10 dress: Inside the Chinese factories fuelling Shein's success",
        "description": "Workers making clothes for the fast fashion giant tell the BBC they labour for up to 75 hours a week.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Apple board pushes against diversity rollback call",
        "description": "The tech giant has asked investors to reject a proposal from a conservative group to end its DEI policies.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "More people in late 20s still living with parents",
        "description": "The rising cost of buying or renting home in the UK has led more to remain in the family home, a think-tank says.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Meta and Amazon axe diversity initiatives joining US corporate rollback",
        "description": "The companies are among the latest major corporations to alter their diversity programmes since Trump's re-election.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Apple board pushes against diversity rollback call",
        "description": "The tech giant has asked investors to reject a proposal from a conservative group to end its DEI policies.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Online safety laws unsatisfactory, minister says",
        "description": "Peter Kyle responds as internet safety campaigner Ian Russell says laws to protect children need fixing.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Watch: I will work with Trump for low whisky tarriffs - Swinney",
        "description": "John Swinney says he will capitalise on Donald Trump's Scottish connection in an attempt to avoid tariffs being applied on imports to the US.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Reeves defends China visit and hails £600m boost to UK",
        "description": "The chancellor has been criticised for making the trip while the UK government is under pressure from rising borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "World of Business",
        "description": "Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "How a viral post saved a Chinese actor from Myanmar's scam centres",
        "description": "Many Chinese are now asking: what about their loved ones still trapped in scam centres?",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "'Trump 2.0' looms large over the global economy",
        "description": "Donald Trump's planned tariffs are expected to greatly impact international trade in 2025.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "US stocks under pressure after jobs report - 10 Jan 2025",
        "description": "The latest healthy US jobs report adds more uncertainty about whether the Fed will cut its key interest rate.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Good Bad Billionaire",
        "description": "Simon Jack and Zing Tsjeng find out how the world's billionaires made their money, and then judge them. Are they good, bad, or just another billionaire? Listen to season two. New episodes released on Mondays.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "How one product made a multi-million dollar brand",
        "description": "Nell Diamond, CEO of Hill House Home, shares how her small business skyrocketed to global success with the launch of the Nap Dress in 2019.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "US and UK toughen sanctions on Russian oil industry",
        "description": "The actions are aimed at cutting off revenue Moscow is using to fund its war in Ukraine.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Fewer rate cuts and higher loan costs - how US jobs surprise affects you",
        "description": "Jobs growth in the US surged unexpected last month. That's good news for the world's largest economy but could be \"punishing\" for the UK.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "'I don't like this Musk chap': Reform members say they're unbothered by spat",
        "description": "Activists gathering at a regional conference assess whether the US billionaire could help or hinder the party.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "US top court leans towards TikTok ban over security concerns",
        "description": "The platform with nearly 170 million American users is challenging a law that would see it banned in the US in a matter of days.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "UK MPs urge checks as Shein refuses to answer questions",
        "description": "The chair of a committee of MPs has written to the London Stock Exchange with concerns over the fashion retailer.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Can young Americans live without TikTok?",
        "description": "The BBC spoke to young people as the Supreme Court discusses a potential ban on the social media platform.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Playing with FIRE: How to quit work and retire in your 30s",
        "description": "A personal finance strategy popular among millennials is helping them to quit their job and retire decades early.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Boomerang CEOs: Do they ever succeed?",
        "description": "Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "How industry leaders transformed their career",
        "description": "The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Women were the original beer brewers - what changed?",
        "description": "Today, the beer industry is male-dominated, but it wasn't always so.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "How waiting alters our perception of time",
        "description": "Expert advice on how to get through a waiting period.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Do the super-rich 'deserve' their wealth?",
        "description": "Should there be a cap on billionaires' wealth and their inheritances?",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Four simple hacks to succeed in every conversation",
        "description": "A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Solo and hybrid work: Navigating our future and new normal",
        "description": "Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Can supersonic flight ever be sustainable?",
        "description": "How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Commencement speech: The surprising pitfall of your passions",
        "description": "Students are graduating in the US this week. The commencement speeches might lead them into questionable choices.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "ASMR: How whispering took over the internet",
        "description": "We meet the creators behind the current ASMR boom.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "A desk full of descriptions for your work colleagues",
        "description": "These are the long lost words you've been waiting for to describe your colleagues.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Veterinarian suicide rates are very high. Why?",
        "description": "Veterinarian professionals are committing suicide at a higher rate than the general population.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Boeing and Google each give $1m for Trump inauguration",
        "description": "The US companies join other major firms donating funds for the ceremony on 20 January.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "LA wildfire damages set to cost record $135bn",
        "description": "Some of the most expensive properties in the US have been wiped out by the fires.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Man told he can't recover £598m of Bitcoin from tip",
        "description": "James Howells tried to sue a council for access to the site or get £495m in compensation.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "UK Chancellor heads to China amid market trouble at home",
        "description": "The warning from a former Bank of England official comes in the wake of rising UK borrowing costs.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Price of resale tickets to be capped under UK plans to tackle touts",
        "description": "The UK government is suggesting a cap on the cost of resold tickets, potentially up to 30% on top of the original price.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Ex-UK PM Truss sends legal threat to Starmer over claim she crashed economy",
        "description": "No 10 insists millions of people share Sir Keir's view of the Truss government's economic record.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Pound falls to lowest in over a year as UK borrowing costs soar",
        "description": "Economists have warned the rise could mean further tax hikes or spending cuts by the UK government.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "China bets on kitchen appliances to boost economy",
        "description": "A list of subsidised household goods has been expanded as Beijing tries to increase domestic spending.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Lloyds, Halifax and Bank of Scotland to share branches",
        "description": "The move is intended to make it easier for people to access banking services, but some warn it will lead to more branch closures.",
        "source": "BBC Business",
        "fetched_date": "2025-01-13T07:24:16.437569"
    },
    {
        "title": "Death Toll Rises in Los Angeles as Firefighters Brace For Return of Inferno Brought by Strong Winds",
        "description": "Reports of missing people are rising across the city “hour by hour,” according to the county sheriff.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Kim Kardashian Advocates for Incarcerated Firefighters Pay Raise as Fires Devastate L.A.",
        "description": "The 44-year-old reality TV superstar and business mogul has been dipping into prison law reform since 2018.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Jackie Farry, ’90s Music Figure and Francis Bean Cobain’s First Nanny, Dies at 58",
        "description": "Raised in the controversial Synanon community, she also served as tour manager for Elliott Smith, the Lemonheads and other indie rock acts.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "L.A. Private Firefighters Are a Class War Flashpoint, But the Reality Is More Complicated",
        "description": "While social media amplifies (and attacks) wealthy homeowners offering to \"pay any amount\" for mitigation — and such outfits do certainly exist — most private firefighters work for utilities, insurers or independent jurisdictions.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Jamie Chung and Bryan Greenberg’s House Destroyed in L.A. Fires: “Was Supposed to Be Our Forever Home”",
        "description": "The couple, who share two twin boys, said their family was safe.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Los Angeles Wildfire Death Toll Rises to 16 as More Threats Loom",
        "description": "Five of the deaths were attributed to the Palisades Fire, and 11 resulted from the Eaton Fire, the coroner's office said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Dennis Quaid Says “So Many Friends” Lost Homes in Devastating L.A. Wildfires",
        "description": "“We’re fighting as hard as we can to save our city. Gosh, I never thought I’d say that. But that’s what’s going on,\" the actor said.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Former Child Star and Motivational Speaker Rory Sykes Dies in L.A. Fires, Mother Says",
        "description": "Sykes, who was born blind and living with cerebral palsy, reportedly died at his family home in Malibu.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Will Grammy Awards Be Postponed Due to L.A. Wildfires? Discussions Are Underway",
        "description": "As devastation continues to move through Los Angeles, the broadcast may pivot to a fundraiser, sources reveal.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "SAG-AFTRA Donates $1 Million for L.A. Fires Relief",
        "description": "The performers' union earmarked the funds for the SAG-AFTRA Foundation, a nonprofit that offers emergency financial aid and education to members.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Chateau Marmont, Sunset Tower Offer Refuge to Firefighters and Angelenos Amid L.A. Fires",
        "description": "The historic Hollywood hangouts are opening their doors to first responders and evacuees during the wildfires that have killed at least 11 people and destroyed more than 12,000 structures.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Lesli Linka Glatter Loses Home in L.A. Fires",
        "description": "The DGA president and top TV director-producer is just the latest high-profile figure to see her house destroyed by the wildfires across southern California.",
        "source": "Hollywood Reporter",
        "fetched_date": "2025-01-13T07:24:17.338548"
    },
    {
        "title": "Kokkinakis in nightmare Aus Open scenes",
        "description": "Thanasi Kokkinakis is fighting to stay alive at the Australian Open as a tennis legend’s call about the fan favourite eerily came true.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "James Hird splits from wife after 27 years",
        "description": "AFL legend James Hird and wife Tania have reportedly separated after keeping a secret for more than a year.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘Not qualified’: LA Olympics now impossible",
        "description": "As wildfires continue to wreak havoc and cause devastation across Los Angeles, experts have questioned whether the event’s future will go up in smoke.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘No idea’: Cummins questions as dynamo axed",
        "description": "Pat Cummins’ ankle injury remains a mystery but what is less certain is the fate of the young gun trumpeted as the future and the next Glenn Maxwell.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Test cult hero, discard on standby for shock Champs Trophy call-ups",
        "description": "Sydney red-ball sensation Beau Webster, and the man he replaced for the fifth India Test, are in the frame for a one-day call-up if Australia makes a late change to its Champions Trophy squad. SEE THE 15-MAN SQUAD",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘No idea’: Cummins questions as dynamo axed",
        "description": "Pat Cummins’ ankle injury remains a mystery but what is less certain is the fate of the young gun trumpeted as the future and the next Glenn Maxwell.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Kokkinakis in nightmare Aus Open scenes",
        "description": "Thanasi Kokkinakis is fighting to stay alive at the Australian Open as a tennis legend’s call about the fan favourite eerily came true.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘Proud of my guy’: Aussie’s shock hype man",
        "description": "Fans on a small outside court were shocked to see a global sports star in an Aussie wildcard’s box as he claimed a milestone win.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "James Hird splits from wife after 27 years",
        "description": "AFL legend James Hird and wife Tania have reportedly separated after keeping a secret for more than a year.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘Absolutely rocking’: Eddie’s son in title game",
        "description": "The sons of well-known AFL figures Eddie McGuire and Matt Rendell are going to face off in the national championship decider.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Dragons make shock captaincy call",
        "description": "Two players who joined St George Illawarra from other clubs after the 2024 season have been named as co-captains in their first season for the Dragons.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "NRL trials: First-look at new signings and positional puzzles",
        "description": "The countdown is on for NRL action with trials less than a month away. Find out when and where your team is playing and read every club’s in-depth season preview inside.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Steph Rice shocks fans with second wedding",
        "description": "Stephanie Rice’s friends were all saying the same thing when the swimming champ and her new husband did it all again.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Strongman suffers horrific training injury",
        "description": "WATCH: England’s Strongest Man faces a long road to recovery after sustaining a horrendous injury lifting 172kg in training.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "World losing its mind over Shaq footage",
        "description": "Video of NBA legend Shaquille O’Neal left looking tiny next to a record-breaking teenager is racing across the internet.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘Absolutely rocking’: Eddie’s son in title game",
        "description": "The sons of well-known AFL figures Eddie McGuire and Matt Rendell are going to face off in the national championship decider.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Ange cracks over historic embarrassment",
        "description": "A brutal, viral fan video said it all as Ange Postecoglou’s team blundered its way to something only seen four times in history.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Liverpool star’s ‘unbelievable’ goal, PL side stunned: FA Cup Wrap",
        "description": "Manchester City dashed the dreams of Salford’s former Manchester United star owners with an 8-0 FA Cup rout, while Liverpool also cruised into the fourth round with a 4-0 victory over Accrington Stanley.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Racism drama as UFC icon kicked off flight",
        "description": "Former UFC champion Khabib Nurmagomedov has questioned whether the airline saga was driven by racial or national bias.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘Sour taste’: Aussie F1 gun in huge trouble",
        "description": "A rare, thinly-veiled driver move could spell trouble for Australia’s newest F1 driver Jack Doohan with eyebrows raised.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Elon Musk torn to shreds by F1 great",
        "description": "F1 great Martin Brundle has teed off on X owner Elon Musk, using a three-word insult to slap down the billionaire.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "NBL star stood down following assault charges",
        "description": "Cairns Taipans guard Jackson Makoi has been stood down after being arrested and charged by NSW Police over an alleged domestic incident in 2023. CONTENT WARNING",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "‘Easier than having a mate’: Why Doull’s partner was perfect caddy",
        "description": "Jordan Doull’s girlfriend, Kathryn Norris, put her own on course disappointment behind her to play an “instrumental” role in his remarkable win at the Webex Players Series. Here’s how it played out in WA.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Son of Testa Rossa’s jockey driving for Olympic gold",
        "description": "Eddie Cassar hit great heights in the saddle aboard the super galloper Testa Rossa in 1999 but gets a much bigger thrill watching his son on the trail of Commonwealth Games and Olympic gold in the boxing ring.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Sales pitch begins to keep Wallabies coach",
        "description": "Public lauding of Wallabies coach Joe Schmidt will be the players’ way of convincing him to stay rather than private urgings that could put unwanted pressure on him.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Reds star aiming for stellar Super season",
        "description": "Queensland Reds star Tom Lynagh knows his best chance of regaining a Wallabies jersey is to shine for the Queensland Reds this year.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    },
    {
        "title": "Olympian’s tragic final moments emerge",
        "description": "Distressing CCTV footage reportedly shows the tragic final moments before Aussie world champ Melissa Hoskins was fatally struck.",
        "source": "News AU",
        "fetched_date": "2025-01-13T07:24:19.001481"
    }
]